{
"name" : "Swipe Gestures Launcher - Edge Swipe, Edge bar",
"url" : "https://play.google.com/store/apps/details?id=a.jck.sparr.swipegestureslauncher.free",
"package" : "a.jck.sparr.swipegestureslauncher.free",
"category" : "Tools",
"description" : "Swipe Gestures Launcher allows smart easy access to your favorite apps, settings and full device control and navigation through sidebars. To use it swipe side panels from any app to instantly open the menu which keeps apps you need: Your recent apps, most used apps or a custom set of apps. You fully customize those panels: look, color, opacity. Features  Multitask: start any application, shortcut, custom action or launcher from a side panel without leaving current applications  Intelligent: Swipe Gestures Launcher cleverly anticipates and organizes your apps based upon importance and your past usage behavior.  Favorites: add and arrange up to 9 your favorite apps to always be within your reach from a side panel.  Navigation browse actions: Swipe side panel to open next app, previous app  Customize: quick access to many side panel skins on your choice  Battery efficient: it does not work when the screen is off  Swipe screen edge to trigger defined action  Access launchpad from any app with swipe gestures  Navigate and switch flawlessly between apps  Define any custom gestures launcher with apps and actions  Open notifications with side panel swipe Available in full version  No ads  More side panel skins  Large launchers  up to 9 rows and 9 columns  Unlimited custom launchers  create as many as you wish  Favorites: Add and arrange up to 89 your favorite apps to always be within your reach. We value our users feedback! Whether its a bug report, a complaint, a concern, a suggestion, please, let us know, because it helps us improve Swipe Gestures Launcher! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_LOGS', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_LOGS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW']",
}