{
"name" : "Update Software Latest",
"url" : "https://play.google.com/store/apps/details?id=app.quantum.supdate",
"package" : "app.quantum.supdate",
"category" : "Tools",
"description" : " Download Update Software Latest & relax, this app will automatically check for updates to your installed Apps & Games and will notify you as soon as updates are available  Update Software Latestwill help you automatically check for pending updates to all your downloaded Apps & Games, system apps at regular intervals.  Key Features Auto Update Check Get all your pending updates on one page.  Update Notifications This app automatically checks for updates and notifies you once they available on play store.  Downloaded Application Check for update for all your installed Apps & Games.  System Application View updates for pre-installed system apps.  Phone Usage Meter Track the time spent you spend on your phone & your favourite apps.   App Action Permission: View all the permissions used by any installed or System Apps. Uninstall Apps: Uninstall any app directly from the Update Software Latest app.  Play Store Version Check View the updated play store version of any app that is installed on your phone.  Why you should get Update Software Update App Your phone might have 50+ Apps installed and you will always want to keep those apps up-to-date on your device, for this, you dont need to check for app updates multiple times on the Play Store. You can simply get the list of newly updated apps usingPending Updatesfeature automatically with this app and upgrade your apps & games.  In most cases, these updates will show up on your phone when the time is right, but for those of who are not willing to wait a second longer than necessary, there is a way to check for the updates manually.  You just need to open the application and click on the app you want to update from the app list. The list is divided into installed application, system application & pending updates. Upgrade all your apps and games with one touch.  The app will keep checking the updated versions for all your installed apps and will notify you if there is an app with an available update on Play Store.   *Smart Features*  Smooth User Interface  Easy to Use  Free App with full Feature  Small APK Size  LIKE US and STAY CONNECTED https://www.facebook.com/quantum4u/ https://www.facebook.com ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}