{
"name" : "PDF Reader for Android: PDF Viewer 2020",
"url" : "https://play.google.com/store/apps/details?id=app.pdfviewer.pdfreader2020",
"package" : "app.pdfviewer.pdfreader2020",
"category" : "Tools",
"description" : " PDF Reader for Android is one of the best reading pdf file tools. It can help you to easily manage, and open all the ebooks on your phone.  PDF reader for Android 2020 integrates 3 functions of PDF scanner and PDF editer and PDF viewer files on the mobile screen.   PDF file reader for Android application has a display simple, interface easy to use with Foxit PDF Reader for Android and manage PDF File in your phone. Please download the free PDF reader: PDF editor & PDF scanner !!!   Features PDF reader: PDF Viewer & PDF Scanner:   PDF manager file: Scan and update all the pdfs available in your device as quickly as possible. List all the pdf files available in your device. List the pdfs you have recently viewed. Add your favorite pdfs to your favorite book, you can open it faster. - Scan PDF file is very fast - Support to viewer PDF Reader downloaded file on phone - Support to documents pdf reader  PDF Reader Search: Easily find your pdfs by name  - Support search pdf, pdf reader from the memory card ...  PDF Viewer : The most important feature of this application is the pdf viewer. You can easily and quickly view the contents of the pdf files in your device. From anywhere, you can quickly launch this application to view your pdfs. - Full screen mode - Use as a comics application - A pdf viewer, pdf reader free - Open the pdf viewer file weighs only little capacity 1s  PDF next to page: Quickly move to the pdf page you desire. It is very convenient to see what is currently being viewed.  PDF orientation: Vertical and horizontal views provide the most convenient experience for you - Optional display horizontally, vertically, mobile ...  PDF Reader and PDF Viewer 2020 is a great, simple, convenient and fast application. It supports you all that you need for a pdf reader application.  - Best pdf reader - Simple interface easy to use - Pdf document reader, pdf viewer free, pdf reader free, xps file viewer - This is comic book apps free, ebook reader for android free and ebook and pdf reader  Pdf reader for android free download - Free pdf reader for android   Other features we still working on and will update on next version   - PDF Compressor: Lets you compress PDF documents and reduce file size - Merge PDF: Merge pdf documents together. - PDF Creator: Draw and type directly on PDFs - Split PDF: Easily split your pdf files - Scan to PDF: Scan everything as images or PDFs. - Annotate PDF: Annotate PDFs with others in real time - Convert PDF: Convert PDF to DOC, TXT, PPT, WORD, JPG, PNG, XLS and many more - Print to PDF: Makes printing easy ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'app.pdfviewer.pdfreader2020.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}