{
"name" : "Mp3 music cutter for Android: Ringtone maker 2020",
"url" : "https://play.google.com/store/apps/details?id=app.ringtone.audio.musiccuter.pro",
"package" : "app.ringtone.audio.musiccuter.pro",
"category" : "Tools",
"description" : " Audio Mp3 Music Cutter Want to have a ringtone for yourself, or want to cut a chorus from your favorite song and make your own ringtone, cut mp3 songs make ringtone. => Download Mp3 music cutter for android 2020 now  Audio Joiner Merge MP3 Files With Mp3 audio cutter 2020: ringtone maker for Android, you can creat ringtone by connect the mp3 file and your favorite musics   Music Format Converter With the mp3 cutter: ringtone maker you can easily convert MP3, WAV, FLAC, M4A, AAC files to other formats with different quality such as 16Kb, 64Kb, 128Kb and 320Kb.  Features of Music cutter for Android: ringtone maker 2020  Easily cut cut mp3 as ringtone, music joiner mixer and cutter for mobile, merge multiple mp3 songs.  Manage audio cut files, mp3 cutter in audio song, free mp3 ringtone maker .  Elegant design, nice design, friendly and easy to use  Share songs with friends through social networks  Easily set up songs as: alarm ringtone, incoming call tones, notification tones and message ringtones.  Support join many songs together, mixer mp3 music song, music mixer and cutter for android.  Best audio editor and mixer for recording music n songs, best mp3 cutter editor and song mixer .  Convert music conveniently with the software to change mp3 converter from wav  Best ringtone maker app for android, audio mix cutter mp3 cutter, ringtone cut and join maker.  Option to save music on the memory card or internal memory of your device  Support : audio to mp3 converter, audio converter m4a to mp3, wav to mp3 audio converter for android.  Composer supports formats: FLAC, MP3, M4A, WAV, AAC  The format converter supports: FLAC, MP3, M4A, WAV, AAC  MP3 Cutter & Free Ringtones  Mp3 cutter and ringtone maker, mp3 cutter mix converter and ringtone maker.  Mp3 player for android phone, music cutter and music joiner, edit mp3 song. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'app.ringtone.audio.musiccuter.pro.permission.C2D_MESSAGE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.WRITE_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_CONTACTS']",
}