{
"name" : "20SPEED VPN",
"url" : "https://play.google.com/store/apps/details?id=app.android_20speed_vpn",
"package" : "app.android_20speed_vpn",
"category" : "Tools",
"description" : " 20SPEED VPN                           .                  .              .  -          . -          . ( ) -              -         -           -           -          -       -         ***   :                       .  -              .  -                                              Power Saving Mode   .       Settings      Battery    Power Saving Mode     Restrict All Background Data  .  -                               Background Data      .       Settings       Data Usage    Background Data               20SPEED VPN   . The 20SPEED VPN app has various VPN services for all Android devices that users can easily switch to by connecting to their high-speed IP servers.  If youre a new user, you can get a free 2-hour subscription by installing and running the app.  The important features of this app can be mentioned below.  - Compatible with all kinds of Android devices with versions above 4.3 - Compatible with all kinds of Android devices with versions below 1.0 (requires root) - Telegram only option to pass the telegram alone via VPN - Applicable to all types of home and mobile Internet - Free 4-hour testing with just installing and running the app - Display the amount of incoming and outgoing traffic and total traffic consumed - Displays the amount of subscription remaining time and connection time - Access to the latest unfiltered site address - Connect with support through the app  *** important points :  Please read the tips below before using and let us know if you find any issues with the app.  - Please restart your device once every install of the app has been installed.  - If you see a No Internet Access error in the application after a successful connection with Internet access and no traffic is transmitted and your devices Internet connection appears virtually off, you will probably have your phone in Power mode. You are using Saving Mode.  To fix this issue, go to Device Settings and enter Battery, enter Power Saving Mode and select Restrict All Background Data.  - If you are using our app when using the mobile Internet and you do not receive traffic, your Background Data feature may be disabled on your device.  To enable it, log into your devices Settings and enter the Data Usage section and enable the Background Data option and make sure to have a 20SPEED VPN checkbox in front of us. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.FOREGROUND_SERVICE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}