{
"name" : "Bluelight Filter for Eye Care",
"url" : "https://play.google.com/store/apps/details?id=app.bluemonsterprotectyou",
"package" : "app.bluemonsterprotectyou",
"category" : "Tools",
"description" : "Filter excess blue light, reduce strained eyes, and extend battery life!   Effectively reduces all blue light from electronic devices that cause strained eyes. Great for those who use their devices all day long and are feeling fatigued.   Multiple modes to choose from, that have all been meticulously designed for a natural and comfortable experience.   Power saving mode lowers screen brightness and filters blue light, which reduces power consumption and extends battery life.  Bluelight Filter for Eye Care is good for extensive phone use or when its really dark, so you never have to strain your eyes.  Reduce eye strain and save battery life too, its like hitting 2 birds with 1 stone.  Customized eye protection to use, as you control the filter, based on what you need and use most often.    Worry-free of screen consuming battery life  Eliminates accidentally hitting your screen  Quintessential for late-night phone users  Various colour schemes to choose from, to match your screen (Gold, Pink, Macaron Green, Mystic Purple, Basic B&W)  Select your filtering level from 0% - 100%  Night Mode - Darkens screen brightness to reduce glare and late-night squinting  Multi-tasking with apps is trouble-free! Simple and easy-to-use interface! On and off at swipe of a finger!  Back-off blue light! With Bluelight Filter for Eye Care, youve got not worries with an invisible shield protecting your eyes! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}