{
"name" : "Text Tools - Fancy stylish text Repeater-Decorator",
"url" : "https://play.google.com/store/apps/details?id=appbuck3t.texttools",
"package" : "appbuck3t.texttools",
"category" : "Tools",
"description" : "If you are looking for any Text tools or utility app to: Create coolest messages, Facebook updates, Instagram Bio with cool Fonts & tools, generate cool & fancy text effects, generate stylish text, repeat text, decorate text, generate random text, ASCII emoji faces, generate blank text & perform all other text related operations...  Youve got the right app! Text Tools will do all the above jobs for you. Text Tools app has a mission to become the best text utility app to perform all such tasks for you.  Text Tools is a text repeater, stylish text generator, fancy text effects generator, text decorator, random text generator, blank text generator & collection of various text utilities   With Text Tools app you can  Pimp your Instagram Bio and comments with cool Fonts & styles  Create coolest messages, Facebook updates, Instagram Bio with cool Fonts & tools  Write better Facebook status messages or moments, get more likes, fans or retweets  Customize profile of Whatsapp or Line with cute fonts  Write stylish text & generate cool, fancy text effects & styles  Decorate text with an easy to use text decorator tool  Prank your friends by sending blank, empty messages  Repeat text with a powerful text repeater tool   Send ASCII emojis, faces & other arts  Generate random text, emojis with a powerful random tool   Copy & share generated stylish & fancy text to other apps   Other key features  Uppercase - converts all characters to upper case  Lowercase - converts all characters to lower case  Count characters - counts all characters in the text  Count words - count words in the text  Count lines - counts newlines in text  Word frequency - How many times each word is used  Character frequency - How many times each character is used  Remove white-spaces - removes white-space from the text  Format JSON - pretty format JSON string  URLEncode - Encode string as URL safe string  URLDecode - Decode URL safe string as a regular string  base64encode - Encode text as base64  base64decode - Decode base64 string  Text tools app deserves your try right away. It is the simplest but the most useful text utility app. Download Now & Enjoy! https://play.google.com/store/apps/details?id=appbuck3t.texttools   If you have any problems or suggestions, feel free to contact us. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}