{
"name" : "Card Creator for CR",
"url" : "https://play.google.com/store/apps/details?id=applifters.crcardcreator",
"package" : "applifters.crcardcreator",
"category" : "Tools",
"description" : "Card Creator (fan app for Clash Royale) let you make you own Clash Royale cards.  It,s boost to your creative potential and turn your creative, funniest and craziest ideas into the cards in Clash Royale. Make unlimited card with full customizations.  With this Card Creator, you can create your own Clash Royale card within a minute.  The card created with this tool is looks as nice as the cards in Clash Royale game.  It also allows you to create custom card attributes with a set of predefined attribute icons.  You can also save your created cards in the built-in Card Library and open the card and share with your friends.  You can also export your cards as PNG image to save in sdcard or share it with you friends with just one click.  KEY FEATURES - one click to edit options - fully customization options - Card Library (for storing your created cards) - Card Icon Edit (Zoom, Pan, Scroll and Crop) - Predefined card attributes (quick add for the card attributes appeared in Clash Royale) - Custom card attribute (free to create your own custom attributes using the icons we prepared for you) - Export (export the created card as PNG image and save in sdcard) - Share (export the created card as PNG image and share on any social media or messengers)  Another even more important is that such a powerful Clash Royale helper tool is completely free of charge!!  What funny, cute, crazy or outrageous cards you like to create?  Card Creator for CR will get you started on the road to creativity. What are you waiting for?  Lets create your first Clash Royale card now!  We are big fans of Clash Royale and we only create useful helper apps for the games that we love.  We hope you love them as much as we love making them.  If you have any comments, suggestions or questions, please feel free to contact us at jahaanzaibkhan422@gmail.com. Thank you!!  ======== Disclaimer ======== This app acted as a guidance app for the game Clash Royale by Supercell.  This is unofficial and not associated by Supercell.  All Chests images, background, popup are belong to Supercell.  For more information, see Supercells Fan Content Policy http://supercell.com/en/fan-content-policy/ ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}