{
"name" : "Simple Alarm Clock Free",
"url" : "https://play.google.com/store/apps/details?id=ar.com.basejuegos.simplealarm",
"package" : "ar.com.basejuegos.simplealarm",
"category" : "Tools",
"description" : "Simple Alarm is a free alarm clock application designed to create, edit and remove alarms in the easiest way. You can use Simple Alarm to wake up in the morning or setup reminders for your tasks during the day.  Simple Alarms main advantage is that you can type in the time for an alarm directly instead of using a selector, pressing arrows or moving through a large list of numbers. You can just press the buttons for the hours and minutes of your new alarm directly in a numeric keyboard on screen, and thats it! You can also edit or remove alarms with just one touch, saving a lot of time when you need to setup your alarms.  Unlike other alarm clocks for Android, Simple Alarm sorts your alarms in the order they will sound next, so you can easily identify which are the tasks you have to do next, if you are using Simple Alarm as a To Do tasks list.  If you use Simple Alarm to wake you up, you will be able to wake up gently from your dreams, in a peaceful and progressive way, because Simple Alarm increases alarm volume slowly instead of starting at maximum volume. This way, you can avoid being startled with a strong sound while you are in a deep sleep.  In addition, to keep you from de-activating the alarm and keep sleeping, Simple Alarm has a 3-button deactivation method (optional), so you will need to be really awake to do so. If you want to keep sleeping for a while, you can pause the alarm by pressing just one big Snooze button. As everyone has his/her own preferences and needs, Simple Alarm lets you customize alarms sound (selecting any ringtone, sound or song in your phone) and pause duration between alarms.  If you want to wake up at the same time every day, on labor days, weekends or just a few days a week, you can easily select which days when creating the alarm, and the alarm clock will go off on that selected days every week.  For all the reasons above, Simple Alarm is the best alarm clock in the market, and it is much better than Androids default alarm clocks.  Simple Alarm Features:  Fastest setup method.  Alarm enabling/disabling with one touch.  Set a message for each alarm.  AM/PM or 24 hours format  Alarms sorted in the order they will ring.  Repeat alarms every week on certain days.  Select the alarm sound you want from all your phones ringtones, songs and sounds.  Customize Snooze duration.  3 buttons alarm de-activation to avoid turning alarm off and continue sleeping (optional).  1 button alarm Snooze.  Wake up gently while volume and vibration increases slowly.  Available in English, Spanish, French, Polish, Portuguese, Italian, Japanese, German, Korean, Arab, Hindi, Chinese and Indonesian.  Special design for tablets and big cellphones  Its free! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
}