{
"name" : "Best Camera",
"url" : "https://play.google.com/store/apps/details?id=best.camera",
"package" : "best.camera",
"category" : "Tools",
"description" : "Best camera is a fully featured HD Camera apps,with 4K Camera,professional capture mode, Gorgeous Camera Filter you can easily take incredible HD photos on Android phones and tablets!   Best camera apps will turn your phone into HD camera like, with fully manual control on shutter speed, exposure, ISO, manual focus and another features , which can bring your mobile photography to the next level! Best 4K Camera is totally free!    Key features   Intelligently Face Detection  Front / rear camera selection  Magical effects with different styles  Select camera and video quality and resolution JPEG  Multi-touch gesture and one-touch remote control  Video recording time (with optional audio)  To turn off the optional shutter sound  Video recording (supports all resolutions including HD)  Stylish HDR,Improve images captured in low-light and backlit scenes  Capture photos and videos in high resolution HD quality with superb camcorde  Real-time Filter/Color effect, Preview filter effect before taking pictures or shooting videos  Keys Adjustable volume (to take pictures, zoom or to change exposure compensation)  Support for focus modes, focus mode,Scene modes, color effects, white balance, ISO, and exposure compensation/lock, torch  Manual focusing distance; Manual ISO; Manual exposure time; RAW (DNG) files  HD Camera, HD camera recording (With optional audio recording)   Configurable volume keys,Continuous shooting,Auto-stabilize  Easily choose camera and video quality and resolution  Widget to take pictures automatically after launching  Selfie camera performance/ Full HD Camera  Also known as front camera (selfie shooting)  Camera line, golden ration line  HD image capture feature  Location targeting feature,Optional GPS location tagging (geotagging) of photos and videos  Camera is the best hd camera application to take beautiful pictures! Perfect camera application!  Best camera apps for free,Take professional photos in high resolution, HD quality.Lets capture more wonderful moments in best camera!  ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}