{
"name" : "Magic Dosbox Free",
"url" : "https://play.google.com/store/apps/details?id=bruenor.magicbox.free",
"package" : "bruenor.magicbox.free",
"category" : "Tools",
"description" : "A highly optimized and fast DOSBox port for Android with unique control system for playing anywhere you are without need of external hardware. Play favorite DOS and Windows games with full mouse, keyboard, sound and gamepad support with friends through IPX network.  NOTE : Games are not included. It is emulator which can run your own dos games. Screenshots are used to show Magic Dosbox abilities and functionality only in truthful and non-deceptive manner !!  It was originally developed by DOSBOX team and allows you to run games and applications for DOS platform. This port is highly optimized for touch devices. The main focus is to play your old games anywhere where you dont have external hardware with you.  If you find this application useful you can support further development with buying donated version. In free version is possible to have one game in collection and three base widget types - for controlling keyboard, mouse and system functions.  Please visit our website details and GPL  Features :   game collection, every game profile can be highly customizable (one game profile in free version)  possibility to create game shortcut on desktop  export profile. Profile with whole designed layout. Serves for sharing layouts between friends. In donated version you can additional actions : import, duplicate  multi-language support (slovak, english, german, russian, french)  10 types of various on-screen widgets/buttons with dozens settings. Free version has 3 allowed widgets  On-screen widgets : Key, Mouse, Special. Additional seven in donated version.  various modes, main are design mode and play mode  unlimited number of on-screen widgets/buttons with custom image, text, background image and custom position on screen. Text and Image inside widget can be resized and positioned by your needs  dozens painted images and background images for widgets styling. Possibility to add your own  absolute and relative mouse  support for samsung stylus include its button  support for x360 joystick, nvidia shield controller and other external gamepads  support for physical mouse  support for sound blaster and pc speaker  mappable swipes gestures  longpress, double tap, two-point gestures  support for *.iso, *.gog, *.inst and *cue ogg support  in-game screenshots with gallery. Useful if you need something remember in adventure or rpg  fast emulation with plenty optimizations  orientation lock to landscape or portrait  resizable screen with custom position  support for networking - IPX and serial modem  forum and website  Save and Load States  support for android 4.0+  ============================= It all happened so suddenly. Massive disasters from the sky above and from deep below has been scorching our southern land. Rivers have turned red and sky black. And than they appeard. Nobody saw them centuries...orcs, devils and alien forces. And even more! Messengers brought news about people deceased long time ago which had been risen from their graves. This night, I have seen dragon with my own eyes . Despair is everywhere. All brave heroes are being called to arms by our king. Join his mighty army to fight for the glory. I have to admit Magic has returned to the earth! ============================= ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}