{
"name" : "Calc Box - Photo,video locker,Safe Browser,Applock",
"url" : "https://play.google.com/store/apps/details?id=calc.gallery.lock",
"package" : "calc.gallery.lock",
"category" : "Tools",
"description" : "Calculator Box is completely free to Hide unlimited Pictures and Videos. Really want secret locker for your personal files in your phone? you can not skip this app. Keep safe gallery and No need to worry when giving your smart phone to friends and family when Smart Calculator Plus app installed in your phone.  Top Features   Hide Pictures & Videos: Your files will be secretly stored and can only be viewed in this app after you enter correct password into smart calculator.   Safe Browser: Surf through internet using safe browser and even download photos and videos which will be stored secretly inside this app. You can even bookmark your favorite sites to access them easily.   App Lock: Powerful App Lock system to lock private and social apps along with Fingerprint App Lock option for compatible devices.  Advance Features   Disguised and inconspicuous Gallery Lock app icon magically disappears and gets replaced with a secret G-Scanner icon. You can also start this app without icon from your phones Settings/Apps/Gallery Lock/MANAGE SPACE.   Share to Hide You can directly hide pictures and videos from phone gallery or SD card by sharing to Gallery Lock app.   Fake Vault Create Fake vault with different password for storing fake photos and videos.   Face Down Lock The app will perform action given by you when your device faces downward. You can choose to close the app or open a website or other app in emergency.   Fake Cover Disguise your apps lock screen to prevent from breaking into your password. Fingerprint scanner and fake force close dialog will hide the real lock screen.   Intruder Selfie Automatically takes Intruder selfie when someone tries to break in your privacy by entering wrong password or pattern.   Inbuilt Image Viewer and Video Player Support Inbuilt Image Viewer to view pictures and slideshow them with transition effects. Support Inbuilt Video Player to play videos with any media player installed in your phone.   Uninstall Protection Prevents Secret Gallery Lock app from being uninstalled from kids or strangers. This app uses the Device Administrator permission.  This app uses Accessibility Service.  Quick Tips   In order to Change PIN quickly go to Settings tab and click on Change Password.  After you Hide Pictures and Videos, Export icon in Gallery lock brings back your media whenever needed.  Easily Change Slide Show interval using the Settings tab.  Use Theme icon to make the Vault Lock Screen colorful so you dont get bored.  ---------FAQ--------  Q: If I uninstall the app, can I get my pictures back if I reinstall the app? A: Re-installing cannot recover those deleted files. So please make sure to unhide and backup all your hidden files before uninstalling this app.  Q: What about if I lost my phone or broken? A: Your files are stored only on your device and not online.  Q: Can I take out my media from this photo and video Locker? A: Yes, you can easily export photos and videos using couple of steps  Q: Photos and videos are stored together or separately? A: You can hide photos in photo locker and videos in videos locker inside this app.  Q: If I forgot my password? A: If you Forget Password you can always Recover Password by your registered e-mail id and regain access to this app by, Input 7777 then = button in our Calculator App to send your password into registered email.  Need Help? Feel free to mail us at: donnadanley247@gmail.com ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}