{
"name" : "Scanner App -  PDF Scanner Document Scan OCR",
"url" : "https://play.google.com/store/apps/details?id=camscanner.documentscanner.pdfreader.scannertoscan",
"package" : "camscanner.documentscanner.pdfreader.scannertoscan",
"category" : "Tools",
"description" : "Doc scan - scan to scanner PDF & OCR text scanner  PDF document Scan offline, OCR text & Image Scanning app into pdf & jpg Docs Scanner.  Scan to Scanner offline is a fast cam scanner app that OCR text scanner to pdf. Doc scanner app is automatically detects document borders when you scan pdf & jpg document.  Free Scanner app documents, receipts and business cards scanner and any type of documents save the scanner documents to PDF. Easy way to scan, convert pdf to word document scan, Support SD card and send fax another android devices.  Fast scanner and pdf scanning app scanning image, paperwork into PDF format, sometimes a single day you need your different documents scan do in multiple languages. The scanner app its your document image cropping and enhancing algorithm that lead to the clear images and pdf scanner for android. Scan to scanner app is a must for every person be its a school students business person or any other field of person.  The pdf scanner is get the faster speed for documents scan and share the files do it immediately mail, fax or text. The automatically detect the corner of the document files that you to scanning for best quality. You can also crops and filter the part of document that you want to signature scanning and letter. The peoples worries about office documents files saving and paperwork data storage is resolve by digital scanning process to have real file convert into a soft form. JPG files scanning, OCR (Optical Character Recognition) tech the possessor which is fit to support image to hold them & compose an original scanning file. PDF scanner compose to signified a clear copy of the real file is convert into a soft copy.  OCR text scanner offline is work very fast your phone, tablet and other android devices. Scanning document file to jpeg format the camera of the mobile, android devices. With a high quality scanner document files and PNG format, OCR convert image to text and scanning. The cam scanner app to supporting +104 Languages- of pdf to word convert can be done or txt from scanning. Sign and send file to other for signing with an electronic signatures and automatically detect page edges. Add documents file folder and create new folder function. Clear scanner allow the user to convert the jpeg file to pdf format. You can even print the scanned documents files or images over clout prints.  Scan to scanner PDF features:   The camera scanner app also offers editing features after saving the image along with various multiples filter.    Optimize your files into modes like Color and dark for the best (file) scan quality and fast.  The high quality scan image your android device with in just touch in our free scanner.  Arrange your documents in folders and sub folder and files to scan images one by one.  Auto correcting feature the doc scanner provides like adjusting the image brightness removings shadows & straightening picture for the betters result.  Enhance texts, OCR text images and graphics looks clears & fast.  You will be able to digitize all your paperwork & file and save the transfer pdf document on your phone devices.  Cam scanner turn your android devices into a multiple pages scan for receipt notes, whiteboards, invoices & other paper text and JPEG file.  Recent changes: Fast and Clear Scan document in HD quality. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}