{
"name" : "Cast Videos: Web/IPTV/Phone to Roku/Chromecast/TV",
"url" : "https://play.google.com/store/apps/details?id=castify.roku",
"package" : "castify.roku",
"category" : "Tools",
"description" : "Cast Videos from Web, IPTV, DLNA, LAN, or Phone to Smart TVs.  Compatible Streaming Devices: Roku Express and Roku Streaming Stick Chromecast 1, 2, and Ultra HD 4K Fire TV and Fire Stick Apple TV Airplay (4th gen) tvOS 10.2+ DLNA receivers Xbox One, Xbox 360 Google Cast receivers Smart TVs with DLNA built-in including: LG, Panasonic, TCL, Phillips, Sony Bravia, Sharp, Samsung, and many others. Please check your TVs user manual.   ***Remote feature is only for Roku streaming devices. Like all other Android remote app of this kind, it requires the Roku to already have access to the same WIFI network as phone.  This app works best with Roku and is optimized for it, but it also works with Google Chromecast, and Google Cast receivers. Users may experience limited functionalities with other casting receivers.  Play From Sources:  - Phone Files - Browser Websites - LAN, SMB, Samba - DLNA Servers - IPTV  - IPTV playlists - Cast to TV, video, music, or photos - Cast web videos found online from websites - Stream to TV from local files on phone to Chromecast or compatible devices - Only 2 items in queue at a time - Only 1 bookmark at a time - Play history - Searching of videos on any websites  - Block popups per website  *Free features are ads-supported.    Pro Premium Features: - Removes advertisements - Subtitles (only Chromecast) - Custom themes - More than 2 videos in queue - More than 1 bookmarks - Set home page - Sync across devices  Cast videos or music from Web Browser or IPTV to TV.  Also cast local movies and musics found on your phone/tablet to TV with compatible streaming devices.  Usage Steps: 1. Use the apps browser to navigate to a website. 2. The browser will try to find any playable video/audio on that site. 3. Then play it locally on the Phone/Tablet, or cast to TV with Chromecast or one of the compatible streaming receivers.  Supported Formats: MP4 movie MKV files MP3 music JPG, PNG images HTML5 video HLS Live Streaming IPTV m3u formats 4K and HD where available  Limitations of Some Streaming Receivers Apple TV AirPlay: Battery Optimization must be disabled for Android 6.0 Marshmallow and up, local cast of audio and photo not supported. MKV files not supported. Some urls formats not supported. Fire TV: some video formats not supported. Roku Sticks: no video resuming/scrubbing, no audio streaming, some file formats not supported. The following streaming devices and Smart TVs are in BETA support, so please do not expect them to work as good as Chromecast: DLNA devices, Android TV, Xbox One & 360, WebOS, Netcast  This app does not modify, download, or transcode the video sources. It only sends the original source to your streaming receivers. The app does not hosts any content. Therefore the compatibility and availability of the videos are dependent on the source websites themselves.  -This app only casts from websites that uses public format. Proprietary video formats will not cast to TV. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.CHANGE_WIFI_STATE', 'com.android.vending.BILLING', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.BLUETOOTH', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'com.sec.android.provider.badge.permission.READ', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.ACCESS_COARSE_LOCATION', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.google.android.c2dm.permission.RECEIVE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.FOREGROUND_SERVICE', 'com.sec.android.provider.badge.BadgeProvider', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.sec.android.provider.badge.BadgeProvider', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}