{
"name" : "Ham Clock",
"url" : "https://play.google.com/store/apps/details?id=cc.kostic.hamclock",
"package" : "cc.kostic.hamclock",
"category" : "Tools",
"description" : "HamClock is targeted for portable amateur radio operators.  It displays time/date and user notes related to various portable locations on a single screen: - Local date / time - GMT date / time - User notes - Reminder to transmit callsign every 10 minutes, as required in some countries.  Note can be entered in up to four fields. Use it to record location name, QTH locator, callsign, activation details for SOTA, WCA, WFF or other activities, event info etc.  Multiple notes can be entered and saved for later use. Note view is scrolled to show longer texts Hide local clock, leaving even more room for notes  - Large font and contrast for readability in bright daylight. - Light / dark color scheme - Configurable date format - Configurable display timeout. - Optional popup every 10 minutes to remind you to transmit your callsign. - Optional ringtone played along with the visual reminder. If you dont want audio alert, select silent or none ringtone.  - Share note content as a simple text file, formatted as JSONArray (string). Extension is .hctxt (HamClockTxt) but can be edited in any text editor. Sharing works best via Gmail or GoogleDrive. With Gmail, open/receive directly from an attachment (no need to download the attachment first). If proper JSONArray file format is detected, save or discard note is offered.  Sharing via Bluetooth is less reliable on different devices, because android versions and phone vendors vary in trusted file types for BT transfers, and in permissions needed to access bluetooth storage space (received files). Sharing via other applications is not tested, and it may or may not work.  PRIVACY / DISCLAIMER This app does not collect any personal data or share anything with anyone. There are NO ads. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'cc.kostic.hamclock.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}