{
"name" : "PhoNetInfo - Phone Info & Network Info",
"url" : "https://play.google.com/store/apps/details?id=ch.patrickfrei.phonetinfo.free",
"package" : "ch.patrickfrei.phonetinfo.free",
"category" : "Tools",
"description" : "PhoNetInfo retrieves detailed phone and network information such as firmware, manufacturing date, battery temperature, sensors, network operator, signal strength, cell id, wifi details, camera details, memory details, CPU details, etc.  PhoNetInfo PRO: Allows you to export all information by email or to a file. Ad free. Download the PRO version here.  Main categories with examples: - General: Manufacturer, Model, Firmware, Manufacturing Date, Sales Country, Display Size, Last Reboot, etc. - Battery: Battery Level, Battery Status, Health, Temperature, Voltage, Capacity, etc. - Network: Network Operator, MCC, MNC, IMEI, IMSI, Cell IDs, Signal Strength, ASU, LAC, CQI, RSRQ, Bandwidth, etc. - Wifi: IP, DNS, DHCP, MAC, SSID, etc. - Sensors: Name, Vendor, Power Consumption (hygrometer, barometer, magnetometer, luxmeter), etc. - Camera: Supported Resolutions, Zoom, Flash, Focal Lengths, etc. - Memory: RAM (total, available), etc. - CPU: CPU Cores Frequencies, CPU Frequency Limits, etc. - Thermal: Thermal Zones Act. Temperatures and Trip Point Temperatures, etc.  Get the full list of features here.  If you like the app, please take some time to leave a nice review. Thank you for your support!  PhoNetInfo requires specific permissions in order to only show system relevant information. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}