{
"name" : "Phoenix VPN - Free proxy vpn, Unlimited vpn",
"url" : "https://play.google.com/store/apps/details?id=classicstudio.phoenix.proxy.vpn",
"package" : "classicstudio.phoenix.proxy.vpn",
"category" : "Tools",
"description" : "Phoenix Vpn is an absolutely free and unlimited Vpn proxy for your Android phone or tablet. Phoenix Vpn hides your IP address, encrypts your Internet connection, provides complete anonymity online. Phoenix Vpn allows you to access sites and content blocked in your region.  Unlock sites and applications  With Phoenix Vpn Proxy, you can unblock any sites and applications absolutely free. Go around Internet censorship and geographical restrictions to access your favorite sites.  Anonymity and protection of personal information  Phoenix Vpn helps protect your personal data in the global network. Your IP address and your location will be inaccessible to attackers. You can freely use the Internet connection without fear for your information security.  Protect your device  Phoenix Vpn protects your phone and tablet when connected to the Internet. Your device is safe when connected to public WIFI networks. Your passwords are completely secure.  Phoenix Vpn - Free VPN Proxy  Our application is absolutely free in all countries of the world. No paid subscriptions. Unlimited.  Phoenix Vpn - Lightning Proxy Vpn  Instant connection to the server. We constantly monitor the load on the servers and correctly distribute users so that no one has difficulty connecting.  Phoenix Vpn - WorldWide Proxy Vpn  Several dozens of servers located around the world are available to every user. We are constantly adding new servers. All servers are absolutely free and unlimited.  Phoenix Vpn - Fast VPN Proxy  You get the highest possible internet connection speed. Connect to the nearest server and you will not feel the loss of Internet connection speed.  Phoenix Vpn - Simple and Easy Proxy Vpn  Simple, intuitive, user-friendly interface. No complicated settings and no clear terms. All you need to do is click on one button and our application will instantly connect you to a free server. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CHANGE_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}