{
"name" : "Quick Cleaner - Cleaner & Booster, Memory Cleaner",
"url" : "https://play.google.com/store/apps/details?id=clean.storage.booster.memory.master",
"package" : "clean.storage.booster.memory.master",
"category" : "Tools",
"description" : "Quick Cleaner is a Speed booster & Cleaner for Android is your preference to make your android clean and powerful. Clean your Android phone from time to time to boost performance, enhance battery life, delete empty files and get rid of junk files. Optimize your RAM memory with this Memory Cleaner (RAM Cleaner) to accelerate your smartphone. Speed booster &Cleaner app Effectively scan and Clean junk files.  Speed Booster & Memory Cleaner: Clean and Boost Your Android phone or apps Just By One Tap, Speed Up RAM Memory And Make Your Phone Faster up to 40%. It Stops Unnecessary process To Enhance Speed And Reduce Memory Usage.  Cache Cleaner: Clean all junk documents, which includes cache, App Cache, Document cache, Video Cache, Empty Files, etc. Its the safest Cleaner for Android. It will do clean cache, trash, app cache, download folders, browser records, and residual junk files to reclaim storage and boost your phone. So its a Cache Cleaner, Cache Cleaner android ram booster. Cached data cleaner, Logs cleaner, and system memory cleaner. Its an All in one tool for cleaning junk files & optimize storage in depth.  Cpu Monitor and Cpu Cooler: In Android device Heating is a common problem in the current age of mobile processors, Speed Booster helps you to monitor and controls the phone temperature in real-time and show you the statistics. Cool your Cpu by Cpu Cooler and monitor by Cpu Monitor.  Optimize battery temperature and life  Shows the battery info such as Battery temperature, Battery voltage, Battery Capacity. Take care of the battery temperature by Kill background apps.  Residual storage Fast cleaner  Speed Booster will auto-detect junk file, log files, duplicate file and empty folder on your Android Device. Empty Folder Cleaner and empty file Cleaner  Phone Booster is advanced utility to delete empty folders. Analyze / Scan phone storage and Delete empty folders, Clean Empty files. One tap Empty folder Remover.  Game Booster - Clean your device and boost to play the game smoothly. Speed up performance and surely free up memory space for Games.  App Manager, APK Extractor and system Manager  Monitor your device RAM, CPU, Storage and show you status and manage the status of apps Clearly. Extract to backup installed android apps and share backup app.  Additions: Quick Cleaner is a top cleaner booster for android 2019. super cleaner booster for android phone Clean your device quickly and delete empty folders one tap. it is the best booster cleaner master. It optimizes your device to boost performance. its a top cleaner booster optimizer app. No need to worry about android cache here is the solution use phone booster cache clean 2019. Use smoothly it is a phone booster with no ads. If your device hanging during android play game use this phone cleaner & booster app. Its a just 3 MB to download phone cleaner lite. do you have an issue during the game ? its the best phone cleaner for the game. No worry about junk files or empty folders. Its all in one tool clean empty folders  Better User Experience: Cleaner and Booster Tool provides accurate and fast experience.  Download Quick Cleaner NOW!  If you have any questions or suggestions regarding Quick Clean, please contact us at nuapps.developer@gmail.com ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.RESTART_PACKAGES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'clean.storage.booster.memory.master.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RESTART_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES']",
}