{
"name" : "HOT VPN- Free･Unblock･Proxy",
"url" : "https://play.google.com/store/apps/details?id=co.acnet.hotvpn",
"package" : "co.acnet.hotvpn",
"category" : "Tools",
"description" : "HOT VPN, the fastest, the most smooth free VPN, and easier to use.It is the best app for Unblock sites, Wi-Fi Security and Privacy Protection.  100% unlimited. No registrations.No session, speed or bandwidth limitations and restrictions.   HOT VPN is the most trusted security, privacy and access platform with top performance on speed, stability and security.   HOT VPN gives you true online freedom  bypassing geo-restrictions and accessing worlds content from anywhere, with just one tap.   Install HOT VPN- FreeUnblockProxy for the following features:  Unblocked Websites and Apps  Bypass geo-restrictions, internet filters and censorship while youre at work or school.  Bypass and Unblock websites or social media sites with free VPN proxy server.   Bypass the firewalls as school VPN proxy. Enjoy multiple proxy server to bypass blocked website and apps.Just hop on HOT VPN and get instant access to social websites, messaging apps, and media content that may be restricted in your country or region.   Super Fast Speed  Thousands of servers being provided for you to make sure super fast speed.  It detects your location automatically and connects you to the nearest and fastest server. As a result, your connection will be much faster than any other VPN or proxy providers.  Anonymous Connection and Privacy Protection  Protect your network traffic and internet under public Wi-Fi hotspot browse anonymously and securely without being tracked.   Protect data privacy, personal information security and internet security while HOT VPN is on.  Encrypts data using OpenVPN protocols (UDP / TCP).   Secure all online activities  Hide your IP address, identity, and location from trackers, and enjoy maximum privacy and security.  Easy to use  One touch to connect to VPN proxy server.   Non username, Non password, Non registration.   No credit card needed.   For policy reason, this service is not available in Mainland of China. We apologize for any inconvenience caused. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}