{
"name" : "NetPatch Firewall",
"url" : "https://play.google.com/store/apps/details?id=co.netpatch.firewall",
"package" : "co.netpatch.firewall",
"category" : "Tools",
"description" : "NetPatch Firewall is an advanced Android network firewall WITHOUT ROOT.  You can block Any network access based App, Hostname and IP using the no root firewall.  It supports custom rules fully, shadowsocks and shadowsocksR proxy, the only network firewall supports these features.  With the firewall App, reduce your data usage, save your battery, protect your privacy, take back the better Android life you deserve.   Block network access per apps, based screen on/off, wifi/mobile(3G & 4G), and block Roaming  Shadowsocks and ShadowsocksR secure proxy, support TCP & UDP(one better VPN proxy, you need a shadowsocks or ShadowsocksR server)  Custom DNS, change your DNS servers, support DNS query through shadowsocks(R) proxy, and set DNS cache time  Notify when new apps installed  Export/import configure  Free 7-day Trial for Premium  No Ads  Premium features:   Create any number of IP and domain groups  Subscribe IP and domain groups from network  View all network logs, (include access type, IP, hostname, activity time, duration time, sending and receiving data size).  View all blocked requests  View all IPs and hostnames of each app accessed  Block the access to any domain names you dont want at any time  Block or proxy based country ips  Support Block/Proxy/Direct rules for every group  Support root domain name  Support CIDR network address   How does NetPatch firewall work?  https://netpatch.github.io/rules/  Follow us on Twitter:  https://twitter.com/netpatchco  Notice:  NetPatch Firewall does not have any built-in rules, you need to create your own rules or subscribe from network.  Known issues:  1. In the ipv6-only network may not work.  2. Android VPN has a routing bug for income connection that I cant fix it.  If you encounter problems when using apps like Microsoft Teams Meetings, Whatsapp video, you can try long tap the App in the APPS SETTINGS page to add it to whitelist, it may work.  ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}