{
"name" : "Hide Files Photo Vault - Private Photos, Videos",
"url" : "https://play.google.com/store/apps/details?id=co.tpcreative.supersafe",
"package" : "co.tpcreative.supersafe",
"category" : "Tools",
"description" : "SuperSafe secures personal photos and videos by locking them down with PIN protection, fingerprint authentication, and military-grade encryption. Its the best place for hiding personal pictures and videos. With SuperSafe, you can protect your privacy, secure your photos, and save phone space.  SuperSafe lets you:  Preserve special memories  Store family photos, audios ,videos  PIN protect your Photo Gallery  Just look through your phones photo gallery and tap photos or videos to import into your SuperSafe Photo Vault. Once imported, you can choose to easily delete those photos from your phones public photo gallery while still view them in your SuperSafe Photo Vault. SuperSafe Photo Locker Features:   Everything behind a lock - Your photos are secured via a PIN, pattern or your fingerprint.  Sync photos or videos across devices - Your encrypted Google Drive securely syncs your photos, albums and videos across all your devices.  Backup photos & videos for easy recovery - Fear not if your phone is lost, stolen or damaged!  Face-down auto lock - In a tight situation? Have SuperSafe lock itself when your device faces downward. Install SuperSafe Basic to get free secure Private Cloud storage and also receive a free test drive of SuperSafe Premium!  SuperSafe Premium Exclusive Features:  Album Lock: Assign individual PIN codes to access particular albums  Break-In Alerts: Takes photos of intruders and tracks break-in attempts  Fake Pin: Creates a decoy SuperSafe with a separate PIN code  Manage Photos  Private Cloud: No limit items in SuperSafe  Trash Recovery: Retrieves photos youve mistakenly deleted  Personalize SuperSafe  Ad-Free: Keeps your photo-viewing experience distraction-free  Custom Album Covers: Sets album thumbnails to a specific image  ---   About SuperSafe   SuperSafe helps you to protect your personal important data. We focus on making simple to use, secure apps and services that improve your digital life.  Need Help? Find the FAQs in the Help & Support tab within Photo Vault, or contact us at  care@tpcreative.me ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}