{
"name" : "ChastiKey - Timed Keyholder",
"url" : "https://play.google.com/store/apps/details?id=co.uk.kevincross.chastikey",
"package" : "co.uk.kevincross.chastikey",
"category" : "Tools",
"description" : "ChastiKey acts as a keyholder to your chastity device by storing and hiding combinations that youve set your locks and personal safes to, for a variable or fixed duration of time.  ChastiKey has two types of locks, each with a number of settings. Fixed locks and variable locks.  Fixed locks run their duration without changing.  Variable locks will increase or decrease in duration depending on a number of factors.  When setting up a new lock you will need to choose if its a fixed or variable lock, the length of the combination that your lock or safe allows (4 to 8 digits), the maximum hours or days you want the combination to be hidden from you, and whether or not you want a chance for the maximum days to be increased or decreased (up to 50% chance), and a number of other options.  You will then be shown a random combination that you will need to set your combination lock or safe too, before being shown a screen full of random flashing numbers to help you forget that combination. The point is to forget the combination so writing it down will defeat the purpose of the app, but you may want to write it down the first time or two while you test the app out.  For variable locks you will be given a chance each hour or day (depending on the other options you chose) to reveal your combination by trying to find a green card in a deck of cards (all done in the app).  A green card will show you the combination needed to unlock your combination lock or electronic safe. A red card means you will have to wait another day/hour to try again. A yellow card will either add or subtract a number of red cards from the deck. Each card picked will be removed from the deck which increases the chance of picking the green card next time.  You can have multiple locks running at the same time if needed.  You can also share locks with other users and when other users load your shared locks you can increase/decrease the duration of their lock if its a fixed lock, and add/remove cards to their lock if its a variable lock. So you can take on the role as a keyholder using the app.  It is also perfect for self bondage as it allows for short locks that run for a few hours instead of days. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'co.uk.kevincross.chastikey.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}