{
"name" : "Stay Alive! Keep screen awake",
"url" : "https://play.google.com/store/apps/details?id=com.synetics.stay.alive",
"package" : "com.synetics.stay.alive",
"category" : "Tools",
"description" : "IMPORTANT: Fix app detection for Android 6 and 7 users. See in app information in about box for more details.  Make your device screen Stay Alive! when you need it.  Most options are FREE and donator options are cheaper than simillar app on the store!  Download our new app Auto Exec! Easy Tasker!  Stay Alive! donators get 10% rebate on Auto Exec! Easy Tasker.  Keep your screen on when your device is running your GPS application, favorite remote control, playing a movie or slideshow, etc... Perfect to keep your screen on without dimming for application development. Your screen will never go back to sleep until you want it to...  Choose when you want your device to Stay Alive!:  FREE OPTIONS!   NEW: Full Android 5, 6 & 7 support  On except if one of the applications you selected is in foreground  Only when you have power  Even if you are running on batteries  When one of the applications you selected is in foreground  Can be automatically disabled when you connect to your car or desktop docking station  Prevent or allow Stay Alive! to dim your screen when active  Protect your battery with minimum battery level auto pause option  Easily pause Stay Alive! when not needed from the notification zone. No need for a widget!  NO annoying ADS!  HOLO light and dark themes!  DONATORS OPTIONS!   NEW: Black screen floating clock  Display a black screen to prevent screen lock and save battery on AMOLED screens. Just touch the screen to wake up.  Auto start on boot  Hide top bar icon (Android 4.1+)  Automatically keep screen on when plugged even if configured to stay on for specific apps when unplugged  Keep screen on even when locked  Automatically pause SA! with proximity sensor  Change config colors!  Easy power operation mode changes with the notification icons! It will show you which power mode you are using and allow you to quickly change between modes. You can also quickly activate the Stay Alive for specific application mode!  Stay Alive! will automatically disable itself then you manually turn off your device. It wont keep your screen on if your device wakes up when it receives a notification.  Stay Alive! will not change your display timeout value or brightness settings. It will prevent your device from going to sleep based on your needs.   We made this application Ad Free. Please, support this initiative by donating using the menu option in the application.  Please use our email address for support or feature requests, as comments on Play Store dont allow me to gather enough information or contact you.  Privacy Policy: We take your privacy seriously. All permissions are needed for the app local operations and no information is used or exchanged.  Contact Us: Support Forum: http://forum.xda-developers.com/showthread.php?p=46379475 Google+ Community: https://plus.google.com/u/0/communities/103504696247906095281 Email: stayalive@synetics.ca  Permissions: GET_TASKS - Needed to get foreground app name to keep alive. PACKAGE_USAGE_STATS - Needed to get foreground app name to keep alive on lollipop. READ_PHONE_STATE - Needed to disable Stay Alive! if the device is off. WAKE_LOCK - Needed to keep the device Alive! WRITE_EXTERNAL_STORAGE - Needed to write the user configuration. READ_EXTERNAL_STORAGE - Needed to read the user configuration. BILLING - Needed for the donation option! RECEIVE_BOOT_COMPLETED - Needed to auto start Stay Alive! on boot WRITE_SETTINGS - Needed to be compatible with XIAOMI devices. Do not use XIAOMI compatibility with other devices it is not needed.  Tags: Screen Alive, Screen Awake, Galaxy Dim, Brightness, Timeout ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.SEND_SMS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.READ_EXTERNAL_STORAGE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.SEND_SMS', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}