{
"name" : "GST Calculator & Guide",
"url" : "https://play.google.com/store/apps/details?id=com.aswdc_gstcalculatorguide",
"package" : "com.aswdc_gstcalculatorguide",
"category" : "Tools",
"description" : "Goods and Services Tax (GST) is an indirect tax which was introduced in India on 1st July 2017 and was applicable throughout India which replaces multiple cascading taxes levied by the central and state governments. Under GST, goods and services are taxed at the following rates: - 0% - 5% - 12% - 18% - 28%  The tax will be the substitute for all indirect tax levied by state and central government.  - Central GST (CGST) which will be levied by Centre - State GST (SGST) Which will be levied by State - Integrated GST (IGST)  which will be levied by Central Government on an inter-State supply of goods and services.  GST Calculator and Guide is an app to help you understand guidelines of Goods and Services Tax applied in India. The app will explain about GST and help you calculate bill along with GST.   Key Features of the app are: - HSN List - HSN (Harmonized System of Nomenclature) is a 6-digit code for identifying the applicable rate of GST on different products as per CGST rules. Here the app provides a list of HSN Codes, its description including CGST (Central GST), SGST (State GST), IGST (Integrated GST) rates as applicable.   - SAC List - Service Accounting Code (SAC) for GST - India has adopted a Service Accounting Code (SAC) for all its services.   - GST Calculator - It helps you calculate the total amount of the bill for the goods you purchased including percentage rate of GST levied.   - Sections / Acts - GST Seva Kendra - GST Seva Kendras have been set up by the Government for helping GST taxpayers and businesses with GST registration related support and assistance in uploading GST returns. The app provides details like Address, Phone Number, Fax number, Email address of all these Seva Kendras.   - FAQs - Some frequently asked questions related to GST are given for clarification and understanding.   ---------------------------------------------------------------------------------------  This App is developed at ASWDC by Akshay S. Kotecha (150540107048) 5th Sem CE Student. ASWDC is Apps, Software, and Website Development Center @ Darshan Institute of Engineering & Technology, Rajkot run by Students & Staff of Computer Engineering Department  Call us: +91 97277 47317 Write to us: aswdc@darshan.ac.in Visit: http://www.aswdc.in http://www.darshan.ac.in   Follow us on Facebook: https://www.facebook.com/DarshanInstitute.Official Follows us on Twitter: https://twitter.com/darshan_inst ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.aswdc_gstcalculatorguide.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
}