{
"name" : "Image Recovery - Restore deleted photos",
"url" : "https://play.google.com/store/apps/details?id=com.deleted.imagerecovery",
"package" : "com.deleted.imagerecovery",
"category" : "Tools",
"description" : "Some times it happens that the files are accidentally deleted from you, after that you do not have any option how to get that file. Image recovery solves your problem so that you can retrieve your deleted images. The image recovery application performs deep recovery to find your deleted image files and shows the images you can save on your phone. The photo recovery application also obtains hidden files for you and shows them as well. Image recovery uses a special type of algorithm that gives you the best results. And always gives good results.  Why you go with Photo Recovery? - Recover deleted Images & get your lost memories or your beloved one Its really complex if any important photos get deleted without backups. But No worry with Photo Recovery, you can easily restore deleted Images, Restore deleted photos.  Easy to use and strong tool: Easy to use UI you jus click the scan photos and wait till the scanning process not completed and once the photo searching process is done you will see a list of deleted or hidden image files.  Fast and deep scanning: It is a strong tool for scanning the deleted image and show you deleted or lost images quickly. Photo Recovery is a powerful search engine that discovers lost pictures and lets you restore deleted photos. Make sure with this tool you will get your deleted images easily.   Image recovery no root required  Image recovery dose not required to root your phone. Only install this photo recovery app on your phone. do Scan, View deleted images, and recover them, and then you can get your lost photos recovered.   Save time and quick result: Just one click away from getting the deleted photos from your phone. Scan fast and better result to deliver you deleted images  Image recovery no ads Its free of cost app and no ads to disturb you  Image recovery main features: - View detailed photo detail info like image path, image size, date, etc - Recover deleted photos or images - Search and find all previously deleted photos on your device by Image recovery. - Restore deleted photos - Share photo recovery - you can delete the photo permanently from the device.  If you have any questions, please contact us at any time. Our email address is nuapps.developer@gmail.com. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.deleted.imagerecovery.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}