{
"name" : "Keyboard theme for Galaxy Note8",
"url" : "https://play.google.com/store/apps/details?id=com.ikeyboard.theme.galaxy.note8",
"package" : "com.ikeyboard.theme.galaxy.note8",
"category" : "Tools",
"description" : "You cant miss the Galaxy Note8 Keyboard Theme with new fonts&emojis. It can make your phone trendy and more fashionable than before! Download and Apply this Galaxy Note8 theme right now !  Why Galaxy Note8 Keyboard Theme is the right choice: * Every pair of stylish eyes would be caught if you install and apply this Galaxy Note8 Keyboard Theme with the most gorgeous appearance and the greatest sense of fashion. * The most attractive design is in Galaxy Note8 Keyboard Theme. * Galaxy Note8 Keyboard Theme is specially generated for you to personalize and beautify your phone. * Your phone keyboard with Galaxy Note8 will appear completely luxury and fashionable. * Galaxy Note8 Keyboard Theme with New Galaxy Note8 HD wallpaper will make your phone awesome brand new. * You will experience unbelievable pleasing, fluent and fast when you type with Galaxy Note8 Keyboard Theme. * Your wish to customize your phone can be satisfied 100 percent by Galaxy Note8 Keyboard Theme.  Galaxy Note8 Keyboard Theme is definitely the most correct option for you. Download the Galaxy Note8 Keyboard Theme right now!   How to Use Galaxy Note8 Keyboard Theme:  * Note: Please download and activate our keyboard first. * Download Galaxy Note8 Keyboard Theme from Play Store. * Click the icon of Galaxy Note8 Keyboard Theme. * Click the Apply button or the preview picture of Galaxy Note8 Keyboard Theme. * Bravo! You have installed and applied Galaxy Note8 Keyboard Theme. * Enjoy Galaxy Note8 Keyboard Theme with cute emoji and delicate fonts.   New features aiming at typing experience improvement:  * Gesture typing will refresh your recognition of keyboard typing. * Next-Word suggestion would improve your typing efficiency tremendously by making suggestions using the previous word. * Auto correction is able to minimize your spelling mistake. * Sticker Suggestion provides a more vivid and easy way to express yourself. Your typing will be so lively and invigorating with Sticker Suggestion feature. * Copy, cut and paste straight from emoticon keyboard full support for mobiles and tablets.   More features you can enjoy:  * Kika theme Keyboard which has been loved deeply by over 20 million users support over 150 languages and still counting. * Kika theme keyboard provides amount of free and perfect stylish&fashion keyboard HD wallpapers to decorate your phone background, like anime HD wallpaper, cute HD wallpaper, emoji HD wallpaper and so on. For example, glitter HD wallpapers like Golden Bow theme, delicate themes like Galaxy Note8 theme, cute animal themes like Panda theme, etc. You can always find your favorite no matter you like anime HD wallpaper, emoji HD wallpaper or cute HD wallpaper! * Kika theme keyboard allows you to customize keyboard theme by choosing your own photos, HD wallpapers, emojis HD wallpapers, applock pictures or launcher pictures. You can also change the theme colors (including background and buttons), customize the font styles, fonts sizes and colors! Be the designer by yourself, hold your own style. * Kika theme Keyboard is compatible with almost all android phones, including Samsung (Note 8 / Note 7 / S8 / S8+ / S7 edge / J8 / J7), Huawei, Honor, LG, HTCOPPO, VIVO, Smartisan, XIAOMI, MEIZU, One Plus, Lenovo, Motorola, etc.   Privacy and Security: Kika will never collect your personal info and collect the photos you set as HD wallpapers. We only use the words typed by you to make the predictions more accurate.   Install and Apply Galaxy Note8 Keyboard Theme, experience an incredible typing! Believe that Galaxy Note8 Keyboard Theme is the right choice for you! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}