{
"name" : "Read notifications aloud - VOINOTEE",
"url" : "https://play.google.com/store/apps/details?id=com.codococo.voinotee",
"package" : "com.codococo.voinotee",
"category" : "Tools",
"description" : "VOINOTEE is an app that reads callers name, notifications from various apps (such as Kakao Talk, Line, Twitter, Facebook, WhatsApp, Instagram, etc.) out by voice.  * NOTE: VOINOTEE is the LITE version of ByVoice app.  * NOTE: To read a callers name from an incoming call is not available as call logs are no longer readable by a third party app as part of Googles security policy. So the feature is not supported from Android 9 but, still supported on Android 8 and earlier versions.    Read incoming call This function reads the caller name or phone number of an incoming call.  Read notifications of various apps such as Messages, Facebook, Instagram and Whatsapp -You can choose which apps you want VOINOTEE to read notifications. -You can set VOINOTEE to read the app by renaming it. -You can adjust the number of characters in the notification to be read. -While VOINOTEE is reading a notification, you can clear it or open the app to stop reading it. -Notifications that do not have text to read can prevent VOINOTEE from reading them. -You can prevent VOINOTEE from reading notifications for apps youre currently using. -For apps that display too many notifications, you can have VOINOTEE read the notification only once every few seconds. -Notifications with certain words you dont like can be blocked from reading by VOINOTEE. -You can have VOINOTEE read another word for something you dont like. -When a notification occurs, you can have VOINOTEE delay a few seconds before reading it.  Read time You can have the time read every hour on time, and you can change the time to words like noon and midnight.  Read power and battery status -The status can be read when the power is connected or disconnected. -You can have VOINOTEE read the current battery status. -You can have VOINOTEE read the amount of remaining battery.  When to read notifications -You can have VOINOTEE read the notification when a Bluetooth earphone (headset) is connected. -You can have VOINOTEE read notifications when wired earphones are connected. -You can have VOINOTEE read notifications when connected to certain Wi-Fi. -You can always have VOINOTEE read your notifications regardless of your Bluetooth, wired earphone or Wi-Fi connection status. -You can have VOINOTEE decide whether to read notifications based on ringtone mode. -You can prevent VOINOTEE from reading notifications at certain times. -Turn your phone upside down to stop VOINOTEE from reading the notification you are currently reading or no reading at all.  volume -You can either follow the volume setting of your system or use the volume of VOINOTEE itself. -You can use different volume depending on the connection status of Bluetooth device and wired earphone.    Now, you can check incoming calls, text messages and notifications from various apps such as KakaoTalk, Line, Facebook, Twitter, WhatsApp, Instagram, etc. while driving or exercising without looking at your phone.  If you are wearing Bluetooth earphones while riding a bike long distances, you can check notifications on your phone by concentrating on riding.  VOINOTEE also provides plentiful options for your usage environment. By using the rich options, you can freely configure when and how to read notifications that are right for you.  You can decide whether to read notifications based on the connection status of various peripherals (such as Wi-Fi, earphones or Bluetooth headsets).  If you are connected to multiple Bluetooth devices, you can set the priority of them so that you can automatically select which device will play voice.  - Because VOINOTEE allows you to set to read notifications only when you are connected to a Wi-Fi network in a specific location, you can set to not read notifications when the Wi-Fi in your office is connected. And you can set to read notifications when the Wi-Fi in your home is connected.  ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.BROADCAST_STICKY', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CALENDAR', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_FINE_LOCATION']",
}