{
"name" : "Business Card & Invitation Maker",
"url" : "https://play.google.com/store/apps/details?id=com.bigoceanstudio.master.bussiness.card.carkmaker.invitation",
"package" : "com.bigoceanstudio.master.bussiness.card.carkmaker.invitation",
"category" : "Tools",
"description" : "Master Business Card  Cards Maker & Invitation also design your own business card from business card maker app to create card for your business. This card creator is an easy app to create card and invite maker for invitation. Biz card maker with logo and design for business cards and visiting cards. Card maker to create card and call cards for cardmaker. Visit card and make card from card maker to share contact and information designed on business card. Master business card have many creative designs for you. Create card in a simple way to fill your data and choose templates of invitation on business card app. Share digital visit card maker from easy business card editor and virtual business card app. card creator app to print card and show printed business card to you beloved friends. Create visiting card or master business card on this online business card and cards maker business app. Create a business card from business card maker real card app to impress someone from free business card creating app. Printed business card is the best commercial card and card maker for you. Card creator and Biz card share your digital card data on social media. Master Business Card  Card Maker & Invitation is a free app to print and invite maker for you to create card and make card for Biz card. Smart business card or card creator for visiting car is the specially designed master card for you to create card and visiting card like on a blank page from your own thoughts. Card maker and visit card is an amazing invitation app and cards app. Business card editor show virtual business card of your own art draw work. Design card maker from master business card to show professional graphics designer and car maker expert. Business card allow you to create card from business card app. Be a business card designer and visiting card designer to show your skills to others. Save time and create card from this easy card maker app. Add text, your name and company name with company logo on it. Master card maker improve your creativity and skills while creating business card for invitation through invite maker and visit card. Master Business Card  Card Maker & Invitation design your business card and create a business card from businesscard and cardmaker app. Get multiple business card and visit card from master card creation app. Master business card app contain many cool and stylish invitation cards from invite maker and cards maker. Enjoy the free business card and create printed business card and show Biz card to your partner. Change text color or font style according to your own created business cards style. Various collection of professional and visit card. Save your card work and print visit card or print business card from printed card machine to show your skills and design graphics cards. Edit photo on card maker and card creator app. make the same visit card design like you have scan a visit card of famous company. create and design your card within a minute. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.bigoceanstudio.master.bussiness.card.carkmaker.invitation.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}