{
"name" : "Multi Calculator - All-in-one Calculator free",
"url" : "https://play.google.com/store/apps/details?id=com.primedev.calculator",
"package" : "com.primedev.calculator",
"category" : "Tools",
"description" : "Looking for a free calculator that can serve multiple calculator functions? This Prime Multi-Calculator App is a single app that not only does standard calculator functions but also helps you with other calculations and conversions. Make your life easier with this all-in-one calculator app, free multi calculator app that does multiple functions without installing multiple calculator or converter apps.  ***************************** APP FEATURES ***************************** This free multi calculator app is unique and is an all-in-one calculator app for the below calculator functions -  Standard Calculator with addition, subtraction, division, multiplication  GST Calculator with CGST, SGST calculation support  EMI Calculator - Home Loan EMI Calculator, Personal Loan EMI Calculator, Car Loan EMI Calculator, etc.  Currency Converter - Convert between 50+ currencies support with live currency rates & conversion.  BMI Calculator - Calculate your Body Mass Index (BMI) easily  Percentage Calculator - Super easy to use percentage calculator  Unit Converter - Easy unit converter for weight, length, area, time & volume All these features on the Calculator app are free to use. So, what are you waiting for? If you are looking for the best and pocket-friendly calculator app to replace the multiple calculator apps on your Android phone, start using this Prime Multi-Calculator app now.  ************************ SAY HELLO ************************ We are constantly working hard on making the Prime Multi-Calculator app better and more useful for you. We need your constant support to get going. Please feel free to email us for any queries/suggestions/problems or if you just want to say hi. We would love to hear from you. If you have enjoyed any feature of the Prime Multi-Calculator app, do not forget to rate us on the play store and share among your friends. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}