{
"name" : "Fing - Network Tools",
"url" : "https://play.google.com/store/apps/details?id=com.overlook.android.fing",
"package" : "com.overlook.android.fing",
"category" : "Tools",
"description" : "Fing has helped 35 million user worldwide to understand:  Whos on my WiFi  Is someone stealing my WiFi and broadband?  Have Ive been hacked? Is my network secure?  Are there hidden cameras in the B&B Im staying in?  Why Netflix has started buffering?  Is my internet provider giving me the speed I pay for?  Fing is the #1 Network Scanner: discovers all the devices connected to your WiFi and identifies them, with our patented technology used also by router manufacturers and antivirus companies worldwide.  With Fing Apps free tools and utilities help you:  Run WiFi and Cellular internet speed tests, download speed and upload speed analysis and latency  Scan networks with Fings Wi-Fi & LAN network scanner and discover all devices connected to any network  Get the most accurate device recognition of IP address, MAC address, device name, model, vendor and manufacturer  Advanced device analysis of NetBIOS, UPnP, SNMP and Bonjour names, properties and device types  Includes port scanning, device ping, traceroute and DNS lookup  Receive network security and device alerts to your phone and email  Add Fingbox to unlock advanced network protection and smart home troubleshooting features:  Know whos home while youre not there with Digital Presence  See devices near your home with Digital Fence  Block intruders and unknown devices automatically before they join your network  Set parental control features to schedule screen time and pause internet access  Analyze bandwidth usage by device  Find Wi-Fi sweet spots  Automate network speed tests and get reports for benchmarking ISP performance  Secure your home network with opened port detection and network vulnerability analysis  Have a question? Get in touch at support@fing.com or learn more about Fing App and Fingbox at fing.com. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.READ_CALL_LOG', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}