{
"name" : "MyHoard",
"url" : "https://play.google.com/store/apps/details?id=com.privatesecuredata.psdmyhoard",
"package" : "com.privatesecuredata.psdmyhoard",
"category" : "Tools",
"description" : "Preppers will love this App! This is the ultimate tool for managing all of your supplies. Track your inventory with joy!  But No matter if you are a prepper waiting for a really big event like the apocalypse or not, if you want to have an overview about your personal food supplies in the kitchen or if you want to organize your bug out bag (BOB organizer) -- MyHoard is the right app for you!  By providing convenient templates for all sorts of supplies this app minimizes the amount of characters you have to type. MyHoard provides three basic categories : food, beverages and non-food for organizing your inventory.  By an intelligent system of arbitrarily nestable containers you can manage your supplies the way you want to! This way, organizing your stash becomes fun!  Features: - Supports the US and the metric measurement-system  - Give a warning when items expire as a reminder to rotate stock - Shopping-List - Easily add all expired items - Add missing items (Difference between stock and quota) - Put all bought items back in a container - Manage arbitrarily nestable containers and items - Check for how many days your hoard will last - A lot of predefined food- and beverage-types with nutritional values - Predefined templates for non-food-items (eg. rope, knife, ...) - Define your own item types (food, beverage and non-food)  You can test the free version as long as you want. The only restraint of the free version is the amount of different types of foods you can manage. This version is limited to 15 different item types.  If you like the app you can easily upgrade to the full version which has no limitations via an in app purchase! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}