{
"name" : "Sideloader for Fire TV - sideload apps to fire tv",
"url" : "https://play.google.com/store/apps/details?id=com.smartapp.sideloaderforfiretv",
"package" : "com.smartapp.sideloaderforfiretv",
"category" : "Tools",
"description" : "Want to add more apps to your Amazon Fire TV or Stick but apps on Amazon Store is limited and you cant find an easy way to do it? Sideloader for Fire TV app is here to do it!  With Sideloader for Fire TV app, you can install any apps that you want to Amazon Fire TV or Stick, launch and manage them right from your phone or tablet.  Features:  Install apps (currently installed apps or .APK files) from your phone or tablet to fire tv or stick.  Launch and manage(force stop, uninstall, clear data) the sideloaded apps from your phone or tablet.  Take fire tv screenshots and automatically pull it to your phone, enjoying or sharing it with your friends at anytime anywhere.  Other features are now developing: + Transfer files between your phone or tablet and fire tv or fire stick. + Suggest functions from you are welcomed, just send an email to me[smartuxapp@gmail.com], I will try to do it for you!   Install Sideloader for Fire TV and start sideloading apps to your Amazon fire tv or stick NOW!   Requirements:  Android Debug Bridge(ADB) library is available in your phone or tablet, read the notes below for more detail.  ADB Debugging option in your amazon fire tv or stick is enable: go to Settings > System > Developer Options and make sure both ADB Debugging and Apps from Unknown Sources options are turn ON.  Phone/tablet and fire tv/stick use the same network(phone/tablet: Settings > Wifi, fire tv/stick: Settings > System > About > Network).  Notes:  Sideloader for Fire TV app is working based on Android Debug Bridge(ADB) - a built-in android library available in the most Android devices, which helps android phone or tablet and amazon fire tv or stick connect together. So in the first time you open the app, it will check ADB version in your phone or tablet. If your phone or tablet is missing ADB (Android has removed it on some versions), you cant use this app. Thank you for understanding!  You can use this app to sideload apps to Android TV also.  Disclaimer: This app is NOT affiliated with or endorsed by Amazon.  If Sideloader for Fire TV app is helpful for you, please share it with . Please help me improve this app by giving feedback in the comment box, I will make it better. If you need support, please email me via smartuxapp@gmail.com.  Thank you for using Sideloader for Fire TV or stick app. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.smartapp.sideloaderforfiretv.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}