{
"name" : "JTL-POS | Die Kasse mit System",
"url" : "https://play.google.com/store/apps/details?id=com.jtl.pos",
"package" : "com.jtl.pos",
"category" : "Tools",
"description" : "Ein Kassensystem mit Zukunft Sie suchen eine sichere, leicht bedienbare und performante Kassen-App fr Ihren Einzelhandel? Eine Kassensoftware, die auch hinsichtlich der Kassensicherungsverordnung und TSE-Aufrstung alle Anforderungen erfllt?   JTL-POS bietet genau das: Eine leistungsstarke, mobil nutzbare und flexible Kassenlsung, mit der Sie sofort starten knnen  vollkommen kostenfrei! Die Vorzge unserer Kassensoftware erleben Sie unmittelbar, etwa durch Einbindung Ihres Zahlungsanbieters ber die O.P.I.-Schnittstelle oder durch die Erweiterung mit passender Kassen-Hardware! Auch die zertifizierten TSE-Lsungen von EPSON sind mit JTL-POS getestet und bei uns im JTL-Store erhltlich. berzeugen Sie sich!   Darber hinaus bietet JTL-POS eine Schnittstelle zu unserer  ebenfalls kostenfreien  Warenwirtschaft. Wir nennen diesen Nutzungsmodus ERPConnected. Damit erschlieen Sie sich nicht nur Mglichkeiten eines Multikassen- und Filialbetriebs, sondern haben viele Optionen, Ihren Einzelhandel zu professionalisieren und in Richtung Omnichannel & E-Commerce auszubauen. Und auch hier: Die erste Kasse mit JTL-POS ERPConnected ist kostenfrei! Schon berzeugt?   JTL-POS ist sicher Regelmige Updates garantieren eine technisch einwandfreie und rechtsgltige Kassensoftware. Die Anforderungen der KassenSichV erfllt JTL-POS vollstndig  zertifizierte TSE-Module fr JTL-POS erhalten Sie bei uns im JTL-Store.    Aufrstbar mit zertifizierter Technischer Sicherheitseinrichtung  Detaillierte Protokollierung, Datenausgabe & Exportfunktionen  Umfassende Benutzer- und Rechteverwaltung mit Auto-Logout  JTL-POS ist vielseitig Unser Kassensystem eignet sich fr viele Branchen und Berufsgruppen. Ganz gleich, ob Sie Waren oder Dienstleistungen handeln, ob Sie stationr oder mobil unterwegs sind: JTL-POS ist eine Kassensoftware, die Sie schon bei der Einrichtung exakt auf Ihre Kufergruppe zuschneiden.   Umfangreiche Artikelverwaltung mit Varianten, Konfigurationen, Stcklisten etc.  Unterschiedliche Rabatttypen & Zahlungsarten  Komfortables Bon-Journal sowie einfacher Bon- und Zahlungssplit  JTL-POS ist erweiterbar Erweitern Sie JTL-POS mit Scannern, Kassenladen, Bondruckern und Zahlungsterminals von zertifizierten Hardware- und Payment-Partnern (Individuelle Einbindung auch ber OPI-Schnittstelle). Nutzen Sie die Companion-App JTL-POS CustomerDisplay fr Ihre Kunden oder richten Sie bei Bedarf einen Multikassen-Betrieb ber mehrere Filialen ein.   Anbindung EPOS-fhiger Bondrucker via USB, LAN, WLAN, Bluetooth oder internen Gerten mit frei gestaltbaren Druckvorlagen  Zahlungsterminals: Automatische Betragsbergabe & Kartentyp-Erkennung, bspw. ber Sumup oder FirstCashSolution.   Einbindung beliebig weiterer Zahlungsanbieter ber die kostenfreie OPI-Schnittstelle  JTL-POS ist E-Commerce ready! Verbinden Sie JTL-POS optional mit unserer kostenlosen Warenwirtschaft JTL-Wawi (ab Version 1.5.14.3). Mit der ERP-Connected-Version knnen Sie Ihr gesamtes Sortiment oder ausgewhlte Artikel fortan bei Amazon & eBay oder im eigenen Onlineshop vertreiben. Unsere Kassensoftware ebnet Ihnen den Weg vom stationren Einzelhandel zum erfolgreichen Omnichannel-Handel.    Kostenfreie erste Kasse im ERPConnected-Modus von JTL-POS  Nutzen Sie die Synergien von Offline- und Onlinehandel  Schaffen Sie sich zukunftssichere Standbeine im E-Commerce  Setzen Sie jetzt mit dem Kassensystem JTL-POS auf Software & Support: Made in Germany!   JTL-POS | Mindestanforderungen: Betriebssystem: Android 5.0 Prozessor: 1,2 GHz; Quad-Core Arbeitsspeicher: 2 GB Interner Speicherplatz: 0,5 MB je Artikel (64.000 Artikel = 32 GB)  Weitere Infos & Hilfen zur Kassensoftware JTL-POS: https://www.jtl-pos.com  Whitepaper & Anforderungen fr Einzelhndler gem KassenSichV: https://www.jtl-pos.com/kassensicherungsverordnung/  Weitere E-Commerce-Lsungen von JTL-Software: https://www.jtl-software.de A POS system with a future  Are you looking for a secure, easy-to-use and high-performance checkout app for your retail business? Cash register software that also fulfills all requirements with regard to the cash register security regulation and TSE upgrade?  JTL-POS offers exactly that: A powerful, mobile and flexible checkout solution with which you can start immediately - completely free of charge! You can experience the advantages of our cash register software immediately, for example by integrating your payment provider via the O.P.I. interface or by expanding it with suitable cash register hardware! The certified TSE solutions from EPSON have also been tested with JTL-POS and are available from us in the JTL store. Convince yourself!  In addition, JTL-POS offers an interface to our - also free - merchandise management. We call this usage mode ERPConnected. This not only opens up opportunities for multi-checkout and branch operations, but also gives you many options for professionalizing your retail business and expanding it in the direction of omnichannel & e-commerce. And here too: the first cash register with JTL-POS ERPConnected is free of charge! Are you already convinced?  JTL-POS is secure  Regular updates guarantee technically perfect and legally valid POS software. JTL-POS fully meets the requirements of the KassenSichV - certified TSE modules for JTL-POS are available from us in the JTL store.   Can be upgraded with a certified technical safety device  Detailed logging, data output & export functions  Comprehensive user and rights management with auto-logout  JTL-POS is versatile  Our POS system is suitable for many industries and professional groups. Regardless of whether you trade goods or services, whether you are stationary or mobile: JTL-POS is cash register software that you can tailor exactly to your group of buyers right from the start.   Extensive article management with variants, configurations, parts lists etc.  Different discount types & payment methods  Convenient receipt journal and simple receipt and payment split  JTL-POS is expandable  Expand JTL-POS with scanners, cash drawers, receipt printers and payment terminals from certified hardware and payment partners (individual integration also via OPI interface). Use the companion app JTL-POS CustomerDisplay for your customers or set up a multi-checkout operation over several branches if necessary.   Connection of EPOS-capable receipt printers via USB, LAN, WLAN, Bluetooth or internal devices with freely configurable print templates  Payment terminals: Automatic amount transfer & card type recognition, e.g. via Sumup or FirstCashSolution.  Integration of any other payment provider via the free OPI interface  JTL-POS is e-commerce ready!  Connect JTL-POS with our free merchandise management system JTL-Wawi (from version 1.5.14.3). With the ERP-Connected version you can now sell your entire range or selected items on Amazon & eBay or in your own online shop. Our POS software paves the way for you from stationary retail to successful omnichannel retail.   Free first cash register in ERPConnected mode from JTL-POS  Use the synergies of offline and online trading  Create future-proof pillars in e-commerce  Rely on Software & Support with the JTL-POS POS system: Made in Germany!  JTL-POS | Minimum requirements:  Operating system: Android 5.0 Processor: 1.2 GHz; Quad core RAM: 2 GB Internal storage space: 0.5 MB per article (64,000 articles = 32 GB)  Further information & help on the POS software JTL-POS:  https://www.jtl-pos.com  White paper & requirements for retailers according to KassenSichV:  https://www.jtl-pos.com/kassensicherungsverordnung/  More e-commerce solutions from JTL-Software:  https://www.jtl-software.de ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.USB_PERMISSION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.NFC', 'android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.NFC', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USB_PERMISSION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}