{
"name" : "Simple Draw - App for your quick & easy sketches",
"url" : "https://play.google.com/store/apps/details?id=com.simplemobiletools.draw",
"package" : "com.simplemobiletools.draw",
"category" : "Tools",
"description" : "Want to draw something creative but you have no paper? This app will suit you perfectly. Just pick a color and draw, it is as easy as that. You can either save the drawing in a file or share it directly through email or social networks so that your friends can have some fun with it too.  This hugely popular app for quick sketches provides many useful functions like Undo/Redo, changing the background color, or using an image as the background. You can optionally make the app prevent the device from falling asleep too. You can also change the brush size, or use an eraser, if you messed something up. It supports inserting colors either by selecting it on a huge palette, or by entering the colors hex code. It has a modern look based on material design.  The app supports many different formats like PNG, JPG or SVG vectors.  You can either draw something new from scratch, or open some file and just play around with it. It is perfectly usable either by you, or by a family with children to play some games. Afterall, everyone has a piece of artist in himself.  You will not find any fancy or advanced tools, brushes, fonts, filters here, it is supposed to be used to have some fun with.  Contains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.  Check out the full suite of Simple Tools here: https://www.simplemobiletools.com  Facebook: https://www.facebook.com/simplemobiletools  Reddit: https://www.reddit.com/r/SimpleMobileTools  DEPRECATED: This version of the app is no longer maintained, get the Pro version at https://play.google.com/store/apps/details?id=com.simplemobiletools.draw.pro . Dont forget that if you uninstall any paid app within 2 hours, you will automatically be refunded. If you want a refund anytime later, just contact us at hello@simplemobiletools.com and you will get it. That makes it easy to try it out :) ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}