{
"name" : "Trimble Catalyst Service",
"url" : "https://play.google.com/store/apps/details?id=com.trimble.bluebottle",
"package" : "com.trimble.bluebottle",
"category" : "Tools",
"description" : "RTK GNSS, using the phone in your pocket...  Turn your phone into a centimeter-accurate positioning system, without the need for a bulky RTK GNSS receiver.  Professional quality. On demand convenience.  Catalyst provides you with scalable, accuracy-base pricing options ranging from 1 cm to 100 cm, and you can subscribe for as little as one month at a time.  Map, Navigate, or Measure anything  Trimble Catalyst can be shared to Android to override your phones on-board GPS receiver, so no matter your workflow your favourite apps can use high quality Catalyst GNSS positions, right out of the box.  Online. Offline. Worldwide  Wherever you work, online or offline, Trimble Catalysts bundled settings free GNSS corrections service - known as the Trimble Corrections Hub - is available almost worldwide, via internet or satellite. In areas where Trimble Correction Services cant reach, you can configure and use your own local corrections source.  Precision results, simple workflows  Leave the complexity of traditional RTK GNSS behind you, and embrace the simplicity of plug-and-play GNSS for precision on-the-go.   Note:This app is for use with the Trimble Catalyst GNSS receiver, and requires a compatible Catalyst antenna. To use Trimble Catalyst you will need a Trimble Catalyst enabled app, or the Trimble Mobile Manager app on your phone.  To purchase a Trimble Catalyst antenna, contact your local Trimble Geospatial distributor. For help or further information about Trimble Catalyst, and to find your nearest stockist visit https://catalyst.trimble.com/  License agreement  Refer to Trimbles EULA for Terms of Service for Trimble Catalyst. https://catalyst.trimble.com/legal/EULA.html ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW']",
}