{
"name" : "Blue Diamond KK Emoji Keyboard",
"url" : "https://play.google.com/store/apps/details?id=com.kkkeyboard.emoji.keyboard.theme.DiamondBlue",
"package" : "com.kkkeyboard.emoji.keyboard.theme.DiamondBlue",
"category" : "Tools",
"description" : "Blue Diamond Emoji Keyboard Theme for Emoji,Emoticons,Stickers,Symbols,and Keyboard.  Whoever wanna a Neon Dream Emoji Keyboard Theme, please try out this Neon Emoji Keyboard Theme specially designed for Neon. Make your phone pop among your friends by grabbing this Neon Dream Emoji Keyboard Theme.   Notice To use this Neon Dream Emoji Keyboard theme for free, please download Cute Emoji Keyboard from Emoji Keyboard -Cute,Emoticons first.  Emoji Keyboard is a free, smart and colorful Emoji Keyboard for Android that help you to fast input over 3000 emoji, emoticons, smiley, sticker and text face conveniently everywhere including message, text, email and chat with social app etc. Its the best Emoji Keyboard for Android with over 100 beautiful themes, smart gesture type and auto correct, highly customization with color, layout, font and over 55 languages support.  Highlights of Emoji Keyboard   OVER 3000 EMOJI & EMOTICONS - Fast input emoji in message,text,email,note and chat with social apps - Smart emoji prediction to match emoji for your words - Text face including (   ), ()   FAST & SMART INPUT - Top row number input - Gesture Typing with dynamic floating preview - Auto correct and smart next word suggestion - Over 30 dictionaries for different languages   BEAUTIFUL THEMES - Over 100 beautiful themes - Continue to increase   HIGHLY CUSTOMIZATION - Resize and split layout as you wish - Customizable key press sound - Customizable keyboard color, font and wallpaper    OTHER ADVANCED FEATURES - Copy,cut,paste and arrow key - Clipboard for fast copy and paste   To use Emoji Keyboard with Skin Keyboard. - Your Emoji Keyboard need to be updated to version 2.0 or later  Join our Facebook: https://www.facebook.com/kkemojikeyboard Follow us on Twitter: https://twitter.com/kkemojikeyboard For more information, please refer to our FAQ:https://emojikeyboard.uservoice.com  Want to help in our localization efforts and please contact with kkemojiandroid@gmail.com. Thanks!  Please try out this Blue Diamond Emoji Keyboard Theme specially designed for Diamond lovers. Enjoy funny typing with Blue Diamond Emoji Keyboard Theme. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}