{
"name" : "Flashlight",
"url" : "https://play.google.com/store/apps/details?id=com.ruddyrooster.android.megaflashlight",
"package" : "com.ruddyrooster.android.megaflashlight",
"category" : "Tools",
"description" : "The Great Flashlight Kit for your smartphone.  Its time to change to the best Flashlight. Do you know why? Because the collecting of your personal information from the other flashlight apps is too high.  **  Some information to all review writers about the hardware controls and network permission:  1. Not working with some Galaxy Ace and some tablet models. If the app does not work, then please dont write a bad review or give a bad star. Please send us an email to the email address given below.  Customer feedback to improve the quality of our service.  2. Network permission is only for third party advertisements. Thats the reason, why our App is Free.  3. The Permission Hardware controls. We need the camera permission to open / close the LED Flash. Please, when somebody wants to write a review about that a flashlight app doesnt needs a camera permission, then please research first. Please search for some android flashlight examples on the Internet and you will see that all the flashlight apps are using the camera permission. Its called camera, because the LED Flash is linked with the camera. And if you still do not believe us, just ask the Android developers.  Thank You!  **  * Light sources: Screen, Morse Code, Strobe, Police, Warning light * Battery Status * Switch Button: Use it, if...  - LED Flash on your device does not work. - LED Flash not supported on your device. - you want to show Morse Code or Strobe Light on your phones screen.  Just try it!  Its FREE.  CAUTION: A very small percentage of individuals may experience epileptic seizures when exposed to certain light patterns or flashing lights. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}