{
"name" : "GO Field Guide for Pokemon GO (Events, Raids)",
"url" : "https://play.google.com/store/apps/details?id=com.gofieldguide",
"package" : "com.gofieldguide",
"category" : "Tools",
"description" : "GO Field Guide is a perfect tool to enhance your Pokemon GO Experience!  GO Field Guide tool is made to assist you in playing Pokemon GO, It has up-to-date information for all Events along with local time, Raid Guides, Research task and rewards, Egg Hatch list, Checklist and much more...  ---------------------------  Features:  - Event Countdown Timer with Local event - Complete Pokedex along with Search by Type and Evolution Family - Add Event to the calendar - Push Notification Reminders - Checklist - Raid Boss List and Counters - Shadow Counters and Grunts Lineup - Egg Hatch List - Research Encounters - Special Research Tasks and Rewards - Special Evolutions lists - Buddy Distance List - Trainers Code - Type Effectiveness - Regional List - Search String Builder  All of these in a compact size app of just less 20MB! ---------------------------  Countdown Timer: Go Events tend to end without much fanfare. Whether its Community Day, the GO Fest or the soon-to-be-over Legendary Events, it can be easy to forget when these special events come to a close. If you just want to see how many hours are left before the event ends and event end time in our local time, the GO Field Guide may suffice  as long as you dont mind popping open an App. Dont worry even if you forget we send Push notifications for important events!  Dex: Complete Dex with complete details about the Pokemon along with Gym, PvP Movesets and CP Range for all levels.   This does not stop here, you can even search Pokemon by Type, Moves, Weather Boost and much more.  Add Event to calendar: With this feature, you can easily add the event details along with event start and end time to your calendar with just one tap!  Checklists: Mark all your little achievements, GO Field Guide provides you with different Checklists to mark and share it with friends (especially for trading) From Regional Checklist to Lucky Checklist.  Raid Boss Guide: Up to date list of current Raid Bosses along with all the information for the best counters, perfect IV, weather boost, type effectiveness and Raid Advice  Shadow and Rocket Leaders Guide: Up to date list of Shadow Pokemon and Rocket Leaders lineup along with best counters to stop them.  Field Research Task Rewards: Complete list of all research encounters, along with CP range, shiny chance. It also has a search feature so you can directly search for the reward of the required task ;)  Special Research Tasks and Rewards: Complete list of Special Research Tasks and Rewards.  Egg Hatch: Check the up-to-date list of the Pokmon you can get by hatching an egg, you can also filter by 2 Km, 5 Km, 7 Km or 10 Km.   Special Evolutions: Want to find out which Pokemon evolves by which stone or lure module? GO Field Guide lists all the different Special Evolutions  Trainers Code: Trainer Code section lists all the active trainers with which you can become friend, send and receive gifts daily. if youre active you can even get your trainer code listed!  Type Effectiveness: Get the type effect information such as Super Effective, Weak to, not effective against!  Regional List: List of all the Regionals and where can they be obtained  ----------------------------  The different icons, sprites, wallpapers, information used in the app are taken from different open sources.  Icons Credit - Roundicons Freebies (Flaticons) Wallpapers - Pokewalls, wallpapercave Raid Counters Data - PokeBattler Egg Hatch List Data - TheSilphRoad  If you find any error or have anything to say. Let us know: randomwreck2016@gmail.com  DISCLAIMER: GO Field Guide is a third-party app made by fans and players of Pokemon GO and is not affiliated with the Pokemon brand, Niantic, Pokemon Go, or Nintendo.  Privacy Policy - https://sites.google.com/view/poketimer/home ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_CALENDAR', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.INTERNET', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.ACCESS_NETWORK_STATE', 'com.sec.android.provider.badge.permission.WRITE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.READ_APP_BADGE', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.READ_SETTINGS', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.READ_CALENDAR', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.WRITE_CALENDAR', 'com.android.vending.BILLING', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.ACCESS_COARSE_LOCATION', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'com.gofieldguide.permission.C2D_MESSAGE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}