{
"name" : "TOTP Authenticator – 2FA with Cloud Sync & Widgets",
"url" : "https://play.google.com/store/apps/details?id=com.authenticator.authservice2",
"package" : "com.authenticator.authservice2",
"category" : "Tools",
"description" : "TOTP Authenticator allows you to quickly and easily protect your accounts by adding 2-factor authentication (2FA). The app brings together best in class security practices and seamless user experience together.  This app generates one-time tokens on your device which are used in combination with your password. This helps to protect your accounts from hackers, making your security bulletproof. Just enable the two-factor authentication in your account settings for your provider, scan the QR code provided and youre good to go!  Cloud Sync (Premium) Never lose your codes again! With Cloud Sync, you can easily backup your 2FA accounts to your own Google Drive. This keeps you in total control of your data while providing effective cloud backup. Using the Cloud History feature, you can easily restore recently changed data with ease.  Browser Extension (Premium) 2FA on the desktop is now easier than ever before! With a single tap, push your 2FA codes to your desktop browser. No need to manually type in the codes again.  Dark theme  Do you love the dark mode? We sure do! Easily change between the light and dark mode in the app and widget. More power to you.  Organise via Labels With the inbuilt labels, you can easily group and manage a large number of accounts. The inbuilt search feature helps to find any account in seconds.  Multi-platform support TOTP Authenticator syncs seamlessly across Android and iOS platforms. You can export your data from one platform, and simply import it on the other.  Multi-device usage This 2FA app empowers you to create both cloud backups (via Cloud Sync) and offline backups. You can then import these encrypted backups in any device running TOTP Authenticator. This is highly useful in cases where you use 2 devices or need to switch your phone.  Extensive Account Support TOTP Authenticator works with the majority of the services offering 6-digit code based 2FA. If some service does not work for you, please contact our support.  Multiple language support Experience the app in a more intuitive way by using it in your language. The app comes with the support of 7 popular supported languages. Dont see your language in the app? Reach out.  Multiple widgets With TOTP Authenticator, you can easily add multiple widgets for your favourite accounts on the home screen for quick access. These widgets come in multiple layouts, so you can choose whichever suits you the best.  Personalization The app allows you to set unique icons to your accounts, either by selecting icons from the provided list or by uploading them. This helps you to easily recognize and sort your accounts.  Biometric security Protect your accounts by using biometrics (Fingerprint, face scan) or a 4-digit PIN. This helps protect your codes from prying eyes or in case someone gets access to your phone. You can also block screen capture via screenshots and other methods.  For any questions or suggestions, reach us at info@binaryboot.com ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.USE_BIOMETRIC', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.USE_FINGERPRINT', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FLASHLIGHT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}