{
"name" : "Lock screen OS12",
"url" : "https://play.google.com/store/apps/details?id=com.greensoftvn.lockios",
"package" : "com.greensoftvn.lockios",
"category" : "Tools",
"description" : "Lock Screen I.O.S 12 style - Lock screen by password Notification Panel - manage yours notifications easy like on Phone!  Lock screen OS12 lock screen like IOS operation system Multiple HD Wallpaper, Theme OS 12, Theme phone X  This app have two type lock: - lock screen with style XOS (OS 11, OS 12) - lock screen with style OS 8 (old OS) Experience the latest OS right on your phone with Lock Screen OS .   *** Features: - Notification, Show all notifications on lock screen - Control Center, Quick launch some applications on lock screen - Music Control - Slide to unlock - Have turn on or turn off bluetooth on lock screen - Quick launch camera from lockscreen - Swipe to unlock screen/ slide to unlock/ Night Shift - Theme X and 8 - Displaying missed calls and unread messages - Unlock sound enable/disable - Unlock vibration enable/disable - Quick setting wifi from lock sreen - Change sound setting from lock screen - Setting rotate screen on lock screen - Support setting wallpaper from gallery and camera - Set PIN to enhance screen lock security, block HOME/MENU/BACK key,no one can access your phone without correct password. - Change background of lock screen with many beautiful wallpapers - Support camera from LockScreen - High security, prevent accessing your phone without password - Support 12-Hour and 24-Hour format - Support set pin passcode and password for keypad lock security - A lot of beautiful wallpapers to choose - DIY Animated Slide Text (default is > Slide to unlock) - Show unread sms and missed call counter on screen locker. - Show state of mobile as network, wifi, battery .. - Multiple wallpaper to choose, you can choose your own wallpaper from gallery too. - Set passcode to enhance screen lock security, disable HOME/MENU/BACK key,no one can access your phone without correct password. - Simulate iOS keyboard password. - Change text slide to unlock . - Change color of date/time. - Super cool I.O. S 11 lock screens for your android - Works on most of the android phones - Fully customizable lock screen - Password protection facility available - A lot of screens to select from - You can set your personalized image or photo from gallery - Small size application - Consume less memory and battery, simple and clean design.    When you open the application there you will see a few settings which will allow you to customize the locker of your android phone. Very easy user interface will help you to customize the application.   Also once you activate the I.O.S X lock screen style, you will have access to control center on the top of screen. You can control a lot of things here, like flashlight, Wi-Fi and Bluetooth, settings, brightness and a lot more.    For further more customization you can select various notifications style, fonts, time format, wallpaper and a lot more to make your android unlock screen look smarter and cool like the Phone X lock screen!  Download the best Phone X Lock Screen style application for android and make your device look state-of-the-art. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.vibrate', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.SET_ALARM', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FLASHLIGHT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MEDIA_CONTENT_CONTROL', 'android.permission.BIND_NOTIFICATION_LISTENER_SERVICE', 'android.permission.CAMERA', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_PHONE_STATE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SET_WALLPAPER', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.BIND_NOTIFICATION_LISTENER_SERVICE', 'android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SET_ALARM', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MEDIA_CONTENT_CONTROL']",
}