{
"name" : "Game Booster 4x Faster Free - GFX Tool Bug Lag Fix",
"url" : "https://play.google.com/store/apps/details?id=com.g19mobile.gamebooster",
"package" : "com.g19mobile.gamebooster",
"category" : "Tools",
"description" : "   Best Game Booster & GFX Tool on Google Play Store      Features of this app:  Boost your devices performance with just one touch.  The Most Advanced Game Booster for optimising gaming experience.  Auto Gaming Mode   Game Turbo  RAM-Free Tweak will be applied  Use AI to optimize your game  HDR picture quality and special effects in gaming  Making the overall experience rich and fluid  Boosts the device for benchmarks and heavy gaming  System Performance Tuner:Monitors the system performance, check for system stability and fixes various issue   GFX Tool  1080 Resolution: Change the resolution of the game.  HDR Game Graphic: Unlock the HDR graphics on low end devices.  Extreme FPS: Unlock the Extreme FPS level.  Style: Change graphics style setting.   HUD Monitor  Storage Load  Network Latency   Zero Lag Mode  Optimized game configuration with Performance.  Hardware-Accelerated Rendering: Enable support for VULKAN and OPENGL 3.1+.  Graphics Rendering Level: Enhance the quality of graphics.  GPU Optimization: Custom OpenGL shaders.   Other Features  Gaming Settings: System wide settings.  Quick Boost: Boost you game.  Quick Launch: Quickly launch your game.   SPECIAL:  Get the maximum fps with this app No heating for all devices !  No heating for 801 snapdragon !  No heating for 820 snapdragon !  No heating for 821 snapdragon !  Reduce the CPU load !  YOUR ACCOUNT IS 100% SAFE using this APP!  100% Guaranty nothing bad will happen you CAN USE THIS APP FREELY   TIPS: 1. If you changed ANYTHING in the in-game graphics settings, please close the game and re-apply your setting from this app before playing. 2. Make sure to allow Storage permission or else the app would fail to do its work.  This app is developed for specific game and we are not affiliated with Tencent.  Permission : Storage (Photos/Media files) for modifying graphics settings. Permission : Internet for loading settings from our server. Permission : Kill background app for boosting memory.  Customize your game, play like a pro.  Let the app help you play games faster and smoother!  Please rate us 5  to promote us application development. Thanks For Used this app. ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}