{
"name" : "Pupa VPN - Free Hotspot VPN& Fast & Security Proxy",
"url" : "https://play.google.com/store/apps/details?id=com.pupa.connect",
"package" : "com.pupa.connect",
"category" : "Tools",
"description" : "Pupa VPN is a better net Proxy. No Registration PupaVPN. 100% free and unlimited VPN (Virtual Private Network) proxy for Android devices. Pupa VPN masks your IP address, encrypt your internet traffic, turns public Wi-Fi into a private network and helps unblock sites and apps on your Android phone so that you can access any restricted connect safely and anonymously. Our servers use and improve the mix of shadowsocks, V2ray, and shadowsocksR to ensure high availability and anonymity of VPN services.  Install Pupa VPN Now to:   Unblock Websites and Apps  You can unblock any apps or websites using Pupa VPN free & unlimited VPN. Bypass government censorship and geo-restrictions to access social networks such as Facebook, Twitter, Youtube, and Snapchat, etc. or any other blocked websites from anywhere!   Anonymous Connection and Privacy Protection  Using a VPN, your IP and location will be masked and your activities can no longer be tracked on the Internet. Pupa VPN service is your privacy guard and better than web proxy servers.   Secure Your Device  Pupa VPN secures your Android devices connection while youre connected to public WiFi hotspots or cellular data networks. It works just like a free Tor proxy (the Onion Router) but its even more secured. Your password and your personal data are secured and you are protected from hacker attacks.   Surf anonymously at Fast Speed  PupaVPN is fast! It detects your location automatically and connects you to the nearest and fastest server. As a result, your connection will be much faster than any other VPN or proxy providers.   Shield WiFi Hotspot  Public Wi-Fi hotspots are perfect places for hackers and if they happen to get a hold of your personal information, you could very well be the next victim of identity theft! Pupa VPN proxy uses advanced VPN technology to encrypt your network traffic, enabling you to connect to a website via HTTPS, providing a secured shield to your WiFi hotspot.   Most Stable We will limit the number of users to ensure that most of them are available within our capabilities.   Fastest  Connect successfully as a hare with high VPN speed. Multi-room and Multi-line Networking    Security Protect your network traffic under WiFi hotspot Browse anonymously and securely without being tracked. Enjoy private browsing.Encrypts data.   Private Your privacy is our mission. Connect to any of our reliable VPN servers, and know that we do not keep any logs of your activity.   Easiest  One tap to connect to VPN proxy server.  Support Android Widgets & Shortcuts & Tile Service   Three main features of a VPN (Virtual Private Network):   Incognito Browsing: using a VPN you dont even have to install any incognito browser. Simply turn on your VPN and all of your Internet traffic is completely encrypted. Your online activities are completely anonymous.   Wifi Safety: because all your online traffic is encrypted through a VPN, whatever public WiFi hotspot you are trying to access, you will be shielded from public Wifi risks and enjoy complete Wifi security.   Location Spoofer: VPN hides your IP address so that your location is masked and you are able to bypass geo-restrictions to access any content anywhere. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_SIP', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.USE_SIP', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}