{
"name" : "VPN Lite Without Registration",
"url" : "https://play.google.com/store/apps/details?id=com.keepsolid.vpnlite",
"package" : "com.keepsolid.vpnlite",
"category" : "Tools",
"description" : "KeepSolid VPN Lite is the best VPN friend to anyone in need of private browsing and secure internet access. This free VPN for Android was designed to address users most common pains and to offer a simple and intuitive interface.  KeepSolid VPN Lite offers unmatched benefits     Free   No registration  No ads  No credit card (Free mode)  Intuitive, one-tap interface  Turbo fast performance  24/7 client support  No-log policy  Dark mode    PERSONAL DATA SECURITY Protect your sensitive information with KeepSolid VPN Lite. It applies AES-128 encryption protocol that even the US Government deemed reliable enough to secure its classified information. Sounds good enough for your credentials, doesnt it? ;)    PRIVATE INTERNET ACCESS To hide your real IP address, KeepSolid VPN Lite obscures it with a VPN proxy servers IP. This allows you to go online anonymously and protected from ISP tracking, spyware, and any unwanted third-partys attention.    BORDERLESS ACCESS TO ANY WEBSITES AND SERVICES KeepSolid VPN Lite effaces online boundaries! At work, at home, or abroad - your favorite apps and sites, social media, YouTube and the like, are always there for you, offering the best content.    FREE, FAST, AND SIMPLE Free and quick download, no ads, simple interface, smooth and seamless performance - whats not to like about KeepSolids VPN for Android users? :)    TURBO MODE By enabling Turbo mode, users get access to over 400 VPN servers in over 70+ locations all over the world, a superb KeepSolid Wise VPN protocol, and an even more secure AES-256 encryption.   In-app KeepSolid VPN Lite Turbo purchases:  Free 7 day trial  After that, you can purchase either a Monthly or a Yearly subscription  Subscriptions will auto-renew unless canceled Subscriptions may be managed and auto-renewal may be turned off in the Account Settings No cancellation of the active subscription is allowed Subscriptions automatically renew unless this option is turned off at least 24-hours before the end of the current period The account is charged for renewal for the amount of the current subscription within 24-hours prior to the end of the current period  Legal information: https://www.keepsolid.com/eua https://www.keepsolid.com/privacy-policy https://vpnlite.net/data-usage-regulations   Please contact us at support@keepsolid.com if you have any feedback or suggestions! ",
"desc_perms" : "['android.permission.INTERNET', 'android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}