{
"name" : "AVL Pro Antivirus & Security",
"url" : "https://play.google.com/store/apps/details?id=com.antiy.avlpro",
"package" : "com.antiy.avlpro",
"category" : "Tools",
"description" : "What is our vision?  Mobile Security has been on the hot list for quite a while and there comes different kinds of mobile security tools. In the last 2 years, AVL Team did only 2 things, one is developing a worlds top local anti-virus engine for mobile and the other is bearing with so many kinds of boring and unprofessional so-called mobile security apps. Then, AVL Pro comes, in which we are trying to concentrate on the App Security and System Security. AVL Pro is willing to provide you a new level of mobile security experience.  What is AVL Pro?  AVL Pro means it will protect you and promote your mobile security. Last but not the least, it will make you a Pro of your own mobile security.  AVL Pro is unlike any other mobile security tools, it is a heavily armed security framework based on the AVL engine. It acts like a radar with microscope which gives you an insight of the security details and tries to help you become an expert of your own. You can use it to identify the security threats among your looks-good apps, and also you can act like a mobile malware analyst to catch the bad guys.  What AVL Pro brings you?  APP Identification Identify apps and classify threats into different levels, including Malicious and Risky. Malicious means trojan apps, rogue apps and Risky means hack-tools, suspicious ad-ware sdk, etc. APP Analyzer Analysis the insight of an app, which explore the APK package , disassemble the DEX binary, and analysis the Opcode data. And then provide you comprehensive information of each app, such as certification, installing info, package files, activity, may-used URL, may-used SMS numbers and so on. Plug-in system Plug-in architecture makes the core of the AVL Pro, which means you can assemble your own AVL Pro to satisfy personal security needs. And its open for your security ideas and e-mail us.  What AVL Team can do for you? We apologize for any bugs and inconvenience. We fight your bugs as light speed, we cherish your 5 stars and we take your 1 star as motive power.  May the force be with you and mobile security live long and prosper!  Website: www.avlsec.com E-mail: AvlPro@antiy.com google+: https://plus.google.com/u/0/111040231992087385127/posts Facebook: https://www.facebook.com/AVLTeam ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.EXPAND_STATUS_BAR', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.antiy.permission.PLUGIN_LAUNCHER', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.EXPAND_STATUS_BAR', 'android.permission.GET_ACCOUNTS', 'com.antiy.permission.PLUGIN_LAUNCHER', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_PHONE_STATE']",
}