{
"name" : "Voice Changer",
"url" : "https://play.google.com/store/apps/details?id=com.greensoftvn.voicechanger",
"package" : "com.greensoftvn.voicechanger",
"category" : "Tools",
"description" : "Voice changer is application change your voice. This application will help you can change voice that you recorded or change file music which exist in your device. You can change your voice to other funny voice, as: change to mens voice, womens voice, bees voice, babys voice, robots voice You need only go to our application and select voice or music file which you want to change, then you can listen voice after change and save voice after changed if you want. Main function: - Record your voice or someone - Save file recorder which you recorded into device - Listen audio, file recorder, music which have on device before select - Choose audio file, recorder file, music file which you want to change to other voice - Listen audio after voice changed - Save audio file after voice changed - Review audio file which you changed on application - Listen again audio file which you changed - Share audio file to your friend simply - Edit name file that saved - Select file changed or recorder file to make default ringtone of device - Cut audio if you want - Delete file quickly - Share application to your friend - It provides the following effects: Normal robot Church Fan Chipmunk Child Old man Martian Chorus Telephone Underwater Twisted tongue Duck Creepy movie Devil Big robot Small robot Alien Giant Bee Foreigner Nervous Drunk Valley Big Alien Hoarse  - Coming soon: develop feature cut file - Send feedback if you have idea to develop application more This is new application which is developed and invest during a long time. We tried very much to make good application but cant avoid users unsatisfaction. However, ours application will fantastic more if you rate star and send your feedback to us. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.CHANGE_CONFIGURATION', 'android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.CHANGE_CONFIGURATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}