{
"name" : "Duplicate Contacts Fixer and Remover",
"url" : "https://play.google.com/store/apps/details?id=com.systweak.duplicatecontactfixer",
"package" : "com.systweak.duplicatecontactfixer",
"category" : "Tools",
"description" : "Duplicate Contacts Fixer  Scan & Remove Duplicate Contacts In A Few Clicks  Want to keep your contacts library organized? Delete Duplicate entries or merge contacts to get a neat list of contacts with Duplicate Contacts Fixer in no time. Changing phones or logging in and out of Google account could add contacts multiple times, creating a mess and taking space on your Android. Organizing them manually couldnt be less than a nightmare. Also, it is not error-free. Therefore you need a duplicate contacts remover which can swiftly scan your contact list to eliminate duplicates from your phone.  With Duplicate Contacts Fixer & Remover, you can scan and delete duplicate contacts easily. It is a great tool to manage and optimize your phone address book.  This duplicate contacts remover can filter your contacts based on account types, such as Facebook, Google, Truecaller and WhatsApp. You can scan and remove duplicate contacts from each account on Android.   Duplicate Contacts Fixer & Remover comes with intelligent with advanced scanning algorithms that help you delete and merge duplicate contacts in a go. The tool comes with a lot of features to help you identify and delete identical contacts in a single tap.  The tool comprises of a lot of features that make it worth a download. Lets check out the features Of Duplicate Contacts Fixer and Remover:  The app is simple and comes with an intuitive interface.  This duplicate contacts remover is light on device resources and is battery-friendly.  Along with deleting duplicate contacts, it can eliminate similar contacts too.  It creates a backup of all your contacts before scanning.  Declutters your address book.  Can find and merge contacts with same phone numbers.  The backup folder is stored in .vcf format. You can restore them anytime if something goes wrong.    Why Choose Duplicate Contacts Fixer? With all these extensive features, you can delete duplicate contacts in your phone book. You can download the app-> Scan-> Find & delete duplicate contacts to get an organized contact list. Benefits Of Installing this Duplicate Contacts Remover:   Optimized Contacts: Eliminate duplicate contacts for organized contacts list.  All Contacts In One Place: Displays contacts from all your accounts in a single app.  Grouped Results:  Scanned Duplicates are grouped in to delete them with ease.   Backup & Restore Backup your contacts & can restore the original contacts list.   How To Clean Duplicate Contacts On Android?  Download and install Duplicate Contacts Fixer & Remover from Google Play Store.  Launch the app.  Select the account from which you want to fetch contacts from.  Click Find Duplicates button.  Once the scan is complete, the app will show all the duplicate and similar contacts in your list based on the same phone number  Tap Delete Duplicates button and get organized address book. Do rate us and share your feedback and suggestions in the comment section below. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}