{
"name" : "Best VPN Proxy – Free VPN Unlimited – VPN Master",
"url" : "https://play.google.com/store/apps/details?id=com.hala.vpn.proxy.master",
"package" : "com.hala.vpn.proxy.master",
"category" : "Tools",
"description" : "You cant access some websites or apps? You have a trip , have to use public WiFi so you worry about unprotected Wi-Fi hotspots? Want to be anonymous and protected from surveillance and hackers?   Best VPN Proxy  is the best solution for you! And it is free vpn app. Best VPN Proxy master is an unlimited, fast and free Internet privacy and security VPN app for all Android users. No matter if you are looking for security on public WiFi Hotspot or fast vpn for your Netflix show, you can get it all with Best VPN Proxy. Our app automatically turns public WiFi into safe and secure private WiFi. Your mobile security, privacy and personal information will be protected from hackers, identity theft, and other malicious activities when we detect a public WiFi network. Highlights feature of Vpn master:  This app is free vpn app. No credit card information needed. No trials offered. Vpn free app  Truly unlimited vpn master. No session, speed or bandwidth limitations.   Unblock your favorite websites and apps worldwide free vpn proxy any time with just one touch of the Connect button.   When connecting to a VPN server through Best VPN Proxy for example - it sets up a secured and encrypted connection to the server in another country. Because of the encryption process the data cannot be filtered or blocked. Protect your network traffic under WiFi hotspot Browse anonymously and securely without being tracked. Enjoy private browsing.  Brings a high speed fastest and encrypted VPN connection to your smartphone or tablet.  Works with WiFi, LTE, 3G, and all mobile data carriers  Bypass geo-restrictions to unblock any website wherever you are! Get access to sites that are blocked or censored by government, school or workplace. Evade firewalls to unblock Facebook, watch YouTube, and circumvent VOIP limitations. If you have any comments or suggestions on Best VPN Proxy  Free VPN Unlimited  Vpn Master , please contact us. We appreciate your feedback! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}