{
"name" : "Avira Phantom VPN: Free & Fast VPN Client & Proxy",
"url" : "https://play.google.com/store/apps/details?id=com.avira.vpn",
"package" : "com.avira.vpn",
"category" : "Tools",
"description" : "Stay safe and anonymous while surfing with the best VPN  Avira Phantom VPN includes a free proxy server and 7 days of unlimited traffic with our premium trial   Phantom VPN secures your data, anonymises your browsing and unblocks geo-restricted websites. With 1 click, our VPN free android app dodges ISP tracking by securing your connection via a proxy server. Our fast VPN technology is the easiest way to safeguard your private internet access and enhance your online safety.  Key features of the Phantom VPN service  Your VPN free online tool    Free premium VPN trial  Enjoy 7 days of unlimited traffic  Best VPN service  Hide your ISP with a free VPN server for greater privacy   International VPN  Bypass geographic restrictions for TV and video streaming  Free fast VPN  Browse the web and download files without slowing down   Free VPN server subscription  500MB/month for unregistered users<  Premium VPN proxy  Upgrade your free VPN proxy and enjoy unlimited traffic   Built for internet security  anti-spyware   Phantom VPN uses military-grade encryption to secure your data, ensuring that all your communications travel via a private VPN tunnel for the best possible network security. Wherever you surf, your tracks are covered by our strong VPN firewall that works quietly behind the scenes.     Free VPN for multiple devices  Our free proxy server works seamlessly on various phones and tablets  Enjoy protection for multiple devices simultaneously with Pro   Use VPN software while travelling  Safely connect to public WiFi with Phantom VPN  the best way to keep your data safe, no matter where you are.  Browse the web via our fast proxies for superb speed    Internet security with intuitive interface  Quickly and easily manage your VPN with our intelligently designed UI  Automatically secure untrusted networks and disconnect quickly with the kill switch   Choose your VPN location  38 best VPN server locations worldwide allow you to access your favourite websites in just 2 clicks  Select your desired country and enjoy full anonymity and security     Private Internet Access - Free or premium  Get 7 days of unlimited traffic with a free premium trial. After the trial you can use up to 500MB/month as an unregistered user  Unlimited traffic with Phantom VPN Pro   Unblock proxy  Get Phantom VPN to unblock any website   Access your favourite websites with our free VPN. Unblock YouTube and stream videos at high speed. Enjoy Instagram unblocked, Spotify unblocked and many others including Gmail, Skype, Snapchat, WeChat, WhatsApp and Twitter.  VPN for Android  Our VPN app is supported worldwide   No matter whether you need a VPN for Australia, a VPN for China or a USA VPN: Phantom VPN supports locations in Australia, Asia (China, India, Indonesia, Japan, Korea), Europe (Germany, France, Spain, UK), North America (USA, Canada), Russia and more.   TRAFFIC OPTIONS IN FREE VERSION  VPN free to download for a 7-day trial with unlimited traffic  500MB/month (unregistered users)  PREMIUM VERSION (available to buy in the app)   VPN with unlimited traffic  Phantom VPN Pro gives you full-scale data transfer  Premium support  Mobile tech support provided by our team of security experts  Avira: The best way to hide my IP using a simple VPN changer  Built by Avira, an award-winning German security company, Phantom is a secure VPN that brings state-of-the-art data security to your Android devices. With more than 1 million downloads, Phantom VPN is proven to hide your IP address and safeguard your private internet access at all times.   This app is included in the Avira Prime subscription service. For more details, check out: https://www.avira.com/en/avira-prime  ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}