{
"name" : "Scrambled Exif",
"url" : "https://play.google.com/store/apps/details?id=com.jarsilio.android.scrambledeggsif",
"package" : "com.jarsilio.android.scrambledeggsif",
"category" : "Tools",
"description" : "Scrambled Exif (pronounced eggsif) helps you remove the metadata in your pictures before you share them.  If you feel like it.  If you dont want the big Internet companies (or whomever) to know where your pictures were taken dont forget to remove the metadata from them before you share them.  To remove the metadata from a picture, simply share it like youd normally do and choose Scrambled Exif. A moment later, the share dialog will reappear. Now just share with the app you intended to share with in the first place.  Et voil!  Required Android Permissions:   READ_EXTERNAL_STORAGE to read the images other apps share with it.  Source Code   This app is open source. You can take a look at the code (and contribute if you feel like it) here:  https://gitlab.com/juanitobananas/scrambled-exif  Translations  If you wish to help to translate this app to your own language, you can do so by translating these two projects using transifex: https://www.transifex.com/juanitobananas/scrambled-exif/ and https://www.transifex.com/juanitobananas/libcommon/.  Misc Stuff and Facts   Basically, Exif is used by jpeg, which is the format in which your Android camera saves pictures. If you want to know more about Exif, check the Wikipedia.   Scrambled Exif also renames the files (this can be disabled).   Please dont heavily rely on the data being deleted. Scrambled Exif does its job pretty well, but it could fail. Always double-check before you share.   It doesnt really scramble the Exif data, it deletes it. So the name is probably stupid. But I like it. The icon doesnt depict scrambled eggs either. So the icon is probably stupid. But I like it. And I also happen to be a huge fan of eggs. So this app doesnt only have a stupid name and an equally stupid icon, it is also my (non-stupid) tribute to eggs. Especially huevos fritos. Because I love them.   Have fun sharing your pics! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}