{
"name" : "Voice Notepad & Sticky Notes Audio Translator",
"url" : "https://play.google.com/store/apps/details?id=com.newgeneration.voice.notepad.sticky.notes.audio.translator",
"package" : "com.newgeneration.voice.notepad.sticky.notes.audio.translator",
"category" : "Tools",
"description" : "Translate free into world any language translation easily and create language into that language. Voice notepad offer you to create audio notes and sticky notes with local language or foreign language while having best language translator features. Language translator note maker also allow you to find detail from text dictionary and voice dictionary app. If you have world language translator then you can create good notes into any language and get different languages notebooks with same meaning but different languages. Write note and translate free into all language translation and copy that memories in note with taking notes app. Create good notes for memories and list maker lists note to do your tasks at time. If your memory to remember is weak than dont worry if you have voice notepad dictionary app. So write anything or speak your word for list maker notes for notability and enjoy sticky notes checklist in future. My Notepad Free App offer you to create your own sticky note book. Write notes and search notes from notebook for easily access. Notepad diary is a free notebook to take notes in a different style. Search notes from start to endnote and lock notes. Make your diary cute and colorful pages with notepad that attract your friends. This note maker is also a note editor to edit notes and lock notes. Language Translator is a helpful translation feature to translate all notes free and note cards to understand real meanings. Free translator app offer you to translate into multi languages and copy multi language translated text for notes taking note maker app. A best translator app to use it for language translation and sometime you have to note the translated words for memory. If you want to learn other countries words or want to learn the foreign language translator than you will need these own notes taking notebook in future. Write notes and translate into all languages translator from foreign translator app. Language translate for your chat that provide you translated words when you travel other countries. Voice Dictionary & Dictionary App is available for all world languages. Spanish dictionary will provide detail information in Spanish culture and similarly English dictionary will give provide English details. You can search French dictionary or Russian dictionary and also Hindi dictionary meaning. Search Punjabi dictionary detail meanings. You can type Spanish Portuguese Russian Italian Urdu Hindi or English words in dictionary and get their detail. Similarly you can use speaking words or audio and choose voice dictionary to make it voice dictionary. Voice Notepad is for you to speak and take notes on notepad app. When you are unable to write notes during note list maker than you can choose voice notepad and easily put your speaking words or voice notes on notepad note book app. Voice notepad is a time saving notepad notes taking feature to create maximum notes and complete your notepad diary within time. You can take notes of your teachers lecture while opening mike to take voice message and voice notepad will save this lecture on a voice notebook diary. Audio Translator App offer you to learn a new language and open mike to to get foreign language and news and translate them into local language. You can also create notes of audio translated speech. Easy translator app for language translator speech translation and translate all languages of world popular countries into your local language. Try microphone translation and get text from speech and translate free. ",
"desc_perms" : "['android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}