{
"name" : "Secret Codes for Lenovo Free",
"url" : "https://play.google.com/store/apps/details?id=com.un_apps.lenovo.secret_codes",
"package" : "com.un_apps.lenovo.secret_codes",
"category" : "Tools",
"description" : "Secret Codes for Lenovo app include the android secret code of Lenovo. In this app, there is complete details of the hidden codes of the mobiles to change the setting and other function of your mobiles functions which even cant be changed in your mobiles setting personally  In All Lenovo Secret Codes for mobile you can find all common android secret codes include Network, GPS, Bluetooth, WLAN test, Firmware version information, factory tests, PDA, display the IMEI number, Super Mode, Service Menu, Check Update, Reset Device, Unlock the device, Recover Forgotten pattern, Engineering mode, GPS test mode, Machine information, Software Information, Hardware Information, Test Photograph RGB and much more.   Now You can Discover the secret world of your Android base mobile devices. Some code of them may not work on specific devices, but you can still try them because their manufacturer does not allow them. When those codes are typed manually from the phone dialer or you can copy this code with long press on code and paste it on clipboard. There is also Functionality in the Lenovo Secret Codes to share it with Social Apps free and offline.  IMPORTANT! Some manufacturers not allow the use of these all secret codes and they may not work on your device. By using all mobile secret codes you can change some of your device settings. Use at your own risk!  Warning: After execute the hash code, your device might be effected. So keep backup your important data before execute hash code. We will not be responsible for any damage of your phone, no will be liable for any damage. For suggestion please mail us @: uniqueapps27@gmail.com. Note: It is not official app of Lenovo. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}