{
"name" : "Chinese Lunar Calendar Reminder Free",
"url" : "https://play.google.com/store/apps/details?id=com.johky.chinesefestivalfree",
"package" : "com.johky.chinesefestivalfree",
"category" : "Tools",
"description" : "Reminder : - Remind your schedule to burn incense every 1st or 15th of the lunar month. - Remind your vegetarian schedule every 1st or 15th of the lunar month. - Remind your beloved lunar birthday. - Free version only allow 5 reminders  How the reminder work : Remind you 1 day before and up to 2 weeks before at specific time to the events  Calendar : - Showing gregorian calendar with chinese lunar calendar - Showing chinese zodiac animal sign of the selected date - Add Note to selected date of the calendar. - Public holiday based on Simcard Country (Only Available For : Indonesia, Singapore, Malaysia, Canada, USA, India, Myanmar, China, Taiwan, Australia, Philippines, Italy, Cambodia, Vietnam, Brunei, France, South Korea, Laos, New Zealand, Russia, Thailand)  Add WIDGET to your home screen for incoming alarm & todays lunar date  Showing Auspicious Days (Lucky Days), Inauspicious Days (Unlucky Days) and Auspicious Time (Lucky Time) on picked date in the main calendar  Showing daily clash information for zodiac and direction  Information about 4 Pillars of Destiny (Earthly Branch - Earth Pillars - & Heavenly Stems - Heaven Pillars -) or also mostly known as BaZi (), The information of this 4 Pillars of Destiny will be served on every single selected date on the main calendar.   *Disclaimer Note : For Android OREO Users : Android Oreo has limit the access of background service, sometimes the alarm is killed and will not work. I Still finding way to make sure the alarm will ring on time. For older android version will not have this issue. https://developer.android.com/about/versions/oreo/background    Chinese Calendar, Lunar Calendar, Moon Calendar, Reminder, Chinese Lunar Calendar, Auspicious Day, Inauspicious Day, Lucky Day, Unlucky Day, Auspicious Time, Lucky Time, 4 Pillars of Destiny, Heaven Pillars, Earth Pillars, Heavenly Stems, Earthly Branches, Bazi,  ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.WRITE_CALENDAR', 'android.permission.READ_CALENDAR']",
"manifest_perms" : "['android.permission.GET_TASKS', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}