{
"name" : "Rocket VPN Free – Internet Freedom VPN Proxy",
"url" : "https://play.google.com/store/apps/details?id=com.liquidum.rocketvpn",
"package" : "com.liquidum.rocketvpn",
"category" : "Tools",
"description" : "Rocket VPN is a simple app that creates a Virtual Private Network to encrypt your internet connection. Hide your traffic, identity, and location with one tap, browse the internet safely without compromise.  Get 250 MB free data usage every 30 days* to watch videos, stream music or surf securely or upgrade to unlimited for a reasonable fee and cover all your devices with unlimited bandwidth usage and the fastest possible speed.  ACCESS BLOCKED SITES AND APPS   Choose from our worldwide servers to access geographically restricted content no matter where you are. Rocket VPN allows you to change your devices location to that of any of our servers in the United States, Australia, Singapore, Japan, the United Kingdom, France, or Germany. Apps and websites that require your location to be any of these countries will be unlocked.  BROWSE THE INTERNET SECURELY WITH OUR BUILT-IN BROWSER   Surf the internet right from Rocket VPN with the new Rocket Browser so youre always protected. Make it extra hard for malicious parties to target you. Our built-in browser possesses state-of-the-art capabilities that will keep your device safe from hackers and trackers.  QUICK LAUNCH YOUR APPS   Turbo charge your browsing experience with Rocket Launcher. You can create shortcuts to open an app and connect to your preferred location right from the app. We are all about making things easier, we take convenience to the next level by adding an integrated shortcut to the home screen.   ENCRYPT YOUR CONNECTION   Protect your data with encryption to keep your personal information safe. Some websites can put your device and private information at risk. The best way to protect your online activity is to anonymize your traffic. Feel safe making online purchases knowing that nobody is snooping.   PROTECT YOUR IDENTITY   Anonymize your connection and prevent third parties from tracking your identity and location. We also automatically block malware and phishing sites so you can navigate the internet safely. When you connect to the internet using a VPN you are leaving no footprints and your activity cant be recorded by third parties.   Rocket VPN works with most internet browsers, including: Google Chrome, Mozilla Firefox, UC Browser, Dolphin Browser, CM Browser, Duck Duck Go, and many more.  Install Rocket VPN for true internet freedom!  *Unused bandwidth cannot be carried over to the next month ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.USE_CREDENTIALS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.VIBRATE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.liquidum.rocketvpn.batch.permission.INTERNAL_BROADCAST', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.liquidum.rocketvpn.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'com.liquidum.rocketvpn.batch.permission.INTERNAL_BROADCAST', 'android.permission.ACCESS_FINE_LOCATION']",
}