{
"name" : "OCR Barcod Scanner [Text Scanner]",
"url" : "https://play.google.com/store/apps/details?id=com.barcod.scanner",
"package" : "com.barcod.scanner",
"category" : "Tools",
"description" : "This is best image to text (OCR) mobile app with highest accuracy and quality. You can expect 81% to 99% success rate using this app. So, it is powerful & handy Text Scanner app, that you can use regularly to scan images.  This app is built with Barcod Scanner as well, which you can use to scan any barcode or qrcode. So, its all in one, Barcode Scanner plus OCR (text to image scanner).  Why OCR ? How it is useful and how it simplify your life ?   Use as an image scanner in data entry work.  Used to automatic vehicle number plate recognition.  Printed papers or documents can be converted to text accurately. So that do not have to  manually re-type. You can save time. You can avoid typing errors.  58 languages supported.  Higher accuracy and success rate.  Can be used to scan business documents, passports, regularly used invoices, bank  statements, receipts, insurance copy, book & projects documents, hand written  document scanning, tickets and official ID cards and many more.  Highest speed of reading and accuracy.  Supports Camera capture, pick image from your Gallery.  Supports hand writing documents.  Add additional note for result.  Edit note and result after scanning documents.  Copy and Share scanned result.  Detailed scan history with latest material design and swipe to delete feature.  Permission:    CAMERA: permission is used to scan barcode.  STORAGE: permission is used to store barcode image, also used to store selected or  captured images into your local device to show it as history item. Also used to read  image from you gallery when you select scan image from gallery.  Our Promise:  We are not collecting, using or distributing any sensitive data, information of our valuable users. So, feel free, relax and keep using app.  Please feel free to send mail, feedback from app if you find any bugs, issues or want any feature. We are always listening to our users.  Note:  OCR functionality will only work if you have active internet connection.  Handwritten text is supported but again accuracy depends on quality of your  handwriting. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}