{
"name" : "System app remover (root needed)",
"url" : "https://play.google.com/store/apps/details?id=com.jumobile.manager.systemapp",
"package" : "com.jumobile.manager.systemapp",
"category" : "Tools",
"description" : "We provide not only system app remover, but also user app uninstaller, move app to sdcard, move app to phone, apk on sdcard scan/install/delete.  [System app] Note: uninstall system app need root permission, and we do not provide root method. Compare to other similar products, System app remover: *******************  Safe, we filter out all apps that may cause unstable after uninstalled, and had tested hundreds of devices, so you can use it safely, but we can not make sure 100% safe because of manufacturers may customized too much, also, we backup all app you uninstalled automatic, so you can restore them in Recycle Bin whenever you need;  Clear, we classify all system app as [Could remove], [Should keep], [Key module], so you can choose what app to uninstall clearly;  Easy, we provide you a way to uninstall multi app in one time, make you easy to go;  Small, we release all memory allocated while app exit, and may the smallest app; *******************  [move to sdcard] If we granted root permission, we can move multi-app in one click, and can move almost all apps installed. *******************  Move apps to SD card  Move apps to phone internal storage  Sort app by movable, name, size and time  User can custom [Install time] [Package name] [Apk path] to show in list  Show app details: size, install time, package, apk path.  Open app  Search in market  Search in website by apk name, package name, app name *******************  [Apk manager] *******************  Scan all APKs in SD card  Install APK  Search APK  Batch rename APKs filename  Batch Move APKs to directory  Search and delete all duplicate APKs in one click  User can custom [time] [Package name] [Apk path] to show in list  Show apk details: size, package, apk path.  Search in market  Search in website by apk name, package name, app name *******************  [User app] *******************  Uninstall multi-app in one click.  Backup & restore apps.  Scan all apks in sdcard.  Search apps in local, in market and in website.  User can custom [Install time] [Package name] [Apk path] to show in list;  User app backup directory can be configured in settings;  Show app details: size, install time, package, apk path.  Open app  Search in market  Search in website by apk name, package name, app name *******************  If the Ads annoy you, you can remove it from settings, just one click.  We never say we are the best, but we will try our best to make it better, any comments or suggestions will be nice, please let me know via feedback in our app. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}