{
"name" : "Speed test 3G, 4G, 5G, WiFi & network coverage map",
"url" : "https://play.google.com/store/apps/details?id=com.nperf.tester",
"package" : "com.nperf.tester",
"category" : "Tools",
"description" : "More than a simple speed test, nPerf brings you the best and the fullest mobile connection quality measurement tool up to 1 Gb/s speeds!   Full QoS test: In few seconds, test your bitrate speed, latency, browsing speed and video streaming quality on your mobile device. Comparison function: Compare your results with those of others users and for each provider with a real time barometer. Interactive map: Check network coverage and carriers performances in your area (in USA : AT&T, Sprint, T-Mobile, Verizon Wireless). Network monitor: Stay informed on data speed in real time on the top of your mobile screen (status bar). Reports your data plan usage (in notifications).  A sliding menu (hamburger icon on top left corner) allows you to start every test separately: - Speed test - Browsing test - website loading speed - Streaming test  All your results are saved in an history with all tests locations on a map. Easily share your results on social networks with nPerf sharing pictures which present a useful summary of your test. Customize your application by switching the background theme using the Settings.  nPerf relies on an homemade top technology and a wordwide high speed servers network which can deliver the bitrate you need for speed tests. With nPerf, you do not blow up your data plan: with many optimizations, testing consumes up to 2 times less data than competing speed tests. In addition, a data indicator will notify you if the monthly threshold you can set in the menu Settings is exceeded.  All connection types can be tested over 1 Gb/s speeds ! 2G, 3G, 4G, 5G, Wimax, WiFi & Ethernet speed test. All WiFi technologies are supported. WiFi 802.11 a/b/g/ac dual-band, tri-band & quadri-band All LTE technologies are supported. LTE, LTE Advanced dual-band, tri-band & more  3G / 4G / 5G coverage & speeds maps : USA : AT&T, Sprint, T-Mobile, Verizon Wireless. Canada : Bell, MTS, Roger Wireless, Videotron, SaskTel, Telus, WIND. Malaysia : CellCom, DiGi, Maxis, U Mobile. Singapore : MobilOne, SingTel, Starhub. and many more countries all over the world !  Test your connection, diagnose connectivity issues and keep your Internet service provider and carriers honest!  PERMISSIONS DETAILS Access to Photos/Media/Files is mandatory for Google Maps cache and for share picture storage. There is no access to other files. Device ID & call information is used to generate an UUID for each device. No private data is used. IMEI is used for UUID generation but never transmitted or stored in any way.  WE NEED YOU We are looking for speed test servers: If you represents an hoster or ISP company and want to support nPerf project by providing a speed test server, please contact us.  We are looking for translators: Your native language is not supported yet? You want to contribute to the nPerf project? Contact us if you want to translate nPerf in your language. Youll get a lifetime premium subscription on all platforms. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_COARSE_UPDATES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_UPDATES', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}