{
"name" : "Life Hack Tips - Daily Tips for your Life",
"url" : "https://play.google.com/store/apps/details?id=com.fireshooters.lifetips",
"package" : "com.fireshooters.lifetips",
"category" : "Tools",
"description" : "This life tips app is a free and easy-to-use application contains tons of life tips in different categories such as technology tricks, health and drinks, money savers, etc. With these life tips you can learn a lot of knowledge and tricks to make your life easier and happier. You will find this app very helpful, and also you can share the life tips with your classmates, or friends via Facebook, WhatsApp and other social apps easily. Here are some tips for example:  1. Take a sip of coffee before adding sugar, you wont need as much sugar for it to taste as sweet afterwards. 2. Using your phone while its charging can damage the battery. This is why the cords for chargers are so short.  Core Features:   Tips with different categories.  Easily browsing tips.  Daily life tips for you to learn them easily.  Beautiful user interface.  Tip Categories:   Technology Tricks  Food and Drinks  Health and Fitness  Money Savers  Life Tips  Party  Survival  Brainy  Self Defense  Travel  Learning and Study  Study Boosters  Money Making  Home Decor  Hacks For Girls  Summer Hacks  Communication  Office Work  Pet Hacks  Car Hacks  Productivity  Gardening Hacks  Clothing Hacks   Just enjoy this app and if you have more life tips and you want the share them with others you can send them to us (email: fireshooters@foxmail.com), and we can add them to this app and help more people. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}