{
"name" : "KeepShare Lite for KeePass",
"url" : "https://play.google.com/store/apps/details?id=com.hanhuy.android.keepshare.lite",
"package" : "com.hanhuy.android.keepshare.lite",
"category" : "Tools",
"description" : "KeepShare Lite, the free version of KeepShare.  All features of KeepShare are present in KeepShare Lite, except for write support.  Features: * Easy-entry PIN unlock, optional fingerprint unlock on Android 6.0+ * Super-secure, PIN cannot be brute-forced without corresponding key stored in Google Drive (accessible only to KeepShare) * Custom keyboard for username and password entry * Auto-fill support across all native apps, auto-fill in Chrome on Android 5.0+; auto-fill is fully secure from clipboard attacks on Android 5.0+ (on pre-5.0 it is possible that a malicious application can snoop passwords using this approach: https://www2.dcsec.uni-hannover.de/files/p170.pdf) * Automatic synchronization with Storage Access Framework providers in Android 4.4+ (includes Google Drive, Box.net, OneDrive, etc) * Full database browsing * Full Material Design * 100% compatible with KeePass 2.x .kdbx files * Completely open source: build and run it yourself if youre cheap; audit the code and verify that nothing nefarious is going on or even verify the security of this solution Im giving you. You get to decide! (Licensed under the terms of the GPLv3) -- https://github.com/pfn/keepshare   What makes it special?  * It is built from the ground up to be completely different from any other solution available on Android. This application is the only implementation of KeePass for Android that allows one to securely unlock the database with a 4+ digit PIN. It also looks good because its fully Material Design.  * KeepShare is one of the first apps to have a custom keyboard for password entry, in addition to searching for database entries using a Share mechanism (hence the name KeepShare). In addition to this, it is also among the first password managers on Android to provide complete auto-fill support across all apps, including Chrome (requires Android 5.0+ for Chrome).  * In addition to this, KeepShare supports Android 4.4+ Storage Access Framework, this means you can automatically connect and synchronize to your choice of cloud storage provider, including Google Drive, Box.net, OneDrive, etc.  * It is also fully compatible with KeePass because it uses a 100% direct port of KeePassLib from C# to Java  How is KeepShare Lite different from KeepShare?  * KeepShare Lite provides read-only support for KeePass databases. I recently completed write support for KeepShare, and as a result, I feel that its enough of a feature delineation where I can give KeepShare Lite to everyone for free! Why do I want to give it away? Because everyone should be improving their security situation by making better use of strong passwords, and security should be easy.  Help! Im stuck  * Yes, its open source: issue tracker at https://github.com/pfn/keepshare/issues  How can a 4 digit PIN possibly be safe!?  * The security is implemented by using a 2-part encryption key for your master passphrase. Your PIN is only one part of the key. The other part of the key is uploaded into app-private data in your Google Drive account. Information stored on your phone cannot be accessed without the key from Google Drive and vice versa. (Also a first, no other app does this to enhance your security).  Can I create databases using KeepShare?  * Not yet, for now, you will need to create it from any other app that allows database creation.  DISCLAIMER: This app uses Accessibility services. KeepShare aims to aid people with disabilities by enabling users to enter passwords that would be otherwise difficult or impossible to type or remember due to any handicaps. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.USE_FINGERPRINT', 'android.permission.VIBRATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}