{
"name" : "JPG to PDF Converter Free",
"url" : "https://play.google.com/store/apps/details?id=com.srdev.jpgtopdf",
"package" : "com.srdev.jpgtopdf",
"category" : "Tools",
"description" : "This free online JPG to PDF converter allows to combine multiple images into a single PDF document. Besides JPG/JPEG, this tool supports conversion of PNG and BMP files too. Image to PDF converter offline you can choose the images from gallery in order with image reorder option and convert it to PDF in a single click.  Free Image to PDF converter app by using this, image could be converted to PDF in a minute and designed with more friendly approached design. JPG to PDF Converter is very useful tool for corporate office, business meetings, daily uses, government office, and online registration account and to upload your KYC so on.  Free Image to PDF Converter Features : - All our features are 100% FREE Suite. - Image to PDF converter can use in offline mode. - Protect your documents with a passcode. - Convert multiple images into single PDF. - JPG to PDF converter supports generation of password protected PDF. - Set page sizes for PDF (Letter, Legal, A4, and more) - Grayscale and black white image effects settings. - JPG to PDF converter is very easy to use and quick. - Image Quality setting including no compression, low, medium and high. - Thumbnail or list view, sort scans by date or title. - Search, scroll, and zoom in and out. - Change page Size Scan to PDF Converter Free. - Open the PDF with any PDF viewer/editor. - Choose Single Page, Continuous scroll, or Reading mode. - Use your device camera to snap a photo of anythinga document, whiteboard, form, picture, receipt, or noteand save it as a PDF. - Take picture of any official form like ID or official document or school documents or resume (CV), bills, invoices, messages, and web pages and send them VIA Mail or Gmail. - Convert all kind of documents then send them via : E-mail , Gmail, WhatsApp , MMS, Dropbox, Google drive docs, Evernote, Wi-Fi direct, Bluetooth or Facebook, Twitter, Skype and more, it can also read and preview pdf files.  Save the following document formats to PDF:  - JPG to PDF Converter - BMP to PDF Converter - PNG to PDF Converter - GIF to PDF Converter - Image to pdf converter - Convert JPG to PDF - Convert to Pdf - PDF Converter - Convert JPG to PDF - JPG to PDF Document Converter  How it works:  - Take picture of the documents that you want to convert or send. - Choose the picture (PNG, JPEG, XPS, TIFF, JFIF, and GIF) or the document that you want to convert or send as pdf. - Resize it + Apply Effects + Change rotation. - Send them via E-mail, Gmail, Yahoo Mail, Whatsapp, MMS, Dropbox, Google drive docs, Evernote, Wifi direct, Bluetooth or Facebook, Twitter, Skype and more, it can also read and preview pdf files.  GOT QUESTIONS? CANT FIGURE OUT HOW TO DO SOMETHING?  If you have any problem about this JPG to PDF converter app please email us at srdevelopers291@gmail.com, and well help you figure it out.  Try and enjoy 2017 - 2018 best JPG to PDF converter app to PDF all new apps 2017 - 2018.  ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}