{
"name" : "Video Downloader for Twitter",
"url" : "https://play.google.com/store/apps/details?id=com.videodownloader.twittervideoindir",
"package" : "com.videodownloader.twittervideoindir",
"category" : "Tools",
"description" : "Twitter video downloader is the best solution to save twitter videos and gif. Its free to use. You just need 3 clicks to save Twitter video. No password or registration needed. You should just follow these 3 simple clicks to download Twitter videos.    3 Clicks to Save Twitter videos and gif 1) Share Tweet to the downloader 2) Touch Download button. 3) Find on in app gallery or browse on your gallery.  You can simply share downloaded video or gif from other social medias or your friends from the app. To share you should click to in app gallery and click to share button of the video. Twitter video saver also have a deleting and preview features. When you click to download button the app selects the best quality to download and downloads to you storage.   With Twitter video download application, you can download at any time (4G / 3G / 2G / EDGE or Wi-Fi whenever possible) when you have internet connection. Just click to download Twitter videos .   Features of Twitter video saver - Twitter video saver  - Size / Duration preview  - Automatically selects best resolution and quality. HD - UHD  - Twitter gif downloader  - Image downloader.  - Audio downloader.  - Share content with your friends  - Browse in your Gallery  - Easy to use, the best & new app  - Lightweight - smart application     Why to use? No charge! Download Twitter Videos allows you to download videos, images, gif on Twitter as long as you have internet connection. No limitation. With this application you can quickly share your videos, images, gif with your friends and family. No need to pay for any item you download. There is no membership. No Twitter passwords needed Its completely free! Save videos from Twitter all fully free.   Which Languages We Support in Twitter Video Downloader ? We are developing apps to makes you life easier. So language options is very important for your experience. We are working hard to add new native language supports. We are supporting  Turkish, English, Arabic, Spanish, Japanese, Hindi , Thai, Russian, Portuguese, Chinese, Indonesian And More Language Support on the way! Just write a comment or create a feedback from application. You can send feedbacks from Twitter video downloader application.   How to Download Twitter Videos ? 1) Open the Official Twitter Application 2) Find the video , gif or image you want to save from twitter 3) Click to share icon of the tweet. Select the Twitter video download application from share list. 4) Click to the Save twitter video. 5) Check the preview if content is correct touch to download button again.  Also you can save Twitter videos by copying tweet links. Its very easy to save Twitter videos and gif. Copy link of the tweet. Open download application and click to the Paste Link button. And Click to the download button. Twitter video downloader is the best solution to save content from Twitter.     Why do you need to download Twitter videos ? People download Twitter videos to share with their friends. Whenever you find a good or funny videos you can download and share this video by a few clicks. This application save Twitter videos to you own device storage that means its also cannot be lose from Internet. Twitter video saver is a best tool to download from Twitter.   Notes  - This applications is not affiliated with Twitter. This application is just a tool to save content. -*-- There is no link between official Twitter application and this tool.  - This application has no feature to download videos , images or gifs from Private Accounts. We are respecting people privacy and Twitter policies.    Official Links Contact - https://mizanbilisim.com/contact-us/ Privacy Policy of Company - https://mizanbilisim.com/privacy-policy/ ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.videodownloader.twittervideoindir.permission.C2D_MESSAGE', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}