{
"name" : "QR Code Reader and Scanner: Barcode Scanner",
"url" : "https://play.google.com/store/apps/details?id=com.appswing.qrcodereader.barcodescanner.qrscanner",
"package" : "com.appswing.qrcodereader.barcodescanner.qrscanner",
"category" : "Tools",
"description" : "QR Code Reader and Scanner: Barcode Scanner fastest and best user friendly QR creator application. QR maker and barcode maker freely accessible on play store. Using the phones camera, our QR barcode scanner & QR maker will rapidly scan QR and identify the information of barcode with URL scanner. QRreader code & rocket QR contains a website URL youll automatically take the web site. Barcode scanner fast, easy and barcode inventory and URL scanner safe application use without limits. Barcode Scanner & QR maker has all features one QR creator and another QR code scan, barcode generator, QR code maker, rocket QR & URL scanner. We provided many type of QR code reader free, barcode maker, QR maker & QR reader types like personal profile, business card maker, contact, message, free text, mail, website, company profile etc. Just select any of these classes and fill vital fields to barcode maker image and QR code reader share with your friends.  QR Code Reader and Scanner: Barcode Scanner is totally free QR code maker & URL scanner application. Change your smartphone into powerful QR barcode scanner, Barcode reader, QR creator, QR reader, barcode generator, business card maker, QRreader and Data Matrix scanning utility, b3b qr and scan QR. QR code reader & QR maker point the camera at the code and youre done. By using phones camera, barcode scanner & QR reader app will quickly scan and recognize information of barcode inventory with URL scanner. When QR code scans, if the code contains website URL, youll automatically be taken to site. If code just contains text, email, contacts information, calendar events and much more with single click using your smartphone camera, image files, and online codes. After cracking you will relay to webpage links, books review, and multimedia calendar online information. You can QR creator and barcode generator is very fast barcode inventory scanner, QR code maker and business card maker. SHARE them with your friends through apps, social networks, email, and text messages, save them for later use.  QR Code Reader and Scanner: Barcode Scanner best app simply point barcode scanner app you want scan will mechanically sense and scan. With barcode reader No need press any buttons, take photos or adjust zoom. QR barcode scanner and barcode generator read all QR code reader free types including text, product, contact, email, whatscan, Wi-Fi and many other formats. QRreader after scan QR and automatic decoding user provided with only relevant options for separate QR barcode type and can take proper action. Use free QR maker to read vouchers codes to receive discounts and save some money. Barcode generator & QR Code Reader really easy to use scans the QR barcode scanner or barcode maker on your mobile device. Your phone is new QR code maker or QR creator. Barcode inventory is extremely easy to scan QR or QR barcodes using this unique and amazing QR Code or Barcode Scanner & business card maker application.  QR Code Reader and Scanner: Barcode Scanner to scan different QR code reader and QR code scanner that are available on different advertisements and newspapers. Barcode maker and QR code scanner, QRreader & barcode generator app reciprocals of script long term of information into small. QR code maker & QR creator easily scan QR from all Super store products. QR Reader & bar code scanner are not transferrable and they only have plug & play system to work properly, instead of bar code readers, we introduced new implement for smart cell phone related desires in few seconds and give better capability barcode scanner app by using Final Quick response QR code reader and scanner, pembayaran qr. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}