{
"name" : "Language Translator Free, Voice Text Translate All",
"url" : "https://play.google.com/store/apps/details?id=com.translate.all.language.speech.text.translator",
"package" : "com.translate.all.language.speech.text.translator",
"category" : "Tools",
"description" : " Text Translator into Text-to-speech apps Language Translator Free, Voice Text Translate All is a leading/professional Translator App to translate between  languages using features like text translator, voice translator, text to speech, language translator with English conversation. Free translation app allows you to translate between all languages. Free translation app is especially helpful when you are out of the country or in a place where you do not know the local language or somewhere foreign. Language Translator Free, Voice Text Translate All allows to speak and translate between multiple languages. Text and speech translator gives a fun and effective way to memorize vocabulary.   Translate that language with  voice translator Multi language and voice translator, which allows you to take notes easily by speaking. Learn local/indigenous languages including all International languages. If youre in a foreign place, no need to worry & just use language translators speak to translate functionality to translate words pronunciation of the local/foreign language. With this Language Translator Free- Voice Text Translate All, speak any words and voice language detector translator will convert spoken language to English or any foreign language to English and in this way you can translate all languages you want.   Tools & utilities for text to  speak all languages Get this amazing language translator with high accuracy capabilities of text to voice translation the likes of which you wont see in any other online language translation app. Language Translator Free- Voice Text Translate All app is your one-stop for easy and fast translator. Now you can understand and speak any language with speech translate feature.  Language Translator supports translation between the following languages:  Afrikaans, Albanian (Shqip), Amharic (), Arabic (), Armenian (), Azerbaijani (Azrbaycan dili), Basque (Euskara), Belarusian (), Bengali (), Bosnian (Bosanski), Bulgarian (), Georgian (), German (Deutsch), Greek (), Gujarati (), Haitian creole (Kreyl ayisyen), Hausa, Hawaiian, Hebrew (), Hindi (), Hmong, Hungarian (Magyar), Icelandic (slenska), Igbo, Indonesian (Indonesia), Irish (Gaeilge), Italian (Italiano), Japanese (), Javanese, Kannada (), Kazakh (), Khmer (), Korean (), Kurdish (kurmanji), Kyrgyz (), Lao (), Latin, Latvian (Latvieu), Lithuanian (Lietuvi), Luxembourgish, Macedonian (), Malagasy, Malay (Melayu), Malayalam (), Maltese (Malti), Maori (Mori), Marathi (), Mongolian (), Myanmar (Burmese ), Nepali (), Norwegian (Norsk), Pashto (), Persian (), Polish (Polski), Portuguese, Punjabi (), Romanian (Romn), Russian (), Samoan, Scots gaelic (Gidhlig), Serbian (), Sesotho, Shona (Chishona), Sindhi (), Urdu (), Uzbek (Ozbek), Vietnamese (Ting vit), Welsh (Cymraeg), Xhosa (Isixhosa), Yiddish (), Yoruba (Ede yorb), Zulu (IsiZulu).    Features:   Language translator to translate texts between  languages.  Quick Voice Translator with high accuracy voice recognition.  All in one - Translator for text, files, web pages & photos.  % free.  Copy text from anywhere and paste into the app to Translate.  View the history of your translations.  Save translations to your phone.  Add voice translations to favorites.  Share voice and text translations.  App localized in multiple languages for the better user experience, now enjoy the app interface into your native language.  If you like our application, please rate 5 stars! Were always excited to hear from you! If you have any feedback, questions, or concerns, please email us at: royaleappstech@gmail.com ",
"desc_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.BIND_ACCESSIBILITY_SERVICE', 'android.permission.FLASHLIGHT', 'android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAMERA', 'com.android.vending.BILLING']",
}