{
"name" : "Protect Me - Accounts and Mobile Security",
"url" : "https://play.google.com/store/apps/details?id=com.protect.detectrisk",
"package" : "com.protect.detectrisk",
"category" : "Tools",
"description" : "Do you think your online accounts will never be stolen? Do you think the information stored on your device is safe and secure? No, you were wrong. Information and account online thefts are increasing day by day are becoming increasingly sophisticated and dangerous  Your devices and online accounts can contain sensitive information like your credit number card, full name, full address, social security number, medical details, financial documents, photos and personal videos. There is a danger that this information is hacked by your phone and your online account  Download this app now to protect your information and accounts before its too late!  The system detects and blocks unauthorized access to your online account. Works right after detecting suspicious activity and potential risks on the device, giving you immediate action for protection.  Defend yourself from any hackers Protect your Facebook, Gmail, Instagram, Twitter accounts. Detect and prevent unauthorized access to steal data from your online accounts. Tracking log activity helps detect suspicious access and offers solutions to protect your online account.  Detect risk from all applications Scan and monitor all the software in your phone. Disables and notifies you of software that may eavesdrop, track and steal data  Avoiding the Risks of Automatic Wi-Fi Connections Continuously scan and warn when there is an unusual intrusion to attack your phone from connected Wifi networks. Avoiding the Risks of Automatic Wi-Fi Connections  Protect it now before its too late.  Any comments please leave a review or contact us via email: nisi.application@gmail.com. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'com.protect.detectrisk.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}