{
"name" : "Sensor Box Plugin",
"url" : "https://play.google.com/store/apps/details?id=com.imoblife.senorbox_plug_in",
"package" : "com.imoblife.senorbox_plug_in",
"category" : "Tools",
"description" : "Shows you what sensors are installed on your device and how they work  This is All-In-One Toolbox (Cleaner, Booster & Optimizer) Sensor Box Plugin. It can not be used on its own, Please install All-In-One Toolbox before use this plugin.  Download All-In-One Toolbox: https://play.google.com/store/apps/details?id=imoblife.toolbox.full&referrer=utm_source%3Dplugins%26anid%3Dadmob  How to use - Install Both All-In-One Toolbox and Sensor Box Plugin - Open All-In-One Toolbox > Toolbox > Plugins > Sensor Box Plugin You can create shortcut for this plugin in Settings or add it as a screen widget for quick access   Main Features Sensor Box Plugin detects all available sensors on your Android device, and vividly shows you how they work with amazing graphics. Sensor Box Plugin also tells you which sensors are supported by the hardware, and provides extremely useful sensor tools that could be used in our daily life.  Sensors included - Gyroscope Sensor Gyroscope sensor can measure six directions at a time. You will be able to see the effects immediately by rotating your phone slightly. Now Gyroscope sensor is mostly used in 3D game development, and possibly indoor navigation in future.  - Light Sensor Light sensor is applied to detect the light intensity of the environment, and then adjusts screen brightness and determines whether to turn off the keyboard light. Test the effect by putting your phone in dark place and retrieving it.  - Orientation Sensor Orientation sensor is applied to detect direction status of the device, i.e. auto rotate screen when device is rotated horizontally. It can also be used as measure equipment like Spirit Level.  - Proximity Sensor Proximity sensor measures the distance between two objects, usually the device screen and our hands/face etc. Test the effect by moving your hand forward and backward in front of the device in Android Sensor Box.  - Accelerometer Sensor Accelerometer sensor is applied to detect device directions, i.e. auto rotate screen when the device is rotated vertically. It is also widely used in game development.  - Sound Sound detects the sound intensity around you and provides you detailed information about the intensity changes.  - Magnetic Field Magnetic Field is used in many areas like metal detection and compass, which bring us lot convenience in our life.  - Pressure Pressure is used to detect environmental pressure, thus to forecast weather and temperature.  Sensor Box Plugin only detects changes. It may not show the correct temperature, proximity, light and pressure values if no changes occur.  For better performances, sensors are usually used together. Check out the live demonstration inside the application!  About All-In-One Toolbox  All-In-One Toolbox is the most comprehensive tool app to optimize your Android in optimal speed. Trusted by Millions of users world wide.   **Key features**  Junk File Cleaner Clean all process, cache, temp files, empty folders, residual files, app leftovers, clipboard data, SMS & call logs, saved password, search history, large files  Task Killer & Memory (RAM) Booster  Kill background running tasks whenever device slows down, lags or freezes to boost speed.  Pre-Installed & User Installed App Manager  Manage all apps. Root user can customize auto-start apps, move app to SD card, batch install&uninstall apps silently, uninstall build-in system apps.   SD Card File Manager Manage all files, folders stored on external SD card. Support all basic file operations.  Privacy Protector  Encrypt apps and everything you dont want to share  Useful Plugins 1. App Advertisement Detector  2. App Locker 3. Auto Clean & Boost Tasks  4. Game Booster  5. App Permission Check  6. Compass 7. Flashlight  8. Quick System Settings  9. Sensor Box 10. Quick Volume Settings    Any questions please feel free to drop us an email: support@aiotoolbox.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.RECORD_AUDIO']",
}