{
"name" : "Translate All, Text & Voice Translator - Tranit",
"url" : "https://play.google.com/store/apps/details?id=com.tranit.text.translate",
"package" : "com.tranit.text.translate",
"category" : "Tools",
"description" : "Tranit is a powerful translate app supporting hindi translate and 100+ other local language translation. No need to open the browser for Google translate or Yandex translate, no need to pay for one hour translation tranit sever as an all-in-one online translate app.  It is an essential translator for everyone traveling, business, and learning with rich translation features including screen translation, voice translation, file translation, web page translation, etc.   Stunning Features  All Language Supported Tranit is expert in indias local language transaltion which enables you to translate English into Hindi (hindi ko english me translate karna hai), translate English to Malayalam, translate English to Punjabi text, translate from English to Marathit, English to Tegulu spelling translation and translation from english to tamil. Meanwhile other global language is also supported, including Japanese to English translation, English to Turkish translation, translation English to Korean, etc.   Voice Translator: Speak & Voice Translate The translate app allows users to speak and translate voice to text (voice typing). Then the automatic voice translator will quickly and accurately recognize the voice input by the user, translate directly into the language you set, and read the translation result aloud through the text-to-voice feature.  Voice translator all language supports Hindi to English voice translation, English to Urdu voice translation, Hindi to Kannada voice translation, Hindi to Telugu voice translation, English to Hindi voice translator, Hindi to Malayalam voice translator and all other language translation to help you talk freely with foreign speakers and break down language barriers   Screen translator/Floating Ball Translation Drag the translation floating ball onto any text you want to translate on any apps or web page, and target translation will be displayed in one second. Double click on the floating ball to activate Translate All feature on automatic screen translator and enjoy fluent page translation.  Camera Tranlator/Image Text Translator With smart OCR feature, any text could be translated directly using your mobile camera without need of text input. Any text in all formats of files and images could be auto detected and translated.    Text Translator/Chat Translator When youre chatting with your friends using a variety of social apps, Tranit enables you to quickly translate the text of the speech bubbles and input boxes, making your communication with foreign language friends smooth. >>Bubble Text Translator: Drag the floating ball to the chat bubbles content or a paragraph of text. >>Input Box Translation: Drag and drop the floating ball to the text in the input box, it would be translated. >>Clipboard Text Translation: Copy the text, and click the floating ball to translate   Screen Translator Whether you are using Facebook/InstagramTwitter for social networking or using WhatsApp/Messenger to chat with others, or you are accessing a page on browser, Tranit helps you instantly translate foreign languages into your target language without switching out to translation apps.   File Tanslator All formats of files are supported including doc, pdf& txt word file and other files format like xls, rtf, etc.    Collection of translation results Add your translation results to favorites, and review them anytime, anywhere. In this way you could try to pick up a foreign language and use tranit as your online dictrionary. Tranit smartly detects your source language and will automatically translate text and words into the language you need. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.RECORD_AUDIO', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_LOGS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.REORDER_TASKS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REORDER_TASKS', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.READ_LOGS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.REORDER_TASKS']",
}