{
"name" : "Screen Mirroring, Cast Phone To TV - Castto",
"url" : "https://play.google.com/store/apps/details?id=com.soomapps.screenmirroring",
"package" : "com.soomapps.screenmirroring",
"category" : "Tools",
"description" : "Screen Mirroring is a technique, which allows you to mirror your smartphone on the TV screen. You can easily access all of your games, photos, videos and other application on a big screen using this Screen Stream Mirroring (Castto) App.   If your eyes are drained from looking at your small cellular phone, you will get a great big screen phone experience by connecting your phone to a TV screen via This Cast To TV app!  Mirroring your mobile screen on your TV can be useful when youre showing off photos from a recent trip, playing a game or giving a demonstration. With this Screen Mirroring App, youll be able to duplicate your Android phones screen on TV screen.   This Screen Mirroring App allows you to easily connect your device and your TV. It provides you a secure connection to protect your data, files and applications. Castto is simple, easy to use and most importantly a free app!  With this Connect Phone To TV App, you can stream to TV from phone without limitation. It helps you instantly stream movies, music and photos to your TV! This is one of the best screen mirroring app for android users.  Cast To TV is useful for streaming movies, videos, access photos and apps on the TV screen. You can easily connect your smartphone with your TV wirelessly. You can search your favorite TV shows and series and easily stream them anytime on your TV screen.   Watching videos on your TV or tablet is great, Streaming those movies on your big TV screen? Better yet. Thiss the best Screen Stream Mirroring app to view your phone on your TV. If you are searching for How to Connect Phone to TV Without Hdmi then this is the best app, you will find!  Little smartphone and tablet screens are good on the run, but when youre in your family area then why not use your TVs much larger screen instead? Sharing your phone screen With the Television now is easier with this Connect Phone To TV App.   If you are tired of searching the greatest Apps for casting your small screens into larger screens to get awesome experiences, here is the best and most user-friendly Screen Mirroring App. All you need is to make sure that your smartphone/tablet and your TV are connected to the same WIFI network in order for Castto to work successfully.  Please follow the steps bellow to display your mobile screen on your TV:  1- Make sure your TV and your Phone are Connected to the same wifi network 2- Enable Miracast Display on your TV 3- Enable Wireless Dispaly option on your phone 4- Click Select button and choose your TV 5- Enjoy!  Screen Mirroring is supported by all Android devices and Android Versions. If you face any problems with your device, feel free to contact us!  PLEASE CONTACT US at contact@soomapps.com for any issue or feature request prior to leave a bad comment, we would be pleased to provide you any help! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}