{
"name" : "Gallery",
"url" : "https://play.google.com/store/apps/details?id=com.photo.video.gallery",
"package" : "com.photo.video.gallery",
"category" : "Tools",
"description" : "The gallery is an application that let you view images and video files. This is the light, fast and modern Photo - video Gallery with a special animated gallery looks for your phone. It is a well-designed gallery replacement for the inbuilt phone gallery. This is perfect gallery for you.  We are providing phone image and video into single place. Items can be sorted by date, size, name both ascending and descending, photos can be zoomed in. Media files are shown in multiple columns depending on the size of the display you can change the column count by pinch gestures. They can be renamed, shared and deleted. Images can also be cropped, rotated, flipped or set as Wallpaper directly from the app. The Gallery is also offered for third party usage for previewing images / videos, adding attachments at email clients etc. Its perfect for everyday usage.  App Features:  Fast: Quick app launching, view thousands of your photos instantly. Smooth user experience is optimized for large screens and multiple finger gestures, and it contains no added any extra permissions.  Management: Powerful file management features, including sort, rename, create new folders data and more.  Customize Photos: Internal picture editor which allows you to rotate, shrink, crop, and set as your wallpaper with the best quality.  Hide Private Albums: Set up PIN Lock for hidden albums. Easy to hide, unhide and view private albums in best innovative way. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}