{
"name" : "Multi-Screen Voice Calculator",
"url" : "https://play.google.com/store/apps/details?id=com.atnsoft.calculator.free",
"package" : "com.atnsoft.calculator.free",
"category" : "Tools",
"description" : "Free multi-screen calculator with voice input for everyday use!  ATNSOFT Calculator lets you:   Instantly enter numbers and mathematical expressions using an ergonomic on-screen keyboard and voice input (currently supports English, Chinese, Croatian, French, German, Hungarian, Italian, Japanese, Korean, Polish, Portuguese, Russian, Spanish, Swedish, Thai, Turkish and Vietnamese). Just press the mic button and speak the expression (for example, 74 point 5 times 4 plus 37 = 74.5  4 + 37 = 335): it will appear on screen and the result will be calculated immediately!   Make two or more calculations simultaneously. To do this, you can switch editing screens with a horizontal swipe along the top edge. You can give names to screens by tapping the screen number.   Quickly copy the result to the clipboard simply by tapping it. There is a special button for pasting from the clipboard ().   All calculations are recorded in the calculations history, from where you can insert the expression and result into the editor. These records can be instantly deleted with a horizontal swipe. Any record from the history can be tagged with text by tapping the date or time.   Execute mathematical operations with incredibly large numbers and expressions.    Raise to the n-th power or extract the root of the n-th power (for example: 5 cubed = 5^3 = 125; the cube root of 27 = 327 = 3).    Percentage calculations (for example: 200 + 10% = 220; 10 % 200 = 20).   Convenient, user-friendly settings that can be opened by swiping from the left edge of the screen or using a menu button. The settings include: vibrate on click, full-screen mode, keep screen on, and other options.   The result is always displayed naturally, without incomprehensible Es, dashes, and numbers.   Easily work with many memory cells, and easily switch between them. You can set a name for each cell, letting you intuitively use the memory for a specific field of activity.   Quickly switch themes.  Important: For voice input to work without the Internet, the appropriate voice baselines must be turned on in the Android settings. However, voice recognition is more accurate and higher-quality with an internet connection.   Free Version Restrictions  Only 5 screens (pages) to switch.  Only 5 memory cells.  An advertising banner is displayed.  Get the Pro Version for Free! Well be happy to send you a coupon or even a few ones for the Pro version free installation in exchange for:  an interesting YouTube video, article, blog post or any other item promoting the application;  or quality translation of the application texts into another language. The application has already been translated into French, German, Hungarian, Italian, Japanese, Portuguese, Russian, Spanish, Swedish and Thai.  Please feel free to use the contact form to share your ideas: https://atnsoft.com/support ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO']",
}