{
"name" : "7Zip & Zip - Zip File Manager",
"url" : "https://play.google.com/store/apps/details?id=com.sociosoft.unzip",
"package" : "com.sociosoft.unzip",
"category" : "Tools",
"description" : "7Zip & Zip lets you take control of archive files like zip, rar, 7zip, jar or APK on your device. Quickly and easily extract, open, view or create your own archive by compressing files and folders.   All features are enabled without limitations. This is the full version, free! Features:  Supports multiple archive formats and types (zip, rar, 7zip, jar, apk)  Browse and open standard compression formats like zip (includes apk and jar) without needing to extract them  Supports password protected archives. Password protected (encrypted) archives can be extracted or created.  Compress and email  Thumbnail support  Simple file and folder browsing made easy  Extract and archive progress display   File associations for extensions (like 7z) lets you open files by selecting them in your file browser   Heres why you should already be using 7Zip & Zip:  Safeguard your files and folders by encrypting them within a password protected zip archive. Encryption is a secure way to protect your files.  Archiving allows you to reduce the file size of a file or folder. You can also compress several files into one smaller file that makes it easier to email or share. You can compress large folders and files on your device that you rarely use to save disk space on your Android device.   More about archives:  Archives are commonly found on the internet and need to be unpacked or extracted before the contents can be viewed. Sometimes the archives are encrypted. This means they require a password before they can be extracted. This password was entered by the original author and is usually included in the download.   Some info on archive formats:  Zip and rar files have been a standard form of archive compression for decades, but recently the 7z format has become very popular.  7zip (pronounced seven zip) is a compression format that offers high compression, speed and reliability. Files are stored with a 7z extension (.7z) Rar is less popular these days since 7z offers higher compression and zip offers more simplicity than rar. Jar and APK archives use compression technology similar to that of zip, but are typically used for other functions. Jar archives are usually java archives while an APK is used to store an Android application. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}