{
"name" : "Delete Phonebook Contacts: Phone Numbers Eraser",
"url" : "https://play.google.com/store/apps/details?id=com.ProDataDoctor.DeletePhonebookContacts",
"package" : "com.ProDataDoctor.DeletePhonebookContacts",
"category" : "Tools",
"description" : "It is an amazing Useful Free App to Delete Multiple Contacts that allows to delete all contacts or groups of Phone numbers in just a single Tap.  App is really useful, when you need to delete all contacts or multiple contacts from your phone or you want fix or restore the contacts from a backup.  App offers a Variety of choices and Advanced options for deleting contacts from your Address Book such as:   Delete All Contacts  Duplicate Contacts Remover  Contacts Cleaner  Delete Remove or Clean the unused or old phone numbers easily  Easy Duplicate Contacts Deletion options  Delete Multiple Contacts in one Click  Delete Entire Phonebook Contacts  WhatsApp contacts  Gmail Contacts  Batch Processing  Delete Phonebook Contacts from selected Profiles  Quick & Easy Multiple Phone Numbers Eraser Tool  Easily get rid of individual or multiple contacts that you no longer want  Quickly scroll to find contacts  Remove all duplicate contacts and advanced options to Fix Duplicate phone numbers   Of course, Phonebook Contacts are the important data in a phone. You need it accurate occasionally need to Make it clean and organize if it is messed up. This Free android App will be useful to maintain the Contacts Book clean in single tap. It also increases the search speed of the contacts in your address book. This App is also helpful if you imported phone numbers and addresses incorrectly from a backup source of VCF vCard Contact file etc.  Please Note: Developer strongly recommends to Backup your contacts before use this app so that you can get it back if necessary or in case, you deleted useful contacts by mistake.  It takes just a single Click to Delete All Contacts to reset or empty your phonebook. App shows the number of contacts available in your phonebook or according to the various Profiles and accounts like Phone SIM Card Gmail whatsapp Facebook and Google etc.  Select Single or several or all the contacts to delete. You can also select any account or all profiles to remove contact and other available options to erase. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.WRITE_CONTACTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}