{
"name" : "Naptime - the real battery saver",
"url" : "https://play.google.com/store/apps/details?id=com.franco.doze",
"package" : "com.franco.doze",
"category" : "Tools",
"description" : "This is the real battery saver. No placebo and dumb marketing shenanigans! Naptime lowers your devices power consumption while the display is off by empowering Androids built-in doze power saving functionality. Faster idle means less power being consumed unecessarily. By default doze can take a while to kick in so Naptime just speeds-up that process automagically for you.  It can also automatically disable W-iFi, mobile data, location & bluetooth as soon as doze kicks in.  Experimental features such as automatic Android Battery Saver, Aggressive Doze timings, Aggressive Doze scheduling times and location detection. Now you have profiles so you can load them up on demand based on your usage and accessible from Quick Tiles.  Most features work if youre not rooted, but to have the full experience youll have to root your device.  F.A.Q.  Q: Rootless mode? To use Naptimes features without Root you need to grant it DUMP permission via ADB on your computer by executing this command:  adb -d shell pm grant com.franco.doze android.permission.DUMP  You also need to grant WRITE_SECURE_SETTINGS permission:  adb -d shell pm grant com.franco.doze android.permission.WRITE_SECURE_SETTINGS  After these two permissions are granted youll be able to use Naptime freely. Q: I dont receive notifications or my music streaming apps stop working after screen off. Please halp! With Aggressive Doze doze is being forced after you screen off. Doze is, currently, the most powerful battery saving mechanism on Android.  The following restrictions apply to your apps while in Doze:  Only high-priority push notifications are delivered;  Network access is suspended;  The system ignores wake locks;  Standard AlarmManager alarms are deferred to the next maintenance window:  The system does not perform Wi-Fi scans;  The system does not allow sync adapters to run;  The system does not allow JobScheduler to run;  Apps like Gmail, which use normal-priority notifications, have them delivered during the maintenance window or when you wake up your device. This is standard behavior and cant be changed Although, you can choose apps to bypass doze. Go to Settings -> Battery -> overflow ->Battery optimization -> All apps -> Your app -> Dont optimize Thatll allow apps like Spotify to bypass the forced doze and actually work on screen off.  Q: Whats the Sensors app whitelist feature? It works together with the Disable motion detection feature and allows you to choose up-to one app (sorry, Android limits us to only one app) to request sensor information even if you disable motion detection. For example it allows apps, such as Google Fit, to query the accelerometer or gyroscope to count your steps.  Q: Why does my display, sometimes, blink once after screening on? This might happen if youre disabling the motion sensors. The reason for this is simple, for system brightness & auto-rotate settings to work after screening on they must be toggled on/off (otherwise they wont work) and therefore it may blink (even if its only for a couple milliseconds).  Q: My fingerprint scanner doesnt work when I disable the sensor motion detection! Unfortunately not all devices will work fine when disabling motion sensor detection and in the process some other sensors & functionality might stop working. Theres nothing I can do about it and your only option is to not use that setting enabled. Theres also some weird compatibility with LG phones where the display doesnt even turn on again if this setting is enabled. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.BLUETOOTH', 'android.permission.DUMP', 'com.android.vending.BILLING', 'android.permission.WRITE_SETTINGS', 'android.permission.WRITE_SECURE_SETTINGS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.DUMP', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_SECURE_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}