{
"name" : "QR Code Reader Free - QR Reader For Android",
"url" : "https://play.google.com/store/apps/details?id=com.maqr.barcode.free.qrandbarcodescanner.mavach.qrcode.reader.qrcodereader.qrcodescanner.quickbarecodescanner",
"package" : "com.maqr.barcode.free.qrandbarcodescanner.mavach.qrcode.reader.qrcodereader.qrcodescanner.quickbarecodescanner",
"category" : "Tools",
"description" : "QR Code Reader is the fastest & safest QR Code & barcode scanner!  QR Code Reader is able to scan all types of QR Codes and barcodes! QR Code Reader is simple & easy to use!    The free application to scan barcodes or any QR code reader easily from your camera for free! The QR reader or the QR Scanner application is a fast and free QR scanner for scanning, capable of scanning a wide variety of QR codes. The QR scanner application can scan the barcode and QR code using the camera on your phone. Just point your camera at the barcode you want to scan and the application will automatically detect it.  characteristics:   Supported codes: QR and barcode: EQS, Data Matrix, Quick Code, EAN8, Code39, Code128  It is easy to use, since it automatically detects and scans codes without even pressing a button, just points and scans.  Scan in a low light environment with the help of a flashlight. App The QR scanner application is capable of handling multiple types of results when scanning a code  If the result is a URL, you can click to open the web page. You can also configure the page to open automatically.  If the result is a Wi-Fi network, it will automatically connect to it  If the result is a phone number, you can call or send a message to that number.  There are many more actions that the QRR scanner application can enable you to perform once you scan the QR code such as purchases, funds transfer, map address, etc.  You can also create QR codes anytime and anywhere  Share the results of the QR code and the codes you create with your friends through SMS, WhatsApp, email, social networks, etc.  The application keeps track of all your scans and codes created in the History section for quick access and review.  The scanner application does not require a working Internet connection and offline functions as well.  The QR Scanner application helps you to send messages on Facebook, WhatsApp, etc. in the form of QR code.  You can share your Facebook Messenger link using the QR code using the QR scanner application.  The QR scanner application is available for free download on the Google Play Store! Download now and scan easily. An essential application for a simpler life.  If you want us to add some more features in the QR scanner application, let us know in the comments or send us an email. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}