{
"name" : "VPN Free - Betternet Hotspot VPN & Private Browser",
"url" : "https://play.google.com/store/apps/details?id=com.freevpnintouch",
"package" : "com.freevpnintouch",
"category" : "Tools",
"description" : "Betternet VPN is a free and unlimited VPN (Virtual Private Network) proxy for Android devices. Betternet VPN masks your IP address, encrypt your internet traffic, turns public Wi-Fi into a private network and helps unblock sites and apps on your Android phone so that you can access any restricted content safely and anonymously.   VPN (Virtual Private Network) works just like Tor proxy, also known as the Onion Router, to hide IP address and bypass internet censorship, to overcome geo-restriction and access the desired content. VPN (Virtual Private Network), however, has a much faster connection speed, and better privacy and security protection than Tor (the Onion Router).   Three main features of a VPN (Virtual Private Network):   Incognito Browsing: using a VPN you dont even have to install any incognito browser. Simply turn on your VPN and all of your Internet traffic is completely encrypted. Your online activities are completely anonymous.  Wifi Safety: because all your online traffic is encrypted through a VPN, whatever public WiFi hotspot you are trying to access, you will be shielded from public Wifi risks and enjoy complete Wifi security.   Location Spoofer: VPN hides your IP address so that your location is masked and you are able to bypass geo-restrictions to access any content anywhere.    Install Betternet VPN Now to:   Unblock Websites and Apps  You can unblock any apps or websites using Betternet free & unlimited VPN. Bypass government censorship and geo-restrictions to access social networks such as Facebook, Twitter, Youtube, and Snapchat, etc. or any other blocked websites from anywhere!   Anonymous Connection and Privacy Protection  Using a VPN, your IP and location will be masked and your activities can no longer be tracked on the Internet. Betternet VPN service is your privacy guard and better than web proxy servers.    Secure Your Device  Betternet secures your Android devices connection while youre connected to public WiFi hotspots or cellular data networks. It works just like a free Tor proxy (the Onion Router) but its even more secured. Your password and your personal data are secured and you are protected from hacker attacks.   Surf anonymously at Fast Speed  Betternet is fast! It detects your location automatically and connects you to the nearest and fastest server. As a result, your connection will be much faster than any other VPN or proxy providers.   Shield WiFi Hotspot  Public Wi-Fi hotspots are perfect places for hackers and if they happen to get a hold of your personal information, you could very well be the next victim of identity theft! Betternet VPN proxy uses advanced VPN technology to encrypt your network traffic, enabling you to connect to a website via HTTPS, providing a secured shield to your WiFi hotspot.  Betternet VPN free version shows ads. Upgrade to premium to enjoy unlimited and ad-free VPN!   Contact us  If you have any questions or suggestions, feel free to reach us on support@betternet.co or visit our website https://www.betternet.co for more information.   By the way, dont forget to follow our twitter account @betternet_co and Facebook http://fb.com/betternet.co to stay tuned. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'com.firstorion.android.roboshield.READ_WL', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.GET_TASKS', 'ANDROID.PERMISSION.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'ANDROID.PERMISSION.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'ANDROID.PERMISSION.ACCESS_WIFI_STATE', 'ANDROID.PERMISSION.CHANGE_WIFI_STATE', 'com.android.vending.BILLING', 'com.firstorion.android.roboshield.READ_WL', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}