{
"name" : "iZurvive - Map for DayZ & Arma",
"url" : "https://play.google.com/store/apps/details?id=com.innovaptor.izurvive",
"package" : "com.innovaptor.izurvive",
"category" : "Tools",
"description" : "Now with Arma 3 support! iZurvive provides you with DayZ and Arma 3 maps, lets you place tactical markers (player positions, tents, meeting points,..) on it and automatically shares those markers with the friends in your group - without the need for accounts, a registration or other services! Furthermore it provides a loot-map for DayZ.  Finding and coordinating your team in the huge open world of DayZ and Arma 3 has never been easier!   Features: - High-resolution offline map of Chernarus+ (DayZ Standalone) Satellite / Topographic - High-resolution offline map of Chernarus, Taviana Origins, Taviana and Namalsk (DayZ Mod) - High-resolution offline map of Tanoa, Altis, Stratis, Malden, Dingor, Fallujah, Kunduz, Lingor, Lythium, Malden, Porto, Sahrani, Takistan, Takistan Mountains, Taunus (Arma 3) - Lootmaps for all DayZ Standalone maps  - Map fully zoom- and scrollable  - Easy coordination of your team  - Share tactical markers with your groups  - Different marker types: player position, vehicle, tent, meeting point  - Join groups  - No registration or account necessary   Note that you will need to download at least one high-resolution map (Chernarus, Taviana,..), which will be stored on the SD-Card.  For any questions, or if you feel that we should really have a certain feature in the next version, please contact us: support@innovaptor.com    This app is for non-commercial use only.  ARMA 2 is a trademark of Bohemia Interactive  DayZ created by Dean Rocket Hall,  2012-2013, http://dayzmod.com  The map of Chernarus is for games by Bohemia Interactive (ARMA, ARMA II,...) and was obtained from publicly available sources. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}