{
"name" : "PDF Drive Pro: Powerful PDF Reader, PDF Viewer",
"url" : "https://play.google.com/store/apps/details?id=com.secrettown.pdfreader",
"package" : "com.secrettown.pdfreader",
"category" : "Tools",
"description" : "PDF Drive Pro is the best choose for you to check and display PDF files detectly on your mobile device.   If you have to work with many PDF documents, you must have a PDF Drive in your mobile device. Dont worry! With FREE PDF Viewer , you can display PDF files with your device in anywhere and anytime. Also, you can easy find them in PDF Drive app and open it quickly   Thats so amazing cause you will never miss any important document in the future!    Scan all and display PDF files with these easy and simple steps:  Choose a PDF file in your device  Choose this Powerful PDF reader as a PDF viewer tool  Or open PDF files that this PDF checker scans and list for you  And now your file is displaying on PDF Viewer 2020    What PDF Drive 2020 can do?   Scan and list all the PDF files stored in your device  Open PDF documents quickly  Display PDF files and easily Zoom in and Zoom out PDF file when reading  Gather and sort all PDF files as a PDF Manager  Quick search to all PDF files  You can go to any page by sliding left or right, or you can enter the page index to move to the page you want to read.  Share PDF files to anyone via email, bluetooth or social networking   Why you should go Premium?  In Premium version, you can access to all upcoming feature and no more being annoyed by ads in PDF Viewer.  Dont miss any important PDF document! Check it out now with best PDF DRIVE PRO   Download the best Powerful PDF READER 2020 NOW for FREE ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}