{
"name" : "Smart Alarm Clock - Offline Allarm",
"url" : "https://play.google.com/store/apps/details?id=com.apps.best.alam.clocks",
"package" : "com.apps.best.alam.clocks",
"category" : "Tools",
"description" : "We present you the BEST personalize alarm clock with the reminder/stopwatch tools that will wake you up with guarantee. Need to get up on time? Looking for the Stopwatch built-in timer stopwatch? Wanted the modern reminder? All these tools and much more with this app is available for free. Set it for the specific time and let the alarm gently start your day! Set this alarm clock and be pretty sure you will really never oversleep again. To get up always in the finest mood and make alarm off on time, use the next functions of this app:  Set the vibration signal and the reminder app gets you up very delicate. If you awake very hard in the morning use the random song alarm to make you rise and shine. The alarm wake suggests you an extra-large snooze button to stop it.  Get up not only your body but also your brain, passing math tests. You will not be stressed with the accidentally disabling alarm wake because only through passing math test you will be able to easily deactivate alarm.   To never oversleep again reduce different intervals of snoozing an alarm clock free and make it ring constantly.   Use the default ringtones of your phone and select one of them as a melody for you! Do maximum number snoozes and awake no matter how dead you are! Download your favorite songs if you are not crazy about the default ringtones and let them be an alarm notifications or reminder signal. Begin your morning with your favorite song!  Set the radio as random song alarm clock. Nice to start the day with the voice of favourite DJ! Dont be shy to set quick alarms! Your neighborhoods also need to get up and go working or studying!  If suddenly alarm clock free caused you to rise and shine even before just make an alarm off. Deactivate alarm wake with the one button tap.  Pay your attention to these alarm options:  Your device must be turned on to use the quick alarms. Set the alarm wake before off your phone. And set as maximum number snoozes clock as you need.  Personalize the alarm system: do not let the accidentally disabling alarm and set it to ring on certain days when you wanna get up.   Do not forget about the reminder and upcoming alarm notifications! They can be configured to repeat daily. If you need the set non-recurring alarm, just customize it.  Special features of free alarm:  Personalize alarm off and never screwed up, making full use of the ideal functionality of the alarm.  Use next options to stop an alarm clock: extra-large snooze button placed on the main screen to make alarm off.  Use a set non-recurring alarm clock when you are absolutely sure that you can get up and start your wonderful day without the alarm repeat.  Use the notification of an upcoming alarm if you got up earlier. Just easily deactivate alarm wake with one simple tap.  Use the timer stopwatch/built-in timer of the reminder if you have strict plans for a day and need smth to remember you about them.  Use the timer stopwatch function if you need to track the time. A nice simple inbuilt alarm stopwatch will do the job with an accuracy of a hundredth of a second.  Use a day planning function: forecasts and calendar events will be displayed thanks to the upcoming alarm clock every morning as notifications.  Use quick alarms as a time management tool. Track the notifications of your alarm wake before off your day.   Ready to install the alarm clock free? Tap the download button and join right now! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.vibrate', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.QUICKBOOT_POWERON', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.QUICKBOOT_POWERON', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FULL_SCREEN_INTENT', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE']",
}