{
"name" : "Sound Meter : SPL meter, dB meter, noise meter",
"url" : "https://play.google.com/store/apps/details?id=com.ktwapps.soundmeter",
"package" : "com.ktwapps.soundmeter",
"category" : "Tools",
"description" : "Sound Meter is also known as Sound Pressure Level meter (SPL meter) , noise level meter, decibel meter(dB meter), sound level meter or soundmeter. It is a very useful app to do a sound test or measure environmental noise(noise test).  The noise level meter or sound pressure level Meter(SPL meter) use the smartphone or tablet microphone to measure environmental noise in decibels(dB). The decibel(dB) value of this noise level meter or soundmeter might be vary compare with an actual Sound Meter(dB Meter). You can now easily perform a noise measurement with your smart phone.  Caution:  The value of decibel meter or soundmeter(dB meter) is not as precise as an actual Sound Pressure Level Meter(SPL Meter), soundmeter, decibel meter or noise level meter, this is due to most devices microphone are aligned to human voice. To fix this, use an actual sound meter or sound pressure level meter (SPL meter) to adjust decibels error as close as possible before use. If you didnt own an actual Sound Pressure Level Meter (SPL meter), go to a very quiet place where sound cannot hear and adjust the reading value to 20~30dB.  Feature: - Measure environmental noise - Real time update on chart graph - Display minimum(Min), maximum(Max) and average(Avg) Decibel(dB) in the recording session - Display measuring time - Reset Button is provided in case you need to reset the measuring - Play and Pause button is provided - Noise test or Sound test(decibel meter or dB meter)  Sound meter or decibel meter(dB meter) level of noise 140decibels : Gun Shots 130decibels : Ambulance 120decibels : Thunder 110decibels : Concerts 100decibels : Subway Train 90decibel : Motorcycle 80decibel : Alarm Clocks 70decibel : Vacuums, Traffic 60decibel : Conversation 50decibel : Quiet Room 40dB : Quiet Park 30dB : Whisper 20dB : Rustling Leaves 10dB : Breathing  A loud noise will be harmful for both your physical and metal health. You should avoid exposure to those environment. Let our soundmeter/noise meter to measure environmental noise. Dont hesitate to download Sound Meter to protect your and your familys health. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION']",
}