{
"name" : "CITIZEN CALCULATOR",
"url" : "https://play.google.com/store/apps/details?id=com.vpn.basiccalculator",
"package" : "com.vpn.basiccalculator",
"category" : "Tools",
"description" : "CITIZEN CALCULATOR by ANGEL NX is best Mobile App all over the world and More Than 10 Million Users.  We are Angel NX. We make CITIZEN CALCULATOR gives you functions that you can see in CITIZEN CALCULATOR and GST CALCULATOR with New GST Tax Rate Calculations by Just One Click.    CITIZEN CALCULATOR App Key Features :-  * CITIZEN CALCULATOR * GST CALCULATOR OR TAX CALCULATOR * LOAN CALCULATOR * UNIT CONVERTER * CURRENCY CALCULATOR * COMPASS * AGE CALCULATOR  CITIZEN CALCULATOR   CITIZEN CALCULATOR is one of the best Calc with many features same as CITIZEN CALCULATOR for your regular use. Calculate like Citizen Calculator and many other calculators. You can use Citizen Calculator as a Business and financial Calcs also has features with GT, GT, M+, M-, MR, MU (Mark Up) which are used to get profit ratio when you want to give discounts on your products. gives your some options of scientific calculator.  GST CALCULATOR OR TAX CALCULATOR  GST CALCULATOR gives all functionality of GST and TAX Calculation for All country with just one Single Click. Get results calculated as you type.  We Give Two Button ADD GST and SUBSTRACT GST.   * ADD GST or TAX :- Calculate any Number of GST or TAX like +3%, +5%, +12%, +18%, +28%,+1, +2 , +15, +0.1, + 40.8, Etc.  * SUBSTRACT GST or TAX :- Calculate any Number of GST or TAX like -3%, -5%, -12%, -18%, -28%, -6, -1, -0.9, -17.6, - 33.3, Etc.  LOAN CALCULATOR  Citizen Calculator also has feature of Loan Calculator by which you can calculate Loan EMI, Loan amount, Loan interest rate, Loan period, Loan Installment Amount and Calculate EMI on monthly and Yearly basis..   WHERE TO USE:  * Personal Loans * Home Loan * Mortgage Loan * Business Loan * CC or Overdraft Loan * Auto Loan * Business Overdraft  UNIT CONVERTER   Citizen Calc is also with feature of Unit Converter.   Unit Converter Features with Many Units :-  1. Area :- Square Kilometer, Hectare, Square Meter, square Mile, Acre, Square yard, Square Foot, Square Inch. 2. Length :- Kilometer, Meter, Centimeter, Millimeter, mile, Yard, Foot, inch, Nautical Mile. 3. Temperature :- Celsius, Fahrenheit, Kelvin. 4. Volume :- Cubic meter, Liter, Milliliter, Cubic Foot, Cubic Inch, Imperial gal, Imperial pint, US gal, Quart, Pint, Cup, Oz, US tbsp, tsp. 5. Mass/weight :- Metric Ton, Kilograms, Gram, Milligram, Mcg, Long Ton, Short Ton, Stone, Pounds, Ounce, Tons. 6. Speed :- Miles/hour, Feet/Sec, Meters/Sec, Km/hour , Knot. 7. Fuel Consumption :- MPG (US), MPG (imp.), km/liter , liter/100km, etc. 8. Digital Storage :- Bit, Byte, Kilobit, Kilobyte, Megabyte, Gigabit, Gigabyte, Terabit, Terabyte, Petabit, Petabyte. 9. Time :- Nanosecond, Microsecond, Millisecond, Second, Minute, Hour, Day, Week, Month, Year, Month, Year, Decade, Century.  CURRENCY CONVERTER  Currency Converter is best for live exchange rate. We put + Sign, Select more than one country so you can show more than one countrys exchange rate at a time.   All Country Currency included European Countries, Asian Countries, American Countries , African Countries, Middle East, like USA, Canada, India, Australia, Uk , China, Japan , Pakistan, France , Germany, Spain, Indonesia, Tanzania, Mali, Bangladesh, Nepal, South Africa, Brazil, Malaysia, Saudi Arabia, UAE, and many more.  DIGITAL COMPASS  Digital compass is with Longitude and Latitude and its Simple to use. Use it like a real compass. Professional design with incredibly smooth movements with True North.  AGE CALCULATOR  Age Calculator is one more best Feature of Citizen Calculator App Where you can calculate your Age in Year, Month, Weeks, days, Hours, Minutes and Second. Also you can show your Next Birthday by Days for many years.  SETTING  By Help of setting Button you can set your requirement Like Sound and Vibration. You can ON/OFF Sound and also ON/OFF Vibration.  Any suggestion from user is welcomed. If you like our Mobile APP Please give your best rating to Citizen Calculator and share it with your friends and Groups. Thanks. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}