{
"name" : "Stopwatch & Timer",
"url" : "https://play.google.com/store/apps/details?id=com.zabamobile.sportstimerfree",
"package" : "com.zabamobile.sportstimerfree",
"category" : "Tools",
"description" : "A large clear digital timer and stopwatch with speaking lap function ideal for all your timing needs from the kitchen to timing sports events.  General  Large clear LED display - Great for the partially sighted and for those wanting to see the display from further away (the running track).  Beep feedback  Custom colour  Auto size to screen  Device size specific layouts makes the most of your device.  From the makers of the popular Digital Alarm Clock  TImer  Multiple countdown timers (great as a kitchen timer) with background service (continues when app is closed)  Up to 99 hours   Stopwatch   Lap function  1/10ths second (1/100ths available through in app unlock)  Speaking lap times  Last lap time display  Optional hours and millisecond display   One touch control, easy to use interface, no complicated menus or cluttered layout.  We are very open to suggestion and take all feedback seriously so please do email/comment in the market and we will do our best to include the ideas in future suggestions.  You may also like our Digital Alarm Clock application - check out our other apps for more information.  Unlock the pro features in app and get the following great features as well as supporting development:   Unlimited timers. (2 when locked)  Milliseconds to 3 decimal places.  Removal of advertisements.  Stopwatch up to 99 hours (10 hours when locked)  We have tried to make adverts as unobtrusive as is possible. Please appreciate that ads support our development. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.zabamobile.sportstimerfree.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.DISABLE_KEYGUARD', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.DISABLE_KEYGUARD', 'com.android.vending.BILLING']",
}