{
"name" : "Gallery",
"url" : "https://play.google.com/store/apps/details?id=com.threestar.gallery",
"package" : "com.threestar.gallery",
"category" : "Tools",
"description" : "Gallery - Phone Storage App Beautiful 3D gallery with latest graphics instead of old one. Use special gallery color gallery app for photos, hot videos, movie collections gallery top rated. gallery is smart gallery, format galleries, collection Gallery with this android gallery google play store Arrange order of gallery items based on your selection. QuickPic gallery collection for fast user interface. Gallery download free app is the well-designed gallery replacement for the built-in phone gallery app for tami a1. Special animated gallery look. Smart Gallery Photo Viewer, Gallery Video Viewer. Enjoy with unlimited gallery video and images for show your friends and others. Gallery for SD card android phone app Special Gallery collections of your smart phone. You can share your pictures to social networks like Facebook, whatsapp, twitter etc. Configurable thumbnail size/colors photo. gallery for mo g4 automatically backed organized. Its great galleria, photography galleries, dato, sb & photo album app for your mobile. it is the gallery pro app. it is the gallery new version 2020 Phone .  Key Features Special Features  - Create an photo albums in gallery pro. - Create Albums and choose best photos of yours into secret folder. - Selfie Camera photo albums gallery hd. - Crop photo view. - gallery you video and pics - Custom Effects on photo & background. - Slide show animation with unlimited photo pics of secret gallery vault for mini e4 plus. - Set as Wallpaper. - Open photo with preferable apps. - Use as photo app inbuild function. - Show photo details. - gallery 3d can Change Theme color from setting. - Beauty Camera Effects on favorite gallery images. - Create effects like photo filter effects based on device. - gallery mot app Multi selection of move & copy paste files. - Customize Background Color. - gallery private able to select image from outside gallery. - rotate image. - gallery pro zoom - gallery calculator for photos and videos. - open gallery camera app. - gallery editors choice free app  1) Video Player With Gallery apps - Supported all video formats and you can say like flv video player, mp4 video player, avi video player etc. - Best Gallery video player. - Easy to handle any videos. - HD video Player with beautiful looks. - Smooth gallery user interface.  2) Photos  - able to show unlimited video grid. - zoom in and zoom out photo filters. - Edit or rename as default gallery photo. - Rotate photo backgrounds. - Share to social networks from gallery. - Sort by Option.  Sort by Name, Sorting by Date, Size wise Sorting, Ascending/Descending Sorting photo grid. - Fast refresh gallery collections. - Professional gallery looks.  3) Gallery Lock  - Gallery Lock for security. - Go to Setting & Create PIN along with security question. - Make you photos and videos collections private by using lock for gallery. - Lock seems like user can hide private photos like girl friend photos, hot photos, naughty photos, dirty photos, secret photos. so Gallery app is the strictly confidential, top secret, hidden application.  - Create Security question and use it if forgot password. - Modern gallery app lock. - Gallery Photo Vault Added: Hide Media now. - You need to create Security Question & Password for Vault from Setting/Vault Button. Note:Security Question & Password are both separate for Vault & Gallery Application Lock  Important Features  - Video Status - Photo Collage - Quotes - Video Editor - Photo Editor  Note : SD card operation supported from lollipop and above android versions. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SET_WALLPAPER_HINTS', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}