{
"name" : "Screenple Screenshots",
"url" : "https://play.google.com/store/apps/details?id=com.screenple.screenple",
"package" : "com.screenple.screenple",
"category" : "Tools",
"description" : "NOW WE SUPPORT LONG SCREENSHOTS ALLOWING YOU TO CAPTURE ENTIRE CONVERSATIONS IN JUST ONE IMAGE;   Screenple is the best screenshot app available taking screenshots to a whole new level providing powerful tools to take, manage and use your screenshots as always accessible practical notes.  The free cloud backup gives you the tranquility you need so that you can count on recovering your screenshots even when you replace your phone.   Main features:   Screenshots organizer: super easy way to take, collect and organize screenshots;   Editor to add text, lines and shapes to your screenshots;   Download entire web pages and handle them as big screenshots easily;   Copy and paste text to save them as notes;   Choose the way you want to take the screenshots: traditional combination of power and home button, long press on home button , floating button , notification message ;   Save screenshots capturing whole chats, articles, recipes etc. that you can share with your friends;   Automatic crops suggestions and easy manual cropping also available;   Select any text from your screenshot - You can copy, mark it and hide it;   Share your screenshots individually or as a photo collection where you can add title and notes;   Combine multiple screenshots in one single image;   Optionally add labels to categorize your captured screenshots;   Use notes to add information to be stored with the captured screenshots (tip: double tapping on the cards is a shortcut to add notes);   Easily navigate through all your screenshots, filter them by label or use text search to find words in the screenshots or within the notes;   Use the full screen view mode (activated with double tap on the image) for a better view of the screenshot (optimized for barcode scanners);   Never lose any of your screenshots and notes, click on the cloud button and start using the free automatic backup to your Google Drive. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.USE_CREDENTIALS', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}