{
"name" : "GPS HUD Speedometer Free",
"url" : "https://play.google.com/store/apps/details?id=com.ascendapps.aaspeedometer",
"package" : "com.ascendapps.aaspeedometer",
"category" : "Tools",
"description" : "Like us on Facebook! https://www.facebook.com/ascendapps  AASpeedometer is an advanced speedometer application that uses the mobile devices built-in GPS system to show your current, maximum, and average speed, as well as your direction, total distance, time traveled, and much more. Keep track of your location and speed simultaneously while driving, running, or biking with our innovative multi-view display.  AASpeedometer Provides:  Improved Accuracy* - A GPS-based speedometer often exceeds the accuracy of a car speedometer.  Multiple Views - Choose from five (seven for the plus version) different skins including our featured Compass view.  HUD Mode - Mirror the display to see your speed reflected on your windshield when you place your phone on your cars dashboard  Speed & Distance Updates - Hear your current speed and/or driving distance.  Speed Alerts - Set up to three alerts that will notify you when you go over a preset speed.  Detailed Route & Statistics Summary Reports - Record your traveled route and speed at any given point. (Two weeks trial)  Unit Systems - Displays in kilometers, miles, or nautical miles.  Acceleration Test - Supports zero to sixty mph and zero to quarter mile time tests. (Two weeks trial)  Save Your Location - Save and find your way back to your current location at a stop or on the go (Two weeks trial).  Google Navigation with Speed Display - Check your speed while using Google navigation. (Two weeks trial)  Import & Export Data. - Save to or load your data from an SD card.  GPX and KML Track Export - Export your saved routes through e-mail.  * Accuracy may depend on mobile device hardware , weather conditions, obstructions, and the visibility of satellites.  The current version will show ads. Please visit our sponsors ads from time to time to support our development.   Want more features and no ads? AA Speedometer Plus is the answer: https://play.google.com/store/apps/details?id=com.ascendapps.aaspeedometer.pro  We welcome your comments, suggestions, or bug reports. You can contact us at admin@ascendapps.net. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}