{
"name" : "QR code scanner for android & Bar-Code,qr-barcode",
"url" : "https://play.google.com/store/apps/details?id=com.gomin.qrcode.barcode.scanner.reader",
"package" : "com.gomin.qrcode.barcode.scanner.reader",
"category" : "Tools",
"description" : "qr scanner is one of the fastest scan app for android and professional escaner, bar-code on the market  You want to find information about products, you want to check the origin and related information about the product? You want to check the detailed data of the barcode on the product you are about to buy or simply want to check if the product is authentic or fake. All will become extremely easy if you use our qr scanner application. qr scanner free is the fastest scan app for android and escaner for smart phone available on market so you can access product information easily.  Main features of the qr code scanner app   Support reading bar-code and qr scanner quickly and accurately  This is a smart qr code scanner for android that identifies the barcode, qr code by scan app for android reader and scanner  Support light in cases of escaner and bar-code in low light environments or insufficient light  Help get information about the product you care about in a quick and extremely simple way  In addition, you can create your own qr scanner easily  More Features of scanner app free   Automatically identify scan app  Returns information accurately and almost instantly  Helping you become a smart consumer can access product information  Create your own escaner for your product, making it the fastest access to users with just a qr scanner app  Instructions for using qrafter  You can use our bar-code application easily if the phone you are using is a smartphone that supports camera shooting. You just need to open the bar scanner app application, scan the bar-code or QR code, our escaner app will automatically recognize any scan app Immediately after scanning the bar-code or QR code, the qr scanner application will return the most accurate information about the scanned product, from the manufacturer, the product name, the price of the product even the country of origin. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE']",
}