{
"name" : "KinScreen 🥇 Most advanced screen control",
"url" : "https://play.google.com/store/apps/details?id=com.teqtic.kinscreen",
"package" : "com.teqtic.kinscreen",
"category" : "Tools",
"description" : "Do you find yourself poking your screen to keep it from turning off? Want to turn your screen on without the power button? KinScreen automatically keeps your screen on while youre using your phone, but turns it off more quickly when you arent to save battery power.  Please check www.dontkillmyapp.com to make sure KinScreen is able to run in the background!  Works on Android 10!  Brief overview  Turn screen on with a wave  Turn screen off with a short timeout when in pocket or face down  Keep screen on just by holding device  Keep screen on while using certain apps  Keep screen on while charging  Keep screen on while on a call  Keep screen on indefinitely with widget, QuickSettings, or notification toggle  Set a separate timeout for the lock screen  Set a maximum time to keep the screen on  Works in the dark unlike Samsungs Smart Stay  No ads  Install now and forget about keeping your screen on! Once you feel the benefits, you will immediately notice it missing on a new device!  Customer service is a top priority at TEQTIC. If you experience an issue, please use the Contact support menu option inside the app or email contact@teqtic.com before leaving a negative review! We usually reply to all emails within 48 hours, and often much quicker.  Detailed overview Turn screen on with gestures Save the wear and tear on your power button when you turn the screen on by uncovering or waving over the proximity sensor. Uncovering the sensor allows you to pull your phone out of your pocket and have the screen turn on automatically. Waving over the sensor works great when your hands are dirty!  Keep screen on automatically Choose from various methods to detect use of the device and keep the display on. The motion method detects small movements from you just holding the device. Waving over the proximity sensor is another method that optionally extends the timeout. The tilt angle method allows the display to stay on when propped up, even when you arent holding it. You can also choose to have the display stay on while using certain apps, while charging, or while on a call (display still turns off when you put the phone to your ear).  Time screen out quickly to save battery You can choose the screen timeout when no keep-on rules are actively keeping the screen on. If the screen isnt being kept on, it should time out quickly to save power. The timeout can be even shorter when the proximity sensor is covered (in-pocket or face down). You can also set a separate timeout for the lockscreen.  More information The settings are highly customizable to your taste. Fine-tuning of parameters is locked in the free version. Please upgrade to premium to fully unlock these features and support future development! KinScreen is continually being improved based on user feedback and feature requests.  KinScreen is designed to be as efficient and battery friendly as possible. It uses little CPU and RAM, and sensor use is highly optimized. However, the proximity sensor may use considerable power on some devices.  KinScreen will not interfere with any other apps that already keep the screen on since it never actively turns it off.  The status bar icon changes based on if KinScreen is keeping the screen on, timing out, or timing out more quickly due to proximity. Inside the app, the colored statuses at the top give you even more insight into what KinScreen is doing. A green status is keeping the screen on, a red status is timing the screen out, and a yellow status would be keeping the screen on but there is another rule preventing it.  To calibrate motion sensitivity, please set the device on a very stable surface, tap calibrate and wait 10 seconds for KinScreen to automatically fine tune the motion sensitivity for your device. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.READ_PHONE_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.PACKAGE_USAGE_STATS']",
}