{
"name" : "Ebook Converter (EPUB, MOBI, FB2, PDF, DOC, ...)",
"url" : "https://play.google.com/store/apps/details?id=com.daemon.ebookconverter",
"package" : "com.daemon.ebookconverter",
"category" : "Tools",
"description" : "Convert your documents into the (FB2, AZW3, LRF, TCR, SNB, RB, PML, PDB, OEB, MOBI, LIT, EPUB) eBook format.  Simply select the files you want to convert and click Convert.  Upon conversion you can use them on the device or transmit in any way available with your device.  We are constantly developing our app and pay attention to your wishes. Therefore, if you have any comments or suggestions - write to us, we will try to implement them (if possible).  For instance, we implemented such functions as: 1. Adding the book author and title. 2. Adding your cover. 3. Sending all the results at once. 4. SD card support.  For better application development and maintenance, we have imposed restrictions on the number of files at a time and the files size in the free version. We hope that you will appreciate our work and will be able to support us if you need our application.   You can use the converter, for example, like:  * doc to fb2 converter * epub to mobi converter * epub to pdf converter * mobi to epub converter  Or convert formats such as:  * convert pdf to epub  * convert pdf to mobi * convert epub to mobi  * convert txt to epub  * convert cbr to pdf, cbz to pdf   Briefly about the conversion: *. Conversion occurs on the server. Therefore, your files will be downloaded to the server via the Internet. Accordingly, the application will not work if there is no internet. *. The server will perform the conversion using Calibre. *. The result will be downloaded automatically to your device in the specified folder. *. The original file will be deleted at the end of the conversion, the result will be deleted after 1 hour.  We do not use your files in any way.  The Electronic Book Converter will help you to convert your (DOC, DOCX, PDF) documents or (FB2, EPUB, LIT and etc) e-books into formats supported by (TXT, PDF, AZW, MOBI) Kindle e-books: epub to mobi, epub to pdf, pdf to mobi, doc to mobi, epub to azw.  You can convert almost any book format into one of the most common EPUB (Electronic PUBlishing) formats, we support conversions such as: pdf to epub, mobi to epub, fb2 to epub, azw3 to epub, doc to epub, lit to epub, txt to epub.  You can also convert your documents to FB2 format, for example: pdf to fb2, docx to fb2, doc to fb2  The resulting e-book can be larger than the original format, as well as not meet your expectations.  Therefore, if you are not satisfied with the result of the conversion, but it has passed  please, contact us, we will try to convey your wishes to the Calibre developers.  If you have a PDF consisting of images - then both us and Calibre developers do not recommend converting it into the e-book format. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MEDIA_CONTENT_CONTROL', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.MANAGE_DOCUMENTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MEDIA_CONTENT_CONTROL', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MANAGE_DOCUMENTS', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}