{
"name" : "Nobø Energy Control",
"url" : "https://play.google.com/store/apps/details?id=com.nobo.noboenergy",
"package" : "com.nobo.noboenergy",
"category" : "Tools",
"description" : "Lower energy consumption and higher heating comfort has never been easier. With Nobo Energy Control app for tablet and smartphone, you can control your heating from anywhere.  Nobo Energy Control is a wireless energy control system that allows the entire family to control the heating in their home using a smartphone or tablet.  Nobo Energy Control is quick and easy to install. You can easily set up your own heating programs and schedules for individual zones in your home.  Lower energy consumption.  Nobo Energy Control can reduce the cost of heating by up to 25 %. Full control of your heaters makes it easy to reduce the temperature in rooms you do not use, or to control them remotely via an app regardless of where you are in the world.   Control via Internet  Interface on app or local switch panel (Nobo Switch)  Easy to program  Frequent software updates  Reduces the cost of heating by up to 25 %  See www.nobo.no/en/ for more information   Key features:  Organises heaters, lights and appliances in ZONES (functional groups).   Each zone has a Normal Weekly Program defined by the user, with four possible settings available (COMFORT, ECO, AWAY and OFF). The Normal Weekly Program runs automatically, saving electricity and money.  System override at a single touch on APP, when short term changes are needed.  Multiple users can operate the same system.  COMFORT and ECO Temperatures can be set individually for each zone, depending on the type of system units. AWAY equals frost safe temperature 7C.  System units (heaters etc.) can be added and removed at any time.  System units (heaters etc.) can be moved between zones.  System units (heaters etc.), zones and weekly programs can be named and renamed.  System capacity: - 500 zones - 500 system units - 200 weekly programs  System requirements:  Wireless network.  Nobo HUB Central unit.  Nobo Signal receivers for each heater or device.  Compatible with Nobo NCU-receivers, Nobo Orion 700 receivers and Dimplex DCU-receivers (Full list of receivers: http://help.nobo.no/en/user-manual/before-you-start/what-is-a-receiver/list-of-receivers/ ) See www.nobo.no for more information.  Contact information: For support with app related issues (crashes, bugs etc.): appsupport@glendimplex.no For support with system related issues (Nobo ECOHUB, system units etc.): support@glendimplex.no ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.NFC', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BROADCAST_PACKAGE_REMOVED', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.NFC', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BROADCAST_PACKAGE_REMOVED', 'android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE']",
}