{
"name" : "Service Reports+",
"url" : "https://play.google.com/store/apps/details?id=com.service.reports",
"package" : "com.service.reports",
"category" : "Tools",
"description" : "A complete, fast and functional tool for Jehovahs Witnesses, JW, to record and report the time spent in the field ministry.  This is the advanced version of the Service Report app for JW. It keeps a clean and simple design, with all the previous features like:   send report via SMS, email or third party app like whatsapp  use a stopwatch   set monthly or yearly goals for pioneers  LDC time (available in the settings)  automatically count the exact number of bible studies  round (up or down) the hours at the end of month  works totally offline, no internet connection needed  And add new features:  Full return visits managements  Support for multi-publishers  Google Drive Backups  It also has specific features for the congregations secretary and the field service group overseers:  Manage irregular, inactive or publishers with overdue reports  See total and average reports for publishers, auxiliary and regular pioneers  Congregation meeting attendance record  Congregation Analyse report  Autofill the forms: S-21, S-1, S-4 and S-88  The app doesnt provide these pdf files with acrofields. Each elder has to download his own files from jw.org. Please note they may not be available in your country yet.   For anyone who wants to help translating, please go to settings then tap language. The app will create a complete list of words to be translated.  I thank everyone and especially Jehovah God who gave me the help I needed to make this application (Psalms 127:1).  JW. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.READ_CONTACTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.WRITE_CONTACTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_CONTACTS']",
}