{
"name" : "Working Scale Free",
"url" : "https://play.google.com/store/apps/details?id=com.sciencewithandroid.workingscalefree",
"package" : "com.sciencewithandroid.workingscalefree",
"category" : "Tools",
"description" : "Working Scale Free uses your phones sensors to measure the mass (or weight) of a small object placed on it. The minimum mass you can measure accurately with typical Android devices is about 5 grams. Best results can be obtained for masses between about 10 and 100 grams.   If you place your Android device on a carpet and gently push down on one end with your finger, it will come back to its original position after you remove your finger. The carpet has spring-like properties. This app is designed to make use of the spring-like properties of common objects in combination with a known mass (a calibration mass) to measure an unknown mass. It tracks your devices changing angle using its built-in motion sensors. You prepare your Android device by placing a calibration mass near one end while it is resting on a spring-like object. After this step, the mass of any small object placed on top of the calibration mass can be determined.  Here are the steps you should follow to get the best results (see help page in app for additional suggestions):  1. Place your Android device face-up on a carpet, sofa cushion, slightly inflated Zip-lock bag (good), flexible ice pack(s) (best), folded towel, or any other springy object. It helps to place a small piece of paper on your Android device where you plan to place the calibration mass. This makes it less likely that it will slide.  2. Press the Start button. Do not touch the device again until it commands you to place the calibration mass on it.  3. For users in the USA, we recommend using at least one quarter for the calibration step (but two quarters is better). You should use more coins for larger devices. You should easily notice movement of the device when you place the coin(s) on it. You can look up the mass of a quarter (or other coin) on the US mint coin specifications web page (http://www.usmint.gov/about_the_mint/?action=coin_specifications). Watch the progress bar and make sure you place the coin(s) on the device after the progress bar begins moving, and make sure the device stops moving before the progress bar reaches the end. You can enter the mass of the calibration mass in the Settings page prior to starting your calibration and measurements. There, you can also enter the number of calibrating masses (for instance, one, two or three coins). As a general rule, the mass of your unknown object should not be too different from the total mass of your calibrating masses.   4. We recommend you place the calibration mass near the top center of the Android device.  5. After the calibration step, place your unknown on top of the calibration mass. The accuracy is at best 0.1 gram; more often a single measurement will have an accuracy of 0.2 - 0.3 grams, but it will depend on the setup. You can run your own tests of the accuracy by placing known masses on the device.  6. When you are done, press the Stop button. If you would like to measure more objects, you will need to repeat the above steps. Press the clear button to reset the displays to 0.00.  7. It is recommended that you enable the averaging display. It displays the average of every 10 measurements.  Be careful when trying to measure liquids that you do not spill any on your Android device.  If you have any suggestions for improvements or just want to share with us your interesting project with this app, please contact us at ggonzo47@gmail.com  Use Working Scale Free for science experiments, measuring small quantities of ingredients for a recipe, or making a game of guessing masses or weights.  The accuracy is about +/- 0.2 grams. This is NOT a gag app!  Working Scale Free is ad-supported. If you find this to be a helpful app, please consider supporting us by installing the pro version. It lacks ads, includes a second completely independent method to measure mass, a save button, and history. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.READ_EXTERNAL_STORAGE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS']",
}