{
"name" : "Scan MyPeugeot App",
"url" : "https://play.google.com/store/apps/details?id=com.peugeot.scanmypeugeotapp",
"package" : "com.peugeot.scanmypeugeotapp",
"category" : "Tools",
"description" : "A user guide at your fingertips.  This application is available for the Peugeot models New 3008 SUV, 308, 308 SW and 108. Other Peugeot models will soon be added to this list.  With Scan MyPeugeot, you can access your vehicles handbook on your smartphone. The Scan MyPeugeot application enables you to quickly access all the information from the corresponding user guide, using the various tabs: - Scan your vehicle with the smartphones camera lens, click on a recognised component to display information on it - Visual search using identification markings on images of the vehicle, click to display the details - Warning and indicator lamps provides you with information on each type of alert and displays the initial advice to be followed  A personalised application: Once the application has been installed, you will be asked to enter details of your vehicle and to select some of the distinctive features of your trim level to download the relevant information from the handbook.  Advantages of the Scan MyPeugeot application: - Visual recognition - It can be used in offline mode, after you have downloaded the information from the handbook for your vehicle - User guide for the warning and indicator lamps - Access to information on all the functions of your vehicle by navigation using the visual search  Once you have downloaded the application, refer to the legal notices for more details about the conditions of use of the application. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.mirrorlink.android.service.ACCESS_PERMISSION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERACT_ACROSS_USERS_FULL']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.mirrorlink.android.service.ACCESS_PERMISSION', 'android.permission.INTERACT_ACROSS_USERS_FULL', 'android.permission.ACCESS_FINE_LOCATION']",
}