{
"name" : "QR Copy",
"url" : "https://play.google.com/store/apps/details?id=com.magnuswikhog.qrcopy",
"package" : "com.magnuswikhog.qrcopy",
"category" : "Tools",
"description" : "QR Copy lets you quickly and securely copy text or files from your mobile device to any other device that has a browser and an internet connection. No need to create an account, login, remember passwords - in short, zero configuration!  The idea behind this app is simple. Lets say youre at a public computer at work, school or in the library. You want to log in to your email account, but your password consists of 20 random characters (as it should!). You can either painstakingly type it in and pray that you got it correct - or you can send it to the browser with QR Copy in a few seconds!  Yes, QR Copy is safe to use even for confidential data like passwords, since your data is sent via an encrypted SSL connection and only has a limited lifespan before it is deleted from our server. We wont sell, share or disclose your information to any third party.  With our Premium subscription you can even send files directly from your phone to any browser - perfect when you need to get a photo, PDF or any other file quickly and hassle-free from your mobile device and onto a laptop or desktop computer. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}