{
"name" : "Ram Booster Pro - Cleaner 2020",
"url" : "https://play.google.com/store/apps/details?id=com.masterappsstudio.ramcleaner.speed.booster.rambooster",
"package" : "com.masterappsstudio.ramcleaner.speed.booster.rambooster",
"category" : "Tools",
"description" : "Is your phone become slow, leggy or out of space? If so, Ram Booster Pro is just the most trusted speed booster & Cleaner you need.  Ram Booster Pro - Cleaner is a super fast Ram Booster, Speed up memory, Super Cleaner, Cache Cleaner, CPU Cooler, Cooler Master and kill all extra Back running app and increase ultimate boost fitness of your device. With this Ram Booster, you can boost your phone speed by cleaning Ram and save battery usage that makes your battery last longer, and can help you get more battery life for your Android phone!. Enjoy this beautifully designed One tap Ram Optimization, Cleaner Master, Super Cleaner, Battery Monitor & Battery Saver and Booster app. Ram Booster Pro behave as a super easy Cleaner and enhance battery life and make your phone fast and cool like a flash!  --- Features of Pro Ram Booster 2020-- START BOOSTING Pro Ram Booster can boost up RAM & clean up Junk files to boost your phone in average of faster. Simply tap START BOOSTING button to boost your phone with one click and Boost all selected back running threads. It can even save battery and Indicates your phone speed with percentage. It will also resolve All RAM Threads & errors on clicking.  Lite but Powerful  Phone Booster is very lite but powerful tool  Easy to Use Just one tap the Start Boosting button to speed up your phone and keep your phone clean and fast. Ram Booster Pro also works on android 7.0 or higher. This app is completely free, easy to use. Boost My Android aims to be the best Android speed booster & junk cleaner app, your 5-star drives awesome work!  Friendly Interface - Simple and easy interface  - Pure material design - Users can choose which apps to kill - Detailed of listed running apps  RAM OPTIMIZER - POWERFUL  - RAM optimizer work wonders on only single tap! Its very lite in use but very powerful tool  BATTERY SAVER & BATTERY MONITOR  Monitor all apps that drain power while not in use and remind user about high consumption apps. Indicates how much battery power will be extended if you use One-tap saving. Monitor all running-apps power consumption and list you the detail to app manager, Battery Monitor, clearly shows the status of battery life and usage  WiFi BOOSTER  - Boost your connection speed - Optimization 3G/4G/WiFi connections - Boost WiFi Signals for Games and videos - Adjust channel WiFi connection faster wireless Internet - DNS Cache cleaning for increased Internet speed ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.INTERACT_ACROSS_USERS_FULL', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.RESTART_PACKAGES', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RESTART_PACKAGES', 'android.permission.INTERACT_ACROSS_USERS_FULL', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION']",
}