{
"name" : "PDF Reader Pro-Read,Annotate,Edit,Fill,Sign,Scan",
"url" : "https://play.google.com/store/apps/details?id=com.pdftechnologies.pdfreaderpro",
"package" : "com.pdftechnologies.pdfreaderpro",
"category" : "Tools",
"description" : "* The worlds No.1 PDF reader app on Apple Mac App Store * Installed on over 70 million devices in over 200 countries around the world * Best Education app  EducationalAppStore.com  Get the all in one PDF office to view, comment, edit, sign, fill form, and share Adobe Acrobat Reader PDF on smartphones, tablets, and even on PC/Mac.  Reliable, stable and fast PDF viewing engine and smooth liquidtext navigation. Complete PDF support and compatible with Adobe PDF Reader Pro and other PDF viewer (such as Xodo, Foxit, PDF Expert, PDFelement, GoodReader, Kami) supporting standard PDF annotations.  With a light, clean and easy-to-use interface, PDF Reader Pro Edition for expert may be your last, best, fast pdf editor for you to work with professional PDF files anytime, anywhere. More particularly, it is completely free pdf markup tools for you.  Good Reader  Display Mode - Enjoy continuous vertical / horizontal scrolling while viewing in single page, two pages modes, full-screen reading pdf mode  PDF Search - Full text search with navigable, detailed list of search results, high levels of zoom  Jump to Page - Jump to a specific Page No, fast page navigation return, lector pdf  Bookmarks - Bookmark specific pages or sections of PDFs  Outline - A PDF table of contents allows you to jump chapters and sections  5+ themes embedded, includes Day & Night mode switcher, moon reader  Open password-protected PDF files  Print PDFs   PDF Annotator  Classic Markup PDF Tools - Annotate PDF with highlight, underline, squiggly, strikethrough / strikeout, notes, ink, freehand, text box and more. Add comments continuously   Sign - Create multiple signatures with handwritten and image signatures  Links - Add hyperlinks to redirect other destinations(URL, Email & Pages)   Stamps - Customize your PDF files with standard and custom stamps(Text Stamps & Image Stamps)  Images - Insert images on the PDF files and place where you want it to be  Form Filler  Work with static PDF forms created in Adobe Acrobat.  Fill out any PDF forms with interactive fields such as text fields, checkboxes and etc  Page Editor  Organize PDF pages - Renumber, reorder, arrange or edit PDF pages easily by drag and drop a page  Rotate - Rotate one or more pages casually  Split / Extract - Smoothly extract pages from the PDF document and automatically save in a new folder  Scan to PDF  Image to PDF Converter - Use free PDF file Reader Pro scan to turn images, receipts, notes and more into PDFs  PDF Creator - You can create pdf file from multiple images  PDF Scanner - Use your camera to capture paper documents, or open an existing image to create a PDF (tiff, jpeg, gif, png)  Organize/Manage Files  Rename, copy, move, or delete docs and folders with PDF Readers built-in file manager  Enable to read the Adobe & Foxit PDF files, documents, and books stored in your SD card  Flattened file: Flatten PDF to make the contents static  Support to get files in SD card and USB flash disk  Share  Easily share files with your friends, classmates and colleagues via email  Pleasure to hear from your feedback and suggestions: support@pdfreaderpro.com  or check out https://www.pdfreaderpro.com Twitter - https://twitter.com/PDFReaderPro  Facebook - https://www.facebook.com/PDFProApp ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}