{
"name" : "Cooling Master : Phone Cooler (Fast CPU Cooler)",
"url" : "https://play.google.com/store/apps/details?id=com.xiamapps.coolmaster.coolerapp.cooling",
"package" : "com.xiamapps.coolmaster.coolerapp.cooling",
"category" : "Tools",
"description" : "Cooling Master - Phone Cooler is a totally free cooling app that cool down phone temperature and Make phone cooling down in second. Device Cooler Master is a professional temperature monitoring and controlling app that reduce your CPU usage, clean RAM, lower phone temp and cool down your phone CPU. Auto CPU cooler master controls and overcomes the overheat operations of apps and high temp problem of android phones, lower down phone CPU temperature. CPU Cooler detects and closes heavy resource consuming apps to reduce CPU, GPU, RAM usage and cool down your phone and lower down phone temperature in real time.  Cooler app behave as Smart Cooling Master, CPU Cooler Master, Auto CPU Cooler , Phone Cooling master, Device Cooling Master, Temperature cooler, Phone Cooler, Auto Smart Device Cooler, Phone CPU Cooler, Cooling Master and Cooler Phone that all you need! Now multitasking with ease and comfort, without having any worry about device overheat because of cooling and phone cool down functions. Keep your device performance smooth and optimum with smart phone cooler and Cool down phone and optimize its speed. Enhance overall performance of your phone with CPU Cooler master. It is a best Cooling Master and Cooler Phone Pro application. Certain apps on phone keep running in the background, so your CPU is always being used a high rate. This causes the CPU to heat up and slows down cell phone operations. CPU Temp Controller app reduces this high temp and keep device cool and low temperatures by killing background running apps. With a single tap, you can easily control the operations of heat-generating apps and reduce the usage of your devices CPU  Device cooler works in a perfect manner. Smart Device Cooler Clean cache memory, free up RAM, Boost memory provide Real time temperature monitoring & protection, overheat prevention & cooling android phone. Cooling Master key feature of smart android cooler is lower down temperature. CPU cooler in other words cool master, cooling android phone, cooler expert master, phone cooling app, Smart cooler master and its heat minimization algorithm is highly effective to reduce CPU usage which ensures long battery life   Battery cooler extra feature of phone cooler is solving battery problems with battery saver mode. Extend your battery life with Phone cooler and give you better performance in multimedia and game usage. Best CPU Cooling Master cool down the phone CPU temperature.  100% Free Cooling app with cooling fan. Auto CPU Cooler for tablet version is also available.  Features of Cooling Master - CPU Cooler Master:  Real-Time Device Temperature Monitoring Monitors phone temperature in real time, so you can see the change temp from moment to moment. When the temperature is too high, Cooling Master (CPU Cooler) will alert you for one tap to cool down  Dynamic Overheating App Detection/Controller CPU Cooler Master analyzes CPU usage dynamically and auto detects overheating apps.We use our original temperature detection and temperature prevention technology to so you never miss any hidden heated apps. Cooling app collects each apps usage of CPU, GPU, RAM, etc. and applies the smart algorithm temp Control Engine to analyze the apps causing the phone to overheat. It then marks each apps temp heating level, so you never miss any hidden heating apps  One Tap to Cool Down Allow you to close overheating apps with one tap to cool down feature and allow you to reduce CPU usage and cool down your phone  Ignore List added Apps added in ignore list to prevent from cooler process  Power Saver mode - Smart Charge - Battery Cooler CPU Cooler display charge status in real time, accurately estimating remaining charge time, allow you go for cool down your phone and battery cooler  WiFi Booster Its smart WiFi booster (Internet boost) boosts internet & makes it fast by cleaning the RAM storage. Enhance WiFi speed by providing strong and stable WiFi signals ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.CAMERA', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.RESTART_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.WRITE_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RESTART_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}