{
"name" : "Wake me up! Smart Alarm",
"url" : "https://play.google.com/store/apps/details?id=com.chlochlo.adaptativealarm",
"package" : "com.chlochlo.adaptativealarm",
"category" : "Tools",
"description" : "Wake me up! is a constantly improved smart alarm application with advanced features, thought with Material Design in mind from the start.  It is fully compliant with Android 6 Marshmallow, Android 7 Nougat, Doze mode and DirectBoot. Even in Doze mode, the alarms fire properly and on time.  Scheduling features  Non-repeating alarm for multiple days  Repeating alarms can ring every week, every 2 weeks, etc.  Prevent your alarm to ring during a short or long period of time without disabling it.  Define a specific date from which your repeating alarm will automatically disable itself  Change the time your alarm will ring on specific days  Gentle wake up: will start ringing softly some time before the scheduled alarm.  Skip an alarm or go back to a previously skipped alarm in one tap  Quick nap: easily set an alarm to ring in 15 minutes, 30 minutes, 45 minutes or 1 hour in one tap  Calendar-related scheduling features Associate your alarm with one calendar and:  Prevent an alarm from ringing on days having all-day event (multi-days event are supported) More already planned for future releases  Integrate your alarms with Android Wear and Tasker, as an event plugin or following an event.  Informational features  Weather forecast (Weather forecast summary up to seven days, temperatures chart, maximum and minimum temperatures, etc.).  TTS message after dismissing an alarm: Greetings, Current date, Current time, Weather forecast, Max & min temperatures  Ringtone features  Progressive ringtone  Repeating TTS message  One time TTS message, then repeating ringtone  Use a music file as a ringtone  Vibrations  Progressive, specific or default brightness  Lower or mute ringtone volume when taking the phone  Snooze and missed alarm features  Limit the number of snoozing or even forbid any snoozing  Customize the sooze length  Decreasing snooze length: snooze length will decrease after each report, down to one minute  Auto-snooze: missed alarms will be automatically snoozed (a maximum number of automatic snoozing can be defined)  Change the length of you alarm for its last repeat before being missed instead of automatically snoozed   Snooze an alarm by flipping the phone or waving your hand over the phone  Look features  Theme your alarm using default colors  Choose one of your pictures as your alarm background and use one of your pictures palette color as its theme  Automatically see a picture background related to your weather forecast  Custom notifications: a notification that displays your next alarm, permits to dismiss it and shows weather forecast  Night mode  Shows current weather summary and temperature  Different types of night modes: Standard, Increase brightness on tap, Fully black screen and shows information on tap  Tasker integration  Other features  Backup (Online or local)  Timer  Dark theme  Clone and lock your alarm with a passcode  Permanent notification: Always display a notification about your next alarm, that permits to skip it or go back to it, and shows weather forecast.  Challenges: solve a mathematical challenge, reproduce a text  Widgets: a widget that shows the next ringing alarm, permits to skip it or go back to a previously skipped alarm  Test your alarms  Google+ Community: https://plus.google.com/communities/100666839075148296567 Google+ Beta Community: https://plus.google.com/communities/109444887841058364077 ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.vibrate', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.NFC', 'android.permission.FOREGROUND_SERVICE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.USE_FULL_SCREEN_INTENT', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERACT_ACROSS_USERS', 'android.permission.MANAGE_USERS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.READ_CALENDAR', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_SETTINGS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.NFC', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FULL_SCREEN_INTENT', 'com.android.vending.BILLING', 'android.permission.READ_CALENDAR', 'android.permission.INTERACT_ACROSS_USERS', 'android.permission.MANAGE_USERS', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}