{
"name" : "Barcode Scanner",
"url" : "https://play.google.com/store/apps/details?id=com.qrcodescanner.barcodescanner",
"package" : "com.qrcodescanner.barcodescanner",
"category" : "Tools",
"description" : "Looking for a powerful QR code reader and barcode generator that supports all major barcode formats? If your answer is yes, then Barcode Scanner is just the perfect app for you right now.  Barcode Scanner is the fastest and most user-friendly QR code scanner &QR Code Reader app available on the play store. By using the phones camera, our barcode reader will quickly scan and recognize the information of barcode. When scanning a QR Code, if the code contains a website URL, youll automatically be taken to the site. Its fast, easy and secure. The best thing is that our QR Code reader app is Free, Fast, Secure, Easy and you can use it without limits!  For detailed help, please visit https://sites.google.com/view/barcode-scanner-help  How Barcode Scanner Works:  1) To work with our app and start scanning your barcode, you will have to simply open the app, point the camera at the code, and youre done! There is no need to take a photo or press a button. QRCode Reader will automatically recognize any QR code your camera is pointing at.  2) When scanning a QRcode, if the code contains a website URL, you will automatically be taken to the site. If the code just contains text, youll immediately see it. For other formats such as phone numbers, email addresses, or contact info, you will be prompted to take the appropriate action.  Want to create your own barcode or QRCode? Its very easy with our app and you can create your personalised barcode with your information easily and fastly.  You can decode text, urls, ISBN, email, contacts information, calendar events and much more using your smart phone camera.  So, what are you waiting for? Download Musicpad and find & promote events near you in a few seconds! We are always striving to provide the best user experience for our users.   We are also looking for your feedback, suggestion or recommendation. Please, feel free to let us hear from you at barcodescanerreader@gmail.com so we can continue to bring you the best experiences and updates. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.FLASHLIGHT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}