{
"name" : "7-piece chess endgame training",
"url" : "https://play.google.com/store/apps/details?id=com.convekta.android.lomonosovtb",
"package" : "com.convekta.android.lomonosovtb",
"category" : "Tools",
"description" : "Have you ever wished that you had access to an endgame oracle which knows the precise evaluation of an endgame position and the best continuation for both sides? Well, the 7-man Chess Lomonosov Tables do exactly that. You will immediately know if a position is drawn or won and the precise number of moves until the opponent is checkmated. The exact moves to deliver checkmate can also be shown and at each step you can see which moves win, draw and lose. In other words, the Chess Lomonosov tables give you the final word on any position with seven or fewer pieces on the board!  The generation of the 7-man endgame tables is a major achievement in the history of chess endgames. The tables were calculated on a Lomonosov supercomputer by the Computer Science department of MSU.  The total size of the 7-man tables is 100 TB, far, far more than any normal user can store on his computer. Therefore this app was developed. It allows any user with an Android device to take advantage of this huge database in order to analyze positions and to play chess with up to seven pieces on the board (including the kings).  With help of the application you can: 1) Setup a winning/losing position and discover the number of moves to mate 2) Display the winning line with optimal moves for both sides 3) Play against the program. You make a move. The program replies 4) Choose positions from carefully selected training positions and play 5) Store your favorite positions, import and export them  After the first start the application is in POSITION mode designed to set up a position and calculate its evaluation and the best line. The actions are performed with help of 3 screens: Board, Notation, and Tree. Two buttons (located in the left upper corner) let your switch from the current screen to the other screens.  The Board screen allows you to place pieces on the board from a piece palette and manipulate the position in various ways. Pressing and holding a button displays a tooltip describing the action it performs. The endgame server is automatically queried for all valid positions. The results appears within a few seconds. 3-piece tables are built into the application, resulting in instant response for such endgames. Distance to mate is displayed in the upper status line. The best move is highlighted on the board with a green arrow. This move can be performed by selecting Arrow Right (Move forward) button.  The Notation screen displays a variation with optimal moves for both sides. You can browse the line and try new moves by making them on the board. Although the notation is only visible on the Notation screen it is also updated when you make moves on the other screens.  The tree screen shows the strongest moves in the position. Make a move by selecting it and touching Arrow Right. Right gesture on the move line produces the same result.  After activating the Play button (Board screen), the computer will reply automatically to the moves you make on the board.  After activating Drag button (icon with four arrows from the center) you can move pieces by dragging them on the board. If you hold a piece, a number is displayed on the squares. Each number shows the mate distance if the selected piece was located on the square.   We selected a set of interesting positions for playing against computer. Choose a position to play using CONTENTS, LESSONS or TRAINING mode. Play moves trying to complete the specified task without exceeding the move limit. After completing a task you can switch to Demo view where your moves are compared with optimal moves. If your move is optimal it is displayed with a green arrow, otherwise red. Other optimal moves are displayed green.  See more details at http://217.112.41.81/LTB7_manual/En/LTB7Android_EN.html http://chess-brabo.blogspot.ru/2016/01/lomonosov-7-men-tablebases.html https://chessappblog.wordpress.com/2015/12/12/lomonosov-tablebases/ ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.convekta.android.lomonosovtb.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}