{
"name" : "RTF to DOC Converter",
"url" : "https://play.google.com/store/apps/details?id=com.daemon.rtftodocconverter",
"package" : "com.daemon.rtftodocconverter",
"category" : "Tools",
"description" : "We tried to make a simple and convenient converter. If your phone does not have an office app or any other program to view documents, you can use our app and easily convert any text document to a DOC. For example, you have downloaded from the website the price list in TXT format, or you received the document in RTF format and you are unable to view it, we give you the opportunity - just convert it to DOC. With our Converter you can add to task several documents at once, simply select the built-in file manager multiple documents and click Add. Then, on the Converting page click Convert. And this is it. You just have to wait for the result. You can minimize the app without any limitations, the whole process will happen in background. You can see the progress of the conversion in the notifications.  The result will be saved in the specified directory; you can always change it. It will stay the same for the next application launch.  Briefly about the conversion: 1. All convert documents occur on our servers. 2. Your documents are transmitted via secure HTTPS Protocol. 3. We will not use your documents in any way. They are deleted automatically in an hour after the conversion. 4. If you have an error occurred during the conversion try again, you will succeed.  At the moment the app has no built-in DOC viewer, but you can always go into any available DOC viewer on your device.  If you have feedback or suggestions - write us.  RTF to DOC Converter supports the following file conversions: * .rtf to .doc * .txt to .doc * and more text document  Conversion happens online, hence Internet connection is required for this App to work. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MEDIA_CONTENT_CONTROL', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.daemon.rtftodocconverter.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.MANAGE_DOCUMENTS']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MANAGE_DOCUMENTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MEDIA_CONTENT_CONTROL']",
}