{
"name" : "Document Scanner : PDF Reader + PDF Creator",
"url" : "https://play.google.com/store/apps/details?id=com.pdfeditor.pdfreader.pdfscanner",
"package" : "com.pdfeditor.pdfreader.pdfscanner",
"category" : "Tools",
"description" : "This tiny PDF viewer is an easy to use relatively much lower app size application to view any PDF file on the go and allows you to scan any image to pdf with options of editing and filters to convert to PDF.   Traditional Scanning is history when you have a PDF Scanner that can read, annotate, create, scan and manage PDF documents on smartphones and tablets. You can easily adjust edges to high quality PDF document.  Key Features :  New Document Scanner 1. Import images using built in camera and from gallery 2. Support image adjustments and continuous scans 3. Added Magnifier  4. Export the scanned images as PDFs 5. Support for all languages 6. Adjust edges to high quality PDF 7. Filters for scanned document 8. Webpage to PDF converter1 9. PDF Creator with Scanner : its simple to scan to PDF  File Manager and Viewing 1. Fast rendering of PDF files 2. Jump to page  3. Magnifier and scrolling 4. Share via Email or sharing app  5. Delete PDF files 6. Search files or find a list of all PDFs at one place 7. Get file size and address details 8. Open PDF file from File Manager, Email or Dropbox  PDF Editor, PDF to Word, PDF to Docx converter, Docx to PDF, Docx Viewer and PDF password protected documents viewer coming in upcoming updates so you can enjoy this small size app without problems.  Icon Credits: http://iconbug.com/detail/icon/5933/file-format-docx/ ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}