{
"name" : "SA File Sharer",
"url" : "https://play.google.com/store/apps/details?id=com.blogspot.starphy.whatsappfilesharer",
"package" : "com.blogspot.starphy.whatsappfilesharer",
"category" : "Tools",
"description" : "Many times, we have to send files that can otherwise not be sent through email because of their large file sizes. The alternatives are using online file sharing.  This software allows you to share files easily to others through the most popular instant messaging app, WhatsApp Messenger.  Note however that, this app has no affiliations to WhatsApp Inc and has been developed by an independent individual  After installation, launch the app there are two tabs, the SEND and RECEIVE tabs to send a file, you should use the send tabs the files you receive show up in the received tabs  SENDING A FILE 1. Launch the app and swipe to the SEND tab if it doesnt already open 2. Tap on the SELECT button. This opens up a file browser from which you select the file you wish to send 3. Tap the SEND button. WhatsApp is automatically launched 4. Select the contact or group you wish to send the file to and tap send  RECEIVING A FILE 1. Launch the app and swipe to the RECEIVED tab 2. The file shows there by its name. All files already extracted show up with a green tick, otherwise, it comes with a red cross 3. To recheck for new files, over-swipe down or click the REFRESH icon on the action bar. 4. Tap on the file you wish to retrieve. A pop-up menu appears 5. Tap the EXTRACT option. 6. The file is extracted into the folder you specified for extraction (The default extraction folder is your pictures folder/SWFS/extracted) 7. Open up your file manager and locate the file  CHANGING A SETTING There are some settings that can be changed. The folder into which extracted files will be stored, the text used to prompt the recipient that he has received an embedded file, and the image into which the file is to be embedded.  CHANGING THE EXTRACTION FOLDER 1. Tap settings from within the app 2. Tap the EXTRACTED FILES DIRECTORY setting (This opens up a file browser) 3. Select the folder you wish the extracted files are stored into and tap SELECT button at the bottom  CHANGING THE PROMPT TEXT 1. Tap settings from within the app 2. Tap the DISPLAY TEXT setting  3. Enter the text you wish to be shown on the image to prompt the user 4. Tap OK  CHANGING THE IMAGE TO USE 1. Tap settings from within the app 2. Tap on the IMAGE TO USE setting. This opens a document browser 3. Tap on the image you will like to use.  Other settings you can include the notification sound, vibration, and whether to allow notifications or not.  You can equally check the app version and check for updates there ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.vibrate', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.NFC', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CALENDAR', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MANAGE_DOCUMENTS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'com.blogspot.starphy.whatsappfilesharer.permission.C2D_MESSAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.NFC', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MANAGE_DOCUMENTS', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}