{
"name" : "Sticker Maker: Make Stickers for Whatsapp",
"url" : "https://play.google.com/store/apps/details?id=com.lyrebirdstudio.sticker_maker",
"package" : "com.lyrebirdstudio.sticker_maker",
"category" : "Tools",
"description" : "Sticker Maker: Make Stickers for Whatsapp helps you make stickers by yourself, private stickers just for you :) Crop photos, create own stickers and share with friends on Whatsapp :) Make own Whatsapp Stickers and send to your boyfriend or girlfriend to make them laugh with this amazing sticker maker:)  Create your own stickers and custom sticker packs with your images, and share them with your friends with this great custom sticker creator! It is very easy to use :) A great emoji maker for you to have fun.  Looking for a simple and useful sticker maker :) You can now have more fun on your Whatsapp conversations with your own emoji pack private for you! Share the fun with your entourage with this awesome emoji maker.  With Sticker Maker: Make Stickers for Whatsapp it is easy to make awesome emoji packs, just follow these steps!  1) Open Sticker Maker: Make Stickers for Whatsapp and tap create a new sticker pack :)  2) Crop photos and create own stickers from your images to share on WhatsApp :)  3) Stickers will be added to your sticker pack, you can open WhatsApp and easily use them :)  You can make custom sticker packs for your friends, your family, your pet, your girlfriend, your boyfriend, with this sticker app by using your own images and crop photos to create funny memes with their faces with this great emoji maker.  Create funny memes or emojis of the faces of your friends, your girlfriend or boyfriend with this great sticker maker:) Share emojis on whatsapp and make your friends laugh :)  This all-in-one WhatsApp emoji maker makes it easy to create emojis for anyone.  Crop, create, share and enjoy! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_MEDIA_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_MEDIA_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}