{
"name" : "Multiple Qrbarcode scanner",
"url" : "https://play.google.com/store/apps/details?id=com.aapnitech.scannerapp",
"package" : "com.aapnitech.scannerapp",
"category" : "Tools",
"description" : "QR Barcode Scanner very easy to use just open QR Barcode scanner and the app will automatically detect all QR/Barcode (Multiple QR/Barcode at once). it just not giving details, it will also provide relevant options to you.  QR Barcode Scanner is a useful and needy tool for every Android phone. No. 1 in speed to scan QR codes and Barcodes, Safe and Secure to scan or generate, decode QR code and Barcodes.  QR Barcode Scanner can decode and scan all QR Barcode types across the whole commercial market of products for shopping. Scan QR/Barcode to shop product & compares its ISBN, UPC or other product details.  Features - Scan all QR & Barcode types including 1D, 2D,3D code (QR_CODE,UPC_A, EAN_8, EAN_13, CODE_128, CODE_39, CODE_93, PDF417) - Supported actions : Weblink, Text, ISBN, Geolocation, emailaddress, PhoneNumber, carddetails, Wi-Fi connection details, contact, SMS, calendarevents, bitcoin and many more. - Create all QR Barcode types to share secure and safe data over social network - applications. - Quick Settings Tile views for create, scan QR/Barcode from gallery. - 3D touch options/sort-cut options for create QR/Barcode, read QR/Barcode.  QR & Barcode Scanner / QR code reader helps to get a cost-effective price. Qr code scanner also helps you to scan QR/Barcode discount coupons to save your money.  In App Items - Export your scanned or created QR/Barcode results with an excel sheet. (Export as Excelsheet) - Print scanned or created QR/Barcode results. - Google Drive Backup option ith settings so you can carry back up with the new phone. - Accurate Multiple QR Barcode scan - Export Multiple scanning, result with Excelsheet - csv  Languages supported: Arabic, Bengali, Bulgarian, Catalan, Chinese, Croatian, Czech, Danish, Dutch, Estonian, Filipino, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Icelandic, Indonesian, Italian, Japanese, Korean, Latvian, Lithuanian, Malay, Norwegian, Persian, Polish, Portuguese, Russian, Serbian, Slovak, Slovenian, Spanish, Swedish, Tamil, Telugu, Thai, Turkish, Ukrainian, Urdu  We appreciate your feedback with an email to improve application Thanks. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}