{
"name" : "SMS Backup & Restore",
"url" : "https://play.google.com/store/apps/details?id=com.riteshsahu.SMSBackupRestore",
"package" : "com.riteshsahu.SMSBackupRestore",
"category" : "Tools",
"description" : "SMS Backup & Restore is a simple Android app that backs up and restores your phones SMS and MMS messages and call logs.  Note: This app requires existing backups to be able to restore call logs and messages. It cannot recover anything without existing backups. Advanced messaging (RCS) is currently only supported with Google Messages.  For questions or issues please visit our FAQ at: https://synctech.com.au/sms-faqs/   APP FEATURES: - Backup SMS (text) messages, MMS and call logs in XML format. - Local device backup with options to automatically upload to Google Drive, Dropbox and OneDrive - Choose a recurring scheduled time to automatically backup - Option to select which conversations to backup or restore - View and drill into your local and cloud backups - Search your backups - Restore/transfer backup to another phone. Backup format is independent of the Android version so the messages and logs can be easily transferred from one phone to another, irrespective of the version. - Fast Transfer between 2 phones over WiFi direct - Ability to restore all messages or only selected conversations. - Free up space on your phone. Delete all SMS messages or call logs on the Phone. - Email a backup file. - The XML backup can be converted to other formats, and can also be viewed on a computer.  Notes: - Tested on Android 5.0 and higher - App only restores backups made by this app - Please start the app at least once after updates so that the scheduled backups start working. - Backup is created locally on the phone by default, but you have the option to upload to Google Drive, Dropbox, OneDrive or Email. You are responsible for backup files. At no time are the files sent to the developer. - If you intend to do a factory reset on the phone, please make sure you save/email a copy of the backup outside the phone before doing it. - If you have performed the Restore and the messages dont appear in your messaging app then: - Open your messaging app and disable SMS from Settings. - Exit the app - Open the app again and enable SMS from Settings.   This App needs access to the following: * Your messages: Backup and Restore messages. Receive SMS permission needed to properly handle messages received while the app is the default messaging app. * Your Calls and Contact information: Backup and Restore Call Logs. * Storage: To create the Backup file on the SD card. * Network view and communication: Allows the app to connect to wifi for backup * Your social information: To display and store the contact names in the Backup file. * Run at start-up: Start scheduled Backups. * Prevent Phone from Sleeping: To prevent the phone from going to sleep/suspended state while a Backup or Restore operation is in progress. * Test access to Protected Storage: To create the Backup file on the SD card. * Account Information: To authenticate with Google Drive and Gmail for cloud uploads. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CALL_LOG', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.USE_CREDENTIALS', 'android.permission.READ_CALL_LOG', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.READ_SMS', 'android.permission.READ_PHONE_STATE', 'android.permission.MANAGE_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_SMS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_SMS']",
"perms_with_call" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_CALL_LOG', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_SMS', 'android.permission.READ_CALL_LOG', 'android.permission.READ_SMS', 'android.permission.WRITE_CONTACTS', 'android.permission.WRITE_SMS', 'android.permission.ACCESS_FINE_LOCATION']",
}