{
"name" : "Chess Clock - Chess Timer",
"url" : "https://play.google.com/store/apps/details?id=com.hd.chessclock.chesstimer",
"package" : "com.hd.chessclock.chesstimer",
"category" : "Tools",
"description" : "Chess Clock - Chess Timer is the smartest and most accurate clock to accompany you in every game.  Clock plus timer integrates extremely useful features along with great user experience, easy interaction. The screen is divided into two sections for two players. Just tap the screen (chessclock touch) and the game will officially start, the clock of chess timer will start counting down and the indicators on the screen will start to increase.  Real chess clock supports users to set up a way of calculating the time suitable for each players play (timer set, chess clock time control). Users can change the total match time, delay time and added time will be calculated after some moves specified by the player. These settings will be saved for easy use in the next game.  Chess clock pro - chess timer allows you to easily play chess games with your friends or your family. Supports Bullet Chess, Blitz Chess, Rapid Chess, Fischer Modus and custom variations.  Features of chess timer: - Friendly application interface, easy to use - Launch quick and simple stopwatch. - Stop the game whenever you want and the app will automatically save the state when you have a call or anything that makes the game stop suddenly (chess stop clock). - Read game information, for example: total number of moves, extra time, delay time, player name, increment timer, clock plus timer, chess hour ... - Notification at the end of the game. - Turn off the sound, vibrate mode while the clock works easily (chess clock with sound) - Easily store and modify game settings, timer set.  A simple yet extremely useful application for knowledgeable users. Download chess clock app free - chess timer app free to experience great relaxation time with relatives and friends.  If you have any questions, please contact us at any time. Our email address is gallaryvaultpro@gmail.com and we will get back to you as soon as possible. Thanks very much! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.vibrate', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.USE_FINGERPRINT', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}