{
"name" : "Rally Checkpoint Clock",
"url" : "https://play.google.com/store/apps/details?id=com.nasarallysport.rcv4",
"package" : "com.nasarallysport.rcv4",
"category" : "Tools",
"description" : "Rally Checkpoint Clock is the only app in the Android market designed to fully handle all areas of stage rally timing and to display huge seconds that the drivers can see from far away. This is for the volunteers at FIA rally, cross country rally-raid, and WRC rally style events.  Features Time vehicles at a stage finish Count down vehicles at a stage start Check vehicles in to a stage arrival (or service in/out) Display official time Calibrate to non-device time, either manually or over the internet  As clarification, this app is designed to be used by the race volunteers at timing checkpoints. It is not for racers.  This app maximizes the size of the numbers that are most needed in a rally clock: the seconds. There are many, many clock apps in the Play market, none of the them make the seconds large like this app does.  Use it for: Multi-stage rally Single-stage rally Rallycross TSD rally Regularity runs Anything where you need to connect a time of day to a number. Motorcycle enduros, dog sled races, running marathons, or triathlons  If you need to replace a broken TimeWise 650 or Alfa rally clock, this will do the trick for you!  Please send feedback, feature requests and suggestions to app@nasarallysport.com. We have already modified the app based on user feedback and we plan to continue to provide updates and enhancements based on your feedback to make this app even more awesome.  Permissions It may seem weird that a simple clock would need the all the system permissions that it does. Rally people are very detail oriented, so here is the rational behind each the permissions requested:  ACCESS_WIFI_STATE - required to detect and show whether wifi is on or not CHANGE_WIFI_STATE - required to be able to turn wifi on when toggle wifi button is pressed ACCESS_NETWORK_STATE - required to be able to tell the user whether they have a connection before they attempt to upload data WRITE_SETTINGS - involved in modifying the screen timeouts (so the clock doesnt time out while using it) READ_PHONE_STATE - needed to see battery level and show it on screen INTERNET - required to perform upload and report software crashes/usage ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.vibrate', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}