{
"name" : "Talk! Stopwatch & Timer for Free",
"url" : "https://play.google.com/store/apps/details?id=com.kentanko74.talkstopwatch",
"package" : "com.kentanko74.talkstopwatch",
"category" : "Tools",
"description" : "It is a simplest ultimate stopwatch and timer free app of the power saving to notify time by the voice at the specified interval time.  The stopwatch and timer can be used without seeing the screen with a smart phone put in the pocket to inform them of the elapsed time by the voice. Therefore, you do not need to move the face.  In addition to can be started automatically after the voice of countdown. You can perform the necessary preparations during the countdown.  Please use it by soccer, futsal, and basketball, and american football, and ice hockey, and pro boxing etc. when the umpire does not exist. It also takes an active part when it is not possible to confirm cycling, marathon, racing, a smartphone such as runnners. Because the elapsed time is notified by the voice, it is possible to use it as a kitchen timer(egg timer) in life. The best for laundry, the brushing teeth, and the nap timer, the yoga, and the zen timer.   Best also for the exercise(exercising), training(workout), meeting, reading, and the video game(online game), etc. with the gym where time is decided. Moreover, it is very good also for the meditation etc. to feed insight. It never never becomes loud voice than music. The best also for the management of time that kids play.  If you do not press the stop button, even if you start another application, stopwatch will continue to run in the power-saving without end. Therefore also is available at the same time another app while checking the voice notification. For example, it can be checked while taking a photo with the camera app. * Your smart phone will run even during sleep(locking).  Music volume and is available separately from the volume control of the voice notification. Therefore, it is also possible to reduce only the volume of the voice notification while listening to music. * Android4.0 or more is required.   Known issues Stopwatch does not work. 1)Samsung Products(Galaxy etc). 2)Android6.0(Marshmallow). 3)Samsung TTS. Workaround see WHATS NEW.    [Main specification and features] Count start button.(On, Off) * Can be set to any seconds to start after the countdown voice notification. Voice interval.(On, Off) Voice notification.(On, Off) Number of repetitions when the voice notification time has exceeded.(one-Infinity) * It repeats like the alarm of the wake up clock.(with repeat stop button) Countdown voice notification immediately before specified time.(On, Off) By Keep screen on option, during the stopwatch screen display can be set so as not to turn off automatically. History management function of each designated time setting. History management functions of the countdown setting. Adjustment of voice notification volume.(With mute button) * In the case of Android4.0 or more, it can be adjusted independently of the media volume. The record is displayed until 1/1000 seconds. Total time and lap time is counted up to a dual. Show multiple lap time list.(Displays the split.) Copy time to the clipboard. Copy lap time to the clipboard. Change of voice notification rate. * Voice notification rate is Android4.0 or more.(Less than Android4.0 is in the Android terminal setting, Change in the Text-to-speech settings.) Notification sound.(On, Off) Notification Vibe.(On, Off) Button Press vibration.(On, Off) The word before and after each voice notification is customizable. Even if the stopwatch is being executed, the voice notification condition can be changed. Large time display. Display area of time of visual like digital clock. Possible to operate it easy with a big start and the stop button. Energy saving of battery. * Since the power consumption goes up, it does not correspond to the widget. Tablet support. English support.   * All are machine translation. If you find a funny word, please point out by e-mail titled #Talk! Stopwatch & Timer. (Important to put a # at the head.) ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}