{
"name" : "SES Satellites",
"url" : "https://play.google.com/store/apps/details?id=com.ses.sessatellites",
"package" : "com.ses.sessatellites",
"category" : "Tools",
"description" : "The SES satellite fleet & coverage   SES is a world-leading satellite operator, providing reliable and secure satellite communications to broadcast, telecom, corporate and government customers worldwide.   Travel to space, view our satellites in orbit, compare coverage maps spanning the globe and experience the thrill of 3D navigation, all this and more with the SES tablet and mobile app.  Explore and discover interesting facts about our fleet of over 50 satellites via an engaging 3D interface. Navigate 360 degrees around the earth, from satellite to satellite, to view key technical data and our coverage maps in detail.   Compare coverage maps across the globe reaching over 99% of the worlds population. You can see the list of satellites based on your location and conduct searches.   Finally, once you have completed your journey of discovering the SES satellite fleet & coverage, send a message from space to a friend or colleague.   The app provides the following features:   - View SES satellite fleet around a 3D globe  - Get key technical data on each satellite  - View and compare the coverage maps of all SES satellites  - Use the powerful search that allows you to search by location, satellite or footprint and filter by band  - See EIRP and dish size contours in graphical format  - Learn about satellites covering any location  - View office and Teleport locations as well as the fiber network connecting all teleports  - Get in touch with SES via email ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}