{
"name" : "Mountain Watch (M-Watch)",
"url" : "https://play.google.com/store/apps/details?id=com.skyapps.mountainwatch",
"package" : "com.skyapps.mountainwatch",
"category" : "Tools",
"description" : "  This app provides the functions of the watch, Compass, Barometer / altimeter, speedometer, flash, moon phase and a weather information.  # This application is made by reference to mountain climbing watch.  # The Main Function  1. Main Screen - You can see all the information on the main screen. - The weather and temperature, humidity, wind speed, sunrise / sunsets time information is displayed on top screen. - Current time / compass / barometer-altitude / speed information is displayed in the center core. - Location and moon phase function is displayed in the lower area.  2. Current Time - Displays the current time and date information.  3. Compass - Shows the compass and orientation information. - If the compass is inaccurate, please wave your device in a figure 8-shaped. (Set -> Users Guide)  4. Barometer, Altimeter - displays the this areas current barometric pressure and altitude information. - You need using the GPS setting, if you want to the altitude information.  5. Speed - When moving with the device, displays the current speed. - You need to set a high accuracy GPS - If you use for a long time, it can be consumed the battery quickly.  6. Flash - You can use it like a flashlight.  7. Location - The locations are marked on the map.  8. Settings - You can choose to Celsius () or Fahrenheit () of displayed temperature. - You can check the instruction manual.   Notes This app does not exhibit the enough performance such as a professional climbing watch. And can not guarantee 100% accuracy of the data. The devices GPS and network usage setting is required for more accurate display. Because high-accuracy consumes a lot of the battery, does not recommend the use of a long time. I hope use this app only when you need it. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FLASHLIGHT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}