{
"name" : "dB Meter - measure sound & noise level in Decibel",
"url" : "https://play.google.com/store/apps/details?id=com.dbmeterpro.dbmeter",
"package" : "com.dbmeterpro.dbmeter",
"category" : "Tools",
"description" : "The best way to meter sound levels - AppAdvice  dB Meter is full of features sound level meter with exclusive accuracy of measurements calibrated with professional decibel meter.  The world is a noisy place: cars, power tools, crowds, machinery, and other common sources produce amounts of noise that can, with continued exposure, lead to permanent hearing loss. Sound level meters are useful for anyone who wants to avoid exposing their ears to harmful noise levels, but who wants to spend hundreds of dollars on one?  dB Meter is free app which provides professional-quality measurement results, calibrated using an actual Nor140 high-precision sound level meter. With dB Meter, you can measure ambient noise levels, save your measurements and their locations, and share your measurements with others. dB Meter couples utility with stylish design and a polished user experience: a powerful tool in a sleek package, and at a tiny fraction of the cost of professional sound meters.  (Please note that dB Meter sound & noise level meter app is not a replacement for professional sound level meter devices and should be used for personal purposes only.)  FEATURES:   Highly accurate decibel meter.   Saves location data for each measurement.   Save measurements with custom names.   Export measurements.   Four weighting types dba, dbc, dbb & dbz.   Allows you to save, export and play back recorded noise measurements.   Integrated Fully Functional Spectrum Analyzer    FFT Plot (Fast Fourier Transform)    Linear and logarithm scales   Up to 16384 FFT size (not all phones supported)    A lot of available window functions   Tracking for max noise volume value   Max and Min decibel hold for any selected frequency   Stunned graphics   Have any questions or suggestions? Write to us: support@dbmeterpro.com  DB Chart 150-160 decibel = Eardrum rupture  140 decibel = Aircraft carrier deck.  130 decibel = Jet take-off (100 meters), gun blast at close range.  120 decibel = Human pain threshold, loud rock concert.  110 decibel = Serious hearing damage if sustained for more than 1 hour.  100 decibel = Serious hearing damage if sustained for more than 8 hours.  90 decibel = Likely hearing damage if sustained for more than 8 hours.  80 dB = Potential but unlikely hearing damage if sustained for more than 8 hours.  70 dB = Just annoying, but probably safe noise.  60 dB = Typical conversational volume.  50 dB = A quiet, library conversation.  40 dB = A whisper.  30 dB = Barely audible sound.  20 dB = Threshold of human hearing. ",
"desc_perms" : "['android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
}