{
"name" : "TechniSat CONNECT",
"url" : "https://play.google.com/store/apps/details?id=com.technisat.multiplay.main",
"package" : "com.technisat.multiplay.main",
"category" : "Tools",
"description" : "TechniSat CONNECT ermglicht erstmals die einheitliche Bedienung einer Vielzahl von TechniSat Gerten aus einer zentralen App heraus. Egal, ob es sich dabei um die Steuerung des TV-Gerts, des Radios oder des Multimedia-Receivers handelt. Individuell  genau wie Sie. Die Mglichkeiten von TechniSat CONNECT wachsen mit den TechniSat Produkten in Ihrem Zuhause. Sie knnen entscheiden, welche Produktlsungen Sie nutzen und einbinden. Bei TechniSat CONNECT lassen sich Funktionen spielend leicht an- oder abwhlen.  Eine App mit Bausteinprinzip Folgende Module sind zur Zeit in TechniSat CONNECT integriert:  CONTROL: ber die TechniSat CONNECT App steuern und fernbedienen Sie kompatible TechniSat TV-Gerte, Receiver und Radios.  SIEHFERN INFO: Sie mchten wissen, wann Ihre Lieblingssendung luft? Schauen Sie einfach in der digitalen Programmzeitschrift SIEHFERN INFO nach. Hier haben Sie fr viele Sender bis zu 4 Wochen im Voraus das TV-Programm im Blick. Zudem merken Sie mit zwei Klicks Ihre Lieblingssendung fr eine Aufnahme vor  und das sogar von unterwegs aus.  SMARTHOME: Mit TechniSat CONNECT machen Sie Ihr Zuhause smarter. Unsere kompatiblen Smart-TVs und Receiver verfgen bereits ber die Zentraleinheit zum Ansteuern aller Smart Home Komponenten. Hierdurch wird es erstmals mglich, die komplette Hausautomatisierung ber das Men des TechniSat Gertes oder ber die TechniSat CONNECT App auf dem Smartphone/Tablet zu steuern. Die Anschaffung einer separaten Zentraleinheit knnen Sie sich sparen.  MULTIROOM: Sie sollen Ihre Lieblingsmusik perfekt und einfach bedienbar in allen Rumen zuhause genieen knnen. Ob Radiosender, CDs oder digitale Musikdateien  Sie entscheiden, was Sie hren, und wo Sie es hren. Dabei spielen Sie Ihre Musik einzeln in jedem Raum oder in vielen Rumen gleichzeitig ab. Komplett ohne Kabel, drahtlos ber das Heimnetzwerk. Das Besondere an unserem Konzept fr das wohnraumbergreifende Musikstreaming ist die groe Auswahl qualitativ hochwertiger, perfekt aufeinander abgestimmter Radios und Lautsprecher von TechniSat.  MULTIPLAY: Sie mchten die Medieninhalte, die auf Ihrem TechniSat Receiver oder TV Gert gespeichert sind einfach mal im Garten betrachten? Dann haben Sie mit MULTIPLAY die Mglichkeit, diese Inhalte innerhalb Ihres Heimnetzes auch auf Ihrem Tablet oder Smartphone anzuschauen. Die Aufnahmen und Inhalte wie z.B. Live-TV knnen direkt mit der CONNECT App wiedergegeben werden. Oder Sie mchten eine Aufnahme in einem anderen Raum zu Ende schauen? Dann whlen Sie mit MULTIPLAY einfach ein anderes Wiedergabegert und streamen Sie die Aufnahme per UPnP dort hin.  Informationen zu den erforderlichen Berechtigungen: Standort: Notwendig zur Bestimmung der Position via GPS/Netzwerk in Verbindung mit beispielsweise sonnenstandsabhngigen Szenen. Wird nur nach Zustimmung oder manueller Eingabe durch den Kunden verwendet.  Speicher (Lesezugriff): Erforderlich, um auf lokale Medien auf dem Mobilgert zuzugreifen.  Auf Bluetooth-Einstellungen zugreifen: Bentigt, um ber die App die Bluetooth-Einstellungen ffnen zu knnen. So kann der Nutzer sein Mobilgert z.B. mit einem TechniSat Lautsprecher koppeln.  WLAN-Verbindungen herstellen und trennen: Ist erforderlich fr den Installationsvorgang bei Multiroom-Lautsprechern.  Voller Netzwerkzugriff: Voller Netzwerkzugriff ist erforderlich, damit die App mit anderen Gerten oder ber das Internet kommunizieren kann, was fr die Funktion aller Module von TechniSat Connect bentigt wird.  Ruhezustand deaktivieren: Ermglicht dem Nutzer die Stabilitt in SmartHome zu verbessern, wenn das Mobilgert in den Standby-Zustand bergeht.  WLAN-Verbindungen abrufen: Ermglicht es, bei Verbindungsabbrchen automatisiert reagieren und den Nutzer ber mgliche Fehler informieren zu knnen.  Internetzugang: Ermglicht den Zugang zur Smart-Home-Cloud, Online-Hilfen und Tutorials sowie das Aktualisieren von SFI-Daten. TechniSat CONNECT allows the unified operation of a large number of TechniSat devices from a central app for the first time. Regardless of whether it is the control of the TV, the radio or the multimedia receiver. Individual - just like you. The possibilities of TechniSat CONNECT grow with the TechniSat products in your home. You can decide which product solutions you use and integrate. With TechniSat CONNECT functions can be easily selected or deselected.  An app with building block principle The following modules are currently integrated in TechniSat CONNECT:  CONTROL:  Use the TechniSat CONNECT app to control and remotely control compatible TechniSat TV sets, receivers and radios.  WATCH INFO:  Would you like to know when your favorite show is about to start? Just look in the digital TV magazine SIEHFERN INFO. Here you have for many channels up to 4 weeks in advance, the TV program in view. In addition, with two clicks, you can remember your favorite program for a recording - even on the go.  SMART HOME:  With TechniSat CONNECT you make your home smarter. Our compatible smart TVs and receivers already have the central unit for controlling all smart home components. This makes it possible for the first time to control the complete home automation via the menu of the TechniSat device or via the TechniSat CONNECT app on the smartphone / tablet. The purchase of a separate central unit you can save yourself.  MULTI ROOM:  You should be able to enjoy your favorite music perfectly and easy to use in all rooms at home. Whether radio stations, CDs or digital music files - you decide what you hear and where you hear it. You play your music individually in each room or in many rooms at the same time. Complete without cable, wireless over the home network. The special feature of our concept for cross-residential music streaming is the large selection of high-quality, perfectly coordinated Radios and speakers from TechniSat.  MULTI PLAY:  You would like to have a look at the media content stored on your TechniSat receiver or TV? Then with MULTIPLAY you have the opportunity to view this content within your home network on your tablet or smartphone. The recordings and contents such as Live TV can be played directly with the CONNECT app. Or you want to finish a recording in another room? Then simply select another playback device with MULTIPLAY and stream recording via UPnP there.  Information about the required permissions: Location: Necessary for determining the position via GPS / network in connection with, for example, sun-dependent scenes. Only used after approval or manual input by the customer.  Memory (read access): Required to access local media on the mobile device.  Access Bluetooth settings: Needed to open the Bluetooth settings via the app. For example, the user can use his mobile device e.g. pair with a TechniSat speaker.  Create and disconnect Wi-Fi connections: Required for installing multiroom speakers.  Full network access: Full network access is required to allow the app to communicate with other devices or over the Internet, which is required for the functionality of all modules of TechniSat Connect.  Disable hibernation: Allows the user to improve the stability in SmartHome when the mobile device goes into standby.  Get Wi-Fi connections: Allows you to react automatically to disconnections and to inform the user about possible errors.  Internet Access: Provides access to the smart home cloud, online help and tutorials, as well as updating SFI data. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}