{
"name" : "Free VPN - Fast Secure and Best VPN Unlimited USA",
"url" : "https://play.google.com/store/apps/details?id=com.lifetimevpn.secure",
"package" : "com.lifetimevpn.secure",
"category" : "Tools",
"description" : "Free VPN for online games - such as VPN for PUBG   Free VPN for Android - No Registration - No Login required - Anonymous VPN - Free Proxy - Net Neutrality from the USA  Free VPN - Unblock Whatsapp,Telegram, Skype, Facebook, Instagram, Kakao Talk, Kik, Line, Messenger, OK, Omegle, Reddit, Snapchat, Telegram, Torrent, Viber, VK, Wechat, Youtube and other voice and video calls with our unlimited Free Android VPN  VPN IP Changer Bot Protection  Free American VPN  Secure VPN Protect your Internet with unbreakable encryption algorithms. Secure and encrypt your Android Internet on public WiFi hotspots  Unlimited VPN Unlimited speeds on all our VPN servers  Access blocked sites or applications or games - Bypass Censorship - Unblock Websites Full access to blocked websites or games such as Roblox with our VPN   Unlimited VPN Speeds and works everywhere Works on 3G/4G/LTE/5G and or WiFi, as long as you have Internet connectivity our app works  Our VPN solution works on any Android phone or tablet compatible with Android 5.0+ versions   Access to more than 100+ VPN servers around the world Global locations in countries such as: VPN Servers in USA (East and West Coast), UK, Canada, Germany, France, Italy, Russia Netherlands, Korea, Japan and many other  Only Real VPN servers - no virtual or fake locations  Free VPN for online games - such as VPN for PUBG , fast speeds unlimited connections for PUBG Mobile   No logs We dont keep logs about your Internet usage   Access online TV from anywhere Access geo-blocked TV channels from any country in the world  *** Premium Support 24x7x365 *** For a fee***  Frequent updates We are here to help you.  Please be advised that this Free VPN app works on AS IS and AS available basis and without ANY guarantees due to the fact that the app is FREE. Before posting any negative comments please try to switch servers or change protocols. Our Free VPN app may not work in some countries and there is nothing we can do to help, unfortunately. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}