{
"name" : "Fireflies lockscreen",
"url" : "https://play.google.com/store/apps/details?id=com.app.free.studio.firefly.locker",
"package" : "com.app.free.studio.firefly.locker",
"category" : "Tools",
"description" : "A beautiful lock screen with Fireflies live wallpaper theme for Android devices, Make you enjoy one of the seven wonders of the insect world on your phones lock screen,the flashing signals from fireflies looks  vivid under forest HD wallpapers.  Features: 1. Simulate the flashing signals animation of fireflies. 2. Simulate the animation of fluttering butterfly. 3. Support unlock sound settings,you have ten nice ringtones to choose. 4. Support set pin password via keypad lock screen for lock security. 5. Support customize unlock text,device name and operator name. 6. Support customize wallpaper. 7. Support display notifications such as unread messages ,unread mail,missed call and so on in lock screen. 8. Support slide to unlock,including slide up to unlock,slide down to unlock,slide left to unlock and slide right to unlock. 9. Support display widget in lock screen(Recommend music widget) 10. Support Pattern lock for lock security. 11. Support change clock/date text color,text size and text fonts. 12. Support swipe to remove notifications 13. Support change themes for setting background. 14. Blur wallpaper with unread notifications. 15. Support random keypad or password to enhance the security for your phone 16. Support unlock animation. 17. Support music control  How to use? 1.open this apps settings,then this Fireflies live wallpaper lock screen will start to work. 2.You can preview the screen lock by clicking the preview option no matter when you change any settings. 3.You can change the unlock ways by clicking the Slide to unlock style option and select the corresponding option.  FAQ Q: What should I do if I encounter double lock screen? A:You can click Disable System Screen Lock option to close system screen lock or set to none. Q:When I turn on the notifications,it talks back to me while operating my phone. A:Please turn off Talkback in Accessibility of System setting. Q:This lock screen sometimes not work? A:It means that this lock screen had been killed,This happens when the system is in low memory while you are playing games or you start too many applications. In order to avoid this you can toggle on the Advanced Settings to tell the system not to kill it while on low memory. Q:How to uninstall? A:Settings-->Security-->Device administrators,Deactivate the application,then you can uninstall normally.  This Fireflies live wallpaper lock screen has been tested on latest devices such as Samsung Galaxy S3/S4,Nexus 5/7,HTC one and Sony Xperia Z. Please contact us if your device is not supported.  This application is completely free of charge,so download it to enjoy the wonder world of fireflies, In addition, share it with your friends if you really like this application,Thanks! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.app.free.studio.firefly.locker.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.WAKE_LOCK', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}