{
"name" : "Super Volume Booster -Sound Booster for Android",
"url" : "https://play.google.com/store/apps/details?id=com.soulapps.superloud.volume.booster.sound.speaker",
"package" : "com.soulapps.superloud.volume.booster.sound.speaker",
"category" : "Tools",
"description" : " Super Volume Booster for all music lovers and users who need super loud device voice!  User-friendly, clean, neat, small and free!  Try it and you would find what set the sound booster for android from other voice enhancer.  Sound booster tool, default equalizer and 3D virtualizer effects bring you the best voice experience.  Download Super Volume Booster for android and start to see a sound magic!  Why Super Volume Booster?  Volume booster for android supports audio, video and game sound volume boom.  Bass booster for headphones, external speaker & Bluetooth.  Live sound spectrum is presented when you are playing music.  Stereo surround sound effects bring immersive experience.  Music player control ensures songs playing & sound enhance on the same page.  System volume amplifier for ringtone volume, notification volume and alarm volume.  Clean and simple page & one-touch operation.  No root required.  A good volume booster could give you a fantastic music experience! A proper speaker booster for android could spare you multifarious sound amplifiers in Google Play. Max volume booster can be found here. We stick to easy-to-use music booster & volume boost free app. Choose this sound enhancer and boom your sound louder! Extra volume for your device is close enough to touch now! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}