{
"name" : "Bangla Voice To English and Bangal Automatic Type",
"url" : "https://play.google.com/store/apps/details?id=com.kobirhussain4000.Speech_To_Text",
"package" : "com.kobirhussain4000.Speech_To_Text",
"category" : "Tools",
"description" : "                  ,                 ,                                                                                                                                                                                                   Developer E-Mail kobirhussain800@gmail.com          Bangla Voice To English type, Bangal speech to English translate Bengali voice to English translate, Bengali voice to English type, Bangla English voice translate Bangla English training, bangla speech to text, bangla speech to text keyboard, bangla speech, bangla speech to english text, bangla speech to text converter, bangla voice typing keyboard, bangla voice keyboard, bangla voice to text, bangla voice typing, bangla voice software, voice to text Bangal, voice to text Bangal Converter, voice recorder, voice changer, voice translator all languages, voice translator, speech to text, speech to text bangla, speech translator app, speechnotes, speech text translator app, speechnotes - speech to text,  , ,    ,   ,  ,  ,  , ,   ,    ,    ,  Thanks for download this application, You can not write in Bengali or you do not have Bengali keyboard support on your phone.  What do you do in this situation, At this time you need our apps, our apps will solve your problem, Whatever you say on your face, these apps will be automatically typed. It will be typed in Bengali and it will also be typed in English as automatic.  There are many hard words that we can not find on our phones keyboard. To find out the problem, we have these apps. We have this app on your side, you can type many difficult words that you can not type in the words that you will call your phone Automatically typing will show you and you will be typed in a very easy way Lee can share social media.  You can not write in English or you can not understand English, you can download it in English. You can download this app through our app, you can easily learn English and type in English.  You can not say in English If you say in Bengali, if you say in Bengali, these apps will automatically show you by typing in English and typing it along with this word will also be typed in Bengali You will also be able to see in Bengali and can also see in English.  Dear friends, if you have any problems then you can email us and we will fix this issue and update it. Our apps Developer E-Mail kobirhussain800@gmail.com  Thank you all to stay healthy.   Bangla Voice To English type, Bangal speech to English translate Bengali voice to English translate, Bengali voice to English type, Bangla English voice translate Bangla English training, bangla speech to text, bangla speech to text keyboard bangla speech, bangla speech to english text, bangla speech to text converter bangla voice typing keyboard, bangla voice keyboard, bangla voice to text, bangla voice typing, bangla voice software, voice to text Bangal, voice to text Bangal Converter, voice recorder, voice changer, voice translator all languages voice translator, speech to text, speech to text bangla, speech translator app, speechnotes, speech text translator app, speechnotes - speech to text, Wyk Reakt, Hey, Wrapper print Bengali people, Boys Change Software, Boys Kidder, Boys record Wyk Reakt, Age, Voice to Text, Bangla voice to text, Type in the mouth,  Thanks for download this application, ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS']",
}