{
"name" : "AppMgr III (App 2 SD, Hide and Freeze apps)",
"url" : "https://play.google.com/store/apps/details?id=com.a0soft.gphone.app2sd",
"package" : "com.a0soft.gphone.app2sd",
"category" : "Tools",
"description" : "AppMgr (also known as App 2 SD) is a totally new design app that provides the following components:  Move apps: moves apps to either internal or external storage for getting more available app storage  Hide apps: hides system (built-in) apps from the app drawer  Freeze apps: freeze apps so they wont use any CPU or memory resources  App manager: manages apps for batch uninstalling, moving apps or sharing apps with friends  Support app 2 sd for Android 2.x~9.x. For Android 6+, read http://bit.ly/2CtZHb2 if you dont see the Change button. Some devices may not be supported, visit AppMgr > Settings > About > FAQ for details.   Over 50,000,000 Downloads!   up-to-date UI style, themes  uninstall apps  move apps to external storage  notify when movable apps installed  hide apps from app drawer  freeze apps to a stop state  1-tap to clear all cache  clear apps cache or data  batch view apps on Google Play  export the app list  install apps from the exported app list  No ads (PRO)  quick uninstall or move an app by drag-n-drop  sort apps by name, size or installation time  share customized app list with friends  support home screen widgets  Functions for rooted device  Root uninstaller, Root freeze, Root cache cleaner  Root app mover(PRO-only)  Move apps Are you running out of application storage? Do you hate having to check each and every app if it supports moving to the SD card? Do you want an app that automatically does this for you and can notify you when an app can be moved? This component streamlines the movement of apps to on your devices external or internal storage through your devices Settings. With this, youll have more control over your ever expanding collection of apps. This is crucial to anyone who has memory management issues.  Hide apps You dont care for all the apps your carrier adds to Android? Well, now you can get rid of them! This component enables you to hide system (built-in) apps from the app drawer.   Freeze apps You can freeze apps so they wont use any CPU or memory resources and consume zero-battery. Its good for you to freeze apps that you would like to keep in device, but dont want them to run or be uninstalled.  Permissions  WRITE/READ_EXTERNAL_STORAGE: use to export/import the apps list  GET_PACKAGE_SIZE, PACKAGE_USAGE_STATS: get the size information of apps  BIND_ACCESSIBILITY_SERVICE: this app uses Accessibility services to automate the function (e.g. clear cache, move apps), optional. It helps those who have difficulty in tapping and complete the task easier  WRITE_SETTINGS: prevent the screen rotation during the automatic function  SYSTEM_ALERT_WINDOW: draw a wait screen above other apps during the automatic function  We have been selected as a Google I/O 2011 Developer Sandbox partner, for its innovative design and advanced technology. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.MOVE_PACKAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DELETE_CACHE_FILES', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CLEAR_APP_CACHE']",
"perms_with_call" : "['android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.MOVE_PACKAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.DELETE_CACHE_FILES', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}