{
"name" : "VPN free and secure - Free VPN Proxy",
"url" : "https://play.google.com/store/apps/details?id=com.vpnbeaver.vpn",
"package" : "com.vpnbeaver.vpn",
"category" : "Tools",
"description" : "Free VPN is the cool client for Android. This Free VPN is unlimited VPN that does not require any registration. Fastest - Connect successfully as a hare with high VPN speed. Many VPN servers for you security. We protect your private and identity. You can browse the web anonymously. We have lots of free vpn cloud proxy server to provide best net and VPN service. Free VPN Beaver gives you the freedom to be completely anonymous.  Your traffic is encrypted while our Free VPN is on. Check it out!  We have free 12 countries with servers to connect: 1. Ukraine 2. Russia (Many free Russian VPN servers) 3. Singapore 4. Netherlands 5. USA 6. Bulgaria 7. Singapore 8. Sweden 9. Czech Republic 10. United Kingdom 11. Latvia 12. Poland   How does Free VPN Work? Free VPN encrypts your data and safely. You can connect to any website or mobile application. Free turbo VPN keeps you safe by directing your data traffic through our secure servers.  Your IP address is hidden. This app is a lightning-fast app provide free VPN proxy service. Not need any configuration or registration, just simply touch one button, you can access the Internet securely and anonymously.  Unique Features of our Unlimited Free VPN  Easy to connect to Free VPN  No credit card needed  No in app purchase  No registration needed  No login or password required  Easy to disconnect from free VPN  Free VPN connects you to the fastest server * Works with WiFi, LTE, 3G, and all mobile data carriers. * Encrypts data using OpenVPN protocols (UDP / TCP). Free VPN is doing everything we can to keep this app simple and easy to use.   VPN related introduction  A virtual private network (VPN) extends a private network across a public network, and enables users to send and receive data across shared or public networks as if their computing devices were directly connected to the private network. Applications running across the VPN may therefore benefit from the functionality, security, and management of the private network.  Individual Internet users may secure their transactions with a VPN, to circumvent geo-restrictions and censorship, or to connect to proxy servers for the purpose of protecting personal identity and location. However, some Internet sites block access to known VPN technology to prevent the circumvention of their geo-restrictions.  VPNs cannot make online connections completely anonymous, but they can usually increase privacy and security. To prevent disclosure of private information, VPNs typically allow only authenticated remote access using tunneling protocols and encryption techniques.  Mobile virtual private networks are used in settings where an endpoint of the VPN is not fixed to a single IP address, but instead roams across various networks such as data networks from cellular carriers or between multiple Wi-Fi access points. Mobile VPNs have been widely used in public safety, where they give law enforcement officers access to mission-critical applications, such as computer-assisted dispatch and criminal databases, while they travel between different subnets of a mobile network.   Terms of Use https://vpnbeaver.com/en/terms  Privacy Policy https://vpnbeaver.com/en/privacy  Partnership/Support https://vpnbeaver.com/en/support  Enjoy ;) ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}