{
"name" : "Wola Schools - School bus tracker for parents",
"url" : "https://play.google.com/store/apps/details?id=com.wola.school",
"package" : "com.wola.school",
"category" : "Tools",
"description" : "Track the school route in real time in the morning and in the afternoon to organize your day better, to anticipate delays or traffic jams and to improve the safety of your children.   During the back-to-school period, bus routes tend to undergo changes, and face delays or traffic jams that make it hard to predict the arrival time of the children. Wola Schools makes it easy for parents to plan when to leave their children at the bus stop and when to pick them up. Its notification system also informs you when the bus is leaving the school or arriving at your stop and also on the way, when needed.   Wola Schools is the most precise school bus tracker in the market, using the proprietary real time technology by Wave Application, the leading geolocation provider in the world. As Wola Schools plays a role in childrens safety, all data is encrypted on a militar level to ensure that nobody else can access the private map or hack the app.   HOW DOES WOLA SCHOOLS TRACK THE SCHOOL BUS?  Wola Schools is active when the supervisor that goes on the bus with the children is sharing the location of the bus with both parents and the school. The supervisor also controls any attendance issue at the bus stops. Meanwhile, both parents and the school can follow the route in real time through their app or online dashboard, respectively.   This is a novel way to connect with children during the school day and feel safe and sound about their location, without children having to acquire smartphones to communicate with their families.  CONTROL OF ATTENDANCE OF CHILDREN  Wola Schools controls the attendance of children on the school route and the parents can inform when their children are not going on the bus that day, directly through the app. This information is immediately synchronized with the supervisor on the bus app and with the schools records, so no further communication is needed. Every day, the supervisor on the bus will register attendance on the bus, stop by stop, confirming no kid is left on the bus when the route reaches its end. The school has full visibility on which children had a notified absence and which arrived at the school.   NOTIFICATIONS  Wola Schools has a notification system that helps parents organise better their day, by planning the time to leave and pick up the children, considering delays or traffic jams.   The notifications are customisable, so parents choose to receive an alert 5 or 10 minutes before the estimated time of arrival of the bus school or even when the bus is actually arriving to the stop.   PRIVACY  Children safety is a delicate matter, which is why Wola Schools is only accessible for parents previously authorised by the school. The app will recognise their email as valid and send them a verification code. In addition, Wola Schools is only open to schools that have an agreement with Wola Schools, otherwise the school app does not show any route.  MAP VIEW  On Wola Schools parents can choose between different maps that track the school buses and can switch between routes, in case they have been assigned more than one by the school. This can happen when they have more than one child with different schedules or with sports activities after school.  For more information, take a look at the website www.wolaschools.com ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.USE_FINGERPRINT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_BACKGROUND_LOCATION']",
}