{
"name" : "Fast Speed Booster - CPU Cooler, Clean Boost Phone",
"url" : "https://play.google.com/store/apps/details?id=com.xiamapps.speedup.phone.boost.clean.fast",
"package" : "com.xiamapps.speedup.phone.boost.clean.fast",
"category" : "Tools",
"description" : "A smart optimizer for android phones. Clean deep to boost max your phone effectively. Advance Phone Boosting and cleaning on just single tab. Maximize phone speed and optimization.   Best speed booster app 2020 for advance phone boost and cleaner. Max booster cleaner app for android phones. CPU Cooler, Cooling expert, Cool, CPU cool down phone temperature and temperature monitoring & controlling, battery time saving is now with ease and comfort and phone battery expert master. Clean temp cache data and dump files to make phone faster, boost and clean. Deep Clean your phone with Max phone speed booster. Best WiFi booster to enhance WiFi signals.   Best phone cleaning app 2020 to make more storage and more space by cleaning junk files, background running process, and clean cache memory. By reducing CPU usages cool down your phone. Basically clean to boost kill and stop background running apps and process to make more storage and make phone fast and cool. Totally free phone cleaner and phone booster to speed up phone  Just one tab to optimize your phone on just one tab. - Max phone speed boost just single tab  - Easy to use smart super cleaner or android phone - Cool down temperature and monitoring - Monitor phone battery and save battery power - Kill background running apps & processes to clean, boost, cool phone - Make phone faster, smoother & optimize - Phone Booster & CPU Cooler & Battery Saver  Features of Max speed phone booster Advance Booster max performance With the advanced process monitoring technique, speed booster can intelligently clean background processes, stop stealthy running apps and disable stealthy auto-start apps even on non-root devices. Free up memory, speed up your device and save more battery.  Cleaner for android: Free up storage space completely Analyze and safely remove the junk files that take up your memory and storage space. Clean with only 1-tap, free up space and boost phone speed. Clean residual system cache files left by uninstalled apps to free up disk space for Android phone or tablet.  CPU cooler: CPU Cooler Master App It provides phone overheat protection. Phone overheating make phone slow and leggy. Overheat leads to phone slowness and hang. Max Phone cooler is a fast way to overcome the common phone heating problem that make phone leggy, freeze, hang and slow. Now multitasking, movies, gaming like FPS games are now with ease and comfort. Max Phone cooler heat minimization algorithm is very effective to cool down phone rapidly.  Advance Battery Monitoring and Saver Perfect battery expert app that monitor phone battery and close heavy resources and lower the burden from the phone battery that gives longer battery life. Extend battery life and save its power.  Keeps Phone Fast, Power Saving It combines a clean, visually appealing, user friendly interface, with smooth functions that perform optimally every single time. Best of all, it does not have the constant notification interruptions and annoying. Max speed phone Speed Booster is the easiest and most powerful way to give your Android a new lease of life. free up phone memory by killing running tasks, cleaning caches and system junk file. It can boost your phone speed effectively.  WiFi Signal Booster Give a boost to your mobile internet and enjoy fast speed internet with WiFi booster. Enhance WiFi internet speed with ease and just one tab.  Completely optimize your phone can not only clean your phone junk files but also cool down phone CPU, save battery, WiFi Booster.Free Booster app for the android phone. Support for mobile and tablet. Easy to use, one tab to boost and clean. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.RESTART_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.WRITE_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RESTART_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}