{
"name" : "Servicely to control your phone",
"url" : "https://play.google.com/store/apps/details?id=com.franco.servicely",
"package" : "com.franco.servicely",
"category" : "Tools",
"description" : "Remember that time when your device lost 50% of battery life during the night because a gazillion services from careless apps kept keeping your device awake and you have no way to disable them?  Or when apps keep waking up your phone for no reason and you find no way to fix it other than uninstalling it?  Servicely to the rescue!  First of all make sure youre ROOTED (it wont work otherwise). Youll be able to select which apps will be put to sleep when the display goes off. Magic!  You can also disable/enable permanently any service on your device. Its useful if you have services that tend to auto-restart and keep your device awake, or if you have games sending you never-ending notifications.  Theres also a feature to prevent apps from running in the background (doesnt force stop or disables them) on your system. Its particularly useful to prevent popular social network apps from constantly keeping your phone awake during idle.  Disable any broadcast receiver from any app on your device!  This app is somewhat powerful so be responsible when using it.  Have a question? Feel free to reach out! Unlike most developers you will find, Im more than happy to respond.  If you have a problem, before putting in that one star review, please reach out to @franciscof_1990 on Twitter, or send me an e-mail to franciscofranco.1990@gmail.com. Im always happy to get back to you.  Disclaimer I take no responsibility for any fault or damage caused by any misuse of this app. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.DUMP', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.DUMP', 'com.android.vending.BILLING', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}