{
"name" : "PC Protect",
"url" : "https://play.google.com/store/apps/details?id=com.pcprotect.android",
"package" : "com.pcprotect.android",
"category" : "Tools",
"description" : "PC Protect is a total security package for mobiles. It combines all-in-one protection against malicious threats along with easy to use optimization tools.  We provide real-time protection against threats, meaning you are always protected wherever you are in the world. Our definition updates are continuously being updated ensuring you have the latest in threat detection technology on your mobile device. Adware, Malware or Virus files will not pose a threat to the security on your device.  PC Protect also offers a broad range of optimization tools. We give our users the ability to speed up their mobile devices, meaning they are running at optimum efficiency. Safety, Security and Speed what more could you want from a mobile application?!  Heres an overview of the PC Protect features:  Antivirus Scan: PC Protect contains a powerful antivirus engine to help protect your device from potential threats.   Disc Cleaner: Over time files, photos and junk can build up on your device. Our Disc Cleaner identifies and removes these redundant files at the tap of a button.  Privacy Lock: Ever wanted to lock down specific applications? Well now you can. PC Protects Privacy Lock gives our users the power to do this and prevent unwanted access to your favourite applications.  Quarantine: Once a threat is detected, we will automatically move this into quarantine, a safe location on your device where this file can do no more harm.  Real-time Protection: Our powerful feature monitors your device in real-time, meaning youre always protected from harmful threats!  Safe Browsing: By using our Safe Browsing feature you will guarantee safety, security and anonymity whilst browsing online. Activate now to get protected and stay free from hackers.  System Boost: Intelligently manages your devices memory usage to ensure your device is running optimally. Boost finds apps that can be ignored when the device is launched and also apps that are using too much memory or resources that can be closed.  Sign up to PC Protect today and claim your free scan. We can quickly identify any threats present and help guide you through the removal and tune-up process. We give you the ability to effectively manage your device, this is the only application youll need in the fight against malware. Activate your premium subscription today and get protected!  Subscription fees apply. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.DELETE_CACHE_FILES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.READ_PHONE_STATE', 'android.permission.CLEAR_APP_CACHE', 'android.permission.PACKAGE_USAGE_STATS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.BIND_ACCESSIBILITY_SERVICE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.WAKE_LOCK', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.BATTERY_STATS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.DELETE_CACHE_FILES', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.BATTERY_STATS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.REQUEST_DELETE_PACKAGES']",
}