{
"name" : "VIP Access",
"url" : "https://play.google.com/store/apps/details?id=com.verisign.mvip.main",
"package" : "com.verisign.mvip.main",
"category" : "Tools",
"description" : "Symantec VIP Access helps protect your online accounts and transactions by using a strong authentication process when you sign in to your VIP-enabled accounts.   Strong authentication: Provides strong, two-factor authentication when logging into your VIP-enabled accounts.   QR/App Code: Scan a QR Code to generate site-specific security codes for strong two-factor authentication to your favorite websites.  Use VIP Access at participating organizations such as eBay, PayPal, E*TRADE, Facebook, Google, or any one of the hundreds of sites within the VIP Network: :  https://vip.symantec.com  Features Strong Authentication  VIP Access adds strong authentication to your normal login in one of the following ways:   Dynamically generate a one-time use security code on your mobile device. Use that code along with your username and password.  Receive a push notification on your mobile device that you approve as authentication. If your organization requires you to define an additional device authentication mechanism to meet the security requirements, you will be prompted for the additional local authentication such as PIN, pattern, password, or fingerprint.  Use fingerprint or your security code in a push notification to authenticate yourself on your mobile device. Note: Fingerprint authentication requires that your mobile device is fingerprint capable and that you have registered a fingerprint on the device.  The strong authentication method you use depends on the method implemented by your participating organization.  You can generate a security code even if you do not have a network or mobile connection.   QR/App Codes  Scan a QR Code at participating organizations such as Google, Facebook, Amazon, and more to generate a security code every 30 seconds to securely sign in. Enter this security code along with your password to add strong authentication to your favorite websites.  Be sure to read the VIP End User Agreement after downloading VIP Access:  ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.INTERNET', 'android.permission.USE_FINGERPRINT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CAMERA', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_PHONE_STATE']",
}