{
"name" : "GlassWire Data Usage Monitor",
"url" : "https://play.google.com/store/apps/details?id=com.glasswire.android",
"package" : "com.glasswire.android",
"category" : "Tools",
"description" : "GlassWire is the ultimate data usage monitor for Android! Our app makes it easy to monitor your mobile data usage, data limits, and WiFi network activity.  Instantly see what apps are slowing your phones Internet connection or wasting your mobile data.  Key features  GlassWires data alerts keep you under your data limit and save you money on your monthly phone bill. Get alerted before you reach your carrier data limit to avoid overage fees.   See a graph of which apps are currently using your mobile carrier data or Wi-Fi Internet connection.  Instantly know every time a new app accesses the network and begins using Wi-Fi or mobile data.  Swipe right to go back in time to see which apps used mobile data earlier in the week or month. See past Wi-Fi or mobile usage by day or month.  Go to GlassWires Data Plan screen to set up zero-rated apps that wont have their data usage counted against your data plan. GlassWire can also keep track of roaming, and roll-over minutes.  Check GlassWires Speed Meter on its notification bar to quickly see real-time data usage.  Help protect your privacy and reveal suspicious app activity through GlassWires graph.  Block apps from connecting to the network, or allow or deny new connections before they start with GlassWires mobile firewall. Create multiple firewall profiles, one for mobile and one for WiFi.  Have an unlimited plan? Unfortunately, most unlimited plans will throttle you (slow & limit your connection) once you user a certain amount of data. GlassWire can alert you when you start to get throttled.  Protecting your privacy  20 million users protected! Our company based in Austin, Texas USA was founded specifically to help people protect their privacy and security. Our Windows and Android software combined have been downloaded over 20 million times! We make money through sales of our software, not by selling your data to third parties. With GlassWire your data and app usage information never leave your phone. GlassWire will NEVER show you ads or violate your privacy.  Instantly block badly behaving apps with GlassWires firewall Instantly allow or deny new app connections with GlassWires new mobile firewall. GlassWire blocks badly behaving apps! Tap our bottom right menu and tap Upgrade GlassWire Mobile to support our work and try out our firewall features for free. Your support is essential in helping us keep improving GlassWire and youll have access to all new future features we add in the future. We are grateful to those who support our hard work on this ad-free tracking-free project.  Supported mobile networks & providers GlassWires data manager features work great with many different mobile data providers and telecoms world-wide including Verizon, T-Mobile, Vodaphone, AT&T, Sprint, Magenta, and Jio. Its also compatible with 3G, 4G, 5G, Edge, GPRS, Wi-Fi, and most other popular telecommunications networks. GlassWire can also provide you with Internet usage alerts if your Cable, DSL, or Satellite ISP has data caps.  All the major Android websites love GlassWire! 10 best privacy apps for your phone - Android Authority GlassWire for Android now shows whats eating up your data - SlashGear GlassWires free Android app helps you monitor app data usage - Droid Life The best Android security apps to lock down your phone - The Daily Dot  How can we make GlassWire even better? Please join our forum forum.glasswire.com and let us know, or email us at mobile@glasswire.com. We read every email!   Bug & problem reporting Find a bug or another problem? Go to the bottom right three line menu button inside the GlassWire app, then choose Send Feedback with debug logs so we can fix the problem.   Thanks for trying GlassWire. We hope we helped protect your privacy along with saving you money in the process.   Sincerely, The GlassWire Team ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'android.permission.READ_PHONE_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}