{
"name" : "Video Downloader - for Instagram",
"url" : "https://play.google.com/store/apps/details?id=com.tools.downloadinstagram.instasave",
"package" : "com.tools.downloadinstagram.instasave",
"category" : "Tools",
"description" : "Video downloader for Instagram is the app to download Instagram photos, download videos on Instagram to your device easily and quickly.  Save instagram video is the most popular app for downloading photos and videos on Instagram. It is very easy to use. 100% FREE.  Use: 1. Open the Video Downloader for Instagram application 2. Open the Instagram app on your device 3. Select the image or video you want to download 4. Copy the link of the post (URL) 5. Paste the link in the URL box in the application (If auto download is turned off) and press Check URL button 6. Click the Download button to download the image or video Thats it - You succeeded  With some good features below: - Open Instagram from the app with one click. - Download Instagram videos and photos to view OFFLINE very quickly and easily than ever before. - Save downloaded videos and Instagram photos. - Automatically download Instagram photos and videos with one click. - Share and delete stored photos & videos - Allows you to save videos to view them later. - View Instagram photos and videos Offline at the best quality  Disclaimer: * We are not responsible for any intellectual property violations arising from unauthorized re-posting of videos or photos. * Please receive PERMISSION from the owner before you repost a video or photo. * We respect the rights of Instagram. * This app is not affiliated with Instagram and does not read your user data.  Download and experience Need help? Please send us at: klsoft92@gmail.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.SET_WALLPAPER', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}