{
"name" : "Call Flash - Color Phone Flash , LED Call Screen",
"url" : "https://play.google.com/store/apps/details?id=com.led.flash.easyflashlight",
"package" : "com.led.flash.easyflashlight",
"category" : "Tools",
"description" : "Call Flash - Color Phone Flash ,LED Call Screen Ringtone is the amazing color call flash app with call flash themes amazing ringtones and the brightest flashlight creator for you that you can create the colorful magic call flash for your call and never miss the call with nice ringtones . At the same time you can easy to use to instantly turn your device into the brightest LED flashlight .  Call Flash - Color Phone Flash ,LED Call Screen Ringtone is a power call screen flash for calls which helps you create your special unique call phone screen when you have incoming call. There are any beautiful and unique color call flash themes for you and you can make your phone call flash be more colorful . Choose the ringtone call flash themes . Make the different call flash for you call phone,  With Call Flash - Color Phone Flash ,LED Call Screen Ringtone. You can get the LED Flashlight - Super Brightest Flash& Color Flash is a free tools for you to turns your device into the flashlight. . You can switch On/Off the super flashlight just like a real handy torch light.LED Flashlight - Super Brightest Flash& Color Flash is a useful multi LED flashlight. Ultra-bright, super cool, ultra-practical flashlight software, instantly turn the phone into a real flashlight, only need LED lights permission, super convenient, when you need light, this flashlight is your best tool.  ~ Call Flash RingtoneFunction   Very cool Color Call Flash Function, there are a lot different call theme of call flash, very exciting and completely free!  Download the ringtone call flash themes so easy .  Set your favorite ringtones for your phone.  Beautiful colorful and coolVarious styles of call animation are here! Suitable for mobile phones of all call screen sizes! Easy clicks make your calls different from others  Why you need a call flash:  A variety of good-looking, colorful, and interesting call flash themes are here!   Amazing ringtones !  Set the Call LED Flash notification light reminder so you dont miss the call!  Easily find your call phone at night and in silent mode without missing a call!  Memory small start is only to get flashlight permission, very convenient! Regular update new themes!  All Android phones are available!  Now add this convenient and cool call flash function, come and use it for free!   ~ Best Brightest Flash   The flashlight app interface imitate true flashlight ,Power light switch special design makes you feel like in the use of true flashlight  ~Useful super flashlight for dark  Flashlight can quickly select lights flashing mode, lets you can revel in the party, also can use the SOS flash mode in an emergency, and allows you to get help as soon as possible, very useful!  ~Powerful LED Flashlight  The use of mobile phones on the back of the flash light, lighting effect is more bright  ~Colorful LED Flashlight style   There are 20+ LED Flashlight style for you . This flashlight with a variety of topicsskin to choose from, let your flashlight immediately and others are different, looks very cool!  ~Suitable for all models, convenient and quick   With this LED Flashlight - Super Brightest Flash& Color Flash ,you can:  1Light up your night in the event of a power outage 2Reading paper books at night 3Illuminate the road ahead when warking at night 4Party carnival for you  5Sending a sos light signal in a critical situation 6. Get the ringtones as you like.    Call Flash - Color Phone Flash ,LED Call Screen Ringtones is a free color call flash themes creator with magic call flash themes and nice ringtones and you will never missed the call. At the same time lighting tool to make the brightest LED flashlight . Strong and powerful light bright flashlight like a real handy torch light. You can use power flashlight as LED light torch widget while walking in darkness.  ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.READ_CONTACTS', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'com.popwindow.suspension.data', 'android.permission.CALL_PHONE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FLASHLIGHT', 'android.permission.DISABLE_KEYGUARD', 'android.permission.REORDER_TASKS']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.REORDER_TASKS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'com.popwindow.suspension.data']",
}