{
"name" : "Digital Alarm Clock",
"url" : "https://play.google.com/store/apps/details?id=com.andronicus.ledclock",
"package" : "com.andronicus.ledclock",
"category" : "Tools",
"description" : "Digital Alarm Clock is a reliable, stylish and easy to use talking alarm clock & widget that can be customised to your needs.   The alarm clock that wakes you in the morning can have an impact on the rest of your day and we know that most people prefer to be woken with a different alarm on a weekend to that of a working day. Digital Clock offers you this functionality and much more.  Looking for a talking clock? Look no further. Using the powerful Text To Speech engine, tapping the display announces the time in a clear manner.  Digital Alarm Clock FREE Features   ALARM OPTIONS  Each alarm can be individually customised  Built in tones or wake to your own music  Fade in alarm  Nap Timer on main display means you can set a quick alarm in just 2 clicks!  Shake to snooze, number of snoozes, custom snooze time  One off alarm, recurring alarm, date alarm   DISPLAY OPTIONS  Completely customisable  Day & Night mode with individual brightness and volume settings  Built in nightlight softly illuminates the whole screen  Anti Burn moves the clock to look after your display  Optional day, date, seconds, AM/PM indicator, flashing separator  Select your preferred date format  Choose from over 16 million colours & several display fonts  Fits to the size of your screen or pinch to resize   EXTRA FUNCTIONALITY  We have thought of everything  Talking Clock. Simply tap to hear the time (requires TTS engine on device)  Silence notifications ensuring a peaceful sleep  Automatically launches when charging or docked for bedside use  Alarm clock automatically closes when the charger is unplugged or undocked  Handy widget allows you to see the time in style on your homescreen and quickly access the alarms screen.  Important  Task killer applications can interfere with alarm clock applications. If you experience issues with alarms not activating and you use task-killing applications then you must add Digital Alarm Clock to the whitelist.  Permissions  All permissions required are requested for legitimate use by the application and further information can be found at https://squarenotch.zendesk.com ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.andronicus.ledclock.permission.C2D_MESSAGE', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.DISABLE_KEYGUARD', 'android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}