{
"name" : "BullGuard VPN | Unlimited WiFi Internet Privacy",
"url" : "https://play.google.com/store/apps/details?id=com.bullguard.bullguardvpn",
"package" : "com.bullguard.bullguardvpn",
"category" : "Tools",
"description" : "Its never been easier to have complete online privacy and total Internet freedom. BullGuard VPN gives you the flexibility to safely and securely access the Internet and online services from home, work or abroad.   BullGuard VPN   No logging or tracking policy  BullGuard VPN does not log what youre doing online, nor keep records of the websites you visit, ensuring you have complete online privacy and security.  Easy access  Are you already protected by BullGuard Internet Security? Its easy to log in to BullGuard VPN. Simply use your current BullGuard account credentials.  Total freedom online   Secure up to six devices simultaneously with a single BullGuard account.  Secure your privacy   Military grade encryption provides bulletproof protection for data, so no one can snoop on your communications.  Simple and easy to use   Simply click on Quick Connect for one click access to the nearest BullGuard VPN server which connects you based on several factors including your current location. Or you can choose the country of your choice to connect to a server in that country.  Auto-Connect   Enable Auto-connect VPN for open Wi-Fi networks, and BullGuard VPN will identify open Wi-Fi connections and automatically starts the VPN to ensure you are protected.  Use it on multiple devices   Besides the mobile VPN for Android, you can connect to BullGuard VPN on all your devices. Simply get the apps for Windows, Mac or iOS.    Free 24/7 support  Unlimited bandwidth  6 simultaneous connections with 1 account  Military-grade encryption protocols (OpenVPN, Ikev2 / IPsec) ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}