{
"name" : "Voice Search - Speech to Text Searching Assistant",
"url" : "https://play.google.com/store/apps/details?id=com.prometheusinteractive.voice_launcher",
"package" : "com.prometheusinteractive.voice_launcher",
"category" : "Tools",
"description" : "With over 5M installs and 4.2() stars rating on Google Play, we are proud to introduce - Voice Search - Speech to Text Searching Assistant  Voice Search - Speech to Text Searching Assistant makes it faster and easier than ever to search apps, web search, or image search for the content you want. It works as an assistant to Youtube, Google, Wikipedia, image gallery and other apps installed in your device, and allows you to turn normal talk into searching text.  Download Voice Search - Speech to Text Searching Assistant now from Google Play, speak to your mic and start searching easier, faster and smarter!   Features:  Simple to use - search using your mic!  Accurate speak to text vocie recognition  The fastest way to search  Easier and more natural than typing  Web search your favorite sites  Smart voice-controlled searches inside your apps: Google, Youtube, Wikipedia and more!  Multiple languages support -  English  Spanish  Arabic  Chinese  Russian  Portuguese  Turkish  Vietnamese  Japanese  and many more!  Quick image search   Dont wait! Download Voice Search - Speech to Text Searching Assistant now, and become a smart searcher!  Go back to natural. Have you ever stopped to think how smartphones changed how we talk and behave?  Thats ok, most of us didnt. But still, never before have we used written text for immediate needs, and there is a simple reason why: it just takes more time and energy! The first early phones didnt have this feature, they simply had a microphone to talk and a speaker to hear, and despite their unimaginable revolution, they didnt take us so far from our everyday behaviour.   Easier, Faster, Smarter. Voice-controlled Search allows you to go back to simplicity. It uses your smartphones mic to detect your search of choice as you speak, and using smart algorithm turns your microphone vocie input into text without ever needing to type!  Say goodbye to your keyboard and hello microphone! Download Voice Search - Speech to Text Searching Assistant now and go back to simplicity of speak!  Accurate voice-controlled recognition. How annoying it is to count on your vocie search feature and find out it cant actually recognize your words No more need to worry - everything is ok!  Upon downloading youll find out Voice Search detects what you speak correctly over 90% of the time. Not only that, it supports multiple languages and can recognize them quickly and accurately:  English  Spanish  Arabic  Chinese  Russian  Portuguese  Turkish  Vietnamese  Japanese  and many more!  Are you still here??? What are you waiting for? Download Voice Search - Speech to Text Searching Assistant now! Happy searching :) ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.VIBRATE', 'com.prometheusinteractive.voice_launcher.permission.C2D_MESSAGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.READ_APP_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.ACCESS_NETWORK_STATE', 'com.oppo.launcher.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}