{
"name" : "Appsticker [Quick Launch]",
"url" : "https://play.google.com/store/apps/details?id=com.Appsticker.Smart",
"package" : "com.Appsticker.Smart",
"category" : "Tools",
"description" : "Appsticker is an app that lets you customize your Android in a different way from all other apps. In a few words, you can create shortcuts to other apps from the screen of your device. For instance, if you use Twitter often, you can create a Twitter shortcut thats always visible so even when youre using other apps, you can access Twitter by just tapping the semitransparent icon.   From the settings you can choose which apps you want to create a shortcut for on your device. On top of that, of course, you can place the shortcut icons wherever you please. Want them in the margins? Margins it is, then. Or maybe the center of the screen? Well, thats possible too. You have total freedom to decide where in your screen they should go. You can even set the opacity and size of each icon separately.  Appsticker is an excellent way to always have your favorite apps at hand. Thanks to this app, Whatsapp, Snapchat, Twitter, or Facebook will always be a tap away, no matter what youre doing with your phone at the time.  You can run the Apps instantly without going to the home screen to look for Apps.  Setting the frequently used app allows you to easily use the program by showing the icon of its designated app on the screen all the time.  Setting the frequently used app allows you to easily use the program by showing the icon of the app on the screen all the time, and shaking and using home key enable you to use the quick play and conversion.  You can show the icons categorized by apps or show one main icon for app conversion.  You can experience much better functions at Appsticker Pro. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.EXPAND_STATUS_BAR', 'android.permission.CALL_PHONE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.RESTART_PACKAGES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES']" 
"extra_perms" : "['android.permission.EXPAND_STATUS_BAR', 'android.permission.CALL_PHONE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RESTART_PACKAGES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW']",
}