{
"name" : "UKeyboard",
"url" : "https://play.google.com/store/apps/details?id=com.ukey.translitoral",
"package" : "com.ukey.translitoral",
"category" : "Tools",
"description" : "Application Supports 6.0+  **** In case you dont see text it simply means your device dont support the character set. ****  *** If you are unable to see language suggestion by Keyboard please download fonts available in settings. ***  ** Download the fonts from keyboard interface **  * Now Support offline conversion (Cache Supported) -> You will need internet for the first time to write a world -> More you use better it gets! *  Multilingual keyboard (Including the Indic Languages).  A unique keyboard which provides the facility to use transliterate ( A facility by which you can write your native language using English keyboard. )  Application supports a wide variety of options  ENGLISH, AMHARIC, ARABIC, BENGALI, CHINESE, GREEK, GUJRATI, HINDI, KANNADA, MALYALAM,MARATHI, NEPALI, ORIYA, PERSIAN, PUNJABI, RUSSIAN, SANSKRIT, SERBIAN, TAMIL, TELEGU, TIGRINYA, URDU  You will be able to see the text in above mentioned languages in the suggestion field, so that you can choose the correct one. But once selected (Manually or by pressing space bar) it will be responsibility of the application to support that language on which you are working.  Please remember... font support is provided by the devices, so if you are unable to see a particular font then it means the support for that language is not available for your device.  Please let me know if any particular language is not showing in suggestion section.  In case you dont see text it simply means your device dont support the character set.  Application uses Internet It connects to Google Server - I will recommend you not to use this while using your credit / Debit cards as i am also not sure about the caching of Data by the server.   Request you to put some constructive comments... which can help application evolve... :)  Please read the blog to know installation process : http://abhinavasblog.blogspot.com/2011/12/transliteration-keyboard.html  *********** CHANGES******* V4.0 # Updated permission to read FONTS # Updated Settings UI # Experimental feature Key Shortcuts # Updated Emojis for new and old device V3.3 # Fixed language not appearing issue even after downloading font. # FIXED CRASH V3.2 # Fixed Issue for Gingerbread when downloading language pack. # Reduced application size from 24MB to 900KB # Download your fonts from menu in Ukeyboard settings page. # Bug Fixes # More colors to choose # Languages added so can see in suggestion even if phone do not support the font. # Added Hepatic feedback. # Added keyboard customization support. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}