{
"name" : "Hotspot VPN - Super Free VPN Unlimited Proxy",
"url" : "https://play.google.com/store/apps/details?id=com.supervpn.freevpn",
"package" : "com.supervpn.freevpn",
"category" : "Tools",
"description" : "Hotspot VPN ( Free Unlimited VPN Proxy ) - The best vpn for android, 100% free VPN app, 100% unlimited VPN  What do you expect from a great VPN app? # Unlimited Bandwidth to use # Endless list of countries to connect to worldwide! # Simple one click to connect # Super fast speed vpn # Unblock any apps and sites in any country # VPN for privacy , WIFI Security # IP vanish/ IP Fake  # Hotspot VPN # Unblock VPN for VOIP(Based on openvpn, support all voice call and video call) # Unblock APP and site for school   FREE - 100% unlimited free VPN proxy!  - No credit card information needed. No trials offered.  Multi VPN servers - vpn for United States, USA - vpn for Germany, DE - vpn for India, IN - vpn for Singapore, SG - vpn for Canada, CA - vpn for Russia, RU - vpn for Japan, JP - vpn for United Kindom, UK - vpn for Nederland, NL   Unlimited - Truly unlimited No sessionspeed and bandwidth unlimitation, Torrents and file sharing are allowed.   Unblock  - Unblock websites with free VPN proxy server.  - Bypass the firewalls as school proxy while you are at school or at work. - VPN can also unblock video not available in your country. - Unblock blocked websites such as: Netflix, YouTube, Instagram, Snapchat, Twitter, Facebook, Viber, Skype, WhatsApp, Wechat etc   Security - NO LOGS! That means, that youre absolutely anonymous and protected while using our app. - All of your traffic (UDP / TCP) is encrypted while FREE VPN is on.Based on Openvpn. - FREE VPN protect your privacy, keep you safe from 3rd party tracking. - FREE VPN protect your network traffic under WiFi hotspot browse anonymously and securely without being tracked.    Stable and Speed VPN - Top Speed VPN & Stable Connection - Perfect support for Saudi Arabia (SA) and the United Arab Emirates (UAE)   Fast VPN - 100+ free cloud proxy server to provide better net service.100% top speed vpn server.   Simple  - Easy to Use, Just Press a button and connect a betternet  -------------------------------------------   Why using a VPN  With a VPN, you are not only able to unblock geo-restricted or censored services, such as Facebook, Pandora and Youtube; your online privacy and security will be greatly bolstered as youll be surfing the web completely anonymously.   Why Hotspot VPN  Hotspot VPN is 100% free, unlimited, secured and super easy to use. You can connect to any of the servers below (Sweden, United Kingdom, Denmark, United States, Netherlands, and Canada) to enjoy unlimited online privacy and freedom. With Hotspot VPN you can    Access any website in any country. Bypass geo-restrictions to unblock any website wherever you are! Get access to sites that are blocked or censored by government, school or workplace. Evade firewalls to unblock Facebook, watch YouTube, and circumvent VOIP limitations.    Protect Your Data from Hackers. When youre connected to a public Wi-Fi Hotspot, your name, passwords, and personal information can be easily compromised. Hotspot VPN encrypts your data and provides you with banking-level security for the best protection.   Hotspot VPN is a one-click VPN Proxy Service. Hotspot VPN contains only one button. The button connects you to one of many anonymous servers at speeds faster than a web proxy. When you are not running our app we help you save your devices battery. And, we are a completely unlimited and free VPN!   Surf the Web Anonymously. Avoid being snooped by your ISP and prevent websites from ad tracking and targeting. Hotspot VPN changes your IP address, so your online identity is anonymous and your internet activity is inaccessible to prying eyes and businesses.  Please dont download BitTorrent and any P2P. Otherwise, you will be blocked! Porn sites and adult content(including Porno Torrent and Sex sites) are not allowed, you will be blocked! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}