{
"name" : "FREEDOME VPN Unlimited anonymous Wifi Security",
"url" : "https://play.google.com/store/apps/details?id=com.fsecure.freedome.vpn.security.privacy.android",
"package" : "com.fsecure.freedome.vpn.security.privacy.android",
"category" : "Tools",
"description" : "F-Secure FREEDOME is the VPN app trusted by experts and journalists around the world, brought to you by a company with a 30-year reputation of respect for users privacy. FREEDOME VPN is fast and has unlimited bandwidth. Try for free!  Make your Wifi use and surfing private with this easy, no ads VPN with the following features:  ANONYMOUS VPN: Like an anonymous proxy but faster, FREEDOME VPN hides your tracks online with no ads  WIFI SECURITY VPN: Connect to any hotspot anonymously with a VPN. Encrypt your personal traffic and keep it private with VPN  CHANGE IP ADDRESS: With FREEDOME VPN, you can hide your IP address for an extra layer of privacy and change your virtual location to face less geo-restrictions.   EASY VPN: FREEDOME has been designed to be really easy to use so that anyone can use it as a personal proxy or as a no ads VPN.  Having unlimited bandwidth on your easy VPN while surfing securely on Wifi and mobile connections means all your data stays private and you do not have to worry about bandwidth limits when connecting to unsafe hotspots.  Unlike an anonymous Wifi proxy or another type of hotspot shield, an easy VPN like FREEDOME gives you fast and easy encrypted access to the internet. It is your personal VPN tool with no ads!  REASONS TO GET FREEDOME VPN:   FREEDOME has unlimited bandwidth  FREEDOME is an easy VPN to use  Surf privately on any WIFI hotspot  More reliable than a Proxy  Looking for easy VPN access to blocked content that is easier than a proxy, has no ads and unlimited bandwidth? FREEDOME VPN gives you all this.  For frequently asked questions and help, please visit our Community: https://community.f-secure.com/  One subscription covers all your Android-devices. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}