{
"name" : "Video Downloader for Instagram & Facebook",
"url" : "https://play.google.com/store/apps/details?id=com.galaxystudio.fb.insta.downloader",
"package" : "com.galaxystudio.fb.insta.downloader",
"category" : "Tools",
"description" : "- Best video downloader for Instagram & Facebook   - Easy to download video and images from Instagram & Facebook  - Easy download video from IGTV and Story.  - Allow you to download Instagram, Facebook photos & videos in HD quality, allowing you to see them anytime, anywhere.  - Video Downloader can help you download and save videos from your Facebook news feed, groups, pages, friends, etc  - Easily download videos directly from the Instagram to your device. All formats are supported. The video downloader automatically detects the video, which you can download with just one click.  *** How to download Video and Images in Instagram  1. The first way - Copy link video on Instagram paste to input in app - Then download to open later on Instagram  2. The second way - Open Instagram - Choose videos, Click copy link - This app auto detects and paste link video - Download, open or share video  *** How to download video Facebook  - Click or selected Browse Facebook. - Login facebook with your account. - Click to play video you want. - Click Watch to watch video live on your wall. - Click Download to download video. - Click Share to share link with your friends.  - Support downloading multiple files at once and arranging scientifically.  - It is very easy and fast to use.  - Easy to share or repost other social networks   *** Feature  - Support download video 4K - Speed up downloading videos and photos - Easy to you   *** Important Notes: - This app is NOT affiliated with or endorsed by the Facebook official network. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}