{
"name" : "E & E Engineering. Free.",
"url" : "https://play.google.com/store/apps/details?id=com.diks.eengineering.free",
"package" : "com.diks.eengineering.free",
"category" : "Tools",
"description" : "A powerful application which contains useful for radio Amateurs, electrical engineering and the people related professions functionality. Will allow you to quickly perform the necessary conversions and calculations with minimal downtime. Perfect for students.  In the program: Resistors:  Resistor color code calculator (value to color and color to value, 3-6 bands)  Calculator for parallel resistors and resistor in series  SMD resistor code calculator (Alpha-Numeric format, SMD 2, 3, 4 digit, EIA-96 and BS 1852)  Calculator for resistive divider  Led resistor calculator  Capacitors:  Calculator for parallel and series capacitors  Capacitive divider  Capacitor color codes (Alpha-Numeric format)  Capacitor reactance  Motor:  Calculator for run and start motor capacitors (three-phase motor in single-phase)  Calculation of the nominal motor current  Active power consumed from network  Nominal torque on the motor shaft calculator  Ohms law & etc.:  Power calculation  Voltage calculation  Current calculation  Power dissipated in the load (resistor)  Frequency converter (frequency, period, wavelength)  RC filter (component value -> frequency and frequency -> component value)  LC circuit (frequency, capacitance and inductance)  PinOuts:  USB port  Parallel port  Serial port (RS232)  Ethernet (RJ45)  Conductor:  Wire diameter  Cross-sectional area converter  Unit converter:  Pressure converter  Mass converter   Temperatures converter  Energy and work  Decibels at times  Integrated circuits: (Only in a Pro version)  LM317 - voltage and current  TL431 (two options)  555 (NE555 and clones) AStable, Monostable (frequency, period, components values) ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.diks.eengineering.free.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}