{
"name" : "IP Camera Monitor – Video Surveillance Monitoring",
"url" : "https://play.google.com/store/apps/details?id=com.ip_camera_monitor",
"package" : "com.ip_camera_monitor",
"category" : "Tools",
"description" : "Remotely access and control your IP Cameras from anywhere.  Set up an effective IP camera video monitoring system within minutes!   View live video from any IP camera remotely. IP camera models from different vendors are supported. Any camera that supports ONVIF and present in the local network will be automatically detected by IP Camera Monitor. If the camera is present beyond the local network then you can manually add such cameras in the application.  IP Camera Monitor is the best app for video surveillance. Watch a live video of any camera directly from your phone no matter where you are. You can also capture photos of the event.   IP Camera Monitor with Security Monitor Pro is a perfect combination when you need to control Security Monitor Pro cameras remotely on your Android device. Security Monitor Pro is a professional video surveillance software which turns your PC and IP cameras into a full video security system.   You need to install Security Monitor Pro on your Windows PC.   Watch the video tutorial to see how easy it is to connect to Security Monitor Pro and remotely access cameras on your Android mobile device.   Keep an eye on your home, office, parking area or anywhere you need security.  Key features:   Auto detects ONVIF cameras within the local network: View a live video of all the ONVIF cameras present in your local area network. These are automatically detected by IP Camera Monitor.   View IP cameras from anywhere: Add IP cameras present beyond local area network and see whats happening in your home, office or parking area.    PTZ support for IP cameras: Adjust the orientation, rotation and tilt direction of your camera preview using Pan-Tilt-Zoom camera controls.   Access to Security Monitor Pro cameras: Now access and control cameras added in Security Monitor Pro directly from your phone. You can remotely control actions such as monitoring, video recording, and capturing a photo. Access recorded media files and event logs directly from your device.  LIKE US and STAY CONNECTED  Facebook: https://www.facebook.com/Deskshare-1590403157932074 Deskshare: https://www.deskshare.com Contact Us: https://www.deskshare.com/contact_tech.aspx ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}