{
"name" : "Ubidots GPS Tracker",
"url" : "https://play.google.com/store/apps/details?id=com.ubidots.ubidots",
"package" : "com.ubidots.ubidots",
"category" : "Tools",
"description" : "Welcome to Ubidots GPS Tracker for Android devices. This app will push your actual location to the Ubidots API; just login to Ubidots from the app and it will start pushing your location data at regular time intervals.   Once your location data reaches the Ubidots cloud, you can create a real-time map to embed in external web apps.  www.ubidots.com is a cloud service to store and analyze sensor data in real-time. If you are a hardware engineer building IoT (Internet of Things) applications, check out how to push other types of data from any Internet enabled device: http://ubidots.com/docs/devices/  If youd like to see how this app was made, go to: https://github.com/ubidots/ubidots-android-app  Our application asks for these permissions to install:   Your location: We ask permission to access your location, so we can push that data into Ubidots and show it to you in a map.  Modify or delete contents of your USB storage: This doesnt mean we are going to access your storage to read all your files! This is needed because we save some values for the configuration of the application.  Read Google service configuration: This is needed by the application to show the map.  Full network access & view network connection: We need to know if you are connected to the Internet to push the data to Ubidots. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.ubidots.ubidots.MAPS_RECEIVE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.ubidots.ubidots.MAPS_RECEIVE']",
}