{
"name" : "GNSS View",
"url" : "https://play.google.com/store/apps/details?id=com.nec.android.qzss.gnssview",
"package" : "com.nec.android.qzss.gnssview",
"category" : "Tools",
"description" : "This application enables you to see where the Quasi-Zenith Satellite System in the sky  What is QZSS Quasi-Zenith Satellite System (QZSS) is a Japanese satellite positioning system composed mainly of satellites in quasi-zenith orbits (QZO).  Satellite positioning systems use satellite signals to calculate position information. One famous example is the American Global Positioning System (GPS) and the QZSS is sometimes called the Japanese GPS. For details, please refer to the following Website Quasi-Zenith Satellite System. URL : https://qzss.go.jp/en  What is GNSS View GNSS View provides that android version application that is based on the website application GNSS View. This application is optimized for the 32bit.  This application enables you to know position of positioning satellites such as QZSS and GPS in the specified time and location.   The positioning satellites displayed in the GNSS View are not based on the satellite information directly received by the smartphone but are displayed based on the satellite arrangement calculated based on the publicly released orbit information.  GNSSView 3 functions Main You can move to the Position Radar screen or AR Display screen from the application startup screen. You can see the operating manual and privacy policy of this application via the website.  Position Radar It is provided radar view of positioning satellites such as QZS and GPS as a sky plot at the specified time and location.  Positioning satellites can be specified from QZSS, GPS, GLONASS, BeiDou, Galileo, SBAS. You can also select specified signal satellites to see on the radar. You can see selected satellites by setting elevation mask angle. You can switch east and west of satellite arrangement, turn on / off rotation, and switch on / off display of satellite number. It displays HDOP, VDOP, the total number of satellites and the number of each positioning satellites in the satellite arrangement displayed on the radar.  AR Display Position of positioning satellites such as QZSS and GPS on the sky from your current location is able to see through your android camera at the specified time. In order to display satellites, it is necessary to turn on the position information of the smartphone and complete the positioning. Therefore, it may take time to display. Positioning satellites can be specified from QZSS, GPS, GLONASS, BeiDou, Galileo, SBAS. You can also select specified signal satellites to see on the radar. You can see selected satellites by setting elevation mask angle.  Supported versions Android 4.0 Android 4.1 Android 4.2 Android 4.3 Android 4.4 Android 5.0 Android 5.1 Android 6.0 Android 7.0 Android 7.1 Android 8.0 Android 9.0 ",
"desc_perms" : "['android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
}