{
"name" : "Precision GPS Free",
"url" : "https://play.google.com/store/apps/details?id=com.sciencewithandroid.precisiongpsfree",
"package" : "com.sciencewithandroid.precisiongpsfree",
"category" : "Tools",
"description" : "Precision GPS Free uses your devices GPS sensor to measure your location more accurately than is possible with typical GPS apps. Turn your phone or tablet into a precision GPS instrument.  Normally, software on your Android device determines your location from individual GPS readings. This is fine if your are interested in getting your location to within about 10 meters. However, it is possible to do better than this if you average many readings at a particular location.  This app is designed to do just that -- average many readings of a stationary Android device to get a more accurate location; it actually calculates a weighted average, accounting for the accuracy of each reading. The trade-off is time. You will need to wait a least a few minutes to get a high accuracy average location.  Precision GPS Free displays the following information on the main screen:  -start/stop button, -reset button, -battery power remaining as percentage, -current latitude and longitude, -round number, -elapsed time, -number of GPS satellites in view, -number of GPS satellites employed in fixing location, -signal-to-noise ratio of signal from each satellite, -accuracy of the current readings, -weighted average (mean) latitude and longitude, -graph of the current latitude and longitude (white connected points) and the average value (red dot), -bounding scale box (green) around mean position with a width and a height of 2 meters.  The reset button is inactive while readings are being taken. It can be used after the stop button is pressed. If the measurements are stopped and then started again without pressing the reset button, then only the elapsed time value is reset.  The latitude and longitude values are shown on the graph. North is towards the top and east is toward the right, as in a map. The graph automatically rescales to include the extreme values of longitude and latitude each time it updates the graph (every four seconds). The green scale box is not always square in shape, since the graph latitude scale is not necessarily the same as the graph scale in longitude.  The app times out after 30 seconds if the device cannot get a satellite fix.  A settings screen provides an option to keep the screen continuously on while the app is running.  Localization language support is provided for French, German, and Spanish.  This app does not save or transmit any personal information, including location or pictures. All the required permissions relate to the GPS operation and the ads.  Applications of Precision GPS Free include navigation, geocaching, prospecting, emergencies, surveying a property, observational astronomy, and archaeology.   A pro version of this app is also available, called Precision GPS Pro. It adds elevation and HDOP, PDOP, VDOP data and options to save the location (and copy to the clipboard), change the interval that readings are taken, display UTM coordinates, display a sky map of the active satellite positions, run in the background, change the format of the coordinates, and send the average coordinates to a mapping app, such as Google Maps. The pro version is also ad-free.  If you have any suggestions for improvements or problem reports, please contact us at ggonzo47@gmail.com. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}