{
"name" : "Locker for Whats Chat App - Secure Private Chat",
"url" : "https://play.google.com/store/apps/details?id=com.systweak.lockerforwhatsapp",
"package" : "com.systweak.lockerforwhatsapp",
"category" : "Tools",
"description" : "Are you looking for an app that consumes less battery and helps secure group & individual WhatsApp chats? If your answer is yes, you have come to the right place.  Download and install Locker for Whats Chat App on your Android device as it the answer to your questions.  This best WhatsApp locker app helps lock both WhatsApp and chats be it individual or group thereby preventing unauthorized access. Locker for Whats Chat App is your personal guard to secure sensitive and private chats from unauthorized access.  With this app installed on your Android device, you can easily protect your WhatsApp chats from friends who borrow your phone just to spy on you.  Locker for Whats Chat App is one of the best locker apps to lock your WhatsApp chat and application. It helps lock your chats with passcode or fingerprint.   Stop worrying about your private information being exposed.  Outstanding features of Locker for Whats Chat App  Free to use   Best for locking WhatsApp chats  Protects WhatsApp application from unauthorized access  Uses less space   Does not drain the phones battery  Minimum permission required  Does not share data   Supports fingerprint sensor for easy unlocking   Single password for chat and app so that you dont have to remember multiple passwords.  App size is about 3MB and works fast  Supports PIN and fingerprint  Secure group or individual chats.  Lock complete WhatsApp application   How does it works?  1. Download and install the app. 2. Once installed launch app and give the required permissions.  3. Set passcode.  4. Tap + to add the chat you wish to lock.   Youre all set. Now each time anyone tries to access locked chat they will need to enter the set passcode.   Long gone are the days when your friends were able to snoop into your WhatsApp chats as they were unlocked. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BIND_ACCESSIBILITY_SERVICE', 'android.permission.GET_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'com.android.vending.BILLING', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}