{
"name" : "Sound Meter PRO",
"url" : "https://play.google.com/store/apps/details?id=com.soundmeter.app",
"package" : "com.soundmeter.app",
"category" : "Tools",
"description" : "Sound Meter PRO is professional sound meter for your Android. Sound Meter is also known as sound level meter, decibel meter (dB meter), noise meter, sound pressure level meter (SPL meter). Sound Meter PRO uses your Androids microphone to measure levels of noise or sound pressure levels and displays measured data in dB (decibels) with reference to generally known noise (provided by American Academy of Audiology) or displays the noise data on easy to read graph for the last 30 seconds of app use.   Microphones in Android devices are made to record human voice, therefore the maximum noise is limited and very loud sounds cannot be recognized (in most cases above 100dB). Sound Meter PRO is calibrated to be accurate in +-2.5 dB range of actual noise level and is probably by far the most accurate sound meter on Google play. We have adjusted Sound Meter PRO with the use of professional sound meter used by sound engineers and made required adjustments for many Android devices, including the most popular devices on the market today.  Levels of Noise In decibels (dB) according to American Academy of Audiology (www.audiology.org): 140 dB - Gun shots, fireworks 130 dB - Jackhammers, Ambulance 120 dB - Jet planes taking off 110 dB - Concerts, Car horns 100 dB - Snowmobiles 90 dB - Power tools 80 dB - Alarm clocks 70 dB - Traffic, vacuums 60 dB - Normal conversation 50 dB - Moderate rainfall 40 dB - Quiet library 30 dB - Whisper 20 dB - Leaves rusting 10 dB  Breathing  Why would you use Sound Meter PRO? Measure the noise your neighbors make, check new computers, refrigerators, air conditioning units before your buy them for noise levels and select the more quiet ones, to have less noise pollution in your home. Measure how loud your car, motorcycle is. Adjust the sound system for the party you are making to safe levels not to damage peoples hearing. Measure the noise in the apartment, house you are about to buy, it might be too noisy to live in and demand for extra noise insulation. Measure your love ones snoring levels and show them the graph after. Possibilities are endless, Sound Meter PRO is a must have app for every Android device. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO']",
}