{
"name" : "Antivirus & Virus Cleaner, Applock, Clean, Booster",
"url" : "https://play.google.com/store/apps/details?id=com.antivirus.mobilesecurity.viruscleaner.applock",
"package" : "com.antivirus.mobilesecurity.viruscleaner.applock",
"category" : "Tools",
"description" : " 4.7 High Rating on Google Play! Ratings beyond 95% Antivirus apps, Enjoyed by 10 million Users Worldwide  Security Master & Antivirus is the worlds most reliable all-in-one device optimization and protection application, free virus cleaner for android. Use Antivirus & Security to protect your phone optimally in your daily life.   With Security Master & Antivirus you will be protected from viruses and malicious software in an efficient, antivirus app for android and easy way and is equipped with application lock features, scan and security Wi-Fi, speed up the phone, virus clean and virus booster and cleaner, clean phone memory and storage space, antivirus for android phones free.   FREE ANTI-VIRUS Antivirus application will virus scan on your device to protect your device against potential threats, remove virus from phone. Scan system pre-installed and user-installed applications to ensure your device is always protected. Trojan virus remover for android, anti malware virus remover, anti adware for android phones free. Also, remove harmful content or give alerts to your Android device with virus remover app for android phone.  PHONE BOOSTER SPEED UP Clean up memory (RAM) and memory booster ram optimizer your phones speed by removing excess background tasks. Stop Auto-start applications to speed up and reduce memory usage, phone optimizer and booster. The mechanism of action is that it monitors processes, applications running underground on your phone ram booster for android. And when the device detects the excessive use of the RAM, it automatically closes unnecessary applications that are not needed to improve the performance of your device, ram cleaner speed booster.   APPLOCK PASSWORD The best fingerprint applock software or application that helps protect your smartphone and other personal information. App locker with password of pattern can lock and protect applications like Facebook, WhatsApp, Line and almost all other applications from intruders with applock fingerprint and password.   WIFI SECURITY PROTECTION  The application helps protect your wifi network from hacker attacks. Free, fast and compact network tool. You can check wifi security identify rogue Wi-Fi hotspots to protect your online security information, detect DNS/SSL spoofing attacks and spoofing ARP.  Feature highlights of virus removal software:    Scans applications, games, settings and files in real time from virus killer, virus remover & virus cleaner free.  Scan WiFi network to detect encryption problems, weak passwords, and other threats  The compact installer is only 4Mb  Junk cleaner and antivirus, clean junk file ram cache and virus  Clean junk files and boost my speed, clean my android  Scans for apps, games, and files, and removes harmful content  Interrupting tasks and processes can slow down your device  Speed up your phone to free up RAM, speed up phone performance and ram booster speed up your phone.  Display charging information on the lock screen  Fingerprint lock screen hide app security  Support to lock apps with fingerprint, lock apps with password, lock apps with pattern.  Best antivirus app for android, anti malware and spyware for android and antivirus apps new 2020.  Back up and uninstall applications, antivirus cleaner for android free  24/7 phone protection helps protect your smartphone from potential threats with mobile security virus.  Quick and convenient scanning takes just seconds with mobile antivirus software .  Antivirus free virus cleaner 2020, virus removal for android   Track applications running underground, showing memory usage of each application  Free (Advertising)  If you like Security Master & Antivirus, please download free antivirus apps and rate 5  for us. If you have a problem with this antivirus software for android mobile leave feedback and we will fix it and assist you as soon as possible.  ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.PHONE_STATE_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.GET_TASKS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_FINGERPRINT', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.WAKE_LOCK', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.CLEAR_APP_CACHE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.PHONE_STATE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.KILL_BACKGROUND_PROCESSES']",
}