{
"name" : "Free VPN lite 2020: Streaming vpn Proxy App",
"url" : "https://play.google.com/store/apps/details?id=com.adyala.freevpn2020.stream_vpn.vpn_secure.streaming_vpn2020.purevpn.free.proxy.new_free_vpn",
"package" : "com.adyala.freevpn2020.stream_vpn.vpn_secure.streaming_vpn2020.purevpn.free.proxy.new_free_vpn",
"category" : "Tools",
"description" : "VPN for streaming 2020 by VPN lite 2020 is a completely free and unlimited VPN proxy app for Android devices - no registration needed. VPN lite 2020 provides100% free and unlimited high speed, VPN for streaming 2020 by Free VPN lite 2020, the most trusted secure privacy VPN and access platform to help you connect the world. VPN lite 2020 is a professional free VPN app for unblock proxy.  What is VPN?  VPN stands for Virtual Private Network that creates a safe, encrypted connection. When connecting to a fast VPN server through VPN proxy app 2020: it sets up a secured and encrypted connection to the server. Encryption processed data cannot be filtered or blocked. For example, if you live in Iran connected to a VPN server in the US, your traffic would look like coming from the US or the United States, instead of Iran. Want to access some websites? VPN lite 2020  the best free unlimited VPN is the best solution for you by privacy wifi free VPN. Streaming VPN Proxy App with Hotspot is the fastest free VPN app for android to unblock videos, sites, etc. Unblock your favorite videos with free Streaming VPN Proxy App 2020. The main feature of Free Unlimited VPN 2020   Unlimited: truly unlimited WiFi hotspot app with no bandwidth limitation.  Support: We are waiting for your feedback on this Lite VPN 2020: Streaming VPN Proxy App so that we can improve incoming updates.  Free: 100% free unlimited WiFi hotspot app 2020.  Simple: Unblock the world with One-click by High streaming VPN 2020 is the best VPN service.  Secured: VPN proxy app 2020 ensure the fastest VPN speed and most stable and secured connections.  Why using a free VPN hotspot 2020 With Vpn hotspot 2020 you can unblock geo-restricted or censored services. VPN proxy app 2020 protects online privacy and security.  Why Vpn hotspot 2020 Vpn hotspot proxy app 2020 is 100% new, free, fast, unlimited, secured and super easy to use.  VPN lite 2020 unblocking provides unlimited online privacy and freedom. With Lite Vpn hotspot proxy app 2020 you can access any website in any country just bypass geo-restrictions to unblock any website. Hotspot proxy app 2020 gives you access to sites that are blocked or censored by government, school or workplace is the best VPN service.  Streaming VPN Proxy App 2020 unblocks it all with its free VPN app  Protect Your Data from wifi Hackers.  When youre connected to a public Wi-Fi hotspot or local network, your personal information can be easily compromised. Streaming VPN Proxy App 2020 encrypts your data and provides you with a secure connection. New VPN 2020 with the hotspot provides you the most trusted privacy, security, and access platform to help you connect the blocked site and proxy. Lite VPN 2020 provides you one-click VPN Proxy Service  Lite VPN 2020 or streaming VPN Proxy App contains only one button to connect. Super Vpn hotspot 2020 button connects you to one of the anonymous servers at speeds faster than a web proxy.  Lite VPN 2020 with special feature  When you are not running Super Vpn hotspot 2020 we help you save your devices storage and battery. This Lite VPN app 2020 provides you completely unlimited and free VPN! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}