{
"name" : "C7 Mercado da Soja",
"url" : "https://play.google.com/store/apps/details?id=com.campeiro.c7msoja",
"package" : "com.campeiro.c7msoja",
"category" : "Tools",
"description" : "O aplicativo C7 Mercado da Soja tem o propsito de contribuir com informaes que podem ser utilizadas para planejar uma poltica de comercializao de soja em gros, pelos produtores rurais. O C7 Mercado da Soja est constitudo por dois ambientes que possibilitam anlises distintas: O primeiro, Formao do Preo, est baseado em um modelo economtrico e foi desenvolvido com o objetivo de permitir, ao usurio, elaborar projees para o preo da soja (sem ICMS) a partir das expectativas relacionadas  cotao da Bolsa de Mercadorias e Futuros de Chicago (Chicago Board of Trade-CBOT), da taxa de cmbio e do prmio de exportao. Destacamos que as projees resultantes destas variveis explicam, em mdia, 85% da formao do preo da soja (sem ICMS). Portanto, o preo estimado poder apresentar uma diferena de at 15% do preo praticado pelo mercado, quando comparado ao preo do dia. Em funo disso, recomendamos a utilizao das projees para explorar e conhecer melhor as tendncias de mdio e longo prazos, dadas pelas expectativas em relao as cotaes na Chicago Board of Trade (CBOT), na Taxa de Cmbio e do Prmio de Exportao. O segundo ambiente, Grficos-Sries Histricas, est formado por: a) grficos com sries histricas mensais dos preos mdios praticados nas praas de Maring/PR, Mogiana/SP, Passo Fundo/RS e Rondonpolis/MT, em R$/saca, deflacionadas pelo ndice Geral de Preos Disponibilidade Interna (IGP-DI); b) cotaes mdias da CBOT, em US$/Bushel, deflacionadas pelo ndice de Preos dos Estados Unidos (IPC-EUA); c) Prmio de Exportao com referncia no Porto de Paranagu/PR, em US$/tonelada, deflacionados pelo ndice de Preos dos Estados Unidos (IPC-EUA); Taxa Real de Cmbio, resultante do quociente entre o IPC-EUA e IGP-DI multiplicado pelo Dlar Comercial.  importante salientar que a o mercado da soja em gros sofre influncia de fatores dinmicos difceis de serem captados ex ante por modelos economtricos. Neste contexto, as mudanas repentinas nas decises empresariais que condicionam a comercializao de soja das organizaes que dominam este mercado, nas condies climticas que geram expectativas sobre os mercados e nos custos de fretes e seguros podem reduzir a eficincia dos parmetros estimados pelo modelo economtrico disponibilizado. Fontes de dados: Abiove (http://www.abiove.org.br/site/index.php), CBOT (http://www.cmegroup.com/trading/agricultural/), Banco Central do Brasil (http://www.bcb.gov.br/), IPEA (http://www.ipeadata.gov.br/). The C7 Soybean Market application is intended to contribute information that can be used to plan a soybean marketing policy in grain by farmers. The C7 Soybean market is made up of two environments that allow different analyzes: The first, Formation of Price, is based on an econometric model and has been developed in order to allow the user to draw up projections for soybean prices (without VAT) from expectations related to listing of and Commodities Exchange Chicago futures (Chicago Board of Trade, CBOT), the exchange rate and export award. We emphasize that the resulting projections of these variables explain on average 85% of the formation of the soybean price (without VAT). Therefore, the estimated price could make a difference of up to 15% of the price charged by the market, when compared to the price of the day. As a result, we recommend the use of projections to explore and better understand trends in the medium and long term, given the expectations for the prices on the Chicago Board of Trade (CBOT), in the Exchange Rate and the Export Award. The second environment, Historical charts-Series is made up of: a) charts with monthly time series of the average prices in the markets of Maringa / PR, Mogiana / SP, Passo Fundo / RS and Rondonpolis / MT in R $ / bag, deflated by domestic supply General Price Index (IGP-DI); b) average prices of CBOT in US $ / Bushel, deflated by the US Price Index (IPC-US); c) Export Award by reference in the Port of Paranagu / PR, in US $ / ton, deflated by the US Price Index (IPC-US); Real Exchange Rate resulting from the differential between the US and IPC-IGP-DI multiplied by the Commercial Dollar. Importantly soybean market the grain is influenced by dynamic factors difficult to be obtained ex ante by econometric models. In this context, the sudden changes in the business decisions that affect the marketing of soy organizations that dominate this market, climate conditions that generate expectations about the markets and the freight and insurance costs may reduce the efficiency of the parameters estimated by the econometric model available. Data sources: ABIOVE (http://www.abiove.org.br/site/index.php), CBOT (http://www.cmegroup.com/trading/agricultural/), Central Bank of Brazil (http: //www.bcb.gov.br/), IPEA (http://www.ipeadata.gov.br/). ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}