{
"name" : "C7 GeoTopo",
"url" : "https://play.google.com/store/apps/details?id=com.campeiro.c7geotopo",
"package" : "com.campeiro.c7geotopo",
"category" : "Tools",
"description" : "O Aplicativo Android C7 GeoTopo, do Projeto de Extenso Rural da UFSM CR Campeiro, tem por objetivo a obteno de coordenadas geogrficas de pontos com o uso do GPS do dispositivo e sobre imagens de satlite do Google Maps e executar processamentos com clculos topogrficos diversos, registro de arquivos geogrficos entre outras funes. As funes bsicas do aplicativo so as seguintes:  Operaes com o GPS do dispositivo mvel. (Levantamentos de Waypoints e Trajetos)  Operaes de vetorizao, geolocalizao e navegao sobre imagens de satlite - GMaps  Processamento de clculos topogrficos (reas, diviso de reas, clculos de distncias, azimutes e posio planimtrica)  Obteno de fotografias georreferenciadas (Geotag) O C7 GeoTopo rene em um nico aplicativo vrias funes existentes nos apps C7 GPS Dados, C7 GPS Malha, C7 Planimetrico I e C7 Planimetrico II, que esto disponveis no Play Store da Google, e que registram um expressivo nmero de usurios no Brasil e Amrica Latina.  um aplicativo voltado para uso por Profissionais, Produtores Rurais e Acadmicos de cursos com disciplinas curriculares de Topografia O manual do aplicativo em PDF pode ser acessado diretamente no mesmo, a partir do formulrio de Informaes do app: -Info =>App C7 GeoTopo - pdf Um vdeo demonstrativo estruturado a partir desse manual PDF pode ser visualizado em: http://200.18.38.31/apps/geotopo/c7geotopo.mp4 Aguardamos, por parte dos usurios, sugestes para melhorias e aperfeioamento das funes existentes, e assim implementarmos as mesmas para a prxima edio do aplicativo The Application Android C7 GeoTopo, Rural Extension Project UFSM CR Campeiro, aims to obtain geographical coordinates of points using the device GPS and on satellite images from Google Maps and execute processes with various topographical calculations record geographic files among other functions. The basic functions of the application are as follows:  Operations with GPS mobile. (Surveys of waypoints and paths)  vectoring operations, geolocation and navigation on satellite images - GMaps  topographical calculation processing (areas, the division of areas, distances calculations planimetric position and azimuth)  Obtaining geotagged (Geotag) The C7 GeoTopo brings together in a single application several existing functions in the C7 GPS data apps, C7 GPS mesh, C7 planimetric I and C7 planimetric II, that are available in Play Google Store, and that record a significant number of users in Brazil and America Latina. It is an application geared for use by professionals, Farmers and Academic courses with curriculum subjects Topography The application manual in PDF can be accessed directly on it, from the app information form: -info => App C7 GeoTopo - pdf A demonstration video from that structured PDF manual can be viewed at: http://200.18.38.31/apps/geotopo/c7geotopo.mp4 We look for the users, suggestions for improvement and enhancement of existing functions, and thus implement the same for the next edition of the application ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_MOCK_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_MOCK_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS', 'android.permission.ACCESS_FINE_LOCATION']",
}