{
"name" : "AVG Secure VPN – Unlimited VPN & Proxy server",
"url" : "https://play.google.com/store/apps/details?id=com.avg.android.vpn",
"package" : "com.avg.android.vpn",
"category" : "Tools",
"description" : "AVG Secure VPN & Proxy for Android helps you stay safe and protect your identity and information while connected to the Internet. As long as AVG Secure VPN is on, any data you send or receive is protected. Even on public Wi-Fi. Connect to an optimal location via proxy VPN for fast and reliable web surfing.  Browse privately and anonymously with AVG Secure VPN.  Choose your location to unlock apps, content and websites which are geo-restricted.  Our private encryption VPN tunnel prevents hackers and thieves from stealing your data via public/open WiFi hotspots.  VPN on/off dashboard widget - a simple one-click widget for turning on your secure connection. Best for quick hotspot shield security.  Geo-restricted content access is made possible by changing your IP address (virtual location) using our VPN proxy servers.  WHAT IS A VPN? A Virtual Private Network (VPN) protects the data you upload and download from the internet, provides security for any data you send from your device, and anonymizes your internet activity.   HOW DOES VPN WORKS? Our VPN service protects you from data theft by using a virtual encryption shield tunnel to secure your public/open WiFi connections. Once secured, your communications are impossible to spy on.   Private, anonymous browsing  when using AVG Secure VPN Proxy, your internet connection will appear to originate from a different virtual location. Use it to hide and anonymize your banking logins, chats, emails and payments.  Unblock apps, content and websites - some websites and content providers block access from certain locations. With AVG VPN Secure Proxy for Android, you can unblock these. Choose from a variety of servers, located in numerous countries and locations to change your IP address.   Some countries prohibit or restrict the use of VPNs. Countries in which our VPN solutions are not currently recommended for use: Belarus, China, Iran, Iraq, North Korea, Oman, Turkey, Turkmenistan, United Arab Emirates.  Pricing * 7-day free trial followed by yearly subscription * Cancel your subscription anytime via payments.google.com  By installing/updating this app, you agree that your use of it is governed by these terms: http://m.avg.com/terms  Unlimited and fast proxy VPN from AVG. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.AUTHENTICATE_ACCOUNTS', 'com.avast.android.common.avg.IDS_PERMISSION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_CREDENTIALS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'com.avast.android.common.avg.IDS_PERMISSION', 'android.permission.ACCESS_FINE_LOCATION']",
}