{
"name" : "Caller ID - Phone Number Lookup, Call Blocker",
"url" : "https://play.google.com/store/apps/details?id=com.callblocker.whocalledme",
"package" : "com.callblocker.whocalledme",
"category" : "Tools",
"description" : "Caller ID - Who Called Me is the top true name caller id app. Caller ID works like a phone number lookup, spam call blocker, phone dialer and call screen app. 30 million people trust!  Caller ID help identify unknown callers and show whos calling you. Block spam calls, robocalls, telemarketing and unwanted calls. Display true caller id name and region for you.  Caller ID - Who Called Me highlight:  Instant Caller ID - Caller identification help identify unknown and private callers. Shows the caller id and name. Find out true phone caller id and more number details. Not only identify unknown calls, Caller ID - Who Called Me can also help you identify spam, scam and telemarketing calls. Figure out the true caller by installing Caller ID.  Call Blocker - Block unwanted calls such as telemarketing, spam callers, robocalls, fraud, by adding them to calls blacklist. Caller ID app will automatically block number from your blacklist and help you say goodbye to all spam calls.  Phone Number Search - Caller ID lets you perform a phone number lookup any number to find out who it is and find out who called. You can copy any number you see and put it into the search box. Caller ID - Who Called Me will identify the number and display true phone caller id and more details. Based on a huge data base, it is the best phone number lookup and phone number search tool in Android!  Smart Dialer - Make phone calls in the app directly. Now your Dialer is truly yours to block number. Use our smart dialer to quickly search in your call logs and contacts, and enjoy the smoothest dialing experience!  Call Screen - Want to color your call screen? Caller ID provides various beautiful, stylish and colorful caller screen themes for customizing incoming calls. Continuously updated caller screen themes. Now you can personalize the way you see your full screen Caller ID! Share the Color Call Flash with your friends.  Call Log Scan - Have you ever checked your call history and wondered: who called me? Caller ID app scans every unknown caller to protect your security. See all the call history in the recent calls. Including the missed calls, completed incoming and outgoing calls, no answer calls. Show you all call region and true phone caller id. No unknown numbers anymore.  Caller ID - Who Called Me is very easy and lightweight, yet powerful. If you want to find a number detail, you can also try phone number search in Caller ID - Who Called Me. You will get the best results about this number.  Caller ID - Who Called Me is a free caller ID app dedicated to serving users. It has never been easier to identify numbers from unknown callers and block numbers and unwanted calls! Download Caller ID - Who Called Me today!  Note: * Caller ID app does not upload your phonebook to make it searchable. We also do not sell, share data with any third party application and/or organization.  * All authorized permission will only be used internally for Caller ID to provide better service. * Up to Android 6.0 versions request permission on SMS, Phone, Contacts and Draw over other apps.  * Caller ID app will not show the actual Mobile Number Locator / GPS location of the caller. All location information is at State / City level only. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CALL_LOG', 'android.permission.WRITE_CONTACTS', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.Manifest.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permissions.READ_DATABASE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permissioms.WRITE_DATABASE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ANSWER_PHONE_CALLS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permissioms.WRITE_DATABASE', 'android.permission.ACCESS_NETWORK_STATE', 'android.Manifest.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permissions.READ_DATABASE']",
}