{
"name" : "2020 Calendar - IndiNotes",
"url" : "https://play.google.com/store/apps/details?id=com.ojassoft.calendar",
"package" : "com.ojassoft.calendar",
"category" : "Tools",
"description" : "2020 Calendar by AstroSage or IndiNotes is a free calendar, reminder, notes taking and planner app. People can use this app to stay organized and updated. In this all-in-one app, you can view calendar and see all fast, festivals and 2020 holidays. Using this app, you can manage your planner and set a reminder of any important task and event. In this app, you can also create shopping lists using general notes.   Take Notes on Your Hindu Panchang 2020 with IndiNotes by AstroSage In India, it is a tradition to take notes on calendar, also called panchang. People note down various points like newspaper was not delivered, how much milk is bought on a date or when to pay bill. The same old feature of taking notes on your panchang is now available  in this mobile app 2020 Calendar. Now, in place of traditional panchang or calendar, you can use our 2020 Calendar app to take date-wise notes and manage your month. This app has everything that a traditional panchang has, but many incredible other features. For example, you can share your whole monthly notes on WhatsApp with just one click. IndiNotes is like your panchang and notes taking app rolled out in one single app.   Make IndiNotes Calendar 2020 Your Productivity Tool In this modern era, people still mark dates on calendar, and invest a lot of time in keeping their planner ready. With this app, people can create date-wise notes on the Calendar. Now, they dont have to keep a tab on grocery list such as milk, magazine, newspaper, gas, and much more. With this app, they can manage their monthly planner and set a reminder on which date, time and day, they have to pay bills and keep a note of any important task.   Below are some of the important features of 2020 Calendar app:  Turn your Calendar into a Reminder Tool. * View 2020 Calendar  * See Indian fast, festivals, holidays, tithi, and any auspicious muhurat * Make date-wise notes on the calendar related to categories such as milk, gas, bills, tuition, magazine, newspaper, monthly saving, expenditure,and much more * Share the lists with friends & family * Create multiple shopping lists on general notes category * Save time using 2020 Calendar * Manage your list and add tasks straight from 2020 Calendar   Never Skip a Thing with Date-Wise Notes. * Add general reminders for various activities and categories related to ongoing bills, expenditure and savings  * Set date-wise notes * Use to-do-list reminders for on-the-spot notifications * Receive follow-up reminders to keep up with important events * Simple, modern & technically advanced * Available for android devices ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CALENDAR', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.ojassoft.calendar.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}