{
"name" : "Free VPN Proxy: Secure Shield & Fast Hotspot",
"url" : "https://play.google.com/store/apps/details?id=com.megafreeapps.freevpn.proxy.secure.shield.fasthotspot",
"package" : "com.megafreeapps.freevpn.proxy.secure.shield.fasthotspot",
"category" : "Tools",
"description" : "100% free VPN Proxy with High VPN speed, one of the best secure shield and fast hotspot! The best unlimited free VPN hotspot for android. Free VPN Proxy - Secure Shield & Fast Hotspot, connect and use blocked websites, best WiFi hotspot secure and protect privacy at its very best.   Fastest - One of the fastest VPN Proxy. Easiest - Connect and unblock websites at just one tap.  Booster - Boost your android phone with battery optimizer.  Secure - Secure hotspot service. Free VPN Proxy - Unlimited Free VPN Proxy and secure Fastest VPN on android, VPN fastest Service. This is all you need for a 100% Free VPN App which is secure and fastest vpn.  100% FREE! Access to best VPN proxy service for FREE. The ads in this app will provide you fast and free VPN proxy service for android. You can easily remove all Ads and enjoy more super fast servers in just one tap. Enjoy the fast Hotspot VPN Free.  Ultimate Fastest! You can connect to fastest VPN proxy servers around the world for free. In future updates, more VPN proxy servers will be added. Connected to the server of one country but speed is less? Dont worry, connect server of another country from the list and enjoy the unlimited fast VPN. Enjoy the fast Hotspot VPN Free.  Secure VPN! Secure VPN proxy will secures your sensitive data with advanced encryption technology, which hides your IP address so that you browse safely and no hacker can track your Internet activity session! Enjoy the secure Hotspot VPN Free.  Free VPN, Easy to Use! Not so many steps to connect with different servers from all over the world. JUST ONE TAP! And you will be connected and ready to browse on blocked websites from all over the world. With super easy user interface, select country of your choice and just connect. Enjoy the easy and fast Hotspot VPN Free.    Free VPN, for Streaming! Cant Enjoy your favorite show online which is from blocked website? With secure and Free VPN proxy service, you can easily unblock those blocked websites access to your favorite TV shows online. Start using fast Hotspot VPN free and start streaming.  User Data Security, We Dont Keep Logs! For us, the most important thing is our users privacy and we respect that. Free VPN proxy and secure hotspot DO NOT keep any logs of your activity. User privacy is our first priority. Thats why this is one of the best vpn app and secure Hotspot VPN Free.  App is in Continuous Development!  Free VPN Proxy - Secure Shield & Fat Hotspot app is in improving day by day for better user experience. For this purpose, we check our user reviews daily to understand their problems and solve them in a better way for you. We are optimizing our free VPN proxy app to make your next browsing of blocked stuff even faster and safer. Enjoy this secure Hotspot VPN Free.  Free VPN Proxy - Secure Shield & Fast Hotspot works with a variety of Android devices even the vpn app is capable of running on old versions of Android, this Free VPN proxy app will work fast and be secure. Download Free VPN Now!  Your Unlimited vpn proxy, Fast and Free VPN hotspot on Android. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.GET_PACKAGE_SIZE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE']",
}