{
"name" : "Rialto Comfort System",
"url" : "https://play.google.com/store/apps/details?id=com.fnoks.whitebox",
"package" : "com.fnoks.whitebox",
"category" : "Tools",
"description" : "Discover Rialto, the simple and flexible smart home system that brings you real savings. The Rialto system comprises:   Free App  WhiteBox control unit connected to the home router  Rialto Thermostat and/or Rialto Smart Plug  With the App installed, you can manage your home heating with the Rialto smart thermostat, even when out and about. And with Rialto smart plugs, you can also switch on and control the power usage of household electrical appliances via the App, wherever you happen to be.  Want to see how it works? Try out the DEMO VERSION of the App!  For more information and help: www.rialtocomfort.com ---------- The smart home the way we like it  Simple: makes life easier, from the moment of installation  Multi-zone: controls thermostats and smart plugs in different zones of the home, even on multiple floors  Expandable: to suit your particular needs (up to 32 devices)  No worries: connected devices (heating, lights, household electrical appliances, etc.) are switched on and off using geolocalization  Cost-saving: spend less money by adjusting the settings, however far away you may be  Green: the chance to save energy, knowing how youre using it, and how much  Made in Italy: the Rialto Comfort App and all Rialto products are 100% Designed & Made in Italy ---------- Why choose Rialto?  Multi-thermostat: up to 12 heating zones  Expandable: up to 32 wireless devices (Thermostats and/or Smart Plugs)  Works even without being connected to the internet: all programming data and your data are stored locally in the control unit, not online  And if there is no power to the control unit? No problem: you can use Rialto Thermostats and Smart Plugs in the same way as traditional products, with the built-in function buttons  Privacy assured: Rialto uses a remote server ONLY to manage communication between your smartphone and the home system. It does NOT save data concerning your habits on external servers. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}