{
"name" : "Material Cue",
"url" : "https://play.google.com/store/apps/details?id=com.actinarium.materialcue",
"package" : "com.actinarium.materialcue",
"category" : "Tools",
"description" : "Material Cue is a professional tool that draws grids and keylines over the device screen, helping developers to better design their apps. It is a must-have tool for every Android developer, designer or tester who is considerate about Material Design.  Material Cue comes with several pre-defined basic overlays, but the real power is the ability to create your own.  Key features: Comes with 8 basic overlays, such as standard (8 dp) and typography (4 dp) grids, ratio keylines, avatar list, and responsive UI columns. A simple yet flexible expression language for building custom overlays. Copy and adjust existing overlays, or make new ones from scratch  the canvas is yours! Overlay editor with preview and autocomplete. Choose multiple overlays, then toggle or switch between them from the notification without leaving your app. Superior performance: memory efficient, and switching between overlays is instantaneous. Does everything that similar apps can do and more, for free! By design-minded developer, for design-minded developers. More great features are to be added soon, meanwhile enjoy the early access version.  We believe in developer ethics and fair monetization of developer tools. Material Cue offers rich functionality for free for any use, and guarantees that it will never be crippled for the sake of conversions. Instead, well be adding extra features for even greater convenience for professional developers, and those will be available at a premium. Were still committed to offering the best possible experience for all of our users.  Material Cue uses Google Analytics, Firebase Analytics and Crashlytics to collect anonymous, non-identifying usage data, so that I can understand how the app is used, troubleshoot issues, and make it better. Additionally, if you opt in to use the premium features, Firebase and Google Play Services will be used to store and process your data, making some of it visible for the developer. By installing the app you express your consent to such data collection. For more details see the Terms of Service and Privacy Policy.  If you encounter an issue, please consider posting to the community or contacting the developer directly via email instead of leaving a bad review. Ill be glad to reach out and help.  Join the community for news and discussion: https://plus.google.com/u/0/communities/100324647344406722226 ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.actinarium.materialcue.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}