{
"name" : "WizardProg Mobile",
"url" : "https://play.google.com/store/apps/details?id=com.wizardprog.mobile",
"package" : "com.wizardprog.mobile",
"category" : "Tools",
"description" : "The WizardProg Mobile (professional version application is WizardProg Expert) application software designed to manage the programming operation for the universal portable USB-programmer TL866A/CS and other programmer models which fully compatible with it. This system is used to program a wide range of E(E)PROM chips, microcontrollers internal EEPROM, testing SRAM chips and logic chips.  The application allows you to achieve a new level of mobility and efficiency when using the programmer TL866, which is used widely to repair and adjustment:  automotive computers, computer-unit and radio;  personal computers;  any other modern electronic equipment.  The WizardProg Mobile system is used by service technicians of electronics, amateur radio operators and developers of modern electronic devices for the purpose of:  repair and restore the microelectronic device and firmware;  promptly update the firmware of microelectronic devices;  assist in the embedded electronics construction and setting up the microcontroller units;  replicate numerous useful designs using advanced electronic components.  Main characteristics and features of the WizardProg Mobile microelectronic programming system are:  Fast and reliable programming, in most cases with significantly better speed than the similar systems.  The programmers low power consumption when powered by USB (OTG)-cable from the mobile device battery.   Support for a wide range of integrated circuits (ICs): the memory of a large capacity up to 128Mbit (EPROM, FLASH, EEPROM I2C/3-wire/SPI), microcontrollers PIC, Atmel-AVR, MCS-51 based SST, SyncMOS, Winbond. PLD chips, GAL.  TL866 programmer does not need an external power supply and it operates using the power sources of a tablet or mobile phone which is connected to via USB interface. Physical linking to a mobile device is provided with a USB cable fully supporting OTG (On-The-Go) protocol.   Important note! The target control tablet or mobile phone must have a fully implemented hardware support of OTG access too!  Currently WizardProg Mobile mobile application is completely autonomous in operation, does not need a permanent connection to the Internet, allowing you to use it even without access to communication networks.  Both of programmers models TL866CS and TL866A(ICSP) are fully supported. The modern version of the TL866II Plus programmer currently is not supported by the WizardProg Mobile system!  Device list for the current application version: http://www.wizardprog.com/wp/dblist/recent_version_chiplist.htm ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.QUICKBOOT_POWERON', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.QUICKBOOT_POWERON', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
}