{
"name" : "Fast Camera Scanner : Document Scanner",
"url" : "https://play.google.com/store/apps/details?id=com.SmartCentre.camerascanner.fastscanner",
"package" : "com.SmartCentre.camerascanner.fastscanner",
"category" : "Tools",
"description" : "Fast Camera Scanner turns your Android devices into a multiple pages scanner for documents, receipts, notes, invoices, business cards, whiteboards and other paper text.  With Fast Camera Scanner, you can quickly scan your document, then print or email them as multiple pages PDF or JPEG files.  Moreover you can save the PDF files in your device or open them in other apps. This Fast Camera Scanner app is incorporated into your mobile device with extensive functionality so you can use it in a portable way anytime and anywhere, you can, edit, share, upload to driver, download and archive the files. It is a real free document scanner that will help you for your daily work, do not miss the opportunity and download this Fast Camera Scanner app right now.  Fast Camera Scanner is a powerful mobile document clear scanner that fits in your pocket! Discover a universal tool to scan any paper document and save its digital version in a wink.  Fast Scan, sign, upload to drive, download and archive and share multipage documents in high quality PDFs or JPEGs easier than ever.  ## Fast Camera Scanner Features :   The Fast Camera Scanner app for document, receipt, images and business card scanning  Auto cropper for fit borders and page size  High-quality PDF output file  Fast Camera Scanner : scan files from your gallery album or take new shot with camera  Editing and cutting scanned files  Best Document Scanner Lite   Scans are saved to your device in image or PDF format.  PDF Document Scanner   Documents Organization ,Name and organize documents in folders and easy to merge, move, copy or delete.  Scans PDF with edge detection feature additionally.  Optical character recognition picture conversion and transfer   ## How to use Fast Camera Scanner :   Scan the documents from your gallery or use camera to scan files   Editing the file such as Image size, cropper, text Size ....  Save the scanned files into a PDF formats  The scanned documents is ready to share through Fast Camera Scanner at various platforms and also you can upload it to your drive and download it to your device   Download now Fast Camera Scanner app now in your smartphones and get the scanning done from any part of the world and send the scanned image to any person at any location. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}