{
"name" : "dr.fone - Recovery & Transfer wirelessly & Backup",
"url" : "https://play.google.com/store/apps/details?id=com.wondershare.drfone",
"package" : "com.wondershare.drfone",
"category" : "Tools",
"description" : "dr.fone  the worlds 1st Data Recovery Software for Smartphones and Tablets!   Highest recovery rate in the industry.  Recover photos, videos, contacts, messages, notes, call logs, and more.   New feature: Easily transfer any files between devices and PC wirelessly   Free you from cables and client.   The only thing you need to do is to open web.drfone.me in a browser.   The main function of dr.fone  Recovery feature  Important: Deleted data may be overwritten by new data. This will affect the outcome of data recovery. The sooner you act the better the results youll get.  > Recover from Cache (No rooting necessary!*) Support recover photos and videos from cache, thumbnails, memory card and internal memory. > Recover Photos & videos, Message, Contacts (Rooting necessary!*) Support scan and recover from all of your devices internal and external memory  Supported photo formats: JPG, PNG, BMP, GIF, TIF,TIFF.  Supported video formats: MP4 (Taken by Camera) , 3GP, MOV, AVI, MPG, WMV, ASF, FLV, RM/RMVB, M4V, 3G2, SWF.  Support save the recovered contacts as .csv file > Deep Recovery (Need to work with dr.fone desktop version)  Deep Recovery supports more data loss scenarios, like accidentally deleted data/ rooting errors / OS update / system crash, .etc.  Support recover photos, videos, contacts, messaging, call logs, Audio, document, WhatsApp messages & Attachment .    Transfer feature : Easily transfer any files between devices and PC wirelessly. The only thing you need to do is to open web.drfone.me in a browser. Free you from cables and client.  Notes: you need to Keep your device and computer under the same networkor the same Wi-fi.   Recycle Bin (No rooting necessary!*) : Its just like the recycle bin on your windows or mac desktop computer. Move the photos and videos to the Recycle Bin when you delete them, you can restore them anytime you want.  Customize the retention period for deleted files.    Other feature (Need to work with dr.fone desktop version)  Root -- Highest success rate in the industry and 100% safe and secure.  Clone -- 1-Click Phone to Phone Transfer contacts, text messages, photos and other file types   Backup -- Selectively backup Android data to computer with one click.    LIKE US and STAY CONNECTED   OfficialSite : https://drfone.wondershare.com   Facebookhttps://www.facebook.com/drfonetoolkit/ ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}