{
"name" : "CrookCatcher - Anti Theft",
"url" : "https://play.google.com/store/apps/details?id=com.harteg.crookcatcher",
"package" : "com.harteg.crookcatcher",
"category" : "Tools",
"description" : "Disaster scenario #1: What if your phone was stolen?  With CrookCatcher installed on your smartphone or tablet, you might have a chance at getting it back!   CrookCatcher hides behind your lockscreen and if someone tries to unlock your phone with the wrong code, it takes a picture of the person with the front facing camera.  CrookCatcher immediately emails the photo of the thief to you, along with your devices current GPS location.  So whether your phone gets stolen or your coworker/partner/friend is simply too snoopy, with CrookCatcher you always know if you have an intruder!   FEATURES   Takes photo with secret camera when someone tries to unlock your phone with the wrong code.   Sends email with photo, GPS coordinates, accuracy, estimated street address, map and link to Google Device Manager with which you can track your devices location 24/7.   Works with password, pin code and pattern lock.    Combined map and photo view to browse pictures inside the app.   Of course it is completely silent and secret (turn off notifications in settings).   No battery drain - CrookCatcher only runs when the wrong code is entered.   Select number of unlock attempts before picture is taken   Tweakable GPS settings (timeout and desired accuracy)  The app is free - for you. The app contains ads - for me (the developer). Without the ads I would not be able to eat or create CrookCatcher. Support development and get the full experience of CrookCatcher by purchasing PREMIUM inside the app.  PREMIUM FEATURES   Detect SIM card change (send email with SIM and carrier info: subscriber id, operator name, SIM country and SIM serial number. This info might make it possible to get help from the SIM carrier to find your phone).   Detect Break-in (If someone is caught by CrookCatcher but then manages to unlock the phone, CrookCatcher takes another picture)   Retry Email (If your phone is offline when pictures are taken, postpone emails until back online)   Change Email Subject (if you get notifications from your email app, this is useful to prevent the thief from finding out hes been caught)   Hide notifications of new pictures until phone is unlocked   Alert Message (show a custom warning message on the lockscreen when CrookCatcher has caught the thief. For example, you can tell the thief to give back your phone or you show the picture to the police!)    And of course, NO ADS  - - - - - - - - - - - - - C - - - - - - - - - - - - -  HELP: http://jakobharteg.com/crookcatcher/help.html  Note: This app uses the Device Administrator permission to monitor screen unlock attempts.  Why is the Samsung Galaxy S5 not supported? There is a bug in the Samsung Galaxy S5 firmware, which causes CrookCatcher to fail. Until Samsung sends out a fix, CrookCatcher will not support the Galaxy S5. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.FOREGROUND_SERVICE', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.DISABLE_KEYGUARD', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.DISABLE_KEYGUARD', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}