{
"name" : "FastestVPN - Best VPN With Privacy & Security",
"url" : "https://play.google.com/store/apps/details?id=com.vpn.fastestvpnservice",
"package" : "com.vpn.fastestvpnservice",
"category" : "Tools",
"description" : "FastestVPN - A VPN Service Provider that brings protection that you rightfully deserve. The digital space is crawling with threats that can potentially pose a risk to your privacy if you are not careful about what websites you visit or what networks you use.   Use Android VPN to create a secure tunnel between your device and a remote server and surf the internet with complete freedom. FastestVPN has high-speed VPN 300+ servers that are geographically located in more than 39 countries. Connect to any region with a click and get unrestricted internet access from anywhere in the world with a secure VPN.   FastestVPN opens the door for online freedom. Say goodbye to blocked websites and geo-restricted streaming services. By connecting to one of Fastest VPNs secure servers, you can spoof your location to any geographic location. The virtual IP address is your key to an unrestricted experience.   At the core of Fastest VPN are sophisticated technologies that take form to create a smart VPN that enhance the user experience. You dont have to know how Ad Blocker is processing under-the-hood, what you need to know is that it blocks those annoying ads that interfere in your browsing.   Encryption is one of the fundamental pillars of VPN. This app utilizes the toughest encryption standard that comes in the form of AES 256-bit. Prevent third-parties from stealing your data by communicating securely through VPN tunnel.   Unblock Netflix  Streaming services such as Netflix are just a step away from giving you an unrestricted experience. Fastest VPN is a VPN for Netflix that you can rely on. With a dedicated Netflix VPN server, stream in up to 4K quality with fast speeds without worrying about bandwidth limit.   Surf Securely on Public Wi-Fi Hotspot  It is very risky using such unsecure networks to make transactions online or even just logging into bank accounts without internet security. Fastest VPN secures your internet communication end-to-end with military-grade encryption to prevent data theft.   Extensive Capability   Fastest VPN privacy solution is designed to protect your internet suffering with ease of use Android application. It comes preconfigured right out-of-the-box. So when you launch the time first time, you dont need to set it up. The app carries a visually-appealing interface that is intuitive & easy to navigate.   FastestVPN has cross-platform support; FastestVPN app is available on several major platforms such as Android mobile & smart Android TVs. It can also be configured directly in the router, allowing you to get VPN protection on any connected device.   Connect Multiple Devices Simultaneously   Fastest VPN gives you the benefit of adding up to 10 devices with a single subscription. So you can connect all the devices in the house or split the cost of the VPN with friends. Its truly an unbeatable value for money.   No Logs Policy   As a trusted VPN services provider based in the Cayman Islands, Fastest VPN is fully capable to uphold its no-logs policy. Surf with peace of mind knowing that your activities will never be tracked or recorded.   Money-back Guarantee   Buy Fastest VPN with the knowledge that you will get the best customer service. All subscription plans come with a 15-day money-back guarantee. Dont like it? Ask for a refund.   Prices:   FastestVPN gives you flexible subscription plans.    $10  1-Month Plan  $29.95  1-Year Plan  Features:   - NAT Firewall - Anti-Malware Protection - Internet Kill Switch - Blazing Fast Speed - 99.9% Up-time - 256-bit AES Encryption - Ad-Blocker - Unlimited Bandwidth - 10 Multi Logins - DNS Leak Protection - P2P Optimized Servers - Defeat ISP throttling - Anonymous Torrenting - 20+ Device Compatibility - VPN Protocols: PPTP, L2TP, OpenVPN (UDP/TCP), IKEv2, IPSec - 24x7 Technical Support over Live Chat, Call and Email - 15-Day Money-Back Guarantee - Extension for Chrome and Firefox ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}