{
"name" : "Free WiFi App: passwords, hotspots",
"url" : "https://play.google.com/store/apps/details?id=com.osmino.wifil",
"package" : "com.osmino.wifil",
"category" : "Tools",
"description" : "Free online and offline maps with wifi passwords, public and private hotspots all around the world! Works even with no Internet connection! osmino Free WiFi App - its 120 million free WiFi hotspots! Fast and free internet wherever you are! Free and easy way to find WiFi passwords! Offline maps and password database available immediately and for free!  osmino WiFi - a manager to search public wifi hotspots and passwords to private networks accross the world.  Download offline maps of the whole world with WiFi passwords or download just one region you need with all WiFi hotspots. Its free!  There are already nearly 120 000 000 wifi hotspots on osmino map in more than 50 countries: More than 5 000 000 hotspots in USA Over 3 000 000 wifi hotspots in Korea Nearly 600 000 hotspots in Mexico and over 400 000 in Brazil more than 3 million hotspots with passwords in Russia about 170 thousand wifi hotspots in Ukraine 500 000 hotspots on the map of Italy, 400 000 on the map of Spain, France has more than 600,000 hotspots, Germany - 450 000 about 200 000 wifi hotspots in India more than 700 000 wifi spots in Vietnam, about 100 000 wifi networks in Poland, 200 000 hotspots in Indonesia and Turkey in each, more than 700 000 wifi hotspots with passwords on Japan map.  You can check the nearest public networks on our Wi-Fi hotspot map. Its very simple now to connect to WiFi - our WiFi map is always close at hand. On our WiFi map you can easily find the nearest WiFi hotspots, wifi passwords, reviews about WiFi connection and places where WiFi is located.  You can also share the wifi password to a known network and make it available to other osmino Free WiFi App users, just select Share.  Staying connected on the go has never been easier! osmino WiFi App is an innovative solution to find free Wi-Fi hotspots anywhere in the world. No surprise the osmino WiFi App is an absolute success among travellers!  On our WiFi map you can find American major networks WiFi full information:  Xfinity wifi - over 3 mln WiFi hotspots in the USA Optimum WiFI - over 600 thousand WiFis in the USA Cable WiFi - over 600 thousand WiFis in the USA TWC WiFi - over 300 thousand WiFis in the USA AT&T - over 200 thousand WiFis in the USA  All the above listed WiFi networks provide free internet access with time or traffic limits. This free internet access is enough to check your messengers, email or use navigation.  Information about public hotspots is automatically set on map, according to the data received from users devices.  When you share some private network password the hotspot will be automatically added on the map as well. So we create the use-proven public Wi-Fi hotspots map based on users data. The more users subscribe to osmino, the more disposable wifi hotspots there are on the map.  Heading for a new place? Going abroad? Dont want to pay for roaming?  Then discover available Wi-Fi hotspots in point of your destination on Wi-Fi map. Enjoy your trip and free and fast internet across the world.  Warning! Its not a Wi-Fi hacker app!  If osmino WiFi doesnt run on you device or there are any bugs, please, contact us at feedback@osmino.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}