{
"name" : "2020 Unit Converter - All In One Unit Conversion",
"url" : "https://play.google.com/store/apps/details?id=com.digitalindeed.converter",
"package" : "com.digitalindeed.converter",
"category" : "Tools",
"description" : "Need to convert centigrade to fahrenheit? Or feet to meter, inches to feet, km to m, distance, measurements, money?  Or are you looking for an all in one premium unit converter that will convert dozens of different units? A conversion app that will become your only premium all in one conversion tool?   Well, All In One Unit Converter is your tool as it has more than 15 in one unit conversions. It can also convert currencies! This unit conversion tool can be your measurements converter, converter currency, converter distance, metrics converter and so much more!   EASY TO USE Just select the unit of conversion and you can get the needed conversion results in micro-seconds. This converter tool is easy to use and super-light. We have also included a dark and light version depending on your preference of the look of this app.   USEFUL FOR EVERYONE Students, business owners, and everyone in-between will find the All In One Unit Converter useful to use. From currency conversion and unit conversion, to a conversion calculator and measurement converter with metric conversion  there is something for everyone.    THE ALL IN ONE CONVERTER APP INCLUDES: - angle - area - cooking - currency - current - digital storage - energy - force - fuel consumption - length / distance - mass / weight - power - pressure - speed - temperature - time - torque - volume  Stop looking for separate unit conversion apps for as converter weight apps, converter money apps, converter unit of measurement apps or converter distance apps and instead just choose this all in one unit converter.  Download the best all in one unit converter, today For FREE!  The privacy policy can be found in the privacy policy link. Thank you! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}