{
"name" : "Armor Inspector - for WoT",
"url" : "https://play.google.com/store/apps/details?id=com.dreamfarmgames.wot.armorinspector.android2",
"package" : "com.dreamfarmgames.wot.armorinspector.android2",
"category" : "Tools",
"description" : "You play World of Tanks ? To maximize your chances of success you need the absolute best companion app for your games !  Learn about armor protection, shell penetration and modules location of any tank of the World of Tank series. Choose a gun and a target vehicle and you will learn how to survive and deal maximum damage ! Armor Inspector will show you every weak spot of any tank in the game. hide them, and aim at them.  - armor details of 300+ vehicles available - details from any angle or distance from 3D - select any gun and ammo in the game. - penetration chance calculated in real time - HE predicted damage map view - Detailed information about each armor group - internal modules and crew in 3D model for most tanks - no ads  Notes : Version 2.0 is an entirely new app, and better in every bit !  fun to use and interact with, easier to visualize models.  English and Russian languages only for now, but we will add other languages soon.  * Armor Inspector is an application for World of Tanks, WoT Blitz and WoT Console games. * Armor Inspector does not belong to Wargaming, the producer of the World of Tanks series of games. * Armor Inspector is developed independently in accordance with WG DPP terms and policies.  Legal notice. The images and 3d models contained within are copyrighted by Wargaming.Net LLP and tank stats are intellectual property of Wargaming.Net : Copyright  1998 - 2015 Wargaming.net , All rights reserved. World of Tanks, WoT are trademarks or registered trademarks of Wargaming.net. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING']",
}