{
"name" : "pCrop: Photo Resizer and Compress",
"url" : "https://play.google.com/store/apps/details?id=com.riseapps.imageresizer",
"package" : "com.riseapps.imageresizer",
"category" : "Tools",
"description" : "pCrop: Photo Resizer and Compress helps you quickly reduce your picture size or resolution. Easy to optimize your images without losing quality and file size.  ** Compress Images  Image Compressor - Very good quality of the compressed photos and optional compress quality - Give you best analysis of before compress and after compress image size - Output Result saved in /CompressedImages  ** Resize Images  Photo Resizer - Very good quality of the resized photos - Resize mode by pixel or quality with maintain resolution - File option offers to save images as JPG, PNG, WEBP or default format - Output Result saved in /ResizedImages  ** Crop Photo - Use the crop tool to remove unwanted portions of the photo - Simple photo crop tool and easy to crop and rotate images. - Free style cropping with rotate feature (Vertically and horizontally) - Output Result saved in /CroppedImages  **pCrop: Photo Resizer and Compress offers very useful features : - Use finger to zoom/move, rotate the crop area on the photo - Very good quality of the compressed photos and optional compress quality - Rotate Images by 90 either clockwise or (Vertically and horizontally) and crop the photo - Photo Compressor, Image Compressor, Image Resizer, Reduce photo size and compress image size - Multi photo resizer, Image crop and resize, free style cropping tool - View generated images in My Creation option under three folders (CompressedImages, ResizedImages and CroppedImages) - Easy to share compressed and resized images or delete unwanted photos too ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}