{
"name" : "Camera Translator - Translate Picture Scanner PDF",
"url" : "https://play.google.com/store/apps/details?id=com.ticktalk.cameratranslator",
"package" : "com.ticktalk.cameratranslator",
"category" : "Tools",
"description" : "Camera Translator - Translate Picture Scanner PDF  Translate text from photos and documents in any format  The most professional camera translator ever seen, it has no limits. It converts virtually any document, recognition of the camera is instantaneous and the conversion of documents to other formats is total. Compatible with formats in pdf, doc, png, jpg, and others.  Cut out your images or photos to translate just the desired text. It is simple, it is easy, it is intuitive, it is the best translator with camera scanner that exists in the world.  Take a photo to any document, restaurant menu, magazine or photo, and translate to any language in the world. Translating physical or digital documents is no longer a problem, translating with camera is a reality.  Camera Translator - Translate Picture Scanner PDF, Features and general functions:  - Instantly translate texts through the camera - Compatible with over 80 languages - Recognize text documents with pdf, doc and other format - Recognize photos and images in png, jpg and others format - Easy to use and intuitive interface - Cut your images to translate only the desired text - Share texts or images from any application, browser or web. - Share your translations, text or audio, from the application - Customize your translator, with different wallpapers - Expand your long translations - Voice and audio recognition in more than 40 languages - Double function to share your translations, audio or text. - Unlimited translation history - History Search - Favorites in history and filters - Modify the order of translations performed - Resize the text font  Ideal for travel, tourism, or education, translate the rules of your hotel, or a menu of a restaurant, newspaper or magazine, Translator Camera Scanner can translate to any language in the world, any document photograph: physical or digital .  Convert your documents into pdf, and translate to any language with the best translation engine, instant recognition of texts in all languages. It recognizes files and photographs of websites, instant messaging, notes and others.  Learn languages in the best way. An educational application that will help you learn to write, read and pronounce languages in an easy and intuitive way. Save your translations and classify it by color, you can keep your translations of different languages, texts or words.  Share photos directly outside the application, browse the web and translate texts and documents directly.  It recognizes all text formats and translates into more than 80 languages, voice recognition and voice output in over 40 languages, translation history with history search function, and color filter bookmarks.  Multiple options like changing font size, backgrounds, clearing audios cache and many more.  These are some of the languages supported by Camera Translator - Translate Picture Scanner PDF: Arabic, English, Bulgarian, Catalan, Simplified Chinese, Traditional Chinese, Croatian, Czech, Danish, Dutch, Estonian, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Lithuanian, Norwegian, Persian, Polish, Portuguese, Romanian, Russian, Serbian, Slovenian, Slovak, Spanish, Swedish, Thai, Turkish, Ukrainian, Vietnamese and Welsh. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}