{
"name" : "Flat Metal Patterns",
"url" : "https://play.google.com/store/apps/details?id=com.flatmetalpatterns.app",
"package" : "com.flatmetalpatterns.app",
"category" : "Tools",
"description" : "Flat Metal Patterns es una tienda en lnea para la venta de herramientas y accesorios para el ramo de la insolacin industrial.  Adems de que es un programa de clculo de patrones de metal, ayudndonos a ahorrar tiempo en la hechura del patrn, y haciendo a un lado los posibles errores que podamos tener al hacer el trazo del patrn a mano.  Esta aplicacin va dirigida a personas expertas, inexpertas y principiantes, ya que cuenta con botn de video ayuda para saber como usar el patrn calculado. Para personas que tienen experiencia en trazas de un patrn a mano, les ayudar a omitir errores, calcular en segundos el patrn y as ahorrar tiempo.  El programa de clculo de patrones est hecho basado en clculos matemticos, y convirtiendo esos clculos, al patrn que estamos acostumbrados a trabajar.  Burbuja circunferencia-dimetro - La aplicacin funciona principalmente con valores de circunferencia. Adicionalmente, la aplicacin acepta valores de dimetro que son convertidos a circunferencia. Burbuja tamao de pipa - Si se tienen los datos exactos de una pipa, la aplicacin tiene la capacidad de determinar la circunferencia exacta de la pipa. Burbuja pies-pulgadas - Si tenemos los datos en pies, tenemos la facilidad de usar esta burbuja para convertirlos a pulgadas. Burbuja calculadora - Sumamente importante para operaciones especificas en fracciones conocidas y decimales. Esto quiere decir que la calculadora acepta las fracciones de una cinta de medir convencional, y arroja los resultados de la misma manera. Longitud real (removibles) - La aplicacin calcula una medida en especfico a 1, 2, 3 o varias capas de insolacin para removibles. Clculo de 90s - Ya sea que tengamos 90s para aislar y queremos calcular cuntos gajos se necesitan y la medida de cada gajo de insolacin, as mismo el clculo del patrn del metal. Escala - Una caracterstica de la aplicacin sumamente importante y que nos facilita fabricar patrones en grandes dimensiones por partes.  Y muchas ms. Flat Metal Patterns is an online store for the sale of tools and accessories for the field of industrial insolation.  In addition to that it is a program of calculation of patterns of metal, helping us to save time in the making of the pattern, and doing away with the possible errors that we may have when making the stroke of the pattern by hand.  This application is aimed at experts, inexperienced and beginners, since it has a video help button to know how to use the calculated pattern. For people who have experience in tracing a pattern by hand, it will help them to omit mistakes, calculate the pattern in seconds and thus save time.  The pattern calculation program is made based on mathematical calculations, and converting those calculations, to the pattern that we are used to working with.  Bubble circumference-diameter - The application works mainly with circumference values. Additionally, the application accepts diameter values that are converted to circumference. Pipe size bubble - If you have the exact data of a pipe, the application has the ability to determine the exact circumference of the pipe. Feet-inch bubble - If we have the data in feet, we have the facility to use this bubble to convert them to inches. Calculator bubble - Extremely important for specific operations on known fractions and decimals. This means that the calculator accepts the fractions of a conventional measuring tape, and throws the results in the same way. Actual length (removable) - The application calculates a specific measurement to 1 , 2, 3 or several layers of insolation for removable. Calculation of 90s - Whether we have 90s to isolate and we want to calculate how many segments are needed and the measurement of each insolation segment, as well as the calculation of the metal pattern. Scale - A very important feature of the application that makes it easier for us to make large-scale patterns in parts.  And many more. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
}