{
"name" : "Porn Blocker - Block Porn & Kids Parental Control",
"url" : "https://play.google.com/store/apps/details?id=com.udicorn.antiporn",
"package" : "com.udicorn.antiporn",
"category" : "Tools",
"description" : "Porn Blocker: Are you looking on how to block porn sites? Are you looking for a parental control app ? Are you looking for a porn blocker solution that really works ? Are you looking to block porn websites and protect your kids?  Udicorn Anti Porno is the right choice for you!  Download Udicorn block porn app and start protection now.  Why install the Udicorn porn blocker free app? 1 Protection from porn websites is automatically activated. 2 Porn websites database is weekly updated for better filtering. 3 Block porn websites as well as search engines porn results.  Udicorn porn blocking apps main features:  Use search engines safely, porn content is filtered by default by our adult blocker  Anti porn by a large database of filtered porn websites  Fast browsing and browsing safe.  Incognito more for better privacy  Bookmark your favorite websites  Organize your browsing with Tabs   Block porn websites Udicorn porn blocker filter make sure no porn website is returning to the browsers visitor, the browser has a huge database of porn websites to block, updated daily, this make the browser the reliable solution to filter porn content as well as porn websites, block pornography and browsing safe.  Block porn search results The browser also block porn search engines results and allow only clean search engine results that are acceptable for the users in all ages. We recommend using Google as your favorite search engine to get the best possible filtered results.  Ease of use and real time protection By using Udicorn safe browsing, you do not need to configure or activate anything. Protection from porn content is activated by default. Just use the browser  and enjoy your day, we take care of the rest and block porn for you. Just make sure to keep the app up-to-date when we release a new version for your browsing safe.  Keep your child safe This children browser make sure your child surf safely the web with zero porn. Child safe search protection is always ON, this will keep your child safe to browse the web securely.  Highlights of Udicorn Block Porn:  FREE: 100% free. No payment needed. No credit card information needed. No trial periods offered.  SIMPLE: Activate protection automatically by just opening the app!  SUPPORT: Need support? Need to leave a feedback? Suggestions? Reach us by sending an email to: support@udicorn.com!  Udicorn Porn Block contains Lightning Browser and is used under Lightning Browser Mozilla Public Licence, Version 2.0. A copy of this license is available at: https://github.com/anthonycr/Lightning-Browser  What are you waiting for? Download Udicorn Porn Blocker now and block xxx! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO']",
}