{
"name" : "X-plore File Manager",
"url" : "https://play.google.com/store/apps/details?id=com.lonelycatgames.Xplore",
"package" : "com.lonelycatgames.Xplore",
"category" : "Tools",
"description" : "Application manual: www.lonelycatgames.com/docs/xplore  Highlights:   Dual-pane tree view  Root, FTP, SMB1 / SMB2, Sqlite, Zip, Rar, 7zip, DLNA/UPnP explorer  Disk Map - see which files consume most space on your disk - http://bit.ly/xp-disk-map  Cloud storage access: Google Drive, Dropbox, Box, Amazon cloud drive, .mail.ru, Mega.co, OneDrive, Flickr, Webdav, Yandex.disk, MediaFire, Owncloud, SugarSync, GMX, Web.de  SSH File Transfer (SFTP) and SSH Shell - http://bit.ly/xp-sftp ***  Music player ***  App manager  USB OTG  PDF viewer (on Android 5.0+)  WiFi file sharing *** - http://bit.ly/xp-wifi-share  Manage files from a PC web browser *** - http://bit.ly/xp-wifi-web  Favorite folders  Built-in viewers for images, audio, text  Video player with subtitles ***  Batch rename  Hex viewer  Fast Image viewer with zoom and slide to previous/next images  Thumbnails for images and video as well as for various file types (depending on associated application)  Multi-selection - always available, yet not disturbing  View APK files as ZIP  Share - send files by Bluetooth, email, or whatever the device supports, from any location  Configurable buttons and key shortcuts  Seamless work with Zip (as if it was normal folder)  Vault for encrypting sensitive files - http://bit.ly/xp-vault ***   *** marked features are paid - they require donation  X-plore allows you to see inside of your Android device. And also outside.  This is a dual-pane explorer, there are two folders shown at same time, and common operation such as copying files are done from one pane to another. And X-plore shows folder hierarchy in a tree view for clear orientation and fast switching to other location.  You may explore internals of the device, and if youre power user and have your device rooted, you can make changes to system data - backup files, remove unwanted applications, etc.  If youre standard user, you may choose to hide internal memory from view and be sure not to mess with system. You can comfortably see contents of mass memories on your device, or possibly attached USB memory stick.  Simple app manager allows to see, run, copy, share, uninstall and further explore installed applications.  WiFi file sharing Access files on your Android device from other Android devices over WiFi.  Access from a PC web browser Manage files on your Android device from your PC.  Access to FTP and FTPS (secure FTP) servers is supported. Multiple servers may be configured.  X-plore can display shared folders on other computers in LAN.  X-plore can access various web storage Cloud servers, and access their files. You need to have account in supported web service, then you can access your files stored online through X-plore.  Supported is also SSH File Transfer (SFTP) and Terminal shell emulator.  X-plore contains music player that can play music tracks from any available location.  With Vault function, you can encrypt sensitive files, even by your fingerprint.  Main operations are related to managing files and folders - viewing, copying, moving, deleting, compressing to Zip, extracting, renaming, sharing, and more.  SQLite database viewer X-plore can show SQLite database files (those with .db extension) as expandable list of tables, each table containing list of rows and columns with database entries.  Main interaction is done by touch screen, clicking on folders or files to open files, or long-click to open context menu which contains options which can be done on particular clicked item, or multiple selected items. Multi-selection allows to do operation on more files at once.  Opening file may mean to use one of built-in viewer for most popular file types: images, audio, video and text. Or you may configure X-plore to use system application for opening files, in which case system-predefined application that can open particular file is launched.  Archives (currently supported are Zip, Rar and 7zip) are displayed as other folders. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'android.permission.USE_BIOMETRIC', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.USE_CREDENTIALS']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}