{
"name" : "Anno 1800 Goods Calculator",
"url" : "https://play.google.com/store/apps/details?id=com.robertlinsener.anno1800mobilecalculator",
"package" : "com.robertlinsener.anno1800mobilecalculator",
"category" : "Tools",
"description" : "The Anno 1800 Goods Calculator for Android calculates the number of necessary production buildings for you based on your island population. This ensures the optimal supply of your inhabitants.   Annoying under- or overcapacities of production buildings and dissatisfied islanders are a thing of the past. With an optimal ratio of production buildings you can easily achieve a positive monetary balance.  The tool is especially suitable for the later Endgame in Anno 1800, since the overview of the production chains becomes more and more complicated and difficult in the course of the game.   In addition, the app informs you about all details (e.g. construction and maintenance costs) of all production buildings.  The app offers:  - Representation of all production chains per population group for the Old and New World - Use the search function to quickly filter for production buildings - Calculation of consumption of goods per population group in tonnes per minute - Calculation of all required production buildings based on population size - shows capacity utilization and production output per building type - a complete overview of all consumer goods, intermediate product and basic product production buildings as sum display (helpful for an even better overview) - optional electrification of buildings that can benefit from electricity - other interesting statistics, e.g. workforce needed per population group, which can be used to determine how many inhabitants of a population group are needed to satisfy the highest population group - under the menu item Help you can see what the calculated values mean ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}