{
"name" : "VPN by Private Internet Access",
"url" : "https://play.google.com/store/apps/details?id=com.privateinternetaccess.android",
"package" : "com.privateinternetaccess.android",
"category" : "Tools",
"description" : "Browse privately on the internet. Stay anonymous and secure on public WiFi. Hide your IP address and encrypt your traffic to connect to blocked apps and websites with our unlimited bandwidth VPN. Private Internet Access unblocks content for our users and allows them to encrypt their network traffic, change their IP address, and connect anonymously to blocked websites and apps.    Protect your privacy with Private Internet Access, the worlds leading VPN proxy service for Android mobile and tablet users.    DOWNLOAD the Private Internet Access VPN app and enjoy:    High speeds, unlimited bandwidth, connect with 10 devices simultaneously (smartphones, tablets, computers), no traffic logs, and 24/7 professional, native English speaking customer support.   PRIVATE INTERNET ACCESS FEATURES    IP Cloaking. Your IP address will be changed to a Private Internet Access IP address to hide your identity and location. Hide your IP address to stop data trackers, snoopers, and hackers from tracking your browsing and search activity. When you change your IP address, you can be more anonymous and blend in with the crowd.   WiFi Security. With WPA and WPA2 now kracked, you need a VPN to protect your WiFi everywhere - not just in hotspots, coffee shops, cafes, hotels, and airports. If you use WiFi hotspots without encryption, your data can be seen, blocked, throttled, censored, or otherwise changed.   Data Encryption. Encrypt your internet traffic with our VPN proxy. Our trusted online privacy service creates several security layers which keep you anonymous and prevent access to your data. Its time to change your WiFi habits.    Defeat Censorship. Access blocked apps or connect to censored websites. Unlock and unblock your favorite websites from anywhere.   Per App Settings. Have an app that you want to let bypass the private VPN tunnel? Choose which apps to exclude from the VPN.   Internet Killswitch. Ensure your internet always uses our VPN connection with our internet killswitch.   WHY USE PRIVATE INTERNET ACCESS?    Low price. $6.25 per month if you purchase a yearly account ($74.99/year) or $9.99 on a monthly basis.   Reliable and trusted VPN provider since 2010. Proven no log policy. Unlimited bandwidth. Use our VPN as your proxy.   Privacy is our Policy. Here at PIA, we not only provide a great VPN service at a low price, but we also support organizations like the Electronic Frontier Foundation, FightForTheFuture, Creative Commons, Open Rights Group, Index on Censorship, freenode, Wireguard, Arch Linux, and many others.   We respect your privacy and anonymity.    WHAT DOES THE TECH COMMUNITY THINK?    Private Internet Access, one of Lifehacker readers favorite VPN service providers, makes it easy to surf privately and securely from anywhere.  Lifehacker  There have been several Editors Choice VPN services recently, as one product tops the next, but Private Internet Access out-performs and out-features the competition. With 4.5 stars, Private Internet Access sets the bar high and is truly the Editors Choice, trumping all our previous favorites. -- PC Mag  When shopping for a VPN service, it is recommended to find a service that does not log its customers traffic and prevents an anonymity-unmasking issue known as IPv6 leakage. Private Internet Access carries that level of security.  Wired  Why does the app need camera permissions? The camera is used only when you scan a QR code, nowhere else. Earlier versions of Android (before 6.0) will incorrectly report that we need this at all times.  GDPR compatibility This application only send username and encrypted passwords to our servers as part of using this app. During signups, we also collect user-email. We not collect and/or store any other user information. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}