{
"name" : "ITF Seafarers",
"url" : "https://play.google.com/store/apps/details?id=com.itf.seafarers",
"package" : "com.itf.seafarers",
"category" : "Tools",
"description" : "This latest development combines the two previous applications (Look up a Ship and Find an Inspector/Union) into one great app that provides a one stop shop for seafarers in search of vessel information, contact details for ITF inspectors/affiliates and the ITF Helpline. The information displayed is derived directly from the ITFs centralised system and is therefore as up to date as possible.  Aside from merging the two previous applications we have also introduced;  Colour coded system on vessels to easily identify which are covered, uncovered, National flag etc. The colours being; o Green  Covered vessel o Yellow  Vessel under negotiation (Prospect agreement) o Red  Uncovered FOC vessel o Orange  National flagged vessel o Blue  Cruise vessel Hotlinks to affiliate contact information by touching the Signatory Union name on covered vessel details  Ability to contact the ITF Helpline directly from the app via telephone or email  Links to the ITFglobal and ITFSeafarers websites  Greater information on the ITF and FOC campaign  Please note that response times will vary depending on the device connection (Wifi, 3G etc.) and the amount of information you are searching for.  If you have previously downloaded the Look up a Ship and Find an Inspector/Union apps I would advise you to remove them as they will shortly be deleted from the respective app stores.  We look forward to any feedback you feel appropriate and suggestions for improving the application. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}