{
"name" : "Total Commander - file manager",
"url" : "https://play.google.com/store/apps/details?id=com.ghisler.android.TotalCommander",
"package" : "com.ghisler.android.TotalCommander",
"category" : "Tools",
"description" : "Android version of the desktop file manager Total Commander (www.ghisler.com).  Important note: This app does NOT contain any ads. However, it contains a link Add plugins (download) in the home folder. This is treated as an ad by the Play Store because it links to our other apps (plugins).  Main features: - Copy, Move whole subdirs - Drag & Drop (long press on file icon, move icon) - Inplace rename, create directories - Delete (no recycle bin) - Zip and unzip, unrar - Properties dialog, change permissions - Built-in text editor - Search function (also for text) - Select/unselect groups of files - Select by tapping on file icons - Select range: Long tap+release on icon - List of installed Apps (built-in plugin) - FTP and SFTP client (plugin) - WebDAV (Web folders) (plugin) - LAN access (plugin) - Plugins for cloud services: Google Drive, Microsoft Live, Dropbox - Root support for the main functions (optional) - Send files via Bluetooth (OBEX) - Thumbnails for pictures - Two panels side by side, or virtual two panel mode - Bookmarks - Directory history - Media player which can stream directly from LAN, WebDAV and cloud plugins - Configurable button bar for changing directories, internal commands, launching apps, and sending shell commands - Simple help function in English, German, Russian, Ukrainian and Czech - Optimizations for visually impaired, like text for icons - Supported languages of the main program: English, German, Bulgarian, Croatian, Czech, Danish, Dutch, French, Greek, Hebrew, Hungarian, Indonesian, Italian, Japanese, Korean, Polish, Portuguese, Romanian, Russian, Serbian, Simplified Chinese, Slovak, Slovenian, Spanish, Swedish, Traditional Chinese, Turkish, Ukrainian and Vietnamese. - Public translation via http://crowdin.net/project/total-commander  About the new permission SuperUser: This permission is now requested to make Total Commander work better on rooted devices. It tells the SuperUser app that Total Commander suports root functions. It has no effect if your device is not rooted. Root functions allow Total Commander to write to system folders like /system or /data. You will be warned before anything is written if the partition is write protected. You can find some more information here: http://su.chainfire.eu/#updates-permission ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_SUPERUSER', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.ghisler.tcplugins.restricted', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['com.ghisler.tcplugins.restricted', 'android.permission.ACCESS_SUPERUSER']",
}