{
"name" : "Lazarillo GPS for Blind",
"url" : "https://play.google.com/store/apps/details?id=com.lazarillo",
"package" : "com.lazarillo",
"category" : "Tools",
"description" : "LazarilloApp the GPS for the blind and visually impaired, lets you explore the world around you and set up routes.  Lazarillo is a specialized GPS app that brings mobility tools for blind people. Using audio messages, Lazarillo will tell you about nearby places, the street you are walking on, street intersections in your way and more! Like a radio, Lazarillo will announce the places around you while you move. This app was designed and implemented with active feedback from blind people.   The GPS resource is used even if the App is in the background. This allows the user to keep using the app without active usage of the screen, so that they can still enjoy the features of Lazarillo even when their phone is in their pocket or when using other relevant apps.   Note: Continued use of GPS running in the background can dramatically decrease battery life.  This app allows you to use its accessibility functions for free, it just requires mobile data or a Wi-Fi connection.   To collaborate with blind people, Lazarillos main feature is to become the users companion, providing essential information that allows displacement and autonomy.  The goal is to help the person reach the chosen place in a simple way, receiving Lazarillo indications by voice and notifications of nearby places, institutions, shops, etc, allowing communication between the user and the city.   The app contains the following features:   - Exploration: Provides your actual position, nearby places, and street intersections while you are walking on the street, in a bus or by car.   - Category searches: Allows you to find nearby places from a specific category such as banks, health, food, shop, art, entertainment, etc.  - Specific searches: Allows you to find a route to any place using voice or keyboard.  Help information:  Lazarillo provides information about establishments that work with blind or visually impaired people. The app is linked to a web platform where the institutions are able to show important information about events, courses, workshops, and any data that a blind person may need. In that way Lazarillo collaborates with these institutions improving the communication among users, providing better connectivity between people with visual disability.   For suggestions and doubts, you can visit our website www.lazarillo.cl or send us an e-mail to contacto@lazarillo.cl ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.BLUETOOTH', 'android.permission.READ_PROFILE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.GET_ACCOUNTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}