{
"name" : "Calculator - Arabic Numbers",
"url" : "https://play.google.com/store/apps/details?id=com.wro.arabiccalculator",
"package" : "com.wro.arabiccalculator",
"category" : "Tools",
"description" : "This calculator was made for the support of the Arabic number.  Calculator Arabic Hindu Numbers  with Arabic-Hindu Keyboard Numbers  Calculator Arabic Numbers  with Arabic Keyboard Numbers: is the first calculator of its kind in the Arabic world using Arabic numbers and that have been designed with a simple Arabic Numbers Keyboard, and built from scratch specifically for the Arab Community.   Arabic Numbers Keyboard  is a unique Arabic Calculator with a Dark Theme and with an easy interface and a meek keyboard design of Arabic Numbers.  Arabic Numbers Calculator  was specially designed for these people who love Arabic Numbers. Arabic Numbers Calculator is the best mobile Calculator for your daily Calculations.  Calculator Arabic Numbers  with Arabic Keyboard Numbers: is the simplest mobile Calculator in the app market for calculating Arabic math. Arabic Calculator comes with a keyboard that allows the user to do simple mathematics and type Numbers in Arabic.  Calculator Arabic Numbers  with Arabic Keyboard Numbers: You can propose us to update our Arabic Calculator and Keyboard design. We will evaluate and take action on your reviews to make the functions, conversions, Numbers and the keyboard better as the features you want.   We will continuously work on improvements for the Arabic Number Calculator, and make the Arabic Number keyboard more advanced or more scientific as we can. We will be launching new versions of the calculator with new mathematical functions, conversions and theme enhancements each month.  Features of Arabic Number Calculator: The calculator has the following features:  Calculator  Arabic Numbers with Arabic Keyboard numbers: Easy To Use for simple math Calculation in the Free Arabic Numbers Calculator.  Calculator Arabic Numbers  with Arabic Keyboard numbers: Free calculator with a clean and practical interface in the Trending calculators.  Calculator Arabic Numbers  with Arabic Keyboard numbers: Free Arabic Calculator Numbers and Working offline.  Calculator Arabic Numbers  with Arabic Keyboard numbers: android is currently with one theme, we are planning to add the light theme very soon.  Privacy Policy of Calculator Arabic Numbers  with Arabic Keyboard numbers  This Arabic Numbers Calculator is 100% safe because we do not save any keystroke and any kind of personal data like photos, videos, contacts, microphone, camera, etc.  Calculator Arabic Numbers with Arabic Converter numbers: Please Share it! Give us Reviews for more improvements! Thank You. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}