{
"name" : "TUN.ko Installer",
"url" : "https://play.google.com/store/apps/details?id=com.aed.tun.installer",
"package" : "com.aed.tun.installer",
"category" : "Tools",
"description" : "Before rating please remember that we are only collecting the modules that users are submitting to us. So if its not in our database or the file in our database does not work for you then you need to wait until someone uploads a working tun.ko for your phone. If it cant install a module in your device it doesnt mean that the app doesnt work it just means that there is no compatible tun module for your device at that time.  Before downloading this app please visit this page to check if your phones kernel, model and build number matches an entry in our database: http://droidvpn.com/tun-repository/  Your phones model, kernel and build number should match for the module to work. Even if you find your phone in our list it doesnt guarantee that it will work it just raises the possibility that it will be able to find a compatible module. DO NOT ASK IN THE COMMENTS TO FIX THE APP SINCE THERE IS NOTHING WRONG WITH THE APP. IT SIMPLY MEANS THAT THERE IS NO TUN.KO FOR YOUR PHONE OR THE ONE IN OUR DATABASE IS INCOMPATIBLE WITH YOUR PHONE.  If it says TUN MODULE IS LOADED it means YOU CAN NOW USE YOUR VPN.   If it says Path to tun.ko is not found it means that the app cannot find the path to your tun.ko because its possible that tun support is COMPILED WITHIN YOUR KERNEL.  Phones with built in tun support: Samsung Galaxy Y - GT-S5360 Cherry Mobile Orbit/Gigabyte GSmart G1310 Samsung Galaxy Pro HTC T-mobile myTouch 3G  Samsung Galaxy SII Samsung Galaxy S M110S  Using TUN.ko Installer 1. Make sure you have a rooted android phone. 2. Click the install button to check if we have a working tun module for your device. 3. Wait for the installation to finish. If we do not have a tun module just try again later.  Submitting your own tun.ko: 1. Make sure tun.ko is already loaded in your device. 2. Click the Share my tun.ko button 3. Wait for the upload to finish.  Do you need a vpn for your android? Visit our website and check out our own VPN client: http://droidvpn.com/ ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "[]",
}