{
"name" : "SIM Tool Manager",
"url" : "https://play.google.com/store/apps/details?id=com.keesadens.SIMcardToolManager",
"package" : "com.keesadens.SIMcardToolManager",
"category" : "Tools",
"description" : " Very Easy and Fast to   View SIM Card Information. View Phone Information. Import and Export Phone number. Delete or Add new Phone number. Multi Delete Phone number. Sent message or make a call from this app. Copy number and text into clipboard. Manage Sim contact number. Back up SIM phone number into Sdcard. Import phone number from Sdcard to your Sim card. Export phone number from sim card to PhoneBook. Import phone number from PhoneBook to sim card. Add new phone number into Sim card.  SIM CARD INFORMATION: Sim card status. Sim operator. Sim country location. Sim operator code. Network type. dBm level monitoring - Removed ASU level monitoring - Removed Signal strength monitoring - Removed Sim serial number. Subcriber ID/IMSI. Voice mail number. Active Roaming. YES or NO. SMS capable support YES or NO. Voice capable support YES or NO. In the SIM Info, now posible to save and share sim details to some people!  PHONE INFORMATION: Phone number. (now posible to add manualy phone number if your phone number is not visible!) Phone type. (type of your phone) Model. (model of your phone) IMEI number. Serial number. (serial number of your phone) In the Phone Info, now posible to save and share phone details to some people.  PERMISSION REQUIRED: We need permission below to access our feature. We dont collect data and user information. The permissions we requested are only for running the main features of our application. 1. WRITE_EXTERNAL_STORAGE to import/export contact from SD Card and to SD Card. 2. READ_CONTACTS to display contact. 3. WRITE_CONTACTS to adding and save contact.  If you have any questions, feel free to contact us at sadensstudio@gmail.com ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}