{
"name" : "DuckDuckGo Privacy Browser",
"url" : "https://play.google.com/store/apps/details?id=com.duckduckgo.mobile.android",
"package" : "com.duckduckgo.mobile.android",
"category" : "Tools",
"description" : "Privacy, simplified.  At DuckDuckGo, we believe the Internet shouldnt feel so creepy, and getting the privacy you deserve online should be as simple as closing the blinds.   Our app provides the privacy essentials you need to seamlessly take control of your personal information as you search and browse the web, no matter where the Internet takes you:  Escape Advertising Tracker Networks  Our Privacy Protection will block all the hidden third-party trackers we can find, exposing the major advertising networks tracking you over time, so that you can track whos trying to track you.  Increase Encryption Protection  We force sites to use an encrypted connection where available, protecting your data from prying eyes, like ISPs.  Search Privately  You share your most personal information with your search engine, like your financial, medical, and political questions. What you search for is your own business, which is why DuckDuckGo search doesnt track you. Ever.  Decode Privacy Policies  Weve partnered with Terms of Service Didnt Read to include their scores and labels of website terms of service and privacy policies, where available.   As you search and browse, the DuckDuckGo Privacy Browser shows you a Privacy Grade rating when you visit a website (A-F). This rating lets you see how protected you are at a glance, dig into the details to see who we caught trying to track you, and learn how we enhanced the underlying sites privacy measures. The Privacy Grade is scored automatically based on the prevalence of hidden tracker networks, encryption availability, and website privacy practices.  Our app provides standard browsing functionality including tabs, bookmarks and autocomplete. In addition to strong Privacy Protection as described above, we also packed in a Fire Button that allows you to clear all your tabs and data with one tap.  Too many people believe you simply cant expect privacy on the Internet. Were fighting to change that, and have made it our mission to set a new standard of trust online. Install DuckDuckGo and take back your privacy!  About Us: https://duckduckgo.com/about/ Device Privacy Tips: https://spreadprivacy.com/tag/device-privacy-tips/ More Privacy Education: https://spreadprivacy.com/tag/privacy-newsletter/ Our Privacy Policy: https://duckduckgo.com/privacy/  This app is open source at https://github.com/duckduckgo/Android ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}