{
"name" : "iWASEL OpenVPN for Android",
"url" : "https://play.google.com/store/apps/details?id=com.steelkiwi.iwasel",
"package" : "com.steelkiwi.iwasel",
"category" : "Tools",
"description" : "iWASEL the best OpenVPN service in the Middle East is now on Android apps market, Google Play.   One VPN account for all your devices including Android, six simultaneous VPN connections supported.  You can use 3 OpenVPN and 3 L2TP sessions with the same VPN account at the same time.   iWASEL OpenVPN app for Android enables you to connect through a network of high speed servers located in USA, UK, France, Italy, Ukraine, Netherlands and more. One VPN account gives you access to all servers anytime you want. By connecting to one of these servers, youll get a new IP address and therefore appear on the web as if youre located in a different country. You can use iWASEL VPN for Android to access geo-restricted online streaming services such as Hulu Plus, Netflix and BBC iPlayer.    The connection between your Android device and our servers is highly encrypted as iWASEL VPN for Android features 256-bit encryption so you can make sure that youre 100% protected while using iWASEL VPN even if youre connected to a public WiFi network.   Using iWASEL Android VPN becomes especially beneficial if you make a lot of VoIP calls because these calls are easy to eavesdrop on.   iWASEL VPN is the first and only VPN client for Android that provides the option of tunneling OpenVPN over SSH for Android without even having to root your device. This option will hide OpenVPN traffic in one step saving you the trouble going through the whole procedure manually. This option is exceptionally useful if youre in a region that uses DPI technique to monitor VPN connections.   You have a variety of payment methods to choose from; credit card, PayPal, Webmoney, Skrill, OneCard, CashU and Western Union in addition to your Google Play account are all available and your subscription will be activated immediately.   iWASEL VPN packages will perfectly suit your needs and higher discounts are available on longer subscription periods. Also, iWASEL VPN is the perfect VPN solution for business use and offers special  VPN packages for business owners.   If you have any inquiry, you can easily contact our support team via live chat window in our official website or by clicking on the handset icon in the iWASEL VPN application. Our support team is available 24x7.  If iWASEL OpenVPN app for Android is incompatible with your device, you can follow these steps to configure L2TP VPN connection on Android   https://www.iwasel.net/en/faq/10/  Like us on Facebook: https://www.facebook.com/Internet.WASEL  Follow us on Twitter: https://twitter.com/Iwasel  Download links: https://www.iwasel.net/en/download/   :  VPN  ,       ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}