{
"name" : "Random Number Generator Plus - Dice, Lotto, Coins",
"url" : "https://play.google.com/store/apps/details?id=com.randomappsinc.randomnumbergeneratorplus",
"package" : "com.randomappsinc.randomnumbergeneratorplus",
"category" : "Tools",
"description" : "*THE #1 RANDOM NUMBER GENERATOR FOR ANDROID, 100% FREE AND AD-FREE*   Beautiful, simple interface  Fun to use  No permissions required  No ads/ad-free  Dark mode  Open-source  This no-nonsense app generates random numbers in every way you could possibly want. Dont believe us? Then lets jump into everything Random Number Generator Plus can do.  ***FEATURES***  RANDOM NUMBER GENERATOR With the default random number generator, you can customize the amount of numbers you want alongside the range you want them to be from. You can also exclude specific numbers, sort the results by ascending or descending order, show the sum of the generated numbers, and copy the generated numbers report to your clipboard for easy sharing and transferring.  DICE ROLLER I dont know about you, but rolling dice in games is annoying sometimes. Theyre loud and they end up all over the place. This is why Random Number Generator Plus also has a dice-rolling mode where you can roll as many dice you want with whatever amount of sides you want. Random Number Generator Plus also gives you the sum of the rolled dice and allows you to copy the results to your clipboard. To save you time, the app provides quick options for common amounts of dice sides and dice amounts so you can quickly roll dice for popular games like Dungeons & Dragons.  LOTTERY SIMULATOR Feeling lucky? Then lets simulate a lottery or two! Generate 5 random lottery tickets/results with the click of a button. You can choose from simulating the Powerball or Mega Millions. Oh yeah, you can also copy the results to your clipboard with a simple click like with any Random Number Generator Plus feature.  COIN FLIPPER Need to quickly settle a 50/50 bet? Then use Random Number Generator Plus to flip a coin for you! Flip as many coins as you want whenever you want. The app also saves your preferred number of coins to flip for quick reuse and sums up the # of heads flipped and the # of tails flipped for you in the results box as well. And yep, you can copy to clipboard these results too.  DARK MODE Eyes feeling tired? Then turn on Random Number Generator Pluss dark mode to give the app a darker, less bright color scheme and save your device some battery along the way. You can turn dark mode on or off at any time from the apps settings menu.  SHAKE DETECTION Tired of clicking buttons? Want your dice rolling experience to be more realistic? Dont worry, Random Number Generator Plus has got you covered! Simply shake your device to generate numbers!  SLEEK UI This app adheres to Googles Material Design standards, and we even backported all of the apps material elements so Random Number Generator Plus looks silky smooth no matter how old your Android device is.  If there are any bugs or additional features you would like, please let me know in your review!  This app is open-source! Help me make it better at: https://github.com/Gear61/Random-Number-Generator ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}