{
"name" : "3DMark - The Gamer's Benchmark",
"url" : "https://play.google.com/store/apps/details?id=com.futuremark.dmandroid.application",
"package" : "com.futuremark.dmandroid.application",
"category" : "Tools",
"description" : "3DMark is a popular benchmarking app that helps you test and compare the performance of your smartphone and tablet.  3DMark benchmarks the GPU and CPU performance of your device. At the end of the test, you get a score, which you can use to compare models. But 3DMark also gives you so much more.  More than a score  3DMark is designed around data-driven stories that help you learn more about your smartphone and tablet. With its unique charts, lists, and rankings, 3DMark gives you unrivaled insights into the performance of your device.   See how your best scores compare with others from the same model. Learn how the performance of your device has changed with each Android OS update. Compare your device with popular models and see if its time for an upgrade. Discover the devices that deliver the best performance without overheating or slowing down.  Best benchmark for your device  Every year, we add new benchmark tests to 3DMark. When you open the app, 3DMark will recommend the best benchmark for your device. To save storage space and minimize download times, you can choose which tests you want to install.   Choose Sling Shot Extreme to compare flagship Android devices from HTC, LG, OnePlus, Samsung, Sony, Xiaomi, and other manufacturers with the latest iPhone and iPad models. Now includes Vulkan and OpenGL ES 3.1 tests.  Sling Shot is a benchmark for comparing mainstream Android devices with popular iPhone and iPad models.  The API Overhead feature test is a special test for comparing the performance of Vulkan and OpenGL ES 3.0 graphics APIs on your device.  Choose your next phone the easy way  With performance data for almost 5,000 devices, it is easy to find and compare the best smartphones and tablets with 3DMark. You can search, filter, and sort to compare the latest Android and iOS devices.   Better benchmarking starts here.  Millions of people, hundreds of review sites and many of the worlds leading technology companies use 3DMark to test and compare the performance of smartphones and tablets.   3DMark is a free app. There are no ads or in-app purchases. Download it today and join millions of people who choose 3DMark for accurate and impartial benchmark results. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.futuremark.dmandroid.application.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}