{
"name" : "Journaly - Journaling Diary",
"url" : "https://play.google.com/store/apps/details?id=com.emberify.journaly",
"package" : "com.emberify.journaly",
"category" : "Tools",
"description" : "Journaly - journaling Diary  Journaly for Android is a customizable and automatic journaling app & Diary. With Journaly, journal your notes, photos, sleep, activity, places, weather, mood and anything else that matters to you. Sync your Journal on all your devices. Capture everything that you care about.  You can customise it by adding fields that you want to journal. Journaly allows you to add self-survey questions like How many cups of coffee did I drink or What did I eat today or Did I exercise today.  Journaly automatically add activity, travel, weather and place.  If you ever forget to journal, with Auto Journal, Journaly automatically journals your location, photos, weather & activities.  Features of Journaly - journaling Diary :  Journaly has all the features you would need from a modern journal  Password protection Feature. Daily reminders. Synchronise Journals exporting your data file Tags Mood Emoji Journaling adding custom survey questions Custom fields adding media  Journaly has all the features you need to journal on your application. It presents your journal as a simple timeline so you can relish each moment.Journaly has been designed to be flexible. Our early adopters are using it as a travel log, gratitude journal, personal journal, food journal, mood log, idea diary, health journal and for many other applications.Journal seamlessly & make your journal yours with Journaly.  Privacy:  All your data remains private and will never be sold to any other party. It is stored on a secured server. If you decide not to register for the sync, the data will only remain on your phone. For more visit: emberify.com/journaly ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.BODY_SENSORS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.BODY_SENSORS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}