{
"name" : "GitKraken Glo Boards",
"url" : "https://play.google.com/store/apps/details?id=com.axosoft.glo",
"package" : "com.axosoft.glo",
"category" : "Tools",
"description" : "The Glo Boards mobile app provides a more productive way for dev teams to track tasks and issues on the go! Glo Boards are also easily accessible from inside GitKraken (our cross-platform Git GUI client), VS Code, Atom or a browser! Glo Boards sync in real-time with GitHub Issues, support markdown and offer lots of time-saving features for collaborative dev teams.  Choose your theme, and start using Glo Boards to visualize the progress of items through your workflow. Because Glo Boards sync in real-time with GitHub Issues, changes made in either system will be immediately reflected in the other. Meaning, if some team members are using either Glo or GitHub exclusively, important information can still be shared seamlessly.   GitKraken Glo Boards can help you: - Track Anything: Create cards to track tasks, issues, items, features, etc. - Sync GitHub Issues: Visualize the progress of GitHub Issues with workflows. - Real-Time Sync: See updates instantly without refreshing. - Collaborate: Invite different team members to each board and set security permissions. - Track Board Activity: See who did what and when. - Powerful Search & Filters: See only what youre looking for. - Card Labels: Use labels to quickly see priority, item type, etc. - Card Task Lists: Create additional checklists for each card. - Share Boards & Cards: Share specific boards or cards. - File Attachments: Easily add images and files by dragging and dropping. - Markdown Support: Use markdown in card descriptions and comments. - Notifications: Get alerts in-app and via email. - @Mentions: Tag people in comments to notify them. - Themes: Choose the light or dark side. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.axosoft.glo.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}