{
"name" : "Unfollow Users",
"url" : "https://play.google.com/store/apps/details?id=com.xiuxin.instagram.unfollow",
"package" : "com.xiuxin.instagram.unfollow",
"category" : "Tools",
"description" : "Unfollow users for Instagram is a simple Instagram Manager tool that find out users who do not follow you back on Instagram. You can not only track non-followers but also unfollow a single user or unfollow multiple users at a time. This is the best growth manager tool for Instagram growth and a must have for all Instagram users. You can Instafollow other Instagram users.   With Unfollow users for Instagram, you can easily find a list of all users who do not follow your account on instagram but whom you follow. While tracking non-followers, the app also lets you unfollow these users. You can either unfollow a single user or unfollow multiple users. So, if you are asking yourself - Who unfollowed me on instagram?, just start using this Unfollow users for Instagram to find out who unfollowed you. This app does not increase your followers on instagram. It only tracks users who do not follow you back on instagram and allows you to unfollow them.   This instagram management app allows you to unfollow unlimited users.   Here are the incredible features of the Unfollow for Instagram app -  1. Simple UI to track non-followers  2. Unfollow a single user  3. Unfollow multiple users by tapping multiple times    This can be an incredibly easy to user and handy media management tool for your Instagram account. Whether you are a brand or and advertiser using Instagram, this tool can be extremely useful for you to track your followers and non-followers.  So, next time you ask yourself - Who unfollows me on instagram? or How can I unfollow my non-followers on Instagram?, just start using the Unfollow for Instagram Growth app to answer these questions and more.     Want to know more about the user?  Just click the user header or userName. Then you will see the detail information about the user!    TROUBLE LOGGING IN?   Follow these steps if you are facing troubles logging in to Unfollow users for Instagram -  1. Sign in to Instagram  2. Like any photo  3. Come back to Unfollow for Instagram and login    The above is a workaround for some users who are unable to use our app. If you like the app, do rate us and tell your friends about this unfollow app.  The app is free to use for all Instagram lovers.    Note - The app is not affiliated to or endorsed by Instagram Caution! Instagram admits a limited number of unfollows per hour between 60 and 200 requests depending on your accounts age. We recommend you do not exceed this limit! If limit is reached, it might happen that your just unfollowed users still remains as followings. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "[]" 
"extra_perms" : "['com.android.vending.BILLING']",
}