{
"name" : "Safe Connect VPN: Proxy Wi-Fi Hotspot, Secure VPN",
"url" : "https://play.google.com/store/apps/details?id=com.mcafee.safeconnect.android",
"package" : "com.mcafee.safeconnect.android",
"category" : "Tools",
"description" : "Secure VPN connection & private Wi-Fi hotspot by McAfee!  Secure yourself from cyber threats with Safe Connect VPN. Safe Connect VPN helps keep your data encrypted, online activity secure and passwords protected via proxy servers. You stay private and secure, even on public Wi-Fi.  Safe Connect VPN by McAfee gives you bank-grade encryption, Wi-Fi protection, private browsing services, and internet security. Our private internet access VPN will help keep all your online activities, sites visited, and identifiable information private and secure from hackers even on public Wi-Fi or open networks.  Ensure your phones protection every time you connect and help keep all your online activities and sensitive data secure. Hackers and other cyber criminals wont be able to see what youre doing online or acquire your personal information. Our secure VPN takes care of everything.  Get Wi-Fi protection and cyber security you can trust with Safe Connect VPN - download now.  INTERNET SECURITY  Wi-Fi PROTECTION: Our private Wi-Fi apps bank-grade encryption helps to keep your sensitive information private from cybercriminals when you use Wi-Fi hotspots and open networks.  PRIVATE BROWSER: Protect your web browsing private and secure your data from potential hackers.   PROTECTION IN ONE TAP: One tap to get private Wi-Fi.  PRIVATE INTERNET ACCESS   IP BLOCKER: Hotspot VPN to hide your IP address from cybercriminals, ensuring your internet security.  PROXY BROWSER: surf the internet securely through our virtual private network  SAFE CONNECT VPN PREMIUM FEATURES  VIRTUAL VPN: Access your favorite online content from anywhere with our paid VPN. (Paid users only)  FREE CUSTOMER SUPPORT  UNLIMITED DATA: up to five simultaneous devices  Wi-Fi PROTECTION: protect up to five devices at once  NO ADS  SAFE CONNECT VPN BENEFITS  McAfee Safe Connect VPN creates a secure VPN hotspot, helping ensure your online activities, visited sites, and sensitive information stay private and secure from hackers and cybercriminals.  Private internet access hides your IP address and encrypts your online activities, helping to prevent attacks by potential hackers or data thieves and keep your identity secure.  VPN proxy app lets you access your favorite online content from anywhere.  WHEN TO USE MCAFEE SAFE CONNECT VPN?  Keep McAfee Safe Connect VPN Wi-Fi protection turned ON to minimize your online security risks and help keep your data safe from the prying eyes of cybercriminals.  Public Wi-Fi hotspots typically arent password-protected and dont encrypt the data being transmitted; your online activities may be vulnerable to hackers.  Get secure Wi-Fi protection, private internet access and VPN privacy with McAfee Safe Connect VPN.  Ensure internet security no matter where you connect. Our hotspot VPN will keep you safe on any network  download now!  McAfee Safe Connect VPN FREE encrypts your internet connection and lets you privately browse online with our Wi-Fi protection and hotspot VPN service. Use the basic free version forever with limited data protection.  McAfee Safe Connect VPN PREMIUM offers unlimited data and Wi-Fi protection for up to 5 devices simultaneously and unlimited content access from different virtual locations.  Enjoy 7-day free trial of Premium features followed by a monthly subscription or a yearly subscription. Free 24/7 support.  Need to cancel your subscription to our paid VPN service? Go to payments.google.com to find out how.  Got questions or feedback? You can reach us at Mobile_Support@McAfee.com We look forward to hearing from you.  Learn more about McAfee Safe Connect VPN: https://safeconnect.mcafee.com Watch a quick intro video: https://youtu.be/AqfE6OFQ3gc  Note: This app uses Accessibility services. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.mcafee.safeconnect.android.permission.C2D_MESSAGE', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_LOGS', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_LOGS', 'android.permission.ACCESS_BACKGROUND_LOCATION']",
}