{
"name" : "Phone Check and Test",
"url" : "https://play.google.com/store/apps/details?id=com.inpocketsoftware.andTest",
"package" : "com.inpocketsoftware.andTest",
"category" : "Tools",
"description" : "Phone Check and Test is designed to quickly test your Android phone hardware. Test Cellular, WiFi, display, touchscreen, GPS, audio, camera, sensors, storage, memory, CPU, and battery.  Monitor, Test, Report Phone Check and Test allows you to monitor your devices key device usage and signal strengths. It provides an easy to use guided process to quickly check and test all of the main components of your phone or tablet and displays a phone information report which can be emailed. Among the many tests are a network, storage, GPS test, and a WiFi test.  Phone Check and Test is especially useful if you have just purchased a phone or tablet, planning to sell your phone, had it repaired, or it just seems to not be working as well as it should be. Identify problems so you can return your phone or have the problem fixed now (within the warranty period) and before you start relying on your phone for your daily activities. Check if there is a hardware problem or other type of problem that can be resolved, without buying a new phone. Useful for phone troubleshooting and diagnostics.  Comprehensive and designed specifically for Android phones based on years of test software and mobile network experience.  Get a phone health check now ... before your phone lets you down.  The most comprehensive Android phone test The tests are configurable and are run as a series of tests and checks in the order shown below: - Device information check; - Device information: Low memory suggestions; - Device information: Low internal storage suggestions; - Battery check and charging socket test; - Telephony and Wi-Fi network checks; - Network gateway ping test; - Bluetooth check (test with in-app purchase); - NFC check (integrated test with in-app purchase); - Audio test: microphone and call speaker (earpiece speaker); - Audio test: mono/stereo speaker; - Audio test: headphone jack; - Audio test: volume buttons; - Audio test: vibrate test; - Display: dead pixels check; - Display: bright pixels check; - Display: color consistency check; - Touch screen test \ 2D Graphics: dead screen digitizer area; - Touch screen test: 5 touch points; - Network and GPS location tests; - Physical appearance check; - Camera test: front; - Camera test: rear camera and rear flash; - Fingerprint sensor check (test with in-app purchase); - Supported sensors check (e.g. proximity, light, accelerometer, step counter...); - Thermal stress test; - CPU stress test; - Memory stresstest; - Storage stresstest; - Battery usage check; - Temperature reporting.  Device information reported includes* - Device (model, brand, product, serial number); - Body (weight and dimensions); - Operating system (version, API level, build...); - Display (type, size, resolution, PPI, multi-touch); - Processor (SOC, CPU, architecture, GPU); - RAM (total and available); - Internal storage (Total and available); - Primary shared storage; - Camera (front, rear, video resolution); - Battery (connection status, level (range during test run), health, technology, temperature (range during test run), voltage); - Telephony network (SIM state, network type, data connection, IMEI/ESN); - Wi-Fi network (SSID, link speed, ...); - Sensors supported; - Temperature sensors and maximum for the test run; * Where supported by the device.  A results report is produced and can be emailed on the completion of the test.  Note: Not all device information is available on all devices. Please let us know and we will investigate adding it.  Instructions http://inpocketsoftware.com/android-phone-test/android-phone-test-help/  Support support@inpocketsoftware.com ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.NFC', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.NFC', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}