{
"name" : "Aquarium Manager",
"url" : "https://play.google.com/store/apps/details?id=com.viselabs.aquariummanager",
"package" : "com.viselabs.aquariummanager",
"category" : "Tools",
"description" : "IMPORTANT NOTICE: This app includes advertising in the form of a banner. If you do not want to see this, you can remove them with a payment, so you can even try for free before 7 days. If you do not agree, do not install this app please! Before you give castigatory ratings, you should eliminate any gaps in information to the product via the feedback function. We will gladly help you with your questions.  An aquarium with all its inhabitants require a lot of attention and regular care. However, in the hustle and bustle of everyday life, the one or the other can be neglected very quickly. This will no longer happen with the new Aquarium Manager! The free App ensures that you will always think of everything and, if necessary, put you in the position to plan well in advance. These are some of the features that we have integrated: - Management of the residents - Tips and planning of the feeding - Water values - Maintenance tasks, such as the cleaning of the tank, changing of the water, pumps and filters - Diary - Photo library  In this way, you can be on top of everything and can rest assured that your fishes are in good hands and are thriving magnificently. So that no information is lost, you can save all the data not only locally, but also on an Android backup facility (not available with some manufacturers).  The Aquarium Manager is one of the most comprehensive tools currently available on the market. It is suitable both for hobby aquarists, as well as for all those who cannot take responsibility for their own Aquarium. It is also particularly convenient if you want to go on holiday: Because the care-taking steps unfold at a glance, you can give your aquarium keeper precise instructions for days and weeks while you are physically away!  Although we wasted no effort in the development to anticipate everything and all needs, we always appreciate feedback so that we can become even better. Our goal was to create an individual, comprehensive database to assist you keeping your aquarium optimally, regardless whether you are physically present or absent.  Please note: For an optimal experience a Tablet of at least 7 inches is recommended.   We hope you enjoy our App! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.READ_PHONE_STATE']",
}