{
"name" : "Immobility Detector",
"url" : "https://play.google.com/store/apps/details?id=com.mtat.immobilitydetector",
"package" : "com.mtat.immobilitydetector",
"category" : "Tools",
"description" : "Immobility Detector is an intelligent application that detects immobility (no motion) automatically by using the camera of your device. Immobility Detector can be used for many purposes, such as, baby monitoring, elder people surveillance, guard check etc. Immobility Detector is based on our motion detector engine which is used in our Motion Detector application.  Specifications: 1) Immobility Detector automatically understands no-motion or no-change cases. 2) Immobility Detector raises alarm sound and displays alarm icon when no-motion state is kept for a specified time period set by user.  3) Alarm state optionally goes until user termination or any motion is detected. 4) Immobility Detector can save the image frame after entering and exiting an alarm state. 5) Immobility Detector can call a specified phone number after entering and exiting an alarm state. 6) Immobility Detector automatically understands any motion or change and draw frames around them on the screen. 7) Immobility Detector draws motion icon on the screen when a motion is detected. 8) Immobility Detector draws motion history on the device screen. Therefore, you can have information about the complete routes of the targets. Besides, you can see motion towards you or away from you. 9) The main problem with the change detection applications is the shaking of the devices during the observation. These yield false detection due to shaking devices. Immobility Detector application has specially designed algorithm to minimize this drawback. 10) User can set options for motion detection parameters, target phone number, alarm sound, motion overlay and motion history.  How to use: 1) Fix your device by facing your device camera looks to the area you want to track. 2) Start Immobility Detector application. 3) After 10 secs countdown immobility detection starts.  Settings: 1) Alarm Sound: Enable alarm sound or mute. 2) Alarm Time Period: Immobility time period required to generate alarm. 3) Motion Ends Alarm: Manual alarm termination or motion detected alarm termination. 4) Motion Rectangles: Draw rectangular motion region plots on the device screen or not. 5) Motion History: Draw motion history bubbles on the device screen or not. 6) Alarm Call: Call specified phone number in case of alarm or not. 7) Phone Number: Phone number to call in case of alarm entering states. 8) Pixel Threshold: Threshold for intensity difference. Smaller values yield more sensitive detection but may cause noise and excess detection. 9) Block size %: Percentage of analysis blocks. Smaller block size values yield more sensitive detection but may cause noise. Smaller values yield more sensitive detection but may cause noise and excess detection. 10) Motion Area: Amount of motion to make Motion Alarm to generate alarm. 11) Shake Sensitivity: Sensitivity level for device shaking.Immobility Detector stops motion detection in case of device shaking, therefore, prevents false alarms. User can select High, Medium or Low sensitivity. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}