{
"name" : "Calculator - free calculator ,multi calculator app",
"url" : "https://play.google.com/store/apps/details?id=com.tct.calculator2",
"package" : "com.tct.calculator2",
"category" : "Tools",
"description" : "This calculator allows you to handle all the calculations easily necessary for everyday life .  I am Alcatel Calculator - Multifunction Calculator for Android. I am easy to use and beautifully designed, much better than your phone or handheld calculator.  I will help you save time and effort. I remember everything you calculated, so feel free to take a look back and support the use of history again. You can use me to make purchases, do homework, calculate finances, and calculate taxes. If you quit the calculator and do other things, its still here when you come back. You never need to enter the same calculation twice again.  I am very attractive and effective, and I am fine with the buttons all doing a lot better:  - You will never forget where you are calculating - I always tell you what happened - I remember everything so you can take a break and then come back and continue where you left off - I show your calculations in clear, elegant fonts that are easy to read and where commas should be - You can use backspace at any time to correct a simple mistake, not to start over - My percentage key shows exactly what it does, so you will not be confused - Click on the upper right corner of the function curve can be advanced math! - I am very intuitive and simple design, so that you can make daily calculations on your phone or tablet  Let Alcatel Calculator and your phone or tablet, let your handheld calculator rest!  General Calculator Support + - * / four fundamental arithmetic operations.  Scientific Calculator Do scientific operations such as trigonometric, logarithmic, and exponential functions.  Unit Converter Support length, weight, width, volume, temperature, fuel consumption and food units conversion.  Currency Converter Supports over 180 currencies all of the world, including dollar, euro, yen, yuan, etc.  History Record All of the calculations that has ever been used can be recorded for further use . ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.launcher.permission.INSTALL_SHORTCUT']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}