{
"name" : "KIEHL Cleaning Industry",
"url" : "https://play.google.com/store/apps/details?id=com.kiehlapp.grphone",
"package" : "com.kiehlapp.grphone",
"category" : "Tools",
"description" : "The new innovative KIEHL app has all the right answers to your technical questions: quickly, anywhere, anytime.  Choose between the languages German, English, French or Italian within the app.  With the KIEHL App, you can access information about the the products by KIEHL and their application. Moreover, you can directly contact us or the consultant in your area, if you have questions or problems.  Product catalogue All KIEHL products, their properties and applications  always within easy reach on your smart phone.  Data sheets in 28 languages Product information sheets, operating instructions, safety data sheets, transport information and other information in up to 28 languages.  Barcode scanner Quick access to all products and their data sheets. Simply scan the barcode and voila.  Consumption calculator Instantaneous consumption calculation for all product application types.   Cleaning recommendations Which product for which application on which material. Our step-by-step cleaning recommendation will answer all your questions.  Technical application service Should you still have unanswered questions, simply take a picture of the cleaning situation and send it off to our technical application service.  Consultants in your area Locate your personal contact in the area.  Seminars Dates and information on our technical seminars. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.FLASHLIGHT', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA']",
}