{
"name" : "Timer Flow",
"url" : "https://play.google.com/store/apps/details?id=com.bimjay.flowtimer",
"package" : "com.bimjay.flowtimer",
"category" : "Tools",
"description" : "Timer Flow is an easy to use and discreet timer app especially made for workouts, meditation, practice, routine, running intervals, or other times when you dont want to interact with your timer alarms during your exercises, cooking etc. With Timer Flow there is no need for you to interrupt yourself to silence any timer alarms, instead you are discretely notified that the time is up for that part and then it automatically continues with the next timer. Includes example timer flows like Tabata intervals.  Try out the example flows of timers (workouts etc) or create your own flows with your lists of exercises/timers. Visual and optional audio feedback and different forms of repeats available.   As seen on the Google Developer Live shows The App Clinic and Developers Strike back!   FREE The app is ad-supported but they will not start showing until after 7 days and you can remove the ads with a standard Google Play in-app purchase.  MODERN It is a modern Android application using the simple but elegant Android design guidelines while still being available for Android 2.3 and newer devices. On Android 4.1+ it takes advantage of the enhanced notifications. Optimized for both phone and tablet use and you can choose from different color themes (dark/light etc). Colored status bar and translucent navigation bar, Android 5 styled notifications and the beginnings of Android Wear support, the list goes on.  Share your flows/workouts with Android Beam! On supported devices hold it next to another phone or tablet, back to back, and tap to confirm and the flow is shared in a second, no cables, no setup. Simple.   Of course there is an automatic backup of all your data and settings, both automatically restored when moving to a new phone or after doing a factory reset.  QUESTIONS? If you have suggestions, problems or questions please use email: support@bimjay.com   PERMISSIONS  WAKE LOCK -Option to keep the display on when timers are running  VIBRATE -Option to vibrate when time is up  BILLING -For easy in-app optional upgrade to remove ads.  INTERNET -Ads and anonymous usage statistics (can be disabled if upgraded)  ACCESS NETWORK STATE -Ads and anonymous usage statistics (can be disabled if upgraded)  ACCESS COARSE LOCATION -For the ads (not used if upgraded)  NFC -Share workouts with Android Beam (NFC) ",
"desc_perms" : "['com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.vibrate', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.NFC', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.NFC']",
}