{
"name" : "Installer App",
"url" : "https://play.google.com/store/apps/details?id=com.danfoss.hs",
"package" : "com.danfoss.hs",
"category" : "Tools",
"description" : "About the app Aimed at plumbers, heating and HVAC professionals and installers, Danfoss Installer App has been engineered to assist you with your everyday needs regardless of the size of your installation project. Get all the up to date information about presetting values, Danfoss products, installation procedures, converters and other tools you need. Create your project databases and get accurate overview of them whenever you need.   Use the mobile app to reduce the complexity of your work.  Features  My projects Create a list of your clients & jobs, save contact and building information, calculate system properties and presets for for radiator and underfloor heating. Save all information for easy overview and fast access.   Radiator and floor heating presetting Set proper values based on valve, sensor and radiator or manifold type. Or set proper values by room size and heat loss. Get the heat emission, flow and presetting right every time.   Flow/Pressure calculator Calculate, convert or verify pressure, flow, power, temperature (values or units).   Timer Replacement Select the appropriate timer replacement for a Danfoss or third-party unit. Installation guides are available as well.   TRV Sensor Replacement Find your TRV replacement in a matter of seconds: based on mount type technique (wrench, allen key or click), choose from a list of compatible products for the sensor you want to replace. Additional installation hints on valves size and temperature setting range included.   TRV Comparison Select up to 3 products and get a clear overview of the main features, helping you choose the right one for your job.   Balancing tool Ensure correct heat output of the system with flow calculation; based on valve type, handle setting of the valve and measured pressure.  FEEDBACK We are constantly striving to improve our app and we are always looking forward to your feedback.  Please send your feedback, ideas, comments and suggestions to heating@danfoss.com or use the apps Feedback form. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
}