{
"name" : "tpPLC",
"url" : "https://play.google.com/store/apps/details?id=com.tplink.tpplc",
"package" : "com.tplink.tpplc",
"category" : "Tools",
"description" : "TP-Link tpPLC app lets you conveniently view and manage your TP-Link powerline devices via your smart device.  Simply connect your smart device to the Wi-Fi network of a compatible TP-Link powerline extender and start managing with ease. It will list all the compatible powerline adapters and powerline extenders in your current network, and allow you to manage your powerline devices individually as well as the whole powerline network with a few taps.  Features  Display information of all compatible powerline devices in the current network.  Manage a powerline device such as changing its device name, turning on or off its LEDs, viewing its data rate, resetting to factory defaults, and removing it from the current network. For a powerline extender, you can also change and schedule its Wi-Fi settings, and redirect to the web management interface.  Manage the whole powerline network such as adding a new powerline device, setting a new powerline network name, and turning on or off the LEDs on all the powerline devices in the network.  Compatible Devices: To use this app, you need to be connected to the Wi-Fi network of a powerline extender below (listed hardware versions and above): TL-WPA4220V2 TL-WPA4220V3 TL-WPA4220V4 TL-WPA4530V1 TL-WPA7510V1 TL-WPA7510V2 TL-WPA8630V1 TL-WPA8630V2 TL-WPA8630PV1 TL-WPA8630PV2 TL-WPA8730V1 TL-WPA9610V1   More coming soon ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_FINE_LOCATION']",
}