{
"name" : "Calculator Lock – Lock Video & Hide Photo – HideX",
"url" : "https://play.google.com/store/apps/details?id=com.flatfish.cal.privacy",
"package" : "com.flatfish.cal.privacy",
"category" : "Tools",
"description" : "HideX, calculator lock app, is a photo and video calculator gallery vault for photo lock gallery, video lock behind a math calculator without anyone knowing as gallery lock.  Disguised as a calculator, HideX gallery vault is a stunning free video gallery vault, photo gallery lock, audio protector and privacy lock for your personal information and media files.   Now HideX also enables private browsing and private downloading You can search and view any videos or photos in a private browser. Only one-click download and the video or photo will be downloaded and directly saved in HideX.  Install privacy lock and calculator gallery vault now so that no one can view hidden folders or privacy files except yourself. You can create your own photo gallery and media gallery, manage the privacy hidden folders or albums of photos and videos, lock videos and hide photos from the system gallery, while others could only see a normal calculator installed on your phone.  Highlight Features - Gallery vault lock: detect photos and videos on your device automatically - Privacy lock: gallery vault hide picture and videos, lock photo album - Gallery vault calculator: disguise on home screen as a calculator - Sort files or folder, better organize hidden photos and videos in gallery vault lock - Built-in private image viewer, video player - Private browser to visit sites private and safe - Large media storage to lock video & hide photos in hidex gallery vault pro.  Icon Disguise: most secure private gallery - Calculator video lock, calculator photo vault, no one knows its existence except you - photo and video lock in personal gallery can only be viewed with correct numeric PIN you set for private calculator gallery vault - Offer all the regular and scientific calculator functions to make perfect disguise for secure gallery vault picture/video lock.  Hide photos, hide pictures - hide pictures to our hidden photo vault from system gallery - Browse hidden photos in safe place - Support multiple formats picture: jpg, png, gif and more  Video Lock and Media Vault - Keep others away from your private videos, movies in safe video vault - No need to worry that someone scan your private media when handing your phone - Create unlimited secret folders and import files  Multiple Vault & Fake Vault - Create multiple gallery vaults with different passwords for storing photos, videos respectively.  - Set one of them to be a fake calculator gallery vault  Safe view websites via build-in privacy browser - Incognito mode for privacy browser - Built-in privacy browser history cleaner to protect privacy  Effective Media Vault Management - Effectively sort and organize encrypted private files - Easy to locate, rename and delete photos, pictures, and videos in secret gallery vault  Break-in Alert  - Turn on the alert and get photo snapped when unlocking gallery vault failed - Snap anyone who try to break into your privacy  ---- FAQ ---- Q: How to use HideX - the best secret calculator video vault? A: Launch calculator gallery vault to enter disguised math calculator. Set a password on the calculator panel and press = to confirm your password. Note: Remember allow the privacy keeper to access photos, media and files.  QWhat if I forget my password? APlease enter 11223344= to verify your security question and reset the password. If you still have trouble logging in, please submit your valid e-mail address and our support team will contact you within 12 hours.  HideX, as a privacy lock is a fantastic privacy protection app to hide photos and lock videos. Feel free to use this amazing calculator video vault and photo vault now! We focus on full and professional privacy protection and are dedicated to provide the most advanced video hider and photo locker to keep your privacy safe! ______________ If theres any problem or suggestion, please contact us via flatfishteam@gmail.com ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}