{
"name" : "Free & Premium VPN - FinchVPN",
"url" : "https://play.google.com/store/apps/details?id=com.finchvpn.android",
"package" : "com.finchvpn.android",
"category" : "Tools",
"description" : "Surf the Internet freely, securely and anonymously  You are being spied on. Governments, corporations, and criminals all want your internet browsing data. Protect your privacy with FinchVPN.   NOTICE: You cannot use this app to get free/unlimited Internet, please READ the description before downloading |  DATA PACK NEEDED  | No hay internet gratis | Khng c Internet min ph | Hayr cretsiz internet Direct download link: http://goo.gl/FgOPvw  - Prevent hackers and data sniffers tap into your connection on an unsecured public Wi-Fi Hotspot and steal your data. - Unblock region restrictions in your local area (school, cafe, geographically restricted) - Encrypts all data you send and receive. Your passwords, e-mails and browsing activity are scrambled. - Improve your connection speed when you surf, shop or watch movie online on some countries (Eg: China) - Prevent your ISP from inspecting, prioritizing and throttling the data sent to and from your device. - Bypass schools, governments and workplaces restricted web content. Unblock Facebook, Skype, YouTube, uTorrent, and US/UK radio! - After connected to FinchVPN your online identity will be masked behind one of our anonymous IP addresses. - Get a safe and encrypted connection between your device and the Internet anywhere anytime.  HOW FINCHVPN WORKS  FinchVPN creates a secure Internet connection where your Internet provider sees only encrypted data, and the final destination sees only FinchVPN location and IP information.  Can FinchVPN connect on my phone/device that has no load or credit? No, please read https://discuss.finchvpn.com/t/can-finchvpn-connect-on-my-phone-device-that-has-no-load-or-credit/33  WORKS WITHOUT ROOT and AD FREE with NO UNWANTED APP PERMISSIONS  Plan & Pricing Free Plan - Free 3GB for free server every month (Limited servers) Pro Plan - 25 GB/month Premier Plan - Unlimited GB/month except some Asia servers. more info - https://www.finchvpn.com/pricing We are VPN provider, we are not ISP, you need to use your data to connect to VPN  Supported Feature - OpenVPN (UDP/TCP) with ports selection - Anti DPI - Bypass firewall that block VPN - SSH VPN - Tunnel OpenVPN under SSH connection - SOCKS VPN - Apps Filtering/Firewall - Select which apps to go through VPN - Custom Config  - FinchVPN account is needed to use the app. (You can register for free any time) with a single account, you can connect to VPN on Windows, Linux, iOS, Android, etc  Instead of rating 1 or 2 star,please email to support@finchvpn.com or leave a comment so that we can fix or improve it.  Official Telegram Group :  https://t.me/FinchVPN_Support  NOTICE : Leaving comments such as Doesnt work. and rating 1 star surely wont get you any help. Kindly contacting us directly is proven to give much better results, and higher levels of satisfaction for everybody. :) Please write an email if you have any problems, questions or feature requests. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}