{
"name" : "Secure Erase with iShredder 6",
"url" : "https://play.google.com/store/apps/details?id=com.projectstar.ishredder.android.standard",
"package" : "com.projectstar.ishredder.android.standard",
"category" : "Tools",
"description" : "The free iShredder Android. The Android data eraser which shreds your data permanently   Certified erasure methods go beyond international security standards  Securely delete all data, files, folders, photos, contacts, and more incl. File Explorer  Wipe and securely erase the freespace  Secure data deletion fully compliant with the European privacy legislation (GDPR)  Securely delete privacy data  Securely clean temporary data and wipe the cache of your device  Made by Protectstar the world leader in secure deletion of mobile devices  With military-grade security, iShredder data shredder (eraser) app which securely deletes data leaving them irrecoverable and protects falling into malicious hands.    Deletion without trace in 3 easy steps You might think youve deleted those photos, documents, and videos on your mobile device? But anyone can restore those manually deleted files from the free space until the data itself has been overwritten using certified secure deletion algorithms.  It takes just three simple steps to securely wipe that data using patented security standards, making it impossible to recover any deleted files.  1st Select data to erase 2nd Choose a secure deletion method 3rd Start the erasure process   Selling or giving away your Android device? Youll want to destroy all the files on it first  without a trace with military-grade security. Before you sell or give away your device, youll need to make sure that all your files have been blitzed beyond recovery.   Its easy to restore supposedly deleted files from memory on mobile devices these days. The files containing notes, passwords, address book, photos, videos, calendars, and more.   iShredder goes beyond international security standards iShredder surpasses international standards used by state and military organizations in secure file deletion with a wide selection of tried-and-trusted state-of-the-art deletion algorithms. Each algorithm has been analyzed by authorities and independent organizations to make sure it does what it says on the tin  data destruction beyond redemption.  Clean fast, and get a secure wipe to clean the phone without traces. iShredder has set a new benchmark in data shredding. It does not just keep files clean, but it ensures a powerful wipe shred. An excellent cleaner clean. Want your data cleaned beyond recovery? iShredder can help. Want content clean or instead of a clean wipe? Use iShredder to wipe space.  Depending on the edition, iShredder comes with deletion algorithms such as DoD 5220.22-M E, US Air Force (AFSSI-5020), BSI-2011-VS, US Army AR380-19, DoD 5220.22-M ECE, BSI/VS-ITR TL-03423, CSEC ITSG-06, NATO Standard, Gutmann, HMG InfoSec No.5, DoD 5220.22 SSD, Protectstar Advanced Secure Deletion Algorithm (ASDA 2017), and others. An excellent fast cleaner, a cleaner tool, a memory cleaner, and a junk cleaner that erases data.  Certified Deletion Algorithms iShredder is the most popular data eraser app which securely deletes data leaving them irrecoverable by using certified deletion algorithms. With military-grade security, wipe and sanitize unwanted and even confidential files completely and protects falling into malicious hands.  The detailed erasure reports provide evidence of deletion.   Features (depending on edition): + Certified deletion algorithms + Securely overwrite the free space (internal memory & sc card) + Securely Erase files & folders + Erasure Reports + Secure Deletion of the whole sd card + Secure Deletion of mounted devices such as external USB sticks, hard disks, etc. + Securely Erase photos, gallery, facial recognition, etc. + Securely wipe all contacts or a single contact, clipboard, etc. + File Explorer integration + Secure cleaning of temporary data & cache + Password Protection + 24/7 e-Mail Support ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}