{
"name" : "Night Light",
"url" : "https://play.google.com/store/apps/details?id=com.lunarisapps.smartlight",
"package" : "com.lunarisapps.smartlight",
"category" : "Tools",
"description" : "A night light app for Android phones with a variety of useful functions. Design your personal night-light according to your wishes. The app is easy to use and reliable. You can freely configure the function as you wish.  Features:  Select the desired brightness as it suits you.  Determine how long the night light should shine at night.  If you wish, the app will automatically stop completely when the selected time has elapsed and the night light mode is terminated.  Add your desired background image. Either from your devices memory or from a set of supplied images.  If you dont want to have a background image, you can of course simply start a night light without an image.  You can freely choose the background color of the light.  The app can automatically mute your phone when you start the night light. If the night light is switched off, the previous status is automatically restored.  We have supplied 3 standard configurations for you.  Of course, you can add as many configurations as you like.  And of course you can delete the configurations.  Languages:  English  German  Spanish (coming soon)  The app will be developed continuously, therefore there will be new functions from time to time in the future.   Coming Soon  It will be possible to play soothing background noises such as ocean noise.  We are working on a fall asleep function, some time after activating the night light the light slowly gets darker when it is quiet in the room.   If the mobile phone in the room notices an increase in volume (as when waking up), the light will automatically become brighter again.  Soon it will be possible to use the night light as an alarm clock.  We will equip the app with a warning function, if the battery level is critical and no charging cable is connected, then a warning window will be displayed.  Have a lot of fun with this app and if you have suggestions for improvement, dont hesitate to contact us. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}