{
"name" : "Screenshot Quick Free",
"url" : "https://play.google.com/store/apps/details?id=com.dmtech.screenshotquick",
"package" : "com.dmtech.screenshotquick",
"category" : "Tools",
"description" : "Screenshot Quick Free is the most simple , smallest and fastest screenshot taking app. Very small size. It is optimized for high performance especially to take screenshots while playing games or watching videos. Works without internet.  Both Phones and Tablets are supported.  Fundamental features:  Screenshots using overlay button. (Single/Double Tap) (Click on Gear icon in Notification OR open Capture Settings in apps menu to turn on Double tap overlay)  Screenshots using the key shortcut.  Screenshots using notification button.  Screenshot / Shakeshot by just shaking your device.  Crop instantly in easiest way possible.  View your taken screenshot instantly in the preview. (Pinch to Zoom-in/Zoom-out)  Share the screenshot instantly after taking it.  Change screenshots saving location(Folder). (Click on Gear icon in Notification OR open Capture Settings in apps menu to change Folder)   18:9 Displays supported.  Emulator supported.  Special features:  Take the rapid burst of screenshots when screenshot preview is off. You can turn the preview on whenever you want.  Customize overlay button however you like it from the settings.  Dynamic features:  Screenshot Quick Free has its own gallery of taken screenshots for you: view, crop, share and delete wherever and whenever you like.  Powerful features:  Optimized for minimum/least battery usage.  No annoying full-screen ads for better user experience.  Tap once on notification to view and share the previously taken screenshots.  Change settings (Screenshot preview, Overlay button and its size, Double tap, Shake shot sensitivity, Screenshot folder, Haptic feedback) from notification without even opening an app.  Important:  Screenshot Quick Free works in both Rooted and Non-Rooted devices.  App will need access to screen-capture and storage permissions to capture screenshot and save screenshots respectively.  Some apps such as banking or payment apps will not allow to capture screen, in that case app will display blank screenshot. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}