{
"name" : "1KA – Free Survey Maker",
"url" : "https://play.google.com/store/apps/details?id=com.FDV.hitra1ka",
"package" : "com.FDV.hitra1ka",
"category" : "Tools",
"description" : "Need a survey maker app for your Android smartphone or tablet? Want to access all features for free? Create a questionnaire or a voting and get unlimited responses with brief reports, statuses, data analysis, para-data and much more!   The 1KA mobile application is designed for all users of our main product, the web application 1KA  OneClickSurvey, which is available at www.1ka.si.  OneClickSurvey is an open source application that provides support for online surveys. It is an online service (SaaS - Software as a Service) that combines support for the following functionalities:   - Development, design and technical creation of an online questionnaire. - The implementation of online surveys: support for invitations, publication and distribution of data.  - Compiling and analysing data and paradata.   Overview of the status and results of online surveys  For surveys, created in the 1KA web application, users can check the status of responses, access the preview of the survey, share the URL address to the survey via social networks and review the results through the so-called public links.   Create questionnaires  Users can create a simple questionnaire using three types of questions: Categories - one answer, Categories  multiple answers and Text input. The questionnaire can be activated and shared through social networks. Collected data can be viewed in the results section in the form of interactive graphs. There are also other available features of reviewing the status of responses.   Create a voting  Voting is a type of questionnaire with only one answer, which collects respondents opinions for or against a proposal, decision etc. With a default question users can carry out a voting with just one click and share it with the voters. The results of a voting are in the form of interactive graphs and available in real-time. The voting question can be freely transformed and edited. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_CREDENTIALS', 'android.permission.INTERACT_ACROSS_USERS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.INTERACT_ACROSS_USERS', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE']",
}