{
"name" : "PHOENIX CONTACT MARKING system",
"url" : "https://play.google.com/store/apps/details?id=com.phoenixcontact.markingsystem.androidapp",
"package" : "com.phoenixcontact.markingsystem.androidapp",
"category" : "Tools",
"description" : "Which marking material is suitable for your application? Find it out with the MARKING system app!  Via a well-structured Search assistant or the integrated Barcode scanner you can find the appropriate marking solution easily and quickly. More than 3.000 marking solutions, 11 different printing systems and three marking technologies  you are guaranteed to find a suitable marking option for your application.  With the Marking Editor you can create the required marking directly in the application environment. Extend your THERMOMARK LINE printer with the Bluetooth USB adapter MINI FD BLUETOOTH  and send your print jobs directly and conveniently or via USB connection from your tablet PC or smartphone to the printer.  Features of the MARKING system app: - Marking Editor for the mobile labeling of marking materials. - Search Assistant for quickly and easily finding the corresponding marking materials  even without any knowledge in this field. - Barcode Scanner for the quick and convenient selection of appropriate marking solutions for terminal blocks from Phoenix Contact. - My Projects: Manage your created projects in a clear and well-structured way. - Wishlist: Enter the required number of your desired article including a short description for traceability reasons. If necessary, you can send a copy by mail or other services. - Favorites: Memorization of frequently used marking materials for the Marking Editor. - Comfortable adjustment of the right printing parameters via your tablet PC or smartphone. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}