{
"name" : "RaspManager",
"url" : "https://play.google.com/store/apps/details?id=com.cea.raspmanager",
"package" : "com.cea.raspmanager",
"category" : "Tools",
"description" : "NOTE: If you like the app, please, consider to leave a feedback and/or rate it :)  General Information:  Check and control your Raspberry Pi  easily from your smartphone with RaspManager. RaspManager sets connection with your Raspberry Pi , via SSH, anywhere**.  RaspManager has three sections: Status, Explorer and Terminal  +Status: Get your Raspberry Pi  information: Running processes, available memory, network status, temperature, etc. - Allows restart and shutdown your Raspberry Pi  remotely. - Allows mount and dismount drives and filesystems remotely. - Allows kill process remotely  +File Explorer:  RaspManager includes a simple file explorer, in order to send and receive files local and remotely.  - Allows copy, cut, paste and delete folders and files from your smartphone. - Allows send folders and files from your smartphone to your Raspberry Pi . - Allows copy, cut, paste and delete folders and files from your Raspberry Pi  remotely. - Allows receive folders and files from your Raspberry Pi  to your smartphone. - Allows download files to your Raspberry Pi , setting the download link.  +Terminal:  RaspManager includes a simple console terminal, where you can have a full control for your Raspberry Pi  anywhere.  - It has a commands used history (up to 100 commands). - To navigate through the command history, you can use volume keys, from your smartphone. - You can create custom commands and use it in Terminal  +Camera: - For those who have the Pi Camera you can take photos and preview it on your smartphone (in continuos development).   Requirements to work correctly:  RaspManager needs the following to work correctly:  - A SSH server: Most Raspberry Pi  distributions has a SSH server installed. Otherwise, you can install the openssh package. - To show bandwith correctly, its neccesary have installed the ifstat package.   More Information:  *: Although RaspManager was designed to work with Raspberry Pi , due to Raspberry Pi  is Linux based, RaspManager can run on any Linux distribution , as long as it takes into account the prerequisites.  **: To user RaspManager on external networks its necessary get your Raspberry. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.READ_INTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.STORAGE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_INTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}