{
"name" : "EBook Reader -- support Epub, Pdf, Mobi, Fb2...",
"url" : "https://play.google.com/store/apps/details?id=com.vinson.reader",
"package" : "com.vinson.reader",
"category" : "Tools",
"description" : "Wit Reader  book reader allows reading books for free, offline in PDF, EPUB, MOBI, FB2, HTML, XML, JSON and TXT formats.   No register Weve made a fast, reliable reader app that doesnt compel users to use any specific services. The book reader works offline and is entirely free. Read books for free without limits!   No ads Read books without ads. The Wit Reader program for reading books and viewing PDF documents neither contains ads nor imposes internal purchases.   Navigation through a book Support for table of contents, bookmarks, history of jumping through pages of a book. Navigate the book using the page pointer or the progress line. Quick access to reading settings, table of contents, bookmarks and other ebook options. Displays the total number of pages of a book and separately pages of a reading chapter.   Convenient reading settings Auto-saving the current reading page. Nice color modes while reading books. Multiple page flipping mode. Screen orientation, brightness adjustment, including PDF and ebook format. Adjustable font size for Epub, Mobi, Fb2 and txt.   Smart ebooks search function on your device  Multiple book formats support: pdf, epub, mobi, html, fb2, txt, xml, json  Material Design and simple navigation - its cool  Scan library for specific file and text book formats  Multiple fonts sizes for best and cool reading  Nice color modes while reading books  Multiple page flipping mode  File Manager - easily find your ebook or text file and set of enjoying reading your stories  Wit Reader  best app for reading books Epub, Mobi, Fb2 documents and PDF viewer for Android. If you like our reader application, please rate it and recommend it to your friends. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE']",
}