{
"name" : "Hi Translate -Language Translator,Online Translate",
"url" : "https://play.google.com/store/apps/details?id=com.talpa.translate",
"package" : "com.talpa.translate",
"category" : "Tools",
"description" : "Hi Translate is a free language translator for 88 languages, including Hindi translation to English, English to marathi translation etc. Known as online translator, Hi Translate is far more powerful than what you know. Hi translate can apply to almost any applications (Facebook, Whatsapp, Messenger, Hike, JioChat text translation etc). Hi Translate is useful for text translation and image translation with only one click. Come and Sayhi to your foreign friends!  Mostly welcomed languages include:  Hindi translation to English;  Hindi translation to Tamil English to Marathi translation; Hindi to urdu translation; Arabic translation to english, etc.   Features 1)Support Multiple Social Media Translation Hi translate supports multiple application translation, including Facebook, whatsapp and Messenger text translation. You can drag the floating ball to the text or double click the floating ball to translate foreign languages into your language. Note: In Facebook and Messenger, copying text to clipboard for translation would be suggested.  2)Chat Translation Hi translate supports chat translation like whatsapp, Hike, JioChat text translation. You can both translate your friends messages and convert your language into your friends language. Hi translate, your handy language translation assistance to make friends all over the world.   3)OfflineTranslation Supports Offline Translation, Our new Offline feature allows you to use our app and translate abroad without internet  Be confident anytime, anywhere with your translation partner, Hi Translate!  Instructions: 1)Maintain the required permissions and real-time networking. 2)Bubble Text Translator: Drag the floating ball to the chat bubbles content, and with just one step, the content of the bubble will be translated into the targeted language. 3)Input Box Language Translation:  Input any languages in the input box of the dialogue, drag and drop the floating translation ball to the text in the input box, and the text would be translated into the language your friends used. 4)Entire APP Page Translation Quickly double-click floating translation ball, the entire APP page would be translated into your native language. One step to get more efficient to learn a foreign language! 5)Clipboard text translation:  Copy the text, and click the floating ball to translate. In one second, the copied text would be successfully translated into your language. Long press the floating translation ball to change the floating ball position. 6)Long press the floating translation ball to change the floating ball position.  Translations between the following languages are supported: English, Hind / , Bengali/bl / , Telugu/, Marathi/ / Marh, Tamil/ / Tami, Urdu/ / Urd, Kannada/ / kannaa, Gujarati/ / Gujart, Malayalam/ / malaya, Punjabi/ / Shahmukhi, Chinese, Spanish/Espaol / Castellano, Arabic//, Malay/Bahasa Melayu, Portuguese/Portugus, Russian/ , French/le franais, German/Deutsch, Hausa/, Japanese/, Persian/ / Frs, Swahili/kiswahili, Javanese/Basa Jawa, Thai/, Indonesian/Bahasa Indonesia, Turkish/Trke, Nepali/nepali,Filipino/Tagalog, Vietnamese/Ting Vit, Korean/, Italian/Italiano, Amharic/Amharic, Czech/etina, Croatia/Croatia, Swedish/svenska, Dutch/Nederlands, Greek//Greek, Romanian/limba romn, Polish/Polski, Finnish/suomalainen, Hungarian/magyar, Hebrew/, Kazakh/, Cambodian/, Kyrgyz/ , Burmese, Norwegian/norsk sprk, Norwegian/, Sinhalese/, Somali/Somali, Albanian/shqiptar, Ukrainian/  (Translation language continues to increase, please feel free to join our Whatsapp group feedback if you have any suggestions: https://chat.whatsapp.com/D6rX8hRvZxiKwdBiedVxy6) ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
}