{
"name" : "VPN PotatoVPN - Free VPN WiFi Proxy",
"url" : "https://play.google.com/store/apps/details?id=com.potatovpn.free.proxy.wifi",
"package" : "com.potatovpn.free.proxy.wifi",
"category" : "Tools",
"description" : "Hey! Enjoy the fast and stable VPN service with PotatoVPN. We offer global servers and locations to use as you like. Secure all your connection and surfing. Get completely anonymous and safe with PotatoVPN!  Features: * Use servers of 6 main countries with no chargewith ads) including United States, Canada, United Kingdom, Germany, Singapore and India  * We also provide premium servers covering more countries with higher quality to choose * No credit cards needed * No Registration or Login is needed * Automatically connects you to the fastest servers  * Live chat for support    Protect Your Online Privacy  Surf with high-level encryption anywhere anytime. Hide your online identity and protect your data with simple one tap and ultra-fast speed.    Secure All Your Surfings  PotatoVPN will secure your wifi connection, browsing and online activities. Protect you from being tracked by ISP or anybody else. You can change your IP easily to get protection.    High-Quality VPN Service  We offer the best and the most free servers to use. Have a try and experience the fastest and the most stable speed. Best free VPN service is always ready to serve you!   Protect Your Data Is Our Duty  PotatoVPN aims to be a privacy platform. Its our duty to protect your data and secure all your information. If you have any questions about your privacy, feel free to contact us. We also provide strict privacy policy complying with local laws to protect your privacy in PotatoVPN.   Legal:  Terms of Service: https://potatovpn.io/?n=potato.vpn.TermsOfService Privacy Policy: https://potatovpn.io/?n=potato.vpn.PrivacyPolicy  Contact Us: If you have any questions or suggestions, feel free to contact us by live chat in the app. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}