{
"name" : "FTIR spectrum library",
"url" : "https://play.google.com/store/apps/details?id=com.gasmet.gasmet",
"package" : "com.gasmet.gasmet",
"category" : "Tools",
"description" : "* off-line access to gas-phase FTIR spectrum collection  * calculation of Sulfuric acid H2SO4 / SO3 dew point in combustion gas (Okkes formula) * calculation of water vapor dew point  * combustion calculator: estimate O2 or CO2 concentration based on fuel type and H2O level * unit conversion: calculates mg/m3 from ppm and vice versa   The absorbance spectra in this spectrum library contain detailed concentration information of the measured gas components. Additionally, information such as chemical formula, CAS number, melting point, and boiling point is given for each compound.  An IR spectrum is a graph of infrared light absorbance on the vertical axis vs. wavelength on the horizontal axis. The units of wavelength are wave numbers (cm1), but this app displays also the micrometers (m) above the spectrum. Vertical axis and horizontal axis can be zoomed in independently.  Dewpoint calculator: Calculation of water dew point and Sulfuric acid dewpoint helps in planning the sampling setup so that the sample gas does not condense in your gas analyzer. Please note that the calculation is always an estimate based on the parameters entered. For Sulfuric acid the Okkes formula is used.  Combustion calculator: Estimation of the predicted O2 concentration from CO2 (or vice versa) when the fuel type and water vapor concentration are known. Tip: set water vapor to zero to calculate the dry O2 concentration.  Unit conversion: Conversion of mg/m3 from ppm and vice versa, supports different reference temperatures for NTP and STP.   Note: Multicomponent analysis in-phone and file conversion/export are not supported in the app. For quantitative concentration analysis you need the Calcmet Standard software and for additional advanced library search routines the Calcmet Professional software. Please contact your nearest Gasmet distributor or Gasmet sales office for further details.  Note: This smartphone app is provided for information only and Gasmet Technologies disclaims liability or responsibility for loss or damage resulting from the application of this information. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
}