{
"name" : "Unit Converter - Unit Conversion Calculator",
"url" : "https://play.google.com/store/apps/details?id=com.eclix.unit.converter.calculator",
"package" : "com.eclix.unit.converter.calculator",
"category" : "Tools",
"description" : "Unit Converter app is a simple, versatile and an amazing all in one Unit Conversion Calculator app which is developed keeping in mind everyday use of unit calculator in different tasks throughout the day. It is a universal unit converter calculator app which is capable of converting units of different categories. Simple to use with amazing graphics and user-friendly interface.   Unit Converter calculator is used by a student, professional person, engineers, businessman, or stay at home ladies doing home chores and cooking. Each person needs a unit conversion tool like measurement conversion, metric conversion, temperature converter, time calculator, currency converter, mass converter etc, to convert values from one unit to another or to convert one currency into another. It is amazing when one finds an all in one conversion calculator app for their educational and working purpose. Without such a powerful unit conversion app, you have to convert units manually taking a pen and paper invests in our time and still getting not the right conversions. Due to this, you have to make calculations again and again which can waste your precious time. So, you need a unit conversion tool to convert units in real time.  Ladies cooking in the kitchen wants to convert various units of ingredients required into the one they can measure in their kitchen. Most of the cooking shows and recipes tell the ingredients according to their regions common units. The individuals of other regions have to convert them into units used in their region here comes our conversion calculator for cooking that makes it possible. On the other hand, our amazing unit converter app all in one tool is beneficial for college and university students who have to use it almost daily in mathematics, measurement conversion or physics problems.   FEATURES of Unit Converter  Clean, simple, easy to use and friendly user interface.  All in one tool offering with multiple unit conversions.  Works offline and free to download and use all the features.  History mode for saving any conversion for future use.  CATEGORIES  Currency Converter with live exchange rate. Convert gbp to usd, euro to usd, euros to dollars, pounds to dollars, yen to dollar, usd to rmb & a lot more.  Length / measurement converter (kilometer, miles, meter, yard, feet, etc)  Area Converter (square kilometer, square mile, hectare, acre, etc)  Weight / Mass Converter (kilogram, pound, ounce, ton, stone, etc)  Cooking Volume Converter (teaspoon, tablespoon, cup, pint, quart, ounce, etc)  Fuel Consumption calculator (miles per gallon, liters per 100km, etc)  Time Calculator (year, month, day, hour, second, etc)   Speed Calculator (km/h, mph, knot, etc)  Force (giganewton, meganewton, kilonewton, newton, millinewton, micronewton, nanonewton)  Power (watt, kilowatt, horsepower, etc)  Pressure (Megapascal, Kilopascal, Pascal, Bar, PSI, PSF, Atmosphere, Technical Atm, mm Hg, Torr)  Digital Storage / Data Converter (bit, byte, Kilobit, Kilobyte, Megabit, megabytes, Gigabit, gigabytes, Terabit, Terabyte)  Temperature Converter (celsius, fahrenheit, kelvin, etc)  Cooking units Converter (teaspoon, tablespoon, cup, pint, quart, ounce, etc)  Volume Converter  Energy  Data Transfer  Current  image Resolution  Electric Field  Sound  Velocity  Angle  Other Smart Tools Scientific Calculator Compass Jewelry Price Shoe Size Password Generator Stop Watch Fuel Calculator Cooking conversion chart Roman Numerals Area Calculator Volume Calculator Percentage Calculator Discount Calculator Returen on Investment Simple Interest Tip Calculator EMI Calculator Mortgage Calculator  Unit calculator calculator is compatible with all the android devices So, you can take advantage of the unit converter calculator on any device with the support of multiple languages. We are sure that youll love this amazing, useful and essential tool for working with values in everyday life. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}