{
"name" : "Incognito private browser 2020: Protect privacy",
"url" : "https://play.google.com/store/apps/details?id=com.aj.apps.browserapp",
"package" : "com.aj.apps.browserapp",
"category" : "Tools",
"description" : "Incognito-Private Browser: Java Browser Integrated browser for private browsing with Android surfing with TOR and video support. Every time you quit In-Browser or the Fire-I-Fox browser, everything youve done in the app will be removed from this fast browser, including history, cookies, and sessions. Web browser and secure browser: A feature-rich browser, such as for example, the secure Mac mini Web browser, and a private, persistent mode.  Its the optimal and secure search engine if you want to visit adult sites and Properties:  1. No data is stored. When using the application, this 4G high-speed Internet browser does not save a search history  2. Search engines In-Browser supports search in all popular search engines and provide the best results for this best browser.  3. the application does not contain third-party ads or trackers. Your information is protected against leaks. Add a blocker with the browser  4. Video support in the application Click on a video link and a video player from the app plays the video. Any track of it will be removed when you quit the application and quickly download the video or audio.   5. Minimalist, maximum space to navigate No trash, no ads, no extra bars: just maximum storage for your browsing experience  To support Adobe Flash, make sure you have the appropriate Flash add-on installed and that your device is compatible with Flash. In-Browser does not provide ready-to-use Flash but supports Flash content.  Protect your privacy with the simple private browser: Protect your search goals and only remove spyware and spyware. This is the best secure browser for a fast and secure search.  We can help you protect your privacy. Try it.  NOTE: This app does not collect personal information from the user.  The publisher has a license of all images used in the app for commercial use. For more details please contact the publisher. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}