{
"name" : "HMI Controller for Arduino L",
"url" : "https://play.google.com/store/apps/details?id=com.casdata.hmicontrollerforarduinol",
"package" : "com.casdata.hmicontrollerforarduinol",
"category" : "Tools",
"description" : "The Hmi Controller is an application for the Android OS that allows you to connect your Arduino board (UNO and Mega) with your Android device in an easy way, it can be connected over Bluetooth or LAN (Local Area Network), without the need of understanding nothing about Android programming, also without the need of knowing a lot of functions or writing extended code in your Arduino sketch to make the communication. Hmi Controller managed all the control process of the pins and variables declared in your Arduino project.  Make your own customizable hmi in the app without the need of a computer, you can select from seven different objects (widgets): button, switch, led, display 7 segments, numeric display, bar indicator, gauge and slider.  In this Lite version, the app is free but with not all the features from the full version, you can only use four of the seven widgets: switch, led, bar indicator and display 7 segments.   Full version: https://play.google.com/store/apps/details?id=com.casdata.hmicontrollerforarduino  Hmi Controller website: http://hmicontroller.weebly.com/   If you have any question or problem, you can contact me at: hmicontrollerapp@gmail.com The Hmi Controller is an application for the Android OS That Allows you to connect your Arduino board (UNO and Mega) With your Android device in an easy way, it can be connected over Bluetooth or LAN (Local Area Network), without the need of Understanding nothing About Android programming, without the need of Past Knowing a lot of functions or extended writing code in your Arduino sketch to make the communication. HMI Controller managed all the monitoring process of the pins and variables in your Arduino project Declared.  Make your own customizable hmi in the app without the need of a computer, you can select from seven different objects (widgets) button, switch, LED display 7 segments, numeric display, indicator bar, gauge and slider.  In This Lite version, the app is free but not all the features With from the full version, you can only use four of the seven widgets: switch, LED indicator bar and Display 7 segments.   Full version: https://play.google.com/store/apps/details?id=com.casdata.hmicontrollerforarduino  HMI Controller website: http://hmicontroller.weebly.com/  If You have any question or problem, you can contact me at: hmicontrollerapp@gmail.com ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
}