{
"name" : "Duplicate File Remover - Find Duplicate Files",
"url" : "https://play.google.com/store/apps/details?id=com.duplicatefileremover.duplicatefilefinder.duplicatephoto",
"package" : "com.duplicatefileremover.duplicatefilefinder.duplicatephoto",
"category" : "Tools",
"description" : "Duplicate File Remover - Find Duplicate Files can help you Find and Remove duplicate files(duplicate images, duplicate videos, duplicate audios, duplicate documents or other duplicate files).  Duplicate File Remover - Find Duplicate Files will help you delete Duplicate files and free up space on your phone.  Duplicate File Remover - Find Duplicate Files is useful duplicate file finder and remover app that scans and deletes many types of duplicate files(photos, videos, audio, documents and other duplicate files).   The Duplicate file remover app will help you recover loads of storage space on your android device.  Duplicate File Remover - Find Duplicate Files scans and displays duplicate photos, duplicate audios, duplicate videos or duplicate documents in sets. You can have the option to delete them by selecting duplicate files.   Before you use Duplicate File Remover - Find Duplicate Files to remove duplicate files, you can preview them.   Features:  Remove Duplicate Images  Remove Duplicate Videos  Remove Duplicate Audios  Remove Duplicate Documents  Remove Other Duplicate Files  Preview Duplicate Files  Do you want to Find and Remove Duplicate files(photos, videos, audio, documents and other duplicate files) in very simple Way! Just Using Our Duplicate Files Remover! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}