{
"name" : "Camera Blocker & Guard With Anti Spyware",
"url" : "https://play.google.com/store/apps/details?id=com.protectstar.cameraguardfree",
"package" : "com.protectstar.cameraguardfree",
"category" : "Tools",
"description" : "Camera Blocker & Guard With Anti Spyware: Camera Guard Free Edition   Secure Camera Blocker to prevent spying  Can prevent hackers, stalkers and spies from taking unauthorized pictures and video recordings on your smartphone (no root needed)  Deep Detective can detect even unknown attacks  NEW: Deep Detective Live: Anti-Spyware Scanner (subscription for daily signature updates)  Protectstar apps are preferred by more than 2.000,000 users in 123 countries  This app uses the Device Administrators permission. This app uses Accessibility services.   Camera Guard Android from Protectstar makes sure that no hacker or spy can observe you. With just one single click, the camera of your smartphone will be protected entirely and blocked against surveillance applications.  Prevent spying and end unattractive taping Not only millions of users but also famous company founders and security experts from the FBI tape over the webcam of their devices.  With good reason: Everything and everybody is spied on! We know this since June 2013 when whistle-blower Snowden revealed the first NSA documents. Since then, increasingly threatening details are being constantly uncovered. But not only hackers found ways to misuse the webcam without a warning signal to the user. Also, modern spyware is dangerous because it specifically targets control of the webcam.  See nothing for those who should not Camera Guard blocks and observes all programs and processes that try to access the webcam of your smartphone. Every attempted security breach will be reported with a signal.  While all accesses and warnings are conveniently protocolled in the log file, the intelligent Deep Detective can detect even previously unknown attacks.  Deep Detective: A smart invention against (un)known threats With the Deep Detective, we have created an intelligent and versatile detective that observes all accesses to the Android device  similar to a firewall  only smarter.  Deep Detective permanently controls which process or app currently attempts to access the camera. Additionally, it reports known  and thanks to modern heuristic methods  also unknown attack attempts. Every possibility to spy on you is proactively restricted from hackers and spies.  Want your camera disabled? Camera Guard is all you need for blocking the camera against unauthorized access.  With thousands of attack signatures, the optional Deep Detective Live spyware scanner detects a variety of fraudulent elements such as HiddenAds, FakeApps, Adware, LeadBolt, Sms-Thief, Rooting, Sms-Fraud, Fake Installer, Exploits, BankBots, Anubis, AgentSmith, SMSReg, FinSpy, Ransomware, LokiBot, Banker, Sms Sender, AirPush, etc.  With this app, you can disable the camera and prevent unauthorized camera access or disable cameras. This is a full-powered camera protect app that allows you to limit camera access or put camera restrictions in place. Reimagine a cameraless camera in this powerful app. Prevent unethical camera access. Want the camera blocked? Let us handle that for you. We protect the camera as no one has ever before.  An ideal combination Camera Guard can, especially with activated Deep Detective, be used ideally in combination with other existing security solutions.  Besides with our Micro Guard - a secure microphone protection app - you have a complete and robust solution against any surveillance.  Features Free Edition: + Anti Spy: New innovative Camera block app + Camera protection + Camera blocker + Deep Detective Lite + Deep Detective Live: Anti-Spyware Scanner (subscription) + Your camera app can be added to the whitelist to make photos + List of Apps with camera access + Logfile protocol + Passcode protection + Widget + Dark Mode   (If you have any problems, please contact us before giving any negative review. Were happy to assist you) ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.REQUEST_DELETE_PACKAGES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_FINE_LOCATION']",
}