{
"name" : "Ultra Lock - App Lock, Photo and Video Vault",
"url" : "https://play.google.com/store/apps/details?id=com.miragestack.theapplock",
"package" : "com.miragestack.theapplock",
"category" : "Tools",
"description" : "All of the other App Lock applications provide just PIN and Pattern lock options to lock your apps and vault. Most of the time, our friends and colleagues can guess our PIN or Pattern by peeping over our shoulder for a few times. Is your friends, colleagues and family members guessing your PIN number frequently? We provide the Ultra Lock app to solve your problem.   Apart from PIN and Pattern lock option, Ultra Lock provides the following unique lock options,   Hours and Minutes PIN: This option sets the current hours and minutes as your lock screen PIN. For example, if the current time is 10:50 AM, then your lock screen PIN will be 1050. Since hours and minutes in the cellphone changes on every minute, your PIN will also change every minute. The best part is, you neednt remember the ever changing PIN number.   Date and Month PIN: If you dont want to change your lock screen PIN number to every minute, you can make use of the Date and Month PIN which changes to your lock screen PIN to current Date and Month. For example, if the current date is 05/06/2018 in DD/MM/YYYY format, then your lock screen PIN will be 0506. On the next day, the PIN will be 0606.   Battery and Battery PIN: Battery and Battery PIN will set your lock screen PIN as the current battery level in your cellphone. For example, if the current battery level is 50% then your lock screen PIN will be 5050.  Apart from them, Ultra Lock provides the various combinations of the Hours, Minutes, Date, Month and Battery level such as Minutes and Date PIN, Month and Minutes PIN, Hours and Date PIN, Minutes and Battery PIN, etc., Using them, will make it tough for others to guess your App Lock password.  Other Cool Features in the app,   Time-Based Lock: You can enable or disable the lock for a particular set of apps based on the time. For example, you can lock your social networking apps only during your office hours from 9 AM to 5 PM and unlock it after that time.   WiFi-Based Lock: You can enable or disable the lock for a particular set of apps based on your connected WiFi. For example, You can enable lock for Messaging apps when you connected to your office WiFi and disable lock for them when you disconnect from that.   Intruder Detection: The app will capture the photo using the front camera if someone tries to access your locked apps and show a notification about it when you unlock the lock screen next time.   Last Unlock Time: Ultra Lock will show a notification with the last opened time of the locked apps when you unlock the particular apps.   Lock PIN Modifiers: We provide reverse and offset modifiers which hardens the task of guessing your PIN. For example, If you use reverse modifier option Hours and Minute PIN type and the current time is 12:15 PM, then Ultra Lock will set the lock screen PIN for the App Lock as 5121 which is reverse of the current time.   Random Numeric Keypad: The lock screen of the App Lock shows the numeric keypad in random order.   Photo and Gallery Lock: You can lock your private photos and videos inside Ultra Lock.  If you would like to be a Beta tester or provide feedback on the app, please send us an E-mail to help@miragestack.com. We will get in touch with you. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_FINE_LOCATION']",
}