{
"name" : "Guitar Tunio - Guitar Tuner",
"url" : "https://play.google.com/store/apps/details?id=com.sevenstrings.guitartuner",
"package" : "com.sevenstrings.guitartuner",
"category" : "Tools",
"description" : "Guitar Tunio  Guitar Tuner is one of the fastest, easiest and most accurate tuner apps with a simple interface.  Guitar Tunio  Guitar Tuner is now available on Google Play and is total free!  Guitar Tunio  Guitar Tuner is the perfect choice for both beginners and experts!  The app offers many different tuning modes and tools, as well as a list of standard and alternative for guitar and ukulele tunings. It works well with a range of musical instruments such as: + Electric and acoustic guitars + Basses + Mandolin + Ukulele + Viola + Violin + Cello + Balalaika + Sitar + Other string instruments Over 100 tunings available, including:  GUITAR (Standard, Drop D, Drop C#, Drop C, Drop B, Drop A, Halt step down, Half step up, Open C ,Open D ,Open E ,Open F ,Open G , Open A ,DADGAD ,Guitarlele )  UKULELE (Soprano in C, Open D , Drop G , Baritone , Slack Key , Slide )  BASS 4-STRING (Standard, Drop D, Drop C, Drop B,Half step, Full step, Open A, Open E)  BASS 5-STRING (Standard, enor Standard, Standard C, Drop A, F# B E A D )  BASS 6-STRING (> Standard, E A D G C F, F# B E A D G )  VIOLIN FAMILY (Violin: Standard , Viola: Standard, Cello: Standard)   With 2 main modes:  Instrument tuner: This mode is perfect for beginner. All you need to do is open this app, place the microphone from your smartphone near your instrument, choose a tuning and get in tune. Automatic tuning is also supported in this mode. The app automatically determines the string deviation when you play each string. Then, this app will show you whether its sharp (higher pitched) or flat (lower pitched) so that you can adjust it.   Chromatic tuner Chromatic tuner mode is suitable for professional players. It allows you to tune your guitar quickly from standard to drop D without having to touch the app.  We will update our app with a new tools  metronome. This tool allows to set at any tempo and to change the beat manually or by tapping at the desired speed. It suits players who want to learn more professionally.  Additional features:  Quick and sensitive response. Just try this app now and see how quick and sensitive it is to your sound.  Wide range of pitch sensor This app is a chromatic tuner. It follows any pitch your instrument can make.   Left handed mode This mode allows left-handed people to tune their musical instruments more easily and quickly.  No additional equipment needed. Guitar Tuner helps you tune your electric or acoustic guitar with a high level of precision and incredible ease. You dont need any additional equipment because the app works directly with the microphone of your device. You dont even need your guitar amplifier because this app will pick up your electric guitar or bass unplugged. Tuning your guitar has never been so fast, easy and accurate! Install now & enjoy it!  ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}