{
"name" : "Language Translator Translate Languages & Synonym",
"url" : "https://play.google.com/store/apps/details?id=com.newgeneration.translator.speech.translate.languages.text.voice.translation",
"package" : "com.newgeneration.translator.speech.translate.languages.text.voice.translation",
"category" : "Tools",
"description" : "Language Translator Interpreter 2019 is an easy translator offer you tap to translate all languages. Voice translator provide all translation when it translate your voice translation to translate all instructions into world languages. Voice translator allow you to speak and translate any language into target languages. Voice translator to translate all languages and language translator to communicate free through all world countries visit. Speak to translate and communicate from voice translator and language translator app. easily translate any language into international language translator. Language translation app provide you real language translation to learn translation from Language Translator Trainer and translation app. Text to translate all language is for those who love text typing and text translation feature. Speak any language and translate all into world famous languages and local languages. Language Interpreter all language supporting app is an easy language learning dictionary translator app. Language Translator Trainer Provide phrase to communicate & translate. Easily translate language into world languages. Directly translate from messenger or Whats App. Get synonym and translate into any language translator. Camera translator to translate long sentences, Phrases and books. Translator, Phrases, Synonym and Phrases Dictionary of daily life sentences. Language Translator Trainer provide maximum phrases and option to copy and translate language phrases into any world language translator freely. Foreign language interpreter is also an audio translator to capture your voice. Language translate ant sentence or phrase into world languages and voice translator interpreter to communicate. Voice translator to translate language into any world translation languages. Now Language learning from language translator all language supporting app is an easy job. Language translator offer you to translate with voice. Language translator to translate languages offer you to learn a new language from language app. Learn languages and voice translate into foreign language translation and local language translation. Camera Translator offer you to translate long sentences and books page without time consuming. Camera translating app read the sentences and detect language and translate into all world language translator to communicate, understand and learn. Camera translator offer you to avoid translator keyboard. Helpful camera feature for students and language learners to open cam take view of the part and translate everything from Asian to Arabic translator, Arabic to English, English to Spanish, Spanish to French or any other language translator.  Phrases & Synonym Language translator trainer provide you phrase for shopping, mobile, entertainment and greetings. Translate all phrases into any language and talk with your friends and partner. A dictionary translator feature is added here to provide synonym of your target word. Phrases offer you to avoid texting and just copy to translate all languages. Synonym improve your vocabulary and offer you to learn languages. Synonym and phrases are here for language learning and language understandings for you. All Language Translate 2019 is improved and easy app to learn foreign languages and translate free. All language learning translator app is the new translator with extra feature app. You can also translate language of suggested word provided in the phrases list. Translate free from text translation and language app 2019. Language translator is all language interpreter for world language translation. Language translator is an easy language learning app and translator free to learn a new language. ",
"desc_perms" : "['android.permission.CAMERA']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}