{
"name" : "File Manager - My Files",
"url" : "https://play.google.com/store/apps/details?id=com.filemanager.FileBrowser",
"package" : "com.filemanager.FileBrowser",
"category" : "Tools",
"description" : "File Manager is an easy tool that allows users to manage and clean files as they wish. With File Manager you can handle all your files and folders whether they are stored in the device memory or card. It supports searching, copying, pasting, moving, creating, deleting, renaming, sending, hiding, creating a shortcut, and bookmarking as you would on your desktop or laptop. File Manager You can also share files to and from any of your stores. It also allows you to browse and access your files by category. In addition to being a powerful anti-virus cleaning tool. Makes your phone faster.  Key Features and Benefits of File Manager (File Manager):  - Cut, copy, delete, compress, extract etc. Easily accessible  - View photos, music, videos, applications, processes, downloads, Bluetooth etc by category.  - Display the background of the application running, reduce the CPU usage and save the battery.  - Pressure and compression support  - Search and share files  - File manager to open, backup, or uninstall any application directly  - Create thumbnail for pictures, videos and files  - Quickly create new files and folders.  - Bookmark folder and display bookmark in sidebar Add to make root mode.  - Shortcut the support file on the home screen for easy access  - Working on multiple tabs at the same time  - Navigation drawer for quick navigation  - Quick access to history, access to bookmarks or search for any file  - Root Explorer for advanced users  - Grapes design and exquisite user interface with convenient and smooth light. The possibility to customize colors and your favorite interface  - Define a group of files by long clicking in the list of files.  - Support multiple display modes and can be sorted by time, name and size.  - Support a range of languages  - Safe box - Transfer your files to a secure folder. Which has password protection manager files.  - Internal Storage - Manage all files and folders in local storage devices  The application is updated from time to time, please evaluate the positive so as to further work and encourage application. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.ACCESS_SUPERUSER', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.ACCESS_SUPERUSER', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}