{
"name" : "ManageApps (App Manager)",
"url" : "https://play.google.com/store/apps/details?id=com.probcomp.moveapps",
"package" : "com.probcomp.moveapps",
"category" : "Tools",
"description" : "ManageApps is a complete app manager for your Android smartphone. It gives you option to move apps to SD card, uninstalling apps, clearing cache and everything else in between. You can also disable those pesky pre-installed/carrier-bundled apps. Finding apps which are eating away your storage, battery-life or mobile data is easy with the new Apps By Usage feature. With batch select, ManageApps makes moving, uninstalling and taking app backups lot more efficient and easier.  It include 6 sections: 1. App Manager - You can manage everything about your apps from here. Open app details, backup, view the app on the play store, uninstall them or clear cache to free temporary space occupied by apps. 2. Move Apps (App 2 SD) - If your phone supports moving apps to the SD card, you can jump here and select one or more apps to move to get more free phone storage. 3. Backup Apps - Save APK files of your apps for quick installation later on. You can use the backup APK to install on multiple devices or after a reset. 4. Disable Apps - So, you have a lot of bloatware, carrier installed apps on your smartphone - just head here and disable them to stop running in the background and consuming system resources. Even if they cannot be uninstalled, you dont have to look at them. 5. Uninstaller - This is simple, just select one or more apps you dont want anymore and remove them from your phone. 6. Apps By Usage - This is another great addition to the App Manager, you can see a list of apps based on their usage of Data, Storage or Battery. Therefore, identify which app is using all your mobile data, eating up that internal storage or making you charge your phone twice a day.  Other features: * Automatic notification on installation of movable app with customizable ringtone, vibration feedback and led notification. * Auto notification for clearing cache, apps backup and movable apps. * Clear Cache notification when cache size exceeds chosen limit, > 1 MB, > 5 MB, > 10 MB etc. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.INTERNET', 'android.permission.CLEAR_APP_CACHE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW']",
}