{
"name" : "Laboris - Registro Horario para Trabajadores",
"url" : "https://play.google.com/store/apps/details?id=com.wavelt.laboris",
"package" : "com.wavelt.laboris",
"category" : "Tools",
"description" : "Se acabaron es hojas de excel interminables y esos mtodos ineficientes para registrar tu horario laboral.   Laboris te permite validar tu jornada laboral desde tu mvil, en apenas unos cuantos clicks al da, sin necesidad de desplazamientos, ni incmodos registros.   No pierdas tiempo en elaborar documentos con tus firmas, ni te plantees instalar costosos sistemas de control horario, Laboris cumple con tus necesidades y te facilita el control, el mantenimiento y el envo de los informes mensuales a tu empresa de forma rpida y cmoda.    Con Laboris podrs:   - Activar el sistema indicando tu datos de forma rpida.   - Validar en tu mvil tu jornada de trabajo y modificarla de forma rpida.   - Controlar tu horario y las horas realizadas cada da de la semana, con clculo automtico de tus horas extras.   - Utilizar el mvil para el registro diario y la gestin de los informes.   - Enviar tu informe mensual a quien tu quieras en un click.   Laboris hace ms fcil la gestin del registro horario y te permite abrir un canal de comunicacin fcil y rpido con tu empresa. No more endless excel sheets and those inefficient methods to record your work schedule.   Laboris allows you to validate your workday from your mobile, in just a few clicks a day, without the need for travel, or uncomfortable records.   Do not waste time in preparing documents with your signatures, nor do you consider installing costly time control systems, Laboris meets your needs and facilitates the control, maintenance and sending of monthly reports to your company quickly and conveniently.    With Laboris you can:   - Activate the system indicating your data quickly.   - Validate your work day on your mobile phone and modify it quickly.   - Control your schedule and the hours performed each day of the week, with automatic calculation of your overtime.   - Use the mobile for the daily record and the management of the reports.   - Send your monthly report to whoever you want in a click.   Laboris makes the management of the time register easier and allows you to open a channel of easy and fast communication with your company. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}