{
"name" : "UK English Dictionary - Emoji Keyboard",
"url" : "https://play.google.com/store/apps/details?id=com.kitkatandroid.keyboard.dict.en_gb",
"package" : "com.kitkatandroid.keyboard.dict.en_gb",
"category" : "Tools",
"description" : "Spanish Dictionary - Emoji Keyboard is totally free forEmoji Keyboard with 1000 colorful keyboard themes, Emoji, Emoticon, GIF, Stickers, Symbol and Smiley faces! You will need to install Emoji Keyboard first to use this dictionary.   How To Use this Dictionary  Step1. Install Emoji Keyboard first to enjoy this free language pack. Step2. Open Emoji Keyboard app-> Settings-> Input languages-> Check the language box  About Emoji Keyboard Cute Emoticons  Cute, simple, stylish and free. Emoji Keyboard Cute Emoticons is the best popular keyboard for Android.  This keyboard supports Newest Android 8 Emoji and Unicorn, Taco, Nerd Face in several emoji styles. Emoji Keyboard Cute Emoticons makes you easy to type and share 3000+ funny GIF, Stickers, Emoji, Emoticons, Emoji art and Symbols in a flash via all social apps.  With colorful keyboard themes & keyboard customization, finally you can text the way youve always wanted to with Emoji Keyboard Cute Emoticons!  Emoji Keyboard Cute Emoticons Features  Fast Input 3000+ Emoji, Emoticon, Free GIF, Symbol, Sticker  Top row emoji to fast input emoji with keyboard  Text faces including (   ), ()  Massive emoji, smiley icons, symbols      Smart emoji prediction for your words  New Emoticon list, Emoji art, and Emoji dictionary for keyboard  Send funny animated GIFs & stickers straight from GIF keyboard  Awesome Keyboard Customization  Custom keyboard key press sounds   Resize and split keyboard layout as you wish  Customizable keyboard color, font and wallpaper   Background photos from gallery or camera for keyboard wallpaper   Colorful Keyboard Themes  1000+ colorful keyboard themes  Continue to increase new keyboard themes   Fast & Smart Input  Top row number input in main keyboard  Type fast with auto correct and smart next word suggestion  Gesture Typing (Swipe) with dynamic floating preview  Multilingual keyboard with 65 languages   Other advanced keyboard feature  Clipboard for multiple fast copy and paste  Always display capital letter in keyboard input  Copy, cut, paste and arrow key in main keyboard  Your feedback always keeps us improving with more and more cool features.  Facebook: https://www.facebook.com/kkemojikeyboard Twitter: https://twitter.com/kkemojikeyboard For more information, please refer to our FAQ: https://emojikeyboard.uservoice.com Always be prepared! Enjoy typing with this free dictionary pack. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "[]",
"perms_with_call" : "[]" 
"extra_perms" : "[]",
}