{
"name" : "FidoLED",
"url" : "https://play.google.com/store/apps/details?id=com.wookiesoft.fidoled",
"package" : "com.wookiesoft.fidoled",
"category" : "Tools",
"description" : "Need to know the resolution of a given LED Video Screen? How about the physical size of the screen along with the weight of it? Want to map media pixel for pixel to a screen? then this is the application for you.  FidoLED started life on the PC and Mac platforms as a simple calculator for the Barco range of LED products to calculate the number of D320 Processors needed for a given size LED screen. In those days there was some math needed to make sure you had the correct number of processors so this application was written to make life a little easier.  As time went by more products were added, more features all reflecting the stock of LED Screens held in rental inventory across our offices around the world.  Realising that people other than CT Staff were downloading and using this program I started adding in other products requested by others. While its not complete, its very easy to add more product manufactures and models so drop me an e-mail with the link to the product and I will add it and issue an update.  The Android version has most of the features of the desktop versions but with a simplified interface. From your Android device you can get all the information for your given LED Screen and email out a PDF of the information, or e-mail out a pixel mapped grid of the LED screen for your media creators.  You can request more LED products be added to the database by clicking on the bottom right FidoLED logo and clicking request LED.  If there are any features that you would like added just drop me an e-mail and ask. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.wookiesoft.fidoled.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.SEND_SMS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.SEND_SMS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}