{
"name" : "Notification blocker & notification history",
"url" : "https://play.google.com/store/apps/details?id=com.notic",
"package" : "com.notic",
"category" : "Tools",
"description" : "Are you tired of seeing a notification bar that looks like a bulletin board? Do you constantly receive junk notifications that are already irrelevant or not interesting? Not sure how to forbid an app to show push notifications or view notification history?  Just install Notic  a reliable assistant in fighting annoying notifications, which will help you filter out what is not needed and not miss really important information!  What Notic can do Notic offers an all-in-one solution, which not just serves as a notification blocker, but is also able to control notifications in one place. Notic offer the following functions:  notification manager and notification cleaner  filter by apps, headers and notification text  blocking system notifications  blocking all notifications  friendly interface and easy operation  dark theme  minimum app size and battery consumption  notification history not to miss anything  backup copy and restoring rules  Blocking of persistent notifications (for android versions 8.0 and higher) Now you can completely clear the notification panel. Notic can block and hide persistent (ongoing) notifications that cannot be removed manually through swipe.  For example: software update available, process running in the background, device charging, VPN connected, and other system notifications.  Notification history Have you accidentally swiped an important push notification without reading it? Or maybe you got a free minute and want to see what the apps tried to notify you of? Just go to the notification journal, where they are all saved by apps and timing! Set up a convenient mode to clear history  hide notifications manually or allow the app to do this automatically every X days.  Keep your notification bar tidy Leave only relevant notifications on the bar. View the other stuff whenever you have time. System notifications can also be moved to the history.  Set up flexible rules Blacklist or whitelist apps to choose which app can show you push notifications and which alerts will wait in the history. You can filter notifications by given words and phrases in the notification body and headers. Notic offers the following rules (lower priority is on the top):  allow all  block all  allow app  block app  allow by phrase  block by phrase  Friendly interface Allow Notic to read notifications. All you need to do after that is just wait for the notification to appear and add a rule. They will not bother you anymore. You dont need to spend hours searching how to disable junk notification in the settings! Notic automates the process and allows you to see only important information!  Notic saves your time! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}