{
"name" : "Photo Collage - Photo Editor",
"url" : "https://play.google.com/store/apps/details?id=com.dreamgo.photoeditor.photo.collage",
"package" : "com.dreamgo.photoeditor.photo.collage",
"category" : "Tools",
"description" : "Photo collage maker picture grid! Photo Collage-Photo Editor is the best collage maker and photo grid effects! The best and easy-to-use collage photo maker to grid photos!  Photo Collage-Photo Editor is a must-have free photo editor, collage photo maker app with grid and layout options, templates, and exciting photo editor tools to make your photo more special.  Photo Collage-Photo Editor is a powerful collage photo maker & photo editor for to create amazing collages by using your photos with grid, frame & layout.  Photo Collage-Photo Editor is the best photo collage maker & photo editor helping you combine multiple photos with various awesome frame layouts and grid effects.  Choose photos from gallery and instantly see them laid out in cool collage with the best and powerful photo collage, photo editor & grid app. Pick the frame layout you like most, add your photos for collage, then make your amazing photo effects, share your arts with friends on Facebook and Instagram  Photo Collage  Photo Editor Highlights: A full-featured photo editor included Instant grid layouts for photos from gallery or camera Hundreds of frame layouts and templates to choose from Design your personal scrapbook with freestyle pic stitch Create custom layouts by simply dragging grid borders Create amazing collage and make it a stylish poster Easy to share your arts on Facebook & Instagram etc.  Photo Collage  Photo Editor Incoming Features: Personalize your photo collage with hundreds of funny stickers Hundreds of stylish backgrounds to choose from Awesome filters to personalize your collage photo Draw and write on your photos in your own unique handwriting  How to use Photo Collage  Photo Editor? Pick the frame layouts you like most Choose photos from gallery or camera See them laid out in cool & stylish collage Edit it to make amazing photo collage  We sincerely welcome your suggestion or any feedback: david.wang.jack@gmail.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.dreamgo.photoeditor.photo.collage.permission.C2D_MESSAGE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}