{
"name" : "WiFi QR Code Generator & Scanner",
"url" : "https://play.google.com/store/apps/details?id=com.zedstudioapps.WiFiQRCodeScannerGenerator",
"package" : "com.zedstudioapps.WiFiQRCodeScannerGenerator",
"category" : "Tools",
"description" : "WiFi QRCode Generator & Scanner is an impressive WiFi QR Code Scanner and WiFi QR Generator application that can generate, scan, read and connect WiFi in easy way without any root requirement.  With beautiful and futuristic design WiFi QR Code Reader allows you to connect easily to a WiFi network by scanning a pre-generated QR Code. Just put your mobile camera to the QR code and automatically the app will Connect to the scanned network.  WiFi QRCode Generator allows you to share your WiFi Connection with your friends, family & colleagues without telling your Wifi Password.  Main Features   Scan & get list of all available Wifi connection in your surrounding  Select your desired WiFi connection, enter password and generate your WiFi Connection QR Code.  Save and Share Generated Wifi QR Code with your Family, Friends and Colleagues to allow them to connect with your WiFi without telling your password.  Scan, read WiFi QR Code in pubs, restaurants, expos, hotels and even private houses and connect automatically.  WiFi QR Connect can connect you with WPA, WPA2, WEP and non-password networks.  This app DOES NOT reveal the networks password to the user.  The QR code must be valid and must contain a correct SSID & password.  No Root required.  To scan WiFi QR code, just place the QR code in center of screen. WiFi QRCode Scanner & Generator app decodes the QR code automatically and allow you to connect to that WiFi Network.  WiFi QRCode Scanner & Generator required Camera permisson to scan and read QR Code. It needs Gallery and Photos permisson to save generated QR Code to your mobile memory. Beside that it also needs to activate GPS/Location to access all available WiFi networks when generating WiFi QR Code. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'com.zedstudioapps.WiFiQRCodeScannerGenerator.permission.C2D_MESSAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}