{
"name" : "PureVPN - Secure & Best VPN for Android",
"url" : "https://play.google.com/store/apps/details?id=com.gaditek.purevpnics",
"package" : "com.gaditek.purevpnics",
"category" : "Tools",
"description" : "PureVPN offers private browsing that is rated 4.8/5 by Trustpilot. With our secure VPN connection, you can experience complete anonymity and private Internet access.  Our best VPN proxy is powered by 2,000+ servers spread across 180+ locations. Unlock any restricted website or your favorite content with our easy to use and fast VPN app.  Why is PureVPN the Best Android VPN? Complete private internet access is one reason to use a Virtual Private Network. PureVPN offers numerous other benefits, ensuring our secure VPN proxy is the right choice when it comes to Private Browsing and Internet Freedom!  7-Day Free VPN Trial Try before you pay! Avail our 7-day free trial; meaning you pay absolutely nothing for the first 7 days*. Simply 1) download the app 2) authorize your details and 3) enjoy amazing features. The best part; you can cancel anytime. No commitments! **You will be required to authorize payment when the trial starts, but you wont be charged till your FREE Trial ends.  No-Log Certified You wouldnt want to use a VPN service that logs your data. PureVPN has received a no-log certification from an independent auditor so that you can use it with complete confidence.  Top-Notch WiFi Security Theres no point in being the best VPN provider if it doesnt offer security on WiFi. Our app for Android keeps your personal data protected from hackers with military-grade encryption. This ensures that your privacy remains intact every time you are connected with our hotspot VPN.  Complete Privacy & VPN Security Security and privacy is your right. And a virtual private network ensures a secure connection on the internet. In simple words; your online activities are hidden from ISPs, hackers, and other entities.  Unlimited VPN, Unlimited Access Having trouble while accessing your favorite content? Our Unlimited VPN Proxy enables you to get around digital roadblocks in just a few taps to unlock and access anything, anywhere from across the globe.  Fast VPN Speeds Whats the point to unlock websites if youve got slow VPN speeds? Our network ensures a Fast VPN experience when it comes to streaming, gaming or downloading!  No Bandwidth Caps Your Internet connection is already throttled by your ISP, so it doesnt make sense to use a VPN that limits your bandwidth. With our app, you can browse the internet without worrying about bandwidth.  Easy VPN Setup A VPN app for Android should be easy to use, right? Our app can be used by novices and experts alike. Simply download and install the app, connect to any server, and we handle the rest.  PureVPN Android Features  Download the best VPN for Android today to enjoy:   Military-Grade Encryption  IP Address Masking  Private internet access  Split Tunneling  Auto Connect  Secure VPN Protocols  Throttle-Free Speeds  Internet Kill Switch  Fastest-Growing VPN Network  Secure Wifi  DNS & IPv6 Leak Protection  What Experts Have to Say About Us?  PureVPN is a budget offering with reliable performance across a truly global server network and its a fantastic choice for frequent streamers and those who want to tighten up security while private browsing on the move.  Top10VPN  PureVPN includes unique features and capabilities that appeal to advanced users. Its easy to use, hides your online activity from eavesdroppers, and allows you to spoof your IP address to view content that is restricted in certain locations.  PC Mag  A Virtual Private Network anonymizes Internet activity, and consumer advocacy group Choice has a handy breakdown of your options. The company ranked the top VPNs to use in Australia  with PureVPN rating the highest.  Mashable  Download the best Android VPN to enjoy a 7-day free trial! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.CHANGE_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_PHONE_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}