{
"name" : "Create Your Character – Doll Maker",
"url" : "https://play.google.com/store/apps/details?id=com.Create.Your.Character.Doll.Maker.ogg",
"package" : "com.Create.Your.Character.Doll.Maker.ogg",
"category" : "Tools",
"description" : " If creating your very own avatar girl is by far your favorite part of any game, then youre in for a treat. Create your own character without wasting additional hours figuring out the rules of a game. Here, the rules our quite simple. Download our princess doll maker and dont be afraid to be creative. Thats it! That is all you need to know before you dive into our cute character maker. You can design your own avatar to resemble yourself or go into a completely different direction. Chibi yourself and make yourself unrecognizable! You wonder how would you look with longer hair, wings or face tattoo? Wonder no more, thanks to our  Create Your Character  Doll Maker !    Use our anime character creator to avatar yourself like never before!   Features:   Design your own character in our latest kawaii avatar maker app!  Edit their faces with tons of different options: eyes, eyebrows, mouth, glasses, masks, tattoos, facial expressions!  Pick your kawaii hairstyle!  Dress up your avatar in the cutest outfits!  Add beautiful accessories to your new manga avatar: hair decorations, wings, tails, ears, horns!  Take pictures on different backgrounds and save them to your gallery when youre satisfied with the designed style!  Share your absolutely unique and awesome creations on social networks!  Become known as one of the greatest chibi character maker out there!  All this and much more is waiting for you in this astonishing  Create Your Character  Doll Maker  for FREE!    Make your own anime character straight from your dreams with tons of customization options and an infinite number of combinations!    Are you ready to use all of your imagination as well as our wide range of physical features to create your avatar? Or simply put, are you ready to have fun? Now you can finally make your dreams come true with our character maker app! Do you want to refresh your boring look with a fancy haircut or maybe turn yourself into some kind of a creature? From a shy pastel girl to some kind of a monster inspired by numerous anime characters! You can find all of that and much more in our virtual avatar creator!    Were stepping into a new era. The era of create your character games! Make sure you get a front row!    No more exhausting quests and strict rules!  Create Your Character  Doll Maker  have decided to remove everything that was blocking your creativity! Thanks to our avatar girl maker you can freely and fully express yourself! Make a doll of yourself! You can edit facial features, change hairstyles, change clothes, add various accessories and so much more! Sky is truly the limit when it comes to our anime character maker. And guess what? Youre only a click away from this person maker! So dont doubt a second more and join us! Sooner you start playing avatar dress up games sooner youll make your own avatar!    If youre tired of putting your personal photos on each and everyone of social media profiles, we have a solution for you!    Surprise and impress all of your friends with your cute girl avatar! You can create a look a like or completely disguise yourself. Its up to you. Whats important is that our cartoon avatar maker games have made it possible for you to go either way. With countless elements, features and options for you to create your own avatar free, it would be a mistake not to download this adorable chibi creator! Fulfill a long waited wish of your inner child and find out how would your own pastel anime look like. Arent you intrigued at least a bit? If you are,  Create Your Character  Doll Maker  is here to give you the answer.  ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}