{
"name" : "Applock - Fingerprint Password",
"url" : "https://play.google.com/store/apps/details?id=com.tohsoft.app.locker.applock.fingerprint",
"package" : "com.tohsoft.app.locker.applock.fingerprint",
"category" : "Tools",
"description" : "AppLock fingerprint is one of the best Android lock app with privacy guard, the best app locker with password & pattern lock screen, smart applock that provide high secure features in the one app.  This is the super applock that will protects your privacy &give phone protection. Privacy your note, call, sms, email, settings..., all the privacy guard functions for you to ensure your phone security and keep your privacy safe. With App lock security protection, your privacy is well protected with password lock screen & pattern lock screen AppLock can lock Facebook, Whatsapp, Gallery, Messenger, Snapchat, Instagram, .. Ensure personal & phone security. AppLock can hide pictures and hide videos. Hidden pictures and videos are vanished from Gallery and only visible in the photo and video vault. . App lock has option to enable invisible pattern lock. No more worry people may peep the pin or pattern. Keep safe!  With this secret app lock, Its also aso cool child lock to protect phone from your kids.  The app is perfect app lock that help you to keep your personal security, make protection app from everyone.  ---Features--- - Fingerprint lock supported - Lock apps with a password, pattern password safe with anyone - The vault: Safe gallery vault, private photo vault help to hide pictures and hide videos. - With the image vault & gallery lock, app move photo/video to secret vault by auto-deleting hidden images from the gallery wall after performing hide photos & hide videos - Lot of beautiful password lock themes, pattern lock screen themes - Customized lock screen password theme for the app, make privacy screen with style you wanted - App block Settings automatically right after app is opened at first screen, help to prevent someone uninstall app - Protect your emails, SMS, call log - Three securities private mode: Lock apps with password lock, pattern lock or DIY. The keypad lock screen with passcode, DIY help you to make yourself keypad lock screen, pattern lock screen using your photo on the gallery - Option to make invisible pattern on unlock screen, people can not see your pattern lock screen while you are unlocking. More safe! - Easily to lock phone apps, unlock phone apps easily from an app list by one click - Explorer more apps and the locker themes from the More apps feature. - Password manager: Change password type between passcode, pattern, DIY and reset password  Available very soon: - Data security: Delete app data when someone login fails so many times (probably not you) - Option to hide apps from the phone desktop and open it in the app locker app. - Better kids lock: kids lock only allow kids to play with some software that is not security apps like video, music,  without needing to unlock whole phone - Separated private photo vault app to only lock photos (or lock videos only) app, less app size.  To make app workingon fingerprint password, you must setup yourfingerprint lock first on phone settings. When this is ON, thefingerprint lock screen will be enabled at unlock screen, otherwise it requirespattern or password for lock screen instead.  ---FQA--- 1. How to protect my phone ? You need to lock at least these apps: Settings & Google Play to prevent someone uninstall the app lock app  2. How to change password ? To password for apps, open the AppLock, click menu Settings then chose Change password  3. How to stop or uninstalling AppLock ? You must have password to uninstall this smart app lock, if you forgot passcode you can reset it via security email.  4. I Forgot password, how to find it ? Enter your security email then click reset password.  IMPORTANT NOTE: This app uses the Device Administrator permission, it is NOT required, you can enable or cancel at anytime.  Download smart app locker with fingerprint right now, best app protector, app security for everyone. The privacy app: We does not collect any personal & device information of yours. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_ACCOUNTS', 'android.permission.RESTART_PACKAGES', 'android.permission.CLEAR_APP_CACHE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_ACCOUNTS', 'android.permission.RESTART_PACKAGES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}