{
"name" : "Zetup, print in one click",
"url" : "https://play.google.com/store/apps/details?id=com.bq.zetup",
"package" : "com.bq.zetup",
"category" : "Tools",
"description" : "Simple and intuitive software Even if its your first experience with this technology, Zetup lets you print quickly and easily with your Witbox Go!. The PC version allows you to prepare the object and configure and launch the print, while via the Android application you can control the printer, launch the print or check its status, and receive notifications on your smartphone or tablet.  Configure your Witbox Go! in just minutes With Zetup, getting your Witbox Go! up and running is so easy that youll be launching your first print just minutes after unboxing it. Zetup will guide you step by step through the Wi-Fi network setup, bed adjustment, filament loading and the launching of your first print job.  Print-ready objects in three easy steps Forget about complicated slicing processes: preparing an object with Zetup is as simple as choosing the quality (low, medium or high) and fill. Now all thats left to do is save it to the memory of the Witbox Go! and launch the print.  Manage the status of your printer or printers Zetup lets you start and pause the printing as well as consult its status. Details about the filament are also available (such as its colour or the amount left on the spool*). And if you have more than one printer youll be able to manage simultaneous prints and receive notifications from all of them.  *Only our genuine 300 gram PLA spools provide this data.  MyMiniFactory: thousands of objects ready to print Print the objects included in the Witbox Go!s internal memory, create your own or use one of the figures from MyMiniFactory community of talented 3D designers, an open platform with over 30,000 free designs every one of which is guaranteed to be printable. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}