{
"name" : "Sensor Kinetics",
"url" : "https://play.google.com/store/apps/details?id=com.innoventions.sensorkinetics",
"package" : "com.innoventions.sensorkinetics",
"category" : "Tools",
"description" : "Does your phone have a gyroscope? How does your phone compare with your friends phone? Does it have a more advanced accelerometer or gyroscope? What other mysterious high-tech sensors does your tablet have hidden on board, and what do they do? Find out with Sensor Kinetics.  Sensor Kinetics is an advanced viewer and monitor for all of the standard sensors available in your Android device. It allows you to demonstrate sensor activity and perform complex and detailed experiments. The built-in Multi-Sensor Recorder allows you to view and record multiple sensors simultaneously.   Written by one of the pioneers of the use of accelerometers and gyroscopes within the modern smartphone, it provides a comprehensive look at the total dynamics of the combined operations of all the sensors.  The app demonstrates the use of the accelerometer, gyroscope and the rotation sensor to control a tilt based view navigation like the RotoView technology by INNOVENTIONS. It also demonstrates the operation of the magnetic sensor, the linear acceleration sensor and the gravity sensor within special graphical displays.  Use Sensor Kinetics to monitor and understand the behavior of the sensors while you change the delay setting or activate/deactivate specific sensors. Each sensor is attached to a sophisticated chart viewer. The Multi-Sensor Recorder records multiple sensors simultaneously at a controlled data rate. If you need to save or share sensor charts, please purchase the companion Sensor Kinetics Pro. The Pro version is also ad free.  For educational users, the app includes comprehensive help files which provide physics students with hands-on knowledge of how these sensors interact with smartphones and suggest numerous experiments you can perform on your phone or tablet.   Who Should Use Sensor Kinetics?  Developers, students, hobbyists, technicians, engineers... anyone whos curious about what lies under the hood of their mobile device!  Test your Android phone or tablet: Sensor Kinetics allows you to test all of the sensors on your device. For example, you can quickly determine if your Android device has a gyroscope sensor and how fast its operating. The numerous chart viewers allow you to measure any sensor over time and gauge their accuracy and behavior.  Educational: Sensor Kinetics demonstrates the physics of gravity, acceleration, rotation, magnetism and more as these forces are measured by your phone or tablet. The app includes comprehensive help files with easy to understand information and experiments you can perform with the sensors.   App Developers: View in detail the behavior of the sensors used in your apps. Compare the performance of advanced sensors like gyroscope, linear acceleration sensor and the rotation sensor.   Sensor Kinetics relates to gyroscope and accelerometer data logging and to the science and physics of the magnetometer, the pressure sensor, the relative humidity sensor, the light sensor, the linear acceleration sensor, the temperature sensor, the proximity sensor, and the gravity sensor. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}