{
"name" : "Compass",
"url" : "https://play.google.com/store/apps/details?id=com.keuwl.compass",
"package" : "com.keuwl.compass",
"category" : "Tools",
"description" : "Uses the Magnetic Field Sensor to convert your device into a Compass. Does not need to be level. Magnetic North and True North Needles.   Location is required to determine the magnetic declination - the difference between magnetic north and true north (Hence the ACCESS_FINE_LOCATION Permission). If GPS/Network location is not available or turned off, then the location can still be entered manually.  Normally a compass needs to be level to get the correct reading, but this app uses the accelerometer reading to convert the magnetic field reading back to the horizontal plane. If you would prefer it to act like a real compass (which requires being level for a correct reading), in Settings > Mag North, select the magnetic north to point to the maximum field in the plane of the device.  Also:  Bulls eye Bubble in Compass to show how level it is.  Roll and Pitch Gauges.  Calibrate Bubble Level Option.  Heading in Azimuth or Quadrant Notation.  Magnetic Field Strength and Inclination.  Rotatable dial with orienting lines.  GPS/Network Location  Latitude, Longitude and Elevation (GPS can consume a lot of battery, therefore it is only measured continually when the location display is shown. Otherwise just one reading is taken from which the magnetic declination is determined).  Your device must have a Magnetic Field Sensor for this app to work. Magnetic field direction can be affected by nearby ferromagnetic material - Therefore move into a clear area and remove any metallic casing that might interfere with the sensor. Some sensors can become magnetized or gain an offset resulting in false readings  rotating the device around each of the three axis can sometimes help. Results depend on quality of magnetic sensor, so use for indication only. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}