{
"name" : "Wist PDF — PDF Reader for Android Phone",
"url" : "https://play.google.com/store/apps/details?id=com.vinson.reader.pdf",
"package" : "com.vinson.reader.pdf",
"category" : "Tools",
"description" : "Wist PDF  the great viewer and reader apps for PDF files for Android phone  Wist PDF is a great PDF reading and editing application on android. PDF Reader manages and displays all PDF files on a single screen. You will not need to find PDF files everywhere in the phone. You just select the PDF file you want to view and open it. This application supports you to easily open PDF files and read documents offline anywhere, anytime.   No register Weve made a fast, reliable reader app that doesnt compel users to use any specific services. The PDF reader works offline and is entirely free. Read books for free without limits!   No ads Read books without ads. The Wist PDF program for viewing PDF documents neither contains ads nor imposes internal purchases.   Navigation through a book Support for table of contents, bookmarks, history of jumping through pages of a book. Navigate the PDF using the page pointer or the progress line. Quick access to reading settings, table of contents, bookmarks and other options. Displays the total number of pages of a book and separately pages of a reading chapter.   Smart PDF files search function on your device  Material Design and simple navigation - its cool  Reading pdf fullscreen mode pdf files  Nice color modes while reading books   Multiple page view mode  File Manager - easily find your PDF file and set of enjoying reading your stories   Experience the good reader PDF app. Thank you for using Wist PDF  ",
"desc_perms" : "['android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}