{
"name" : "Agenda 2020 Gratis",
"url" : "https://play.google.com/store/apps/details?id=com.appspremium.agenda2019gratis",
"package" : "com.appspremium.agenda2019gratis",
"category" : "Tools",
"description" : "Agenda 2020 Gratis te ofrece un contenido donde podrs llevar control de tus actividades, te brinda la opcin de agregar a cada una de tus notas agregando foto o captura, paisajes, de tu galera de tu dispositivo android, puedes elegir el color para agendar tus notas, citas eventos y viajes, cumpleaos compromisos y todo tu trabajo laboral que as realizado en tu Agenda 2020 Gratis.   Agenda 2020 Gratis es ms sencilla donde podrs organizar tus labores, Horario de clases Vacaciones, salir de paseo, Organizar Eventos a tus Notas, Sin correr el riesgo de perder tus apuntes, Citas en tu Empresa o Escuela, podrs disfrutar de manera fcil y sencilla de usar, solo tienes que descargar esta app y empezar a organizar tus tareas, con tu organizador personal.  Agenda 2020 Gratis de bolsillo, que puedes utilizar en cualquier momento y sin importar donde te encuentres. Guarda y agenda los compromisos, cumpleaos, eventos y tendrs todo organizado en nuestra aplicacin.  Caractersticas: * Colores a tus Notas * Agenda tus Eventos * Agrega Fechas * Crea tus Recordatorio * Anota tus Notas * Realiza tus eventos * Escaner de Cdigos   Con Lector QR tendrs una herramienta muy til y fcil para su escaneo, cuenta con un potente lector de Cdigos QR funcional y preciso. De mucha utilidad y de fcil uso, descargarla y espesaras a disfrutar de la mejor herramienta para organizar tus das.  Con Agenda 2020 Gratis podrs crear y guardar y Agendar tus notas importantes. Descarga y disfruta de la mejor herramienta para organizar tus actividades laborales.  !Descarga y disfruta de nuestra app Agenda 2020 Gratis Agenda 2020 Gratis offers you a content where you can keep track of your activities, it gives you the option to add to each of your notes by adding photo or capture, landscapes, from your gallery of your android device, you can choose the color to schedule your notes , appointments events and trips, birthday commitments and all your work that you have done in your Free 2020 Agenda.  Agenda 2020 Free is easier where you can organize your work, Class schedule Holidays, go for a walk, Organize Events to your Notes, Without running the risk of losing your notes, Appointments in your Company or School, you can enjoy easily and easily to use, you just have to download this app and start organizing your tasks, with your personal organizer.  Agenda 2020 Pocket free, which you can use at any time and no matter where you are. Save and schedule the commitments, birthdays, events and you will have everything organized in our application.  Characteristics: * Colors to your Notes * Schedule your Events * Add Dates * Create your Reminder * Write down your Notes * Make your events * Code Scanner   With QR Reader you will have a very useful and easy tool for scanning, it has a powerful functional and accurate QR Code reader. Very useful and easy to use, download it and you will hope to enjoy the best tool to organize your days.  With Agenda 2020 Gratis you can create and save and Schedule your important notes. Download and enjoy the best tool to organize your work activities.  Download and enjoy our free Agenda 2020 app! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.USE_FINGERPRINT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}