{
"name" : "Norton App Lock",
"url" : "https://play.google.com/store/apps/details?id=com.symantec.applock",
"package" : "com.symantec.applock",
"category" : "Tools",
"description" : "Lock your apps and protect your privacy with Norton App Lock. Use a secure password or pattern lock screen to keep your Android device secure and private.   Youve got lots of sensitive information in the apps installed on your phone or tablet device. Many times, even apps that store pictures, personal and financial information, or control remote access to your home dont require a security PIN, password or lock screen pattern to open.  Install Norton App Lock to protect and safeguard your privacy:    Add passcode security to apps that dont have it  Lock one or more app with the same 4-digit PIN pass code  Protect your private data and photos from the prying eyes of intruders  Make sure youre the only one changing your social status or posts  Keep app content private if you share your device with kids or friends to play games or watch videos  Add a layer of security in case your device is lost or stolen  Prevent those embarrassing pocket-dial accidents  Choose the apps you want to lockall, some, or follow our recommendations  The Norton team takes privacy (and performance) seriously. Other applocker, safe lock, applock, folder lock or privacy lock apps can be sidestepped by crafty criminals or may drain your battery, but Norton App Lock leverages special Android permissions to safeguard your sensitive apps. Its more efficient and more secure than some of the other applock offerings.  --------------------------------------------------  NORTON APP LOCK FEATURES & CAPABILITIES    Lock Apps   Choose the apps you want to protect with a privacy lockall, some or follow our recommendations   Custom PIN, Password, or Pattern Lock Screen   Add PIN, password or pattern lock screen security to protect and lock apps that dont have it  Lock one or more app with the same 4-digit PIN or use a unique lock screen pattern password drawn with your finger  Prevent those embarrassing pocket-dial accidents   Protect Sensitive Information   Protect your sensitive, personal, and financial data from the prying eyes of an intruder  Add a layer of security in case your device is lost or stolen   Lock Photo & Video Apps   Protect photos and videos from the prying eyes of an intruder   Lock Social Apps   Make sure youre the only one changing your social status or posts   Parental Controls   Safely keep app content private if you share your device with kids or friends to play games or watch videos   Sneak Peek Anti-Theft   This anti-theft feature takes a photo of a thief or anyone who fails to unlock your phone after 3 attempts  The photos are saved in your Photos folder  --------------------------------------------------  SYSTEM REQUIREMENTS  Android OS 4.1 or later  --------------------------------------------------  PRIVACY POLICY  Symantec respects the privacy of our users and carefully safeguards personal data. For more information: https://www.symantec.com/privacy/  --------------------------------------------------  MOBILE SECURITY & ANTIVIRUS PROTECTION  Be sure to also download Norton Mobile Security antivirus protection to help prevent bad apps from damaging your phone and stealing your information: https://mobilesecurity.norton.com/  This app uses the Device Administrator permission ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_FINE_LOCATION']",
}