{
"name" : "Root Checker",
"url" : "https://play.google.com/store/apps/details?id=com.joeykrim.rootcheck",
"package" : "com.joeykrim.rootcheck",
"category" : "Tools",
"description" : "Verify proper root (superuser or su) access is configured and working using Root Checker! Free, fast, easy, and used on over 50 million Android devices, Root Checker shows the user whether or not root (superuser) access is properly installed and working.  This application provides even the newest Android user with a simple method to check their device for root (administrator, superuser, or su) access. The application provides a very simple user interface that easily notifies the user whether or not they have properly setup root (superuser) access.  *Feel free to email me with any questions. I always reply!*  This application will test the device for root (superuser) access using a very simple, quick, and reliable method that has been successful for over 50 million Android devices. The su binary is the most common binary used on Android devices to grant and manage root (superuser) access. Root Checker will check and verify that the su binary is located in a common standard location on the device. In addition, Root Checker will verify whether the su binary is properly functioning in granting root (superuser) access.  Many times users experience issues along the path of installing, configuring, and gaining root access or uninstalling and removing root access. For some users the process can seem complex while for others the process can seem simple. Regardless of the users technical skill set, Root Checker, will quickly and correctly verify whether or not root access is 100% functioning. The process of confirming root access is sometimes known by other terms such as, gaining superuser access or gaining administrator access. Root Checker covers all these terms as they relate to one core function, being able to execute commands through the su binary with root access.  If the Superuser management applications (SuperSU, Superuser, etc.) are installed and working properly, these applications will prompt the user to accept or deny the root access request from Root Checker. Accepting the request will allow Root Checker to check for and confirm root access. Denying the request will result in Root Checker reporting no root access.  For scenarios when there is concern somebody else might have installed root access on the device, Root Checker can validate whether root access is installed providing more insight and knowledge.  Please dont leave negative feedback about a concern, bug or issue! Instead, please email me, tweet me, contact me on my web site - https://joeykrim.com/contact, IRC, or on the forums (XDA, RootzWiki, SDX, etc.) with your feedback, suggestions and comments! Facebook AdChoices: https://m.facebook.com/ads/ad_choices I do my best to assist as many people as possible and appreciate all the support that has made this application successful! Thank you! ",
"desc_perms" : "['android.permission.ACCESS_COARSE_LOCATION']",
"manifest_perms" : "['com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}