{
"name" : "Device Info 360 - Hardware, SW, Root, Wear Info",
"url" : "https://play.google.com/store/apps/details?id=com.vishtekstudios.deviceinfo",
"package" : "com.vishtekstudios.deviceinfo",
"category" : "Tools",
"description" : "Know everything about your Android mobile/wearable device with Device Info 360. Know all the essential details of your device, view, manage or share apps and check your device for root access.    Features of Device Info 360:  Device Info :   Get all the essential details (HW and SW info) about your phone with Device Info.  Know your phones processor(CPU), RAM, SOC, GPU, storage, network , battery , sensor, real-time RAM/CPU usage and S/W information.   Displays list of all sensors. Search/filter sensors by name.  Supports all the themes with a full night mode.    App Manager :   View and manage all your apps at one place with the App Manager.   View app related info, launch or uninstall apps with an intuitive interface.  Shows app count, installed and last updated date along with the version code.  Share apps with the App Manager.  Search and filter system/user apps through app search.  View app permissions, target SDK, activities, providers, receivers and services.     Root Checker #:   Know whether your device is rooted and check your device for root access.  Verify whether proper root (superuser or su) access is configured and working.  Full root 360 Info - Simple, quick and reliable tool to check root access, root availability, busy box status and root path.    Wearable app - Device Info 360 for Wear :   Has a standalone wearable app for Wear OS by Google.  Compatible with both round and square devices.  Has full crown support for scrolling.  Runs on both Wear OS 1.x and 2.x devices.    Other features :  Has an overview tab that shows real-time CPU and RAM usage  Has a clean, material design  Has 15 themes with a night mode  and an AMOLED theme  Built for everyone - Built for casual & power users, developers and device testers  Optimised to run on a wide range of low end devices with a small download size of 3.5 MB  Device Info 360 is optimised for tablets, Android 10, Android Go and Wear OS.  Device Info 360 is now available for Wear OS by Google.   Device Info 360 reports the following information: Device - Device Model, Manufacturer and Name - Bootloader - Display Size and PPI - Display Resolution and type  - Android Version Name, Code, Board Code - Soc Info  CPU - CPU Hardware (SOC Manufacturer) - Per Core CPU clock speed(Real time) - Number of CPU Cores - CPU Features - CPU Architecture - CPU Variant  RAM - Device RAM - Actual Available RAM - Used/Free RAM - GPU Vendor/Renderer - Vulkan support  Battery - Battery Level - Battery Type - Battery Temp - Power Source  - Battery Status - Battery Voltage - Battery Health - Max Charging Current  Storage - Internal/External storage(total, used & free space)  Network - Network Connection status - Network type - Data type(WIFI/4G/3G/2G) - IP Address  Sensor - No. of sensors - Sensor Vendor, version and int type - Search/Filter sensor by name  Misc - GPS/NFC - Gyroscope - Accelerometer - Barometer - Wear OS info(Android Wear Info)  - Fingerprint scanner - Wi-Fi Direct - Bluetooth LE    Notes : Device Info 360 is a full-fledged device info app with a standalone wearable version for Wear OS.   Requirements: Mobile version: Android Lollipop 5.0(API 21) and up.  Wearable version: Wear OS 1.x based on Marshmallow(API 23) and up.    Device Info 360 is crafted with and passion for Android. Enjoy using Device Info 360.    Follow our social accounts to receive the latest news:  Facebook: https://www.facebook.com/vishtekstudios/  Twitter: https://twitter.com/VishtekStudios  Instagram: https://www.instagram.com/vishtek_studios_in/  Website: https://www.vishtekstudios.com/  Android is a trademark of Google LLC.   2018-2020. Device Info 360 is developed and published by Vishtek Studios LLP. Vishtek Studios LLP is a registered, bootstrapped, self-funded and incorporated LLP. All rights reserved. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REQUEST_DELETE_PACKAGES', 'com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING']",
}