{
"name" : "Tigrinya Keyboard",
"url" : "https://play.google.com/store/apps/details?id=com.tigrinya.keyboard.for.android",
"package" : "com.tigrinya.keyboard.for.android",
"category" : "Tools",
"description" : "Tigrinya Keyboard lets you type in English characters which gets instantly converted to Tigrinya.  Typing with this Tigrinya keyboard is the fastest way to type - you dont need any other Tigrinya input tools. It works inside all applications on your phone - no more copy-paste! Supports 21+ colorful themes with easy settings, this is the trendiest way to type Tigrinya letters on Android, and the easiest Tigrinya typing keyboard!  Chat with your friends and family in your native language - use native Tigrinya text on Whatsapp, Facebook or any other app on your phone like a regular keyboard.  How to start Tigrinya typing using this Tigrinya Keyboard:  1. Open Tigrinya Keyboard from your apps after installing 2. Enable and choose Tigrinya Keyboard as your default keyboard. 3. Customize settings and choose from 21 amazing themes 4. Start typing Tigrinya language everywhere!  Start typing in English and choose Tigrinya word suggestions for what youre typing. Offline support coming soon. Works on Android phones and Android tablets. Simple to use with touch screen Tigrinya text typing from phonetic transliteration using this keyboard.  - Tigrinya keypad, Tigrinya layout and Tigrinya mobile keyboard in all your applications - Easy swith to English or Tigrinya text as you need. Turn off Tigrinya when you dont need by using the language button. - Emojis are supported: hold on the 123 number button and youll get a list of smileys. There are 3 pages from which you can choose what you need from the Tigrinya smiley keyboard.. - Color themes can be changed from the settings page. Look for Tigrinya keyboard in your apps to access this.  No more typing with slow manual keyboards - this is the best Android Tigrinya Transliteration Keyboard that is free, fast, effortless and easy to use.  No personal information or credit card details are collected. We store anonymous statistics may be shared to improve your experience - share your suggestions at apps@clusterdev.com  Please leave great feedback - it helps us keep going! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}