{
"name" : "Hide and Lock - File Hider",
"url" : "https://play.google.com/store/apps/details?id=com.sociosoft.hidefiles",
"package" : "com.sociosoft.hidefiles",
"category" : "Tools",
"description" : "Hide files and folders and lock them with a password. The file hider is powerful, efficient and secure. Hide files now!  All features are enabled without limitations. This is the full version, free!  Features:  Hide files or folders of any type  Full Gallery support. Images are safely hidden from the Gallery without causing damage like other apps.  Instantly restore hidden files or folders  Password lock and protection  Supports hiding pictures, images, photos and videos (all media)  Fast and reliable file and image hider  Hide files from Gallery and other applications  Lightweight  Instantly hides or restores files or images of any size  Filtering, sorting and searching of secret, hidden or restored files  Photo thumbnail support - so you can see which photos you hide or restore  Smooth and clean interface  Heres why Hide and Lock is the expert image and file hider on the market: You can hide folders and files like images, videos, documents, music or any other type. All file types are reliably supported. Hide and Lock is an expert image hider. Experts use it to secretly and securely hide any of your pictures or photos. Theres no waiting time at all. Any file is instantly hidden so you can go on doing whatever you were doing. Its expertly fast! Experts trust the reliability and speed of hide and lock to hide their files in seconds All folders and files can be locked and password protected using a password of your choice. Hide files in secret from anyone you dont want looking at your photos, pictures or documents like experts. Thumbnails expertly show which images, pictures or photos you hide and lock Hides files and folders in secret without limit Expertly hide folders or restore them at the push of a button. It happens in less than a few seconds. All secret files in the folder will also be restored Hide files or restore files as many times as you want, just like the experts Secure and safe techniques are used when hiding media from the Gallery, so your Gallery never gets corrupted. Become a file hide expert and manage all your hidden files quickly and reliably. You dont need to be an Android expert to become a file hide expert!  Please read the help and tips sections. Feel free to contact us via email if you have any questions for our file transfer experts.  Get Hide and Lock and start hiding your files and folders safely, securely and secretly for FREE. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
}