{
"name" : "Reverse Tethering NoRoot Free",
"url" : "https://play.google.com/store/apps/details?id=com.floriandraschbacher.reversetethering.free",
"package" : "com.floriandraschbacher.reversetethering.free",
"category" : "Tools",
"description" : "ReverseTethering NoRoot allows you to share your computers Internet connection with your Android device via a USB cable. Use Android apps that require Internet in places where you dont have or are not allowed to have a wireless Internet connection! Your Android devices Internet connection is slow and unstable? Youve your Android device already connected to your computer for charging, file syncing or app debugging? Why not use your computers fast, stable Internet connection on your Android device?  Important: Some apps do not recognize the reverse tethered Internet connection because they only check for Wifi or 3G connections. This limitation applies to recent versions of Play Store, Youtube, Gmail and others. If you find an app is incompatible with ReverseTethering NoRoot, please dont give my app a bad rating. Its not an issue of my app, but of the other one, so I cannot change anything about the incompatibility. Instead, please contact the author of the third-party app.    Features  Use your computers Internet connection on your Android device  Works with Mac, Windows and Linux  Works on all Android versions starting from 4.0  NO root needed  Easy set-up, no messing around with tons of command lines  Connect multiple Android devices to one computer  The only way to have wired Internet on devices that do not support Ethernet  PRO Version This is the free version that only allows connections of 10 minutes per 30 minutes. If you need longer connections, please upgrade to PRO version: https://play.google.com/store/apps/details?id=com.floriandraschbacher.reversetethering.pro  IMPORTANT: Bugs and problems might cross your way. If something does not work, please do not write bad reviews, but send an email to the support email address listed below or in the app so I actually have a chance to help you or fix the issues. Thanks!   This app requires a free server application to run on your computer that can be downloaded here: http://bit.ly/RevTetServer. The Java Runtime version 1.7 or later is needed on the computer. Depending on your system, device drivers may have to be installed. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.CHECK_LICENSE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.WRITE_SECURE_SETTINGS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_SECURE_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}