{
"name" : "Exam Timer",
"url" : "https://play.google.com/store/apps/details?id=com.create.aozora.examtimer",
"package" : "com.create.aozora.examtimer",
"category" : "Tools",
"description" : "- Summary  Those who control time, control the exam! With this application you will not have to worry about exam time in production!  Control of time is indispensable for good results in the exam.  This application is an application to train with daily examination study so that you can control that time. With this application, the timer function will operate automatically for each question. So it is freed from troublesome operations like start -> stop -> reset as every problem with stop watch etc until now.  Also, since you can set the time for each problem, one problem is to lengthen the time a little, otherwise at the same time ... You can do something like.  Now, lets limit the examination time with this application!  - How to use  (Characters)  Mr. John: A student who wishes to be a famous private university Mr. Smith: Master Nabbus senior who passed the famous national university  John: Well, its almost time to go to the entrance exam, I guess Ill solve the past questions soon. John: In the meantime, will you assume an answer time and solve the problem so that you can finish the production with some margin? Smith: Oh, I have some recommended apps Smith: That is a smartphone application called a exam timer John: How old is that? Smith: An application called a exam timer is an application that a timer automatically sets and operates for each problem John: Then, is not it normal to use a kitchen timer? Smith: If its like a kitchen timer, you can not concentrate on studying because there is a troublesome operation that starts / stops, and you set again. John: Certainly ... Smith: If you use a exam timer at that time, the timer automatically starts up for each problem, so you do not have to do cumbersome operations Smith: Moreover, because I can set fine time for each problem, I can try to make this problem a bit longer John: Well, thats useful, is not it? Smith: Try it once  In addition to the above, this timer will serve as an indication time even for ordinary study.  - About specific application functions   Since multiple tests can be registered, the timer set for each test can be used.  Since history can be saved, you can look back on past answer time.  There is also a paid version (advertisement is not displayed)  Please try using it by all means!  -- If you have any bug reports / comments / requests, please send them from https://www.aozora-create.com/contact . ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.create.aozora.examtimer.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}