{
"name" : "Antivirus - Virus Clean, Applock, Booster, Cooler",
"url" : "https://play.google.com/store/apps/details?id=com.antivirus.applock.cleanbooster",
"package" : "com.antivirus.applock.cleanbooster",
"category" : "Tools",
"description" : "Android is always the place where hackers look to attack and steal your money, data .... Antivirus & Applock apps protect your phone against dangers, virus cleaner booster all in one. The application provides Virus Removal, Cleaner, Speed Up, App Lock fingerprint and Wifi Security. Download Now Free!   Antivirus & Applock is security center will provide comprehensive protection for your phone when it can help you avoid viruses, trojans and malware. Detects all risks, viruses and spyware, dangerous applications to protect your personal information from theft and spam, virus removal for android. Antivirus remover for android, android virus remover and cleaner.   Antivirus Cleaner for Android:   Antivirus & Applock has a real-time protection mechanism that helps protect your phone comprehensively wherever you are, virus cleaner for android. Scan for viruses and malware in all your applications and files in the system, and block and remove viruses and message software after malicious applications are installed. Antivirus for android phones free, antivirus for android, security center antivirus and malware and virus remover.   Lock Private Apps   The application can lock all applications on Android device and protect privacy with PIN lock, Pattern and Fingerprint. Helping you protect your applications are not afraid of others peeking like: Facebook, Virus Remover app, Line, Whatsapp or Wechat ....Lock apps with fingerprint   Speed Up Phone Performance   Clean up memory (RAM) and optimize phone speed, phone booster speed up by eliminating redundant background tasks. One Touch Speed helps speed up your phone by releasing RAM, ram booster speed up your phone and phone optimizer and booster.   Clean Up & Cleaner for Android   Help analyze all log files, temporary files, history files and AD files, then suggest cleaning up useless junk files to help you free up storage space and optimize mobile phone performance Android action. Clean trash junk files caches, junk cleaner for android phone.   Phone Cooling Down   Cooling the whole device: solving CPU, GPU temperature, cooling battery, cpu cooler for android. Monitor temperature in real time, analyze device status, alert as soon as the device is too hot. This function can control & cool down the CPU to help you play games without worry, phone cooler app for android!   Secure Wifi Connection   The application helps protect your wifi network from hacker attacks. Free, fast and compact network management tool for wifi.  Highlight Function of Antivirus & Applock:    Scan junk & free up memory space  Acceleration optimizes phone performance  The smallest set  Antivirus booster and cleaner, virus remover for android and trojan virus remover for android.  Remover virus and hacker free with virus removal app.  Antivirus real time protection free  Antivirus app for android, Virus cleaner for android, anti malware virus remover.  Antivirus and malware removal, virus and malware removal for android  Anti adware for android phones free, anti malware and spyware for android.  Comprehensive real-time phone protection  Save battery and increase battery life.  Overcharging compartment, showing the charging status when charging.  Scan applications, games and files in real time  Memory booster ram optimizer, ram cleaner speed booster  Clean junk file ram cache and virus, clean optimize and boost phone  Applock fingerprint and password, app locker with password of pattern, fingerprint applock..  Cool down phone temperature, cooling phone down, cooling overheating phone.  If you like our antivirus app for android, give us praise , your encouragement is our greatest motivation! Thank you support to !  ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.EXPAND_STATUS_BAR', 'android.permission.GET_TASKS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_FINGERPRINT', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.antivirus.applock.cleanbooster.USAGE_ACCESS_SETTINGS', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.CLEAR_APP_CACHE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.EXPAND_STATUS_BAR', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'com.antivirus.applock.cleanbooster.USAGE_ACCESS_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES']",
}