{
"name" : "RecovMy - Restore Deleted Photos",
"url" : "https://play.google.com/store/apps/details?id=com.lookandfeel.recovmy",
"package" : "com.lookandfeel.recovmy",
"category" : "Tools",
"description" : "RecovMy is a Free Photo Recovery App that helps you to restore deleted photos easily. Our photo recovery algorithm perform a deep scan on your phone storage to retrieve all deleted photos and then give you the ability to restore deleted photos.  If you come to a situation where you deleted all of your photos by mistake, and tried a lot of apps to restore them without any result, then you are at the right place. RecovMy will solve this problem for you. It will scan all your phone storage looking for deleted photos and list them in an easy way that will help you to restore them back to your phone storage.   How it works?  RecovMy scans your device and tries to restore deleted photos from the cache and thumbnails (no root required), this operation may take minutes depend of your device storage.  Operating Steps to restore deleted photos:   Install and Open the RecovMy App.   In the main window of the RecovMy - restore deleted photos app, click the button Start photo scan in Photo Recovery section.   Wait Until the scan finished.   You will found deleted and undeleted photos.   Select the deleted photos that you want to restore, then, click the restore button in the bottom of window.   All selected photos will be restored to the RecovMy_photos Folder in your Gallery App.   Enjoy the best photo recovery app to restore deleted photos.   Your feedback is extremely appreciated and we act on it! Please leave review or email me about this photo recovery app at recovmy.contact@gmail.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.lookandfeel.recovmy.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}