{
"name" : "barcod scanner",
"url" : "https://play.google.com/store/apps/details?id=com.qrcodereader.qrcodescanner",
"package" : "com.qrcodereader.qrcodescanner",
"category" : "Tools",
"description" : "Barcode Scanner application is a powerful barcode scanner, completely free, designed for tablet and phone.  Barcode Scanner app is a small but powerful barcode reader and qrcode scanner and barcode generator app.  Barcode scanner+ which allows you to access instantly valuable information on your smartphone in one single step!  qrcode scanner app offers fast, seamless and incredibly functional reading of any qr code, barcode, matrix code and getting the most vital contact info from anywhere!  For detailed help, please visit https://sites.google.com/view/barcod-scanner-help  FAST AND EFFECTIVE barcode Scanner app to scan code fast and enjoy exclusive deals, coupons, competitions and videos on the go. Make use of the scan qr code feature and access websites and Wi-Fi networks or find the next store around you.  ENDLESS POSSIBILITIES code reader app enables you to get the contact info from anywhere. It can be your new business contact from a networking event, or your possible client or customers you need to impress. Just open the app and add contact details to your address book in no time at all!  GET THE NEEDED INFORMATION You can also scan the qr code of products to know more information about them, scan urls, images, cards and many many more within a few seconds! Simply get the needed information fast and effectively.  FAST DECODER OF ANY BARCODE Our scanning and decoding technology is also integrated in our other successful app Barcode Scanner. Because of that and the extensive quality code used to create QR Code Rader, our app is able to scan and decode any barecode: QR Code, Data Matrix, Aztec, PDF417, 1D Product and many more!  BARCODE SCANNER FEATURES: Why you need to download and install QR Code Reader on your smartphone instead of other QR code scanner apps? Because of the unique features, read more about them bellow:   Smart History:  Powerful search feature to find history item quickly.  We will save all scanned qr codes for you in the history tab. You can easily access to them later anytime and anywhere.  Have many saved content? You can easily use our powerful search tool to find the content that you are looking for.  Even you can sort the history items so that you can find it easily.   Viewfinder color:  We developed a new feature that you will love! Now, you can choose the viewfinder color that you want from the settings tab to make the qr code more visible.  How does it work? Its that easy: just point the camera at the QR Code and our QR Code Reader will immediately display the scanned content! Dont waste any more time typing a web address, contact details or Wi-Fi access passwords on your Smartphone.  So, what are you waiting for? Download QR Code Reader and Scanner and enjoy the best free scanner app ever! Our code reader and code scanner technologies are one of the best and most successful ones! See why we are constantly adored by our active users. Get it free now!  NOTE: We are always striving to provide the best user experience for our users.  We are also looking for your feedback, suggestion or recommendation.  Please, feel free to contact us at barcodescanerreader@gmail.com so we can continue to bring you the best experiences and updates. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.FLASHLIGHT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}