{
"name" : "Namecheap VPN",
"url" : "https://play.google.com/store/apps/details?id=com.namecheap.vpn",
"package" : "com.namecheap.vpn",
"category" : "Tools",
"description" : "Download our VPN software for Android to secure your mobile device today. Get secure, fast connections on up-to-five Android devices, including Galaxy and Pixel.   Introducing Namecheap VPN for Android Phones and Tablets  Namecheaps new VPN service for Android is a secure, ultra-reliable VPN solution for your web privacy. With a VPN, you can stay safe on public Wi-Fi networks, keep your passwords hidden, and stream your favorite shows wherever you travel. Our VPN software for Android operates in over 40 countries.  Secure, Fast and Anonymous Browsing on Galaxy, Pixel, and more 24/7 Namecheap Support  No Logs  Privacy and Security Guaranteed With our VPN for Android Phones and Tablets  Data Encryption We care about your privacy and security. Thats why we provide best available AES 256 encryption on your VPN connection. Your ISP could be monitoring your data, selling it to advertisers, or selectively slowing it down. Our VPN software gives you private internet access for Android, protecting you from targeted and indiscriminate attacks intended to capture your sensitive data.  Practice Safe Wi-Fi On unsecured public Wi-Fi networks, hackers can easily scrape a connection to obtain sensitive information like passwords, email addresses, and search data. A VPN tunnel (the link created with a virtual private network) lets you move undetected when youre away from your home Wi-Fi network.  No Traffic Logs We do not log any user activity (i.e., sites visited, DNS lookups, emails, etc.) For security and troubleshooting purposes, we do, however, monitor and collect errors so that we can improve the stability of the app.  DNS Leak Protection When you connect to a website, the first query goes to a DNS. If your VPN does not support DNS Leak Protection, the question will go over an unsecured channel, leaking information about your activity. Our integrated and secure DNS protects you from such leaks.  Keep your True IP Hidden An IP address can be used to track your location, your browsing habits, even restrict the websites you use if you go abroad. Our VPN software assigns you a unique, random IP address to your Android device, masking your location and, therefore, keeping your real IP address hidden. Weve got servers in over 40 countries worldwide, allowing you to browse freely in other countries.   Safely Unblock Sites & Content Change your virtual location for secure and fast streaming, data transfers, and online gaming.  The Fastest VPN for Android  High-Speed Network Thanks to high-quality servers, we can provide the best VPN for Android - one thats ideal for streaming, transferring data, and online gaming.  75+ Locations and 1000+ Servers We have servers in over 75+ locations, so you can choose where you want to connect.   Unlimited Bandwidth Our VPN for Android is ideal for sharing large files or streaming your favorite content from the Google Play store.  Available On Multiple Devices You can connect with five Apple devices at once with our app including smartphones and tablets such as Samsung Galaxy, Google Pixel, and more. Our VPN is available with other operating systems.  Easy to Set Up Were renowned for our easy setups, and our Android VPN service is no exception. With our 24/7 customer support team, were on hand to answer your questions.  Avoid ISP Throttling Dont let your ISP hold you back. By using a VPN, ISPs that use packet sniffing to restrict your browsing are no longer able to slow you down. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}