{
"name" : "Translate All Language-Voice & Text translator app",
"url" : "https://play.google.com/store/apps/details?id=com.translator.multilanguagetranslate.dictionary.itranslate.voicetranslator",
"package" : "com.translator.multilanguagetranslate.dictionary.itranslate.voicetranslator",
"category" : "Tools",
"description" : "Translate All Language-Voice & Text translator app & learning translator app to translate between multiple languages. No more communication problem or language problem with online language translator app because a translator is also performed voice translates as a free language translator app. You can also translate complete phrases and sentences with an easy language translator app. You can copy, bookmark and share text translate with a social network. Text Translator Text translator app, you can find out what each phrase or word means in a different language with a text translation. International language Translation has an answer to all your language translator needs a lot of conveniences. In case you cannot write, or if you wish another person to speak to you in another language, you can use the voice conversation translator in a smart translator and immediately the spoken words will happen to be readable and translatable as text in voice translator. Voice Translator Translate All Language-Voice & Text translator app has also copy and spoken resulting output. you are looking for the best way to translate free from one language to another, language translator is what you need. Online translate app all language translation to translate between multiple languages. You can easily listen and share text translator with your friends and family on your social networks. Audio to Text translator The online language translator app is the best to text translator very fast in your cell phone or tablet. Audio translator interpret also supports Translator English to Spanish, translator English to French, translator Italian to English, French translator, translator Japanese to English, German translator, translator Russian to English, English to Spanish translator, Italian translator, translator Portuguese to English, translator Italian to English, translator Korean to Tagalog & multi-language translator.  Language Translation Translate All Language-Voice & Text translator app text to speech works in your phone or tablet free translator will be translator free in your pocket. Just like a dictionary, the translator app will help you searching, learning and studying. Simply type or speak the language you want to translate and allow Language Translator to do the rest.  Display and zoom the free translations result in the mobile phone screens, make easier to read and convey messages. Speech Translator supports voice and text translation in many languages. Use a free translator every day for business, travel, and education.  Photo Translator Translate All Language-Voice & Text translator app is a rare and easy picture translator which will screen translate different words from different languages through the picture or live camera translator in multiple languages translation with a camera at all the phrases in distinct languages with image translator. Photo translation document and you dont know what each word means.  Translator A learning translator is perfect to translate texts fast on your phone or tablet. With an online language translator, you wont have communication problems. Free translation app Also Translation Sms, status and your massages from inbox directly with copy and paste. The use of voice translator application is completely free but requires an internet connection (3G, 4G, and Wi-Fi) to connect to the translation server.  Translate All Language-Voice & Text translator app Feature. Text Translator for all  Free Language Translation International language translator Text translation & speech translation Translator for all international languages You can translate languages with your voice Best Language translator app with a voice translator Translate and copy the text where ever you want to paste it Live Camera Translator, Photo Translator is available for free ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION']",
}