{
"name" : "ANT VPN x Free & Unlimited Proxy App for Android",
"url" : "https://play.google.com/store/apps/details?id=com.ant.vpn",
"package" : "com.ant.vpn",
"category" : "Tools",
"description" : "Free VPN for Android, which provides access to proxy servers around the world with turbo speed. Use our VPN app for free without any restrictions. You dont need to run the VPN connection master. Just click one button & you will be quickly, safely & anonymously connected to the Internet.   BENEFITS OF ANT VPN     FREE PROXY SERVERS Proxy Servers around the world are available for you: Poland, Canada, Latvia, Russia, France, Bulgaria, Germany, Netherlands, USA, UK, Ukraine, Italy. You can connect to any proxy server absolutely free!   UNLIMITED VPN You can use our VPN application without time limit. We dont limit the speed and volume of traffic. All server resources are evenly distributed between users connected to it.   ACCESS TO BLOCKED SITES Connect to any proxy server and get access to sites and resources blocked in your country.    ALWAYS ONLINE With our VPN app you will always be online. Telegram, WhatsApp, Facebook, Twitter, YouTube, LinkedIn etc.All these apps work perfectly through our servers and our VPN application.   WORK WITH ANY BROWSERS Use Google Chrome, Firefox or Opera browser. Our VPN works stably with all mobile browsers. Turn on the traffic saver mode on your device and you will make your Internet connection faster.   SECURE & ENCRYPTED CONNECTION Protect your personal data and billing information in public networks. All connections to our proxy servers are securely encrypted and protected.   ANONYMOUS VPN We do not store user activity logs on servers. You can visit any sites and download any content online anonymously. When you are connected to our VPN, no one can track your actions on the Internet.   DIFFERENT CONNECTION PROTOCOLS On devices with Android 5.0+, different server connection protocols can be used (TCP & UDP). A unique list of proxy servers for our VPN application is available for each protocol. This makes it possible to connect to a faster and less busy server.   APPLICATION FILTER On devices with Android 5.0+ you can select one or more applications for which a VPN connection will be created. If you want to use a browser Opera & VPN to access a blocked site, select the browser Opera in filter application and the VPN connection will be created only for this browser. Thus, you will not load the communication channel with our server with unnecessary data from other apps and get a stable and turbo VPN connection.   GENERAL RECOMMENDATIONS   Use the application filter (for Android 5.0+)  Use different connection protocols (for Android 5.0+)  Connect to servers from different countries  Turn on traffic saver mode on your device   ATTENTION  Our VPN application is absolutely FREE. We show ads to support the operation of servers and application. We are constantly looking for new providers to expand the geography of our servers. Unfortunately, not all providers fit our criteria. Please treat our work with respect and understanding!  We hope that our application will really help you, and you will answer us with a good rating and feedback so that we can further improve and develop our application! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}