{
"name" : "Nexus TruID",
"url" : "https://play.google.com/store/apps/details?id=com.portwise.mid.clients.android",
"package" : "com.portwise.mid.clients.android",
"category" : "Tools",
"description" : "TruID is a client application that generates One-Time Passwords (OTP). OTPs are used to provide secure identification for an organizations mission-critical systems, such as sale and e-mail systems.  TruID supports multiple profiles. Each profile can be set in challenge or synchronized mode. When run in synchronized mode, the OTP is generated after the user enters the PIN. In challenge mode the user has to enter a challenge, in addition to the PIN, to generate the OTP. The challenge is generated and provided by the TruID server.  TruID requires that your organization/provider runs PortWise Authentication Server. PortWise Authentication Server supports the radius protocol. PortWise Authentication Server also provides web service api:s to enable integration with any application that needs strong authentication to authenticate users.  On-line activation: When activating your account using a one-time activation key, the key is generated by the PortWise Authentication Server. The activation key and url is sent to the user via email or SMS. To activate your TruID client on-line, simply click on the url in your device and follow the instructions.  Manual activation: When activating your account a seed value will be generated on the PortWise Authentication Server. The seed value needs to be entered in the TruID client for the profile to be activated. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}