{
"name" : "Configurator for Kodi - Complete Kodi Setup Wizard",
"url" : "https://play.google.com/store/apps/details?id=com.setup.configurator",
"package" : "com.setup.configurator",
"category" : "Tools",
"description" : "CONFIGURATOR FOR KODI OFFICIAL  Fully setup your Kodi android in one click with configurator for Kodi. Backup and restore to safeguard your Kodi against the unexpected. Top Kodi addons and build charts so you know what is in and whats not..  Take a look at some of our app features below:  Switch between multiple Kodi builds on your device easy... Enjoying the best of both worlds is a click away. Configurator for Kodi is feature packed with every possible tool you will need to enjoy the best media player  Here is a List of Features:  Backup Kodi Media Player Restore Kodi android Automatically Setup Kodi Force Close Kodi Change Kodi boot Screen Best Kodi Tutorials Automatically Update Kodi builds Install Kodi builds from url Easy Install Kodi Addons Uninstall/Remove addons in Kodi Install Multiple builds on a single device and switch between builds Screen cast your Kodi Rest Kodi to default/Factory reset Kodi Media Player Clear Kodi cache Kodi buffering fixes Kodi versions download guide Remote control for Kodi Auto boot Kodi feature when device restarts More features coming soon....  **About Kodi and How it works** Kodi is a popular media center that when combined with add-ons allows for streaming all kinds of content such as TV shows and movies.   In the past Kodi was confined to a media center box such as a dedicated computer. Now Kodi can be installed on an android phone, TV, TV box or tablet, and play the same media anywhere bandwidth is available to stream content.  Kodi 18 Leia is the newest version to be released and has some major updated and interface changes.  Kodi 18 should install on any android smartphone or tablet that has at least Android 5.0 Lollipop or higher installed. If your android version is below 5.0, you may have to use an old version of Kodi.  First we need to install Kodi then we need to install a program called an Add-on to stream the content. You can install Kodi from Google Play Store and this app (Configurator for Kodi) is the easiest way for you to install your addons or Kodi builds   Be sure to be connected to a WiFi signal unless you have a unlimited data plan as streaming movies uses a lot of bandwidth and data. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.setting.permission.ALLSHARE_CAST_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.setting.permission.ALLSHARE_CAST_SERVICE']",
}