{
"name" : "Smart Light",
"url" : "https://play.google.com/store/apps/details?id=com.itamazons.smartlight",
"package" : "com.itamazons.smartlight",
"category" : "Tools",
"description" : "Get the bestFlashlight Appfor your Android phone that you ever need to make your fun wonderful.  Smart Light is anon and off flashapp that you could use anytime on your device. If you are a party lover and planning to attain the weekend party then you are in the right place. This app could act like a booster for any kind of your celebration like birthday, anniversary or late night party. It is because this app enables you to play the music or speak on the microphone while blinking thebacklightnext to your rear camera of the device.  Using this application is quite simple because it works on tap and uses the concept. Open the application after successful installation and tap your finger on an icon as per your needs. Check out more attributes about thisflashlight apphere.  Key Features:   On and off switch: Just tap on the On and Off buttons to blink the flashlight or switch off the same.  Set the level: You could adjust the strobes of light on 0 to 9 scales. As you will scroll from left to right, the blinking level will increase.  Mic: Amplify your voice with the blinking of the torch of your device. The up and down waves will show you the frequency of your pitch.  Play the music: With this feature, you could easily play your device songs along with blinking of the backlight. Just tap on the flashlight icon and it is done.  User-friendly: The app is rich in high-quality UI and graphics.   Merits of using this application:   With thisFlashlight torch light app, you can easily read the book at night without consuming the electricity.  This application could layout your party with lustre look  On the roadside, it is now easy to make yourself visible  Simple to use  Use this app during your singing session  Discover your belongings in the dark  During a power cut off  Useful for mechanics while repairing the vehicle   Most of the android devices have an inbuilt torch in their smartphones but this application is made to use the torch with some fun. It is easy to experience the backlight blinking effect with music.  Download Smart Light to avail the great flashlight blinking effect on your android device. Enjoy the flashlight effect with music or with your voice at any time or anywhere. It simplifies everything. Last but not the least, we welcome your feedbacks in order to add-on more features and improvements.   ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.FLASHLIGHT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.REORDER_TASKS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}