{
"name" : "Smart Night Clock",
"url" : "https://play.google.com/store/apps/details?id=com.night.clock.nightclock.live.wallpaper.day.night.analog.digitalclock",
"package" : "com.night.clock.nightclock.live.wallpaper.day.night.analog.digitalclock",
"category" : "Tools",
"description" : "Smart night clock -Set alarm: Super night clock is also as Advance night clock like mobile phone watch and also set alarm. See Mobile clock time with smart night watch. Advance Night watch has best clock live wallpaper. Set live clock wallpapers and clock widget for android phone. Simple Alarm Clock Free turns your android into a beautiful digital clock and alarm clock for free. Alarm Clock turns your android devices into an alarm clock that brings you pure alarm experience to you by combining powerful and customization features and clean interface.  You can set your time in different time format, choose from 12/24-time format. Its a matter of personal preference, which time format you are comfortable with. Adjust night clock nightstand alarm clock with different time format. The digital led clock makes the application more vibrant and useful.  Digital clock: Digital clock widget is a home screen digital time and date widget for Android. It looks just like the one on the phone unlock screen. Make your phone screen look fabulous with this stylish digital clock for Android. Digital Clock LED Classic is a new style digital clock for your screen. This is free and highly customized live wallpaper. Decorate your phone screen with digital time and date clock and be proud of having the best-looking home screen.  Best Analog clock 2019: Analog Night Clock - Live Wallpaper is simple clock with attractive and modern HD designs of Analog Clock Designs. Analog Night Clock app can also be used as a night clock a free night clock app to get customized clock with multiple styles and advanced features.  You can use night clock as live wallpaper, lock screen, home screen for android. It supports all android mobiles devices. World clock feature helps to get the time of any country from all over the world at any time.  World clock and timer clock: Keep track of the current local time in many cities around the world. A team of professional researchers continuously updated the information displayed in the smart night app. Also includes alerts and widgets. A large clear digital timer and stopwatch function ideal for all your timing needs from the kitchen to timing sports events. Smart night clock Screen saver   We are providing all kinds of beautiful themes and screen saver for you to choose. We design all kinds of stylish themes of digital alarm clock for you. Its suitable for all the people no matter youre cool or you like simple. We can satisfy you all with our beautiful themes.   You can change night clock wallpaper it with just one click. This free app offers you beautiful HD clock wallpapers displaying real time free of charge are the latest backgrounds that you must install it.  Features of smart night clock:- I. Many smart nights watch dials to select as night clock background. II. Several advance night clock live wallpapers backgrounds to select. III. Match night clock dials and matching night watch wallpapers. IV. Get a unique new experience of the night clock and night watch wallpapers. V. Very LITE in size and low on memory size background clock and live wallpaper app. VI. Make unlimited combinations of smart night clock with advance night clock. VII. Share the new mobile background experience with friends and family. VIII. Fast and effective application on all android devices IX. Night clock wallpaper app is free app and HD wallpaper quality X. Resize your clock as per you need for your home screen  Disclaimer: This is a Night clock app having different Analog and Digital Clock Designs to set as live wallpapers. Here we disclose that we have used a digital font which is free licensed for commercial use named as Lets Go Digital by WLM Fonts. It is free downloaded form https://www.fontsc.com/font/lets-go-digital. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.vibrate', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.alarm.permission.SET_ALARM', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.SET_WALLPAPER', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.SET_WALLPAPER', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}