{
"name" : "Sunny Portal",
"url" : "https://play.google.com/store/apps/details?id=com.sunnyportal.ui",
"package" : "com.sunnyportal.ui",
"category" : "Tools",
"description" : "Easy mobile access to the largest online portal for monitoring, managing and presenting PV systems is now available for smartphones with the free Sunny Portal App.  No matter what size your PV system might have, whether small residential systems or large PV farms: Sunny Portal gives you access to your PV systems right on your smartphone. PV system operators, installers and service personnel can then access the most important data they require from any location. This saves time and money.  Visualization and Control   The window to SMA Smart Home. PV system operators can use the Sunny Portal to perform a range of visualization and control tasks anytime, anywhere. The mobile online portal not only provides clear information about all relevant electrical energy flows but also offers a user-friendly platform for various control tasks  from basic system settings to activation of specific domestic appliances through SMA radio-controlled socket. Thus, you will not only benefit from the visualization of total consumption, self-consumption, purchased electricity and grid feed-in as well as PV power generation and the self-consumption quota, but also for the first time from integrated PV generation forecast and the resulting recommended actions. Furthermore, a variable system password protects the whole system against unauthorized access.   Standard functions:   Plant Selection  The existing user data is used for accessing the plants, no matter where you are. A demo account is available in case you want to see for yourself how the online plant monitoring works and in case you do not have any Sunny Portal account yet.  Energy and Power  How high was the energy harvest today or in the last month? Accessing yield data is now easier than ever.  System Log for Ensuring Yields  You can access the event history of the system with user or admin rights. This keeps you well-informed wherever you are. For example: In the case the plant detects a blackout you can contact the plant operator with a few fingertips via telephone. You can then verify if this is only a fuse that blew or if you need to organize that the service personnel has a look at the situation on the site.  Plant Description  All important data is visible at a single glance. The plant can be easily presented anywhere you want. And by the way: Sunny Portal can be used in order to define new users, so friends or shareholders can see the plant performance at any time. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}