{
"name" : "Simples Controle Remoto Oi TV",
"url" : "https://play.google.com/store/apps/details?id=com.bragasil.josemauricio.controleremotooitv",
"package" : "com.bragasil.josemauricio.controleremotooitv",
"category" : "Tools",
"description" : "Simples Controle Remoto OiTV Consideraes gerais:   Com o Simples Controle Remoto OiTV voc pode controlar alm de seu receptor Oi TV, sua TV, DVD, Home Theater, BD e muito mais.  Requisitos:    ************ATENO********* ESTE APP S FUNCIONA EM SMARTPHONES COM INFRAVERMELHO (IR)   * Alguns dispositivos com infravermelho podem no ser compatveis com este aplicativo.  Controla Receptores Marcas: Sky, Directv, Tivo, AZbox, AZamerica, Duosat, Motorola, Xfinity, Samsung, Insignia, Sony, Philips, Philco, Technicolor, Comcast, Arris, Airtel, Changhong, Cisco, DigitalBox, Echostar Europe (claro, oi, vivo), Elsys (oiTV), Google, Huewei, My Sky, Net Digital, Pace, Realiance, Skybox, Sun Direct, Zinwell, etc.  * Para Sky tente as seguintes marcas: Sky ou Directv  * Para Oi TV: Elsys, Echostar Europe, Technicolor.  * Para Claro, Vivo: Echostar Europe   LISTA DE DISPOSITIVOS COMPATVEIS:  HTC One (M7) HTC One Max LG G2 LG G Flex LG G Pro Lite LG Spirit H LG Optimus F6 LG Optimus G Pro LG Optimus L9 II Samsung Galaxy Note 3 Samsung Galaxy S4 Samsung Galaxy S4 Mini Samsung Galaxy S4 Active Samsung Galaxy Mega Samsung Galaxy J ZTE Nubia Z5S HTC One (M8) Huawei Honor 6 Huawei Honor 6 Plus LG G Pro 2 LG G2 Mini LG G3 LG G3 S (Vigor) LG L90 LG G Vista LG Volt Samsung ATIV SE Samsung Galaxy Note 3 Neo Samsung Galaxy Note 4 Samsung Galaxy Note Edge Samsung Galaxy S5 Samsung Galaxy S5 Active Samsung Galaxy S5 Duos Samsung Galaxy S5 Mini Samsung Galaxy S5 Duos Samsung Galaxy S6 Samsung Galaxy S6 Edge Xiaomi Mi 4 ZTE Grand Memo II LTE ZTE Grand X Max ZTE Nubia X6 ZTE Nubia Z7 ZTE Nubia Z7 Max HTC One (M9) HTC One M9+ Huawei Honor 7 LG G Flex 2 LG G4 LG V10 Medion P10341 (ALDI) Oppo Mirror 5 Oppo Mirror 5s Samsung Galaxy S6 Samsung Galaxy S6 Active Xiaomi Redmi Note 2 Xiaomi Redmi Note 2 Prime ZTE Grand X Max+ ZTE Nubia Z9 Xiaomi Mi 4C Gionee Marathon M5 Xiaomi Redmi Note 3 Xiaomi Redmi 3 Letv Le 1s Letv LeMax Lenovo Vibe X3 Panasonic P55 Novo Huawei Honor 8 LG G5 Ulefone Power Ulefone Vienna Xiaomi Mi 5 Xiaomi Mi 4s Xiaomi Mi 3s Prime Xiaomi Redmi Note 3 Pro Xiaomi Redmi Note 4 Xiaomi Max LeTV le 1s Letv le Max Huawei P9 Plus LeEco Le 2 LeEco Le 2 Pro LeEco Le Max 2 Lenovo Vibe X3 LG V20 Motorola Moto X Force Asus Zenfone 3 Simple OiTV Remote Control General considerations:   With the Simple OiTV Remote Control you can control in addition to your Oi TV receiver, your TV, DVD, Home Theater, BD and more.  Requirements:    ************ ATTENTION ********* THIS APP ONLY WORKS ON SMARTPHONES WITH INFRARED (IR)   * Some infrared devices may not be compatible with this application.   Controls Receivers Brands: Sky, Directv, Tivo, AZbox, AZamerica, Duosat, Motorola, Xfinity, Samsung, Insignia, Sony, Philips, Philco, Technicolor, Comcast, Arris, Airtel, Changhong, Cisco, DigitalBox , Echostar Europe (of course, hi, live), Elsys (hiTV), Google, Huewei, My Sky, Net Digital, Pace, Realiance, Skybox, Sun Direct, Zinwell, etc.  * For Sky try the following brands: Sky or Directv   * For Oi TV: Elsys, Echostar Europe, Technicolor.   * To Claro, Vivo: Echostar Europe    LIST OF COMPATIBLE DEVICES:   HTC One (M7) HTC One Max LG G2 LG G Flex LG G Pro Lite LG Spirit H LG Optimus F6 LG Optimus G Pro LG Optimus L9 II Samsung Galaxy Note 3 Samsung Galaxy S4 Samsung Galaxy S4 Mini Samsung Galaxy S4 Active Samsung Galaxy Mega Samsung Galaxy J ZTE Nubia Z5S HTC One (M8) Huawei Honor 6 Huawei Honor 6 Plus LG G Pro 2 LG G2 Mini LG G3 LG G3 S (Vigor) LG L90 LG G Vista LG Volt Samsung ATIV SE Samsung Galaxy Note 3 Neo Samsung Galaxy Note 4 Samsung Galaxy Note Edge Samsung Galaxy S5 Samsung Galaxy S5 Active Samsung Galaxy S5 Duos Samsung Galaxy S5 Mini Samsung Galaxy S5 Duos Samsung Galaxy S6 Samsung Galaxy S6 Edge Xiaomi Mi 4 ZTE Grand Memo II LTE ZTE Grand X Max ZTE Nubia X6 ZTE Nubia Z7 ZTE Nubia Z7 Max HTC One (M9) HTC One M9 + Huawei Honor 7 LG G Flex 2 LG G4 LG V10 Medion P10341 (ALDI) Oppo Mirror 5 Oppo Mirror 5s Samsung Galaxy S6 Samsung Galaxy S6 Active Xiaomi Redmi Note 2 Xiaomi Redmi Note 2 Prime ZTE Grand X Max + ZTE Nubia Z9 Xiaomi Mi 4C Gionee Marathon M5 Xiaomi Redmi Note 3 Xiaomi Redmi 3 Letv Le 1s Letv LeMax Lenovo Vibe X3 Panasonic P55 New Huawei Honor 8 LG G5 Ulefone Power Ulefone Vienna Xiaomi Mi 5 Xiaomi Mi 4s Xiaomi Mi 3s Prime Xiaomi Redmi Note 3 Pro Xiaomi Redmi Note 4 Xiaomi Max LeTV le 1s Letv le Max Huawei P9 Plus LeEco Le 2 LeEco Le 2 Pro LeEco Le Max 2 Lenovo Vibe X3 LG V20 Motorola Moto X Force Asus Zenfone 3 ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.TRANSMIT_IR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.TRANSMIT_IR', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.TRANSMIT_IR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}