{
"name" : "Party Dance Lights Music & Flash Disco LED Light",
"url" : "https://play.google.com/store/apps/details?id=com.prodatadoctor.PartyLightsMusicFlashLEDEffectsMaker",
"package" : "com.prodatadoctor.PartyLightsMusicFlashLEDEffectsMaker",
"category" : "Tools",
"description" : "This free Android App allows you to double the enjoyment of Dance party and to have more fun with Dance Party Flash Lights with Music and LED Disco spot Light Effects. Party Lights Effects App offers you a great way to have fun with your family and friends with Dancing lights Effect with different music.  This app allows you to have fun with Disco Lightning with different categories like Dancing girl couple teddy bear and monkey with variety of color background effects. With this app you can easily select your favorite track from the phone library and play with different dancing character and you can change dancing character background according to your choice. Musical Flash Lights Effects App has variety of background categories like Disco light color background disco floor splash and No light.   Features: * App offers a simple way to Browse songs from phone library and play your favorite track with different dancing characters. * App has different dancing characters like dancing girl dancing boy couple teddy bear and monkey to dance on your favorite song. * You can choose the different background categories like Disco lights color background disco floor splash No light. * You can also use your phone flash light for any specific purpose. * You can simply make your mood and have fun with variety of different songs and dancing characters ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.FLASHLIGHT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}