{
"name" : "ESP Matrix - a DIY LaMetric",
"url" : "https://play.google.com/store/apps/details?id=com.bluino.espmatrix",
"package" : "com.bluino.espmatrix",
"category" : "Tools",
"description" : "ESP Matrix device is a WiFi capable smart clock & smart notification (inspired by LaMetric Time) consisting of an 8x64 LED MATRIX and ESP8266 as main controller. (Cost without case ~15$). The case comes from the 3D printer. It shows the time, weather, 5 reminder/own texts, calendar, news, advice, Bitcoin rate, instructables counter and youtube counter. Game of Life, virtual Pet and much more.  It runs completely autonomously and be configured and controlled via an ESP Matrix app, with this application you can create Smart Clock & Smart Notification based IoT ESP8266, configure and setting ESP Matrix device very easy just using this app with a simple interface.  ESP Matrix device features: - Display Clock with a beautiful animation icon - Display Reminder-1  - Display multiple Reminder-2 to Reminder-5 (Pro Version) - Display Calendar (Pro Version) - Display Hijri Calendar (Pro Version) - Display Muslim Prayer times - Display Weather information, source: openweathermap.org (Pro Version) - Display News, source: newsapi.org (Pro Version) - Display Advice, source: adviceslip.com (Pro Version) - Display Bitcoin rate, source: coindesk.com (Pro Version) - Display Instructables Followers & Views, source: instructables.com (Pro Version) - Display Twitter Followers counter, source: twitter.com  - Display Twitter Facebook Page Like counter, source: facebook.com (Pro Version) - Display Twitter Instagram counter, source: instagram.com (Pro Version) - Display Youtube Subscribers (realtime) & Views (source: youtube.com) - Able to configure Brightness display - Able to configure scroll text speed  App features: - Upload firmware directly from your Android phone to ESP Matrix - Set WiFi connectivity of ESP Matrix devices through the app - Configure ESP Matrix device through an simple interface  Tutorial to make hardware ESP Matrix: https://www.hackster.io/mansurkamsur/esp-matrix-iot-smart-clock-dot-matrix-use-esp8266-e770fa  Note:  * Required permission to access devices Location for WiFi discovery (not for GPS location) * If you get problem when upload firmware from Android to Wemos/NodeMcu you can upload firmware use Laptop/PC, download firmware here: https://github.com/bluino/ESPMatrix_firmware ",
"desc_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}