{
"name" : "Multi Calculator",
"url" : "https://play.google.com/store/apps/details?id=com.jee.calc",
"package" : "com.jee.calc",
"category" : "Tools",
"description" : "Multi Calculator is the best application of mathematical and financial calculation that contains several useful calculators and converters.  Try these powerful computing capabilities and intuitive and elegant application designed. You can use Multi Calculator on Wear OS.  List of calculators are included:   Standard Calculator  Keeps the function of a pocket calculator and adds parentheses and some math operators.  Remembers the last calculation condition and checks the calculation history records any time you want.  Use the calculator on your home screen   Currency Converter  Provides real-time currency exchange rates  Once the currency exchange rates are updated, you can use the currency converter in the offline.   Interest Calculator  Provides various options for calculating interest: Installment savings, Regular savings, Simple Interest, Compound Interest, etc.  Enhanced compound interest calculations. Monthly, Quarterly, Half-Yearly and Yearly are available.  If you wonder how to gather 100 million dollar in 5 years, try the future value function.   Anniversary Calculator  Keep track of your anniversaries - with a photo!  View as D-Day or Day count  Add photo widgets on your home screen   Discount Calculator  Calculate Discount price / Discount %  Calculate with Additional discount   Loan Calculator  Supports Level payment / Fixed principal payment / Balloon payment  Set interest only period  Calculate any type of loan such as Mortgage, Auto loan.   Unit Converter  Supports Length, Area, Weight, Volume, Temperature, Time, Speed, Pressure, Force, Work, Angle, Data and Fuel   Health Calculator  Use Health Calculator for your healthy body  Calculate BMI(Body Mass Index), BFP(Body Fat Percentage) and Ideal Weight in one screen  Easy to switch between metric and imperial systems   Tip Calculator  Calculate tip and split the bill  Separate your bill from Sales Tax and calculate tip   VAT Calculator  Calculate VAT easy and fast   Fuel economy Calculator  You can calculate Fuel economy, Distance, Expected fuel amount & cost   Shopping Calculator  Make a shopping list and calculate them right away while you are shopping.   Size Converter  Helps you to convert clothing / shoe / pants / shirt / bra / hat / ring sizes for most countries  Dont forget your size with memos   Time Calculator  Helps you to calculate time in Year / Week / Day / Hour / Minute / Second. (2 hours 5 minutes + 79 minutes = ?)   Unit Price Calculator  Helps to get the unit price from the price and the quantity  Also you can compare unit prices   Number Converter  Provides conversion between binary, octal, decimal and hexadecimal  Purchasing the premium version, you get an ad-free and support us to make better apps.   If you encounter any problem with this App or incorrect wording, please contact us via: - https://www.facebook.com/MultiCalculator - jeedoridori@gmail.com ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.INTERNET']",
}