{
"name" : "Language Translator Free App",
"url" : "https://play.google.com/store/apps/details?id=com.languagetranslator.all.language.translation",
"package" : "com.languagetranslator.all.language.translation",
"category" : "Tools",
"description" : "When we need All language translator. For example, if you want to go to another country and dont have any idea about that country language, or you want to translate the documents from those languages which you have no idea then you needs this world best language translator android app for free. This application perfectly translates your text and speech very fast this online language translation app gives you many of the conversion languages. This application is perfect to translate texts fast in your phone or tablet. With this online translator you wont have communication problems. Language translator online is help you to translate any of the language that you want with one click and also language translator language translator download for free app for your android phones. It is happened many of the time we go abroad for tourism and we don`t know the local language than this Language translator help you to communicate with the local peoples, even if you don`t want to type just speech to text with one click.  LIST OF TRANSLATION LANGUAGES:   Afrikaans Language Translator  Albanian Language Translator  Arabic Language Translator  Azerbaijani Language Translator  Basque Language Translator  Bengali Language Translator  Belorussian Language Translator  Bulgarian Language Translator  Catalan Language Translator  Chinese Simplified Language Translator  Chinese Traditional Language Translator  Croatian Language Translator  Czech Language Translator  Danish Language Translator  Dutch Language Translator  English Language Translator  Esperanto Language Translator  Estonian Language Translator  Filipino Language Translator  Finnish Language Translator  French Language Translator  Gallic Language Translator  Georgian Language Translator  German Language Translator  Greek Language Translator  Gujarati Language Translator  Haitian Creole Language Translator  Hebrew Language Translator  Hindi Language Translator  Hungarian Language Translator  Icelandic Language Translator  Indonesian Language Translator  Irish Language Translator  Italian Language Translator  Japanese Language Translator  Kannada Language Translator  Korean Language Translator  Latin Language Translator  Latvian Language Translator  Lithuanian Language Translator  Macedonian Language Translator  Malay Language Translator  Maltese Language Translator  Norwegian Language Translator  Persian Language Translator  Polish Language Translator  Portuguese Language Translator  Romanian Language Translator,  Russian Language Translator   Serbian Language Translator   Slovak Language Translator   Slovenian Language Translator   Spanish Language Translator   Swahili Language Translator  Swedish Language Translator   Tamil Language Translator   Telugu Language Translator   Thai Language Translator   Turkish Language Translator   Ukrainian Language Translator  Urdu Language Translator   Vietnamese Language Translator   Welsh Language Translator  Xhosa Language Translator   Yiddish Language Translator   Yoruba Language Translator   Zulu Language Translator   Kyrgyzstan Language Translator   Lao Language Translator   Luxembourgian Language Translator  Features:  * Simple attractive and stylish interface * Best Language translator app with voice translation. * International language translator * Free android apps no need credit card information * Text translation * Speech To text * Language learning free * Translator all language * Voice search * Translate your voice * Translator with speech * Translator for all * Paste text from your clipboard * Translator with one click * Translator for all international language simple android apps * Free language Translation * You can translate languages with your voice * Translate and copy the text where ever you want to paste it. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}