{
"name" : "Army Knife for Android",
"url" : "https://play.google.com/store/apps/details?id=com.digital_and_dreams.android.android_army_knife",
"package" : "com.digital_and_dreams.android.android_army_knife",
"category" : "Tools",
"description" : "This app contains a set of tiny tools: a unit converter, a compass (magnetometer required), a bubble level, a calculator, a stop watch, a timer, a magnifying glass, a mirror (front camera required), a ruler and a flashlight (app and widget).  Essentially its like an Army Knife Android app.  Each tool does what it is supposed to do. Theres no space for special effects like 3d compass, talking level, psychedelic flashlight etc: the goal is to have a lightweight, fast and easy to use set of tools, one tap away from your home screen.  This app is the size of a common standalone tool like a compass, a flashlight or a magnifying glass. This way youll save a lot of disk space. Youll save network consumption too, not only for the first download but for every update too. It doesnt require network access, the permission to write on your flash memory or the permission to read your contacts. If you find a bug, please contact us using the Report a bug main menu function.  Note:  - Depending on the hardware capabilities of your smartphone, some tools may not be present  - The permission to use the camera is required in order to turn on the camera flash LED. Some smartphones (for instance the Google Nexus S) dont light the flash LED if the camera is not running. If you check the most popular flashlight apps, youll find out that they all require this permission. Android Army Knife doesnt shot any photos, doesnt save multimedia info onto the flash card and doesnt send anything on the internet: it doesnt require the network permission at all.  - This app was first released on may 2011 and since then is free and without banners!. The Android robot is reproduced or modified from work created and shared by Google and used according to terms described in the Creative Commons 3.0 Attribution License. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.FLASHLIGHT', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}