{
"name" : "Tuner4TRONIC Field: NFC programming of LED drivers",
"url" : "https://play.google.com/store/apps/details?id=com.osram.t4tfield",
"package" : "com.osram.t4tfield",
"category" : "Tools",
"description" : "Important note: This app is part of a system and provides no functionality as a stand-alone. To be able to work with this app, you need a compatible OSRAM OT LED driver with NFC interface. Contact your local OSRAM sales representative for more information.  The installation and maintenance of indoor and outdoor luminaires with OSRAM NFC technology is as easy as it gets  thanks to the Tuner4TRONIC Field app.   The Tuner4TRONIC Field app can be used for programming compatible OSRAM NFC LED drivers in the Field via NFC (Near-Field Communication)  wirelessly and without mains voltage. In most cases, it is possible to readout the drivers configuration even after the devices failure. With the Tuner4TRONIC Field app, certain luminaire settings can be easily adjusted according to the specific needs and within a predefined range set by the luminaire manufacturer. For indoor and outdoor applications, a typical example is the adjustment of the light output depending on the required application. Using outdoor drivers, the dimming levels can be changed in order to optimize energy savings and you can also disable the dimming functionality for special applications such as roundabouts or pedestrian crossings. In addition, using the copy and-paste function of the app, the settings of the original luminaire (indoor and outdoor) can be easily transferred to the new one in a matter of seconds making the luminaire replacement more efficient than ever before.  The following features are provided by the T4T-Field app: - Adjust the light output in percentage, lumens and milliamperes - Adjust the automatic dimming levels, toggle dimming on/off (outdoor drivers only)* - Copy and paste configurations from one LED driver to another* - Load LED driver configurations from e-mails* - Show a report of an LED drivers configuration and send it via e-mail as a CSV file - Supported languages: English, French, German, Italian, Spanish *Paid features (a premium package needs to be purchased)  The user manual of this app can be downloaded as a PDF from the following link:  https://media.osram.info/im/img/osram-dam-4671218//osram-dam-4671218_User_manual_-_App_Guide_-_Tuner4TRONIC_Field_App.pdf  The tech support is available at T4Tsupport@osram.com  NOTE:  When reading a report of a driver, T4T Field saves the report automatically as a csv file in your downloads folder. Therfor, the first time you read out a report, your phone will ask you for permissions to access your data folder. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.NFC', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.NFC', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}