{
"name" : "WolOn - Wake on LAN",
"url" : "https://play.google.com/store/apps/details?id=com.bitklog.wolon",
"package" : "com.bitklog.wolon",
"category" : "Tools",
"description" : "Use WolOn to turn on or wake your computer from your home network (Wake on LAN) or over the Internet (Wake on WAN).   Features   Turn on or wake your computer from your home network using Wake on LAN  Turn on or wake your computer over the Internet using Wake on WAN  SecureOn support  Send WOL packet through VPN connection  Tasker integration. Use Tasker app to trigger automatic WOL actions (donation goodie)  Device monitor and automatic WOL send when device is unreachable (donation goodie)  Scan the local network to find available computers  Use widgets to wake your computer directly from your home screen  Computer status indicator  Pleasant and minimalist Material Design UI  Consider reading the Help page for more information on how to set up your home router  By using Wake on WAN functionality of WolOn to wake your remote computer only when you need it you can considerably reduce your electricity bills.   Available localizations   English  Romanian  German - translated by Johannes Mller & Alina Floroiu  Korean - translated by JaeHyung Lee  French - translated by Reghina Lavric   Permissions info   Internet, WiFi state and network state permissions are used to wake computers over phones internet connection and check phones current data connection state.  Billing permission is used for donations. To sustain this project you can donate using in-app purchase.  Wake on LAN (WoL) is an Ethernet computer networking standard that allows a computer to be turned on or awakened by a network message. Consider reading Help section of the app for a better understanding of how WolOn works. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}