{
"name" : "SecureTeen Parental Control App",
"url" : "https://play.google.com/store/apps/details?id=com.infoweise.parentalcontrol.secureteen",
"package" : "com.infoweise.parentalcontrol.secureteen",
"category" : "Tools",
"description" : "Worried about internet safety of your child who might be exposed to mature content ? Is it your teens excessive screen time that always keeps you on your toes? Dont worry; we have the perfect solution for you. SecureTeen brings you a complete parental control app for cell phones and tablets . It addresses your worries by monitoring and filtering your kids web activities, keeping a tab on apps they download and keeps you informed about their location, text messages, calls and much more.  SecureTeen Parental Control App helps you to control screen time of your child so that he can get more time to engage in active play and be a healthier child.This app lets you to filter out all the cheesy and harmful content so your teens of impressionable age can enjoy all the good that web has to offer.   Here is a sneak peek of features supported by SecureTeen  - Set time limit for your childs screen time. - Keep a check on your childs online presence 24/7 with SecureTeens web control. - Activate a timer through time scheduling feature to set daily time limit for cell phone and tablet usage. - Dont like an app they are using? Use SecureTeens built in app blocker to lock it.  - Monitor all text messages sent and received from child device - Monitor all Call details  - All contacts stored on the phone/tablet are uploaded to your account and then matched with phone numbers of text messages and calls - Track all Facebook activity and get alerts for suspicious friends & posts with SecureTeen  - Use Web History Logs to stay informed when it comes to your childs online activity. - Use SecureTeen to track their location and where they go, so you can make sure their well-being isnt compromised. - And the best part: SecureTeen lets you do it all remotely through an online control panel created especially for you so you can control your childs safety.   With SecureTeen, you can let your teen safely browse the internet with minimal supervision, but optimum care, while staying informed about their outdoor location.  ---------------------------------------------------------------------------------------------- Important notes for users:  - SecureTeen Parental Control App must be installed on your childs phone or tablet. Once SecureTeen is installed then you can remotely monitor and control childs device by logging into your web control panel at www.secureteen.com.   - You can remotely manage SecureTeen at any time by logging into your online dashboard at http://www.secureteen.com/login  - Need help? Please visit the support page at http://support.secureteen.com/ --------------------------------------------------------------------------------------------- Important App Permissions  - This app uses the Device Administrator permission  - THIS APP USES ACCESSIBILITY SERVICES  This app uses Accessibility services. SecureTeen is using the accessibility service with active consent by the parents.   SecureTeen uses Accessibility Service to filter internet on childs device and limit apps usage. This helps all children, including those with pre-diagnosed disabilities from creating or aggravating behavioral disorders disabilities (including but not limited to ADD/ADHD, obsessive compulsive disorder, internet gaming disorder, autism, learning disabilities, developmental disabilities, depression and anxiety). ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_UPDATES', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_UPDATES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}