{
"name" : "Hide Photos - TimeLock Free",
"url" : "https://play.google.com/store/apps/details?id=com.projectstar.timelock.android",
"package" : "com.projectstar.timelock.android",
"category" : "Tools",
"description" : " No one will have the idea that there is a highly secured vault ingeniously hiding in your clock.   All photos and files are fully encrypted with AES-256 bit encryption algorithm.  The encrypted Folders and photos are placed in hidden directories.  The app has a stealth front end so even the fact that you have sensitive information is protected.  ProtectStar apps are preferred by more than 1.000,000 users in 123 countries.   ATTENTION: This app is not compatbile with Android 6 and higher! A patch will be available in 4Q, 2017.   Beware that most protection apps do NOT encrypt your files, they merely change the directories.  These applications are easy to defeat and DO NOT provide significant security. A simple file scan of your phone or our SD card will clearly show your data.  You can save Timelock protected files to your SD card, but you should NEVER place unprotected sensative files on the SD card. Even if you erase them later, you canot guarantee that they were completely erased. Thus, initially place your files on internal RAM, then save them to Timelock, and then delete the files from the device ram. Now your files are protected and there is no left over footprint.   A high-security vault for photos and videos hidden in a clock ============================================= With the new TimeLock app, it is not only a timeless clock with an alarm function, but also a high security vault for your personal photos and videos. The vault itself is completely invisible, hidden in the design of the clock.   The app integrates a powerful vault, which comprehensively protects all the backed up photos and videos in it, while offering unmatched usability.   With the latest security technologies TimeLock keeps all of your pictures and videos militarily secure, because the entire contents of the vault is encrypted with the strong 256-bit AES (Advanced Encryption Standard) algorithm. The AES-256-bit encryption method is one of the safest in the world and is used, for example, for encrypting top secret documents in the military.    Perfect harmony between visibility and invisibility ===================================== TimeLock not only impresses with its plain timeless design or the useful alarm clock, with which you can wake up in style, but it intelligently combines function and style. Naturally TimeLock can be used or placed as a beautiful clock on a writing or bedside table. And if you look at the time again from a new perspective, you will notice how harmonious and perfect a clock and a safe work together:   The genius of TimeLock is the safe, that is hidden and fully integrated into the functional design of the clock: With the hour and minute hands of the clock, you can easily set your four-digit passcode. Readable in both analog and digital format.   Only you have selected your personal passcode, simply confirm it with the inconspicious hands button in the centre of the clock, to open your safe. You can close the safe by shaking your Android device.    Features:  =======  - Unique world innovation  - Arbitrator timer in analog and digital form, including built-in alarm. Ideal for use as a desk clock.  -Built in high-security safe for personal photos and videos.  - AES 256-Bit encryption  - ProtectStar Smart Viewer  - Safely store photos and videos - Technical e-mail support ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.MANAGE_DOCUMENTS', 'android.permission.INTERNET', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.MANAGE_DOCUMENTS', 'android.permission.INTERNET', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}