{
"name" : "MobiClean - Mobile Cleaner & Battery Saver",
"url" : "https://play.google.com/store/apps/details?id=com.mobiclean.cache.cleaner",
"package" : "com.mobiclean.cache.cleaner",
"category" : "Tools",
"description" : "Get strong protection and smart optimization of your Android device with the MobiClean app. It comes decked with fantastic optimization features like Mobile Cleaner, Game Speed Booster, AntiMalware, RAM speed up, CPU Cooler, Photo Management, and Battery Saver.  Key Features Of Mobi Clean App:  1. Deep Cleaning- Junk(trash) and cache cleaning  Here are Features of the mobile cleaner app that are darted to clean your phone.  a)Mobile Trash Cleaner - A fast cleaner to wipe out the trash Intelligent and quick scanning of your complete device so that additional space can be created. It finds out and deletes all the junk files that hamper the performance of your Android device. This may include app cache, APK files, residual files, temp files, etc.   b) Duplicate Photo Remover - A smart way to delete unwanted photos Managing the photos was never this easy. Create more space by deleting the photos that look the same or are blurry and hold no good use in your gallery except for occupying space.   2. Key features of Mobile Cleaner app that can speed up your Android  Speed up your Android with RAM Speed up and Game Speed Booster  a) RAM Speed up - A one-tap operation to boost the devices speed  Increase the operating speed of your Android phone in just one tap. It kills the unnecessary processes that keep the RAM busy. This feature is an excellent way to get a visibly boosted device.  b)  Game Speed Booster - Boost the speed of your game in a tap Who wouldnt want their game to be free of interruption? This feature of the mobile cleaner app offers an amazing gameplay experience by killing the background processes. No lags, no glitches, sheer fun.  3. Advantageous features of the junk file cleaner app  MobiClean comes with other supportive features that can help you get a 360-degree optimized device.   a) AntiMalware- A robust security system This feature keeps your phone completely out of reach of all the infections that can degrade your phone and hamper the sensitive data on it.   b) Battery Saver - A system to hold the battery consumption You can enjoy a prolonged battery duration by using the battery saver feature. It elongates the battery duration by keeping it at a fixed level for a certain time. This makes sure that the battery is not consumed in the unwanted processes.   c) CPU Cooler - A temperature regulator for Android devices Heating and Android device goes hand in hand. Such problems are very common in Android devices. Protect your Android devices internal assembly from suffering through high or irregular temperature levels.   MobiClean is a single entity that can maintain the overall functionality of your Android device and that too very quickly. This junk file cleaner app is the staunch program that will optimize the performance of your Android device.   An extensive mobile cache cleaner app that comes embedded with intuitive features like Trash cleaner, Game Booster, AntiMalware, RAM speed up, CPU Cooler, Photo Management, and Battery Saver. An intensive pocket cleaner exclusively for your Android device. Download now! ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BLUETOOTH', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_PACKAGE_SIZE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.SET_WALLPAPER', 'android.permission.USE_FINGERPRINT', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}