{
"name" : "Super phone cleaner: clean fast, CPU cool down",
"url" : "https://play.google.com/store/apps/details?id=com.xiamapps.booster.coolerapp.boost.fastsupercleaner",
"package" : "com.xiamapps.booster.coolerapp.boost.fastsupercleaner",
"category" : "Tools",
"description" : "Running too many apps and process in the background makes your phone slow and leggy. Youll not have to worry about your phone slow and heat problem anymore about how to clear cache or how to speed up Android phone. When you use your mobile on gaming, movies, social media etc then your mobile takes a too much load on mobile RAM. You have no idea or remember to clean these running apps that makes your phone slow and create phone hanging problems so super cleaner show youre the list of that background running apps and help to kill that apps that make your phone slow, heat problems and hang problem. Makes your phone speedy, cleaning, and boosting, optimization and perfect RAM cleaning by its advance cleaning and cooling algorithm. Phone cleaning is the process in which super-fast cleaner detect the resources consuming apps and clean thee files on just one tab. Easy to use best phone cleaner app for the android phones and tablet. Super-fast cleaner app helps to enhance phone overall performance.  One tab to fast clean, fast cooler and game speed boost for your android phone. Smart phone cleaner is a memory cleaner, space cleaner app for the android phone that leads to phone optimization. Clean your phone cache memory, free up some storage and cool down your phone. Close heavy resources app and background running process to increase and enhance overall phone performance. With its powerful cool and clean function make your phone cool, smooth and faster. Super phone cleaner will give your phone a turbo boost and build a fast and smooth phone.  Extend your battery life making apps not being used to hibernate reducing the resources used on your device. Easy to use, without complicated terms and different screens to activate a wide variety of functions. Clean and boost system cleaner to clean up useless files with its fast clean algorithm that is very effective to clean junk files clear cache files and boost RAM speed. Super phone Cleaner, the professional and smarter Android cleaner with phone cleaner, boost mobile, Game Booster, CPU Cooler, will efficiently improve your Android phone performance and make it faster for daily using.  Features of Super Phone Cleaner  CPU Cooler - Phone Cooler With super phone cleaner CPU cooler feature cool down your phone CPU temperature and reduce CPU usage just one tab to cool down your phone. Analyze CPU usage and stop applications that are too hot to cool the CPU temperature, also just by tapping.  RAM Optimizer  Fast Cleaner Speed up RAM speed along with phone speed and make your phone fast and smooth. Close battery draining apps and speed up your phone and save battery power and life too. Detect useless files intelligently (system cache / application cache / uninstall residual applications), clean them and release more storage safely.  Game Speed Up  Game Launcher Speed up your game before launch and experience a smooth game play. Before game play clean and free up some storage space and this will leads to a perfecta and smooth game play.   Dont worry about your phone slow and heat problem. Here is the perfect solution that makes your phone optimized, clean and fast. Just download install and use super phone cleaner for better phone performance during multitasking and heavy usage. Like gaming, watching videos or perform multipurpose functions. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES']",
}