{
"name" : "WirelessTag",
"url" : "https://play.google.com/store/apps/details?id=com.wirelesstag.android3",
"package" : "com.wirelesstag.android3",
"category" : "Tools",
"description" : "This app is a wrapper of the web interface at http://wirelesstag.net/eth/, you will get identical UI as the web interface, except for graphs, where you will get native graph that allows smooth panning and zooming by touch. By installing the app on your Android device, you will be able to receive push notification message on your Android phones and tablets.  * Improvements over old Android app:  - System back button now works to close option screens.  - When changing device orientation (portrait <-> landscape) the screen does not reload anymore to allow faster response.  - You can tap on the camera icon under each tag to assign picture to each tag like iOS app, and the assigned picture will show up in events view to help visually identify the tag the event is from. - Rewritten temperature/moisture/battery voltage/motion event graph in native code for smooth zooming&panning and zoom in to view/on-demand downloaded raw data-points like the iOS app demo (Android version demo video coming) + This also includes the share and download button at the upper right corner which will take a snapshot of the currently displayed graph and send it / download entire log data as CSV and save/send it.  - Battery voltage graph can now be zoomed in better - Door/motion event graph is more readable with XY scattered plot (time vs number of events)  Because the user interface except graph is still written in HTML, it is best to install this app on a fast Android device (Galaxy S4 or faster) for smooth experience when playing with the settings. However, if you just want to receive push notifications and view captured temperature/moisture data graphs, slower/older Android device will suffice. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CALL_LOG']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}