{
"name" : "Files by Google: Clean up space on your phone",
"url" : "https://play.google.com/store/apps/details?id=com.google.android.apps.nbu.files",
"package" : "com.google.android.apps.nbu.files",
"category" : "Tools",
"description" : "Files by Google is a file management app that helps you:  Free up space with cleaning recommendations  Find files faster with search and simple browsing  Share files offline with others, fast and without data  Back up files to the cloud to save you space on device  FREE UP MORE SPACE In just a few taps, you can free up space more quickly and easily than ever: Delete old photos and memes from chat apps, remove duplicate files, erase unused apps, clear your cache and more.  CHECK YOUR STORAGE Use Files to see how much free space is left on your phone and SD card. Easily transfer files to an SD card to free up your phones storage, right from the app. Or use the integrated file cleaner to get more space on the phone.  BE IN CONTROL You will always know what youre deleting, we dont hide behind complicated terms and phrases. Select only what you want to remove and keep the rest. Its your photos, your videos, your files so you are in charge.  BOOST PHONE PERFORMANCE Use Files to keep enough of memory, so that your phone keeps on running smooth. Regularly, you get a prompt to remove junk or temporary files which helps you get more storage immediately.  SMART RECOMMENDATIONS Get helpful suggestions of files to erase before you run out of space. The recommendation from Files app get smarter the more you use it.  FIND FILES FASTER Save time looking for photos, videos, and documents on your phone. Files uses filters rather than folders so your stuff is organized more intuitively. Files by Google is the file manager and storage browser that helps you find what youre looking for fast.  EASILY MANAGE FILES Search for your files or simply navigate to them through categories and filters. View, delete, move, rename or share any files. Sort them by file size to understand whats taking space. Browse all the GIFs your have. Find and share that video you downloaded last week. All of this with few taps.  SHARE FILES OFFLINE Share your pictures, videos, documents, or apps with others nearby who also have the app. With fast speed up to 480 Mbps, its fast, free, and it works without the internet, so it doesnt cost mobile data. Just pair up your phone with anyone nearby who has Files app.  ENCRYPTED FILE SHARING Filess offline file sharing is secured with WPA2 encryption, providing a more secure file transfer. Files app uses Bluetooth to set up encrypted and direct fast wifi connection, so that you can transfer app APK or large files in seconds, send videos or pictures to your friends. Safe and secure.  BACKUP FILES TO THE CLOUD If you want to keep a file forever, select it from the Files menu and back it up to Google Drive or any other cloud storage app. Save them forever without taking space in your phone.  BACKUP FILES TO THE SD CARD If you run out of storage on your phone, simply transfer large files or videos to your SD card if you have one. With a few clicks, you can clean up your phone and fully use the SD card. That leaves your internal storage free and your phone faster.  EFFICIENT, EFFECTIVE STORAGE MANAGEMENT Files app takes less than 10MB of storage on your phone. And theres no malware or bloatware to affect your phones performance.  THREE-IN-ONE TOOL APP While taking very little storage on your device, Files does three things in one: 1) Free up space - Clean junk files and cache, boost your mobile phone or tablet as you clean up the phone memory and optimize your smartphone performance. 2) Find files fast - Browse your storage and find everything fast without being expert in file management. 3) Share files - Send pictures, share videos, transfer large files or app apks. All of this with super fast speed with rate up to 480 Mbps over an encrypted direct wifi network. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['com.google.android.apps.nbu.files.permission.C2D_MESSAGE', 'android.permission.DELETE_PACKAGES', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.QUERY_ALL_PACKAGES', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.FOREGROUND_SERVICE', 'android.permission.MANAGE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.MANAGE_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'com.android.vending.p2p.APP_INSTALL_API', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED']" 
"extra_perms" : "['android.permission.DELETE_PACKAGES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.QUERY_ALL_PACKAGES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.MANAGE_EXTERNAL_STORAGE', 'com.android.vending.p2p.APP_INSTALL_API']",
}