{
"name" : "Real Pi Benchmark",
"url" : "https://play.google.com/store/apps/details?id=com.georgie.pi",
"package" : "com.georgie.pi",
"category" : "Tools",
"description" : "RealPi provides some of the best and most interesting Pi calculation algorithms out there. This app is a benchmark which tests your Android devices CPU and memory performance. It calculates the value of Pi to the number of decimal places you specify. You can view and search for patterns in the resulting digits to find your birthday in Pi or find famous digit sequences like the Feynman Point (six 9s in a row at the 762nd digit position). There are no hard limits on the number of digits, if you experience a freeze please see Warnings below.  Leave comments with your Pi calculation time on the AGM+FFT formula for 1 million digits. Also the most digits you can calculate, which tests your phones memory. The authors Nexus 6p takes 5.7 sec for 1 million digits. Note that the AGM+FFT algorithm works in powers of 2, so calculating 10 million digits takes just as much time and memory as 16 million digits (the internal precision is shown in the output). On multi-core processors RealPi tests the performance of a single core. For accurate benchmark timing ensure that no other applications are running and your phone is not hot enough to throttle the CPU.  Search function: Use this to find patterns in Pi like your birthday. For best results calculate at least one million digits using the AGM + FFT formula, then select the Search for Patterns menu option.  Heres a summary of the available algorithms: -AGM + FFT formula (Arithmetic Geometric Mean): This is one of the fastest available methods to calculate Pi, and is the default formula used by RealPi when you press Start. It runs as native C++ code and is based on Takuya Oouras pi_fftc6 program. For many millions of digits it can require a lot of memory, which often becomes the limiting factor in how many digits you can calculate.  -Machins formula: This formula was discovered by John Machin in 1706. Its not nearly as fast as AGM + FFT, but shows you all the digits of Pi accumulating in real time as the calculation proceeds. Choose this formula in the settings menu and then press Start. Its written in Java using the BigDecimal class. You should probably not ask it to compute much more than 20000 digits.  -Nth digit of Pi formula by Gourdon: This formula shows that its possible (surprisingly) to calculate decimal digits of Pi in the middle without calculating the preceding digits, and needs very little memory. When you press the Nth Digit button RealPi determines 9 digits of Pi ending with the digit position you specify. It runs as native C++ code and is based on Xavier Gourdons pidec program. Although its faster than Machins formula it cant beat the AGM + FFT formula in speed.  -Nth digit of Pi formula by Bellard: Gourdons algorithm for the Nth digit of Pi cant be used for the first 50 digits, so this formula by Fabrice Bellard is used instead if digits < 50.  Other Options: If you enable the Calculate when in sleep option RealPi will keep calculating while your screen is off, useful when calculating many digits of Pi. While not calculating or after the calculation finishes your device will go into deep sleep as usual.   Warnings: This app can drain your battery quickly when doing a long calculation, especially if the Calculate when in sleep option is on.  Calculation speed depends on your devices CPU speed and memory. At very large numbers of digits RealPi may terminate unexpectedly or not produce an answer. It could also take a very long time to run (years). This is due to the large amount of memory and/or CPU time needed. The upper limit on the number of digits you can calculate depends on your Android device.  Changes to the Calculate when in sleep option take effect for the next Pi calculation, not in the middle of a calculation. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}