{
"name" : "Oxygen Updater",
"url" : "https://play.google.com/store/apps/details?id=com.arjanvlek.oxygenupdater",
"package" : "com.arjanvlek.oxygenupdater",
"category" : "Tools",
"description" : "** ONLY WORKS ON (MOST) ONEPLUS DEVICES. See https://oxygenupdater.com for a list of supported devices and https://oxygenupdater.com/faq for frequently asked questions.**  You always wanted to run the latest software versions. You bought a device with a great operating system - which is intuitive and offers a lot of customization options. There is however one big catch: You have to wait until its your turn to get your system updated to the latest Oxygen*(1) OS / Android version....  Well: as of now, the wait is over! With Oxygen Updater, you will be among the first users to update your Oxygen OS device to the latest and greatest software version, for free!  Oxygen Updater allows you to be the first to download new Oxygen OS System updates, and directly install*(2) them to your device. No more waiting until you get the system update notification after a few weeks, just update whenever a new update is released.  When a new update becomes available, youll receive a notification of it. You may then open the app to download and install*(2) your new system update.  Additionally, this app provides a short overview about your device specs, including your current Android and Oxygen OS version, the amount of memory (RAM), the security patch date and the processor in your device. Also, important announcements about OnePlus and the app itself are posted within Oxygen Updater.  When you open Oxygen Updater for the first time, you will be asked to select your device and your update method. These are usually set to the right values, but you are free to change them according to your likings.  There are a couple of different update methods:  - Incremental updates: Incremental updates are update packages meant to update a specific version of OxygenOS to a newer version. These updates are small to download but do not work on rooted or bootloader-unlocked devices. For most people, this is the recommended way to update. If an incremental package is not available for your specific OxygenOS version, the app automatically offers a full package instead.  - Full updates: Updates which also work on rooted and bootloader-unlocked devices. However, these updates are very large to download (almost 2GB nowadays). Only recommended if you have root access or have a bootloader-unlocked device.  - Open Betas: Do you want to experience even newer software than most other people around you? Then you can also switch to (and update) the OxygenOS Open Betas using this app. *(3). The Open Betas come both in full and incremental packages. These work the same as explained for the regular versions above.  *(1) This is a non-official app. OnePlus and Oxygen OS are not associated with this app in any way. They are not responsible for your actions, neither is the developer of this app. Installing software updates may render your device inoperable if the installation instructions are not carefully followed. Please visit https://oneplus.net/nl/about-us for more information about OnePlus. For questions, suggestions and legal issues, please send an email to the e-mail address from the developer as shown in the Google Play Store.  *(2) Automatic update installation requires root access and TWRP recovery. If you dont have root access, youll be prompted with a guide on how to install the update yourself. Even if you have root access, you may still choose to view the install guide and install the update yourself.  *(3) Switching from the regular version of OxygenOS to the Open Beta requires enabling of Advanced Mode, a free feature meant for advanced users only. Reverting back from the Open Beta to the regular version of OxygenOS may not be possible through Oxygen Updater but *will* erase all contents of your phone. Consider this before switching to the betas! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.ACCESS_SUPERUSER', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_SUPERUSER', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}