{
"name" : "Elegant Teleprompter",
"url" : "https://play.google.com/store/apps/details?id=com.ayman.elegantteleprompter",
"package" : "com.ayman.elegantteleprompter",
"category" : "Tools",
"description" : "Elegant Teleprompter helps people who want to speak fluently in front of cameras. It is an autocue app that is extremely helpful for broadcasters. Can be used in presentations and public speaking. Musicians and singers can use it for reading lyrics. You can also use this application for speed reading.  You can also use Elegant Teleprompter in a Floating Window, which means you can use it simultaneously with any other app on your device. For example, you can use it alongside with camera application to record videos. You can also read the scrolling script while streaming a live video on Facebook, Instagram, etc. The floating window is very flexible. It can be moved or resized.  It presents the user with a scrolling text that can be created from mobile or imported from the drive. Elegant Teleprompter is very easy to use.   Features:  - Mirror text. - Import text from storage or drive. - Support Bluetooth remote. - Change scrolling speed. - Change text size. - Change line spacing. - Change the width of the scrolling script. - Focus on the center of the script (make it more bright). - You can assign shortcut keys to perform certain actions. - Progress bar is added to view or change your position in text. - You can set Elegant Teleprompter to be the default application for .txt files - Sort scripts by date or name - Specific Settings is added where each script can have its own settings (speed, line spacing, text size, focus and width). This option is very helpful for musicians and singers. - Loop option is added where the script starts again after reaching the end. - Center Text option is added to center text horizontally. - Tap to Play/Pause option is added. - Allow multiple script selection to delete.  To get extra features and remove ads, you can buy the pro version: https://play.google.com/store/apps/details?id=com.ayman.elegantteleprompter.paid  Please note that only .txt files are supported. You can buy the pro version to import text from .docx files ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}