{
"name" : "SIM Device Info",
"url" : "https://play.google.com/store/apps/details?id=com.kee.SIMdeviceinfo",
"package" : "com.kee.SIMdeviceinfo",
"category" : "Tools",
"description" : "Easy to see and check your sim card and device information by using the SIM Device Info. This app can detect and checking usefull information such as Dual SIM Serial Number, IMSI Number, IMEI Number, Software, Hardware and much more...  Nice UI ! User friendly!  SIM CARD INFO: Displaying most useful information about Dual SIM Card. In this tab you can copy and share sim card information too!  SIM CONTACT: Displaying contact numbers stored on the sim card. In this tab you can delete sim contact and export sim contact into phone. Other features are also available such as copying contact, call, messages, and share contacts.  NETWORK: Displaying network information and connection status. In this tab you can see and copying your IP and mAc Address.  DEVICE: Displaying most useful information about your phone device. In this tab you can copy and share device information.  SOFTWARE: Displaying most useful information about operating system and software. In this tab you can copy and share software information.  HARDWARE: Displaying most useful information about hardware on your device. In this tab you can copy and share hardware information.  SENSORS: Displaying available sensors and supported features on your device.  BATTERY: Displaying battery status, technology and capacity on your device.  PERMISSION REQUIRED: We need permission below to access our features. We dont collect data or user information. The permissions we requested are only for running the main features of our application!  1. CAMERA to display front and back camera resolution! 2. PHONE to display about phone and sim information! 3. CONTACTS to display sim contacts numbers!  OTHER PERMISSION: INTERNET. ACCESS_NETWORK_STATE. CHANGE_NETWORK_STATE. ACCESS_WIFI_STATE. CHANGE_WIFI_STATE.  have any questions? feel free to contact the developers:) ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}