{
"name" : "Flash Alerts LED - Call, SMS",
"url" : "https://play.google.com/store/apps/details?id=com.rvappstudios.Flash.Alerts.LED.Call.SMS.Flashlight",
"package" : "com.rvappstudios.Flash.Alerts.LED.Call.SMS.Flashlight",
"category" : "Tools",
"description" : "Its time to take control of your phone notifications! Flash Alerts LED lets you manage and customize blinking flash light alerts so you never miss a phone call, text (SMS), app notifications or alarm. When its dark or your phones on silent, youll still know whos trying to get in touch with you, all thanks to Flash Alerts LED!  Flash light alerts put the power of blinking flash customization for your android phone at your fingertips. Create flash blink patterns for incoming phone calls, texts (SMS), and app notifications. For example use flash alerts for all notifications including email, social networking, and messenger apps. Plus use flashlight LED alert on call and sms when youre in a meeting or if your baby is asleep. You never know when silent blinking flashes could come in handy.  You can even create custom light blinks for individual contacts, letting you know whos calling without turning on your screen!  Features:   Set the LED to flash on incoming calls.  Create a custom blinking light for incoming SMS messages.  Set blinking LED lights to help find your phone in the dark.  Use LED Light Controller When:  You have to keep your phone on silent but you still need to know whos texting (movie theatres, plays, baby sleeping, etc.)  You need to identify a caller but cant turn your phone on (in a conference or meeting)   Youre in a noisy location and cant hear your ringtone (coffee shops, parties)  More LED Light Controller Features:  Set individual blink patterns for calls and notifications.  Set continuous flashes or the number of blinks per alert.  Change the speed of light flashes.  Instant flash off control using the power button.  Share flash patterns with friends and family.  Disable flashes when the battery is below a set percentage.  DND mode to hide LED flashes during specified times  The flashlight alert app is fully optimized for tablets that utilize a sim card. Thank you for using the brightest and best LED Flash Alerts for your phone & tablets, and we hope you think this is truly the best app in the market. Please let us know how we can continue to improve the free flash alerts LED app by contacting us or reviewing!  We always welcome your questions, suggestions and comments.  Facebook: https://www.facebook.com/RVAppStudios Twitter: https://twitter.com/RVAppStudios YouTube: https://www.youtube.com/c/rvappstudios ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERACT_ACROSS_USER_FULL', 'android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FLASHLIGHT', 'android.permission.GET_TASKS', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERACT_ACROSS_USER', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERACT_ACROSS_USER_FULL', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERACT_ACROSS_USER', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}