{
"name" : "AppLock Plugin - Guard Privacy",
"url" : "https://play.google.com/store/apps/details?id=com.imoblife.applock_plug_in",
"package" : "com.imoblife.applock_plug_in",
"category" : "Tools",
"description" : "Lock apps with passwords from spy eyes, & Protect privacy   This is All-In-One Toolbox (Cleaner, Booster & Optimizer) App Lock Plugin. It can not be used on its own, Please install All-In-One Toolbox before use this plugin.   Download All-In-One Toolbox: https://play.google.com/store/apps/details?id=imoblife.toolbox.full&referrer=utm_source%3Dplugins%26anid%3Dadmob  How to use  - Install Both All-In-One Toolbox and App Lock Plugin - Open All-In-One Toolbox > Toolbox > Plugins > App Lock Plugin You can create shortcut for this plugin in Settings or add it as a screen widget for quick access   Main Features  App Lock Plugin helps to protect and secure your privacy by locking up the installed applications, settings and private information, such as SMS, mails, photos, and contacts etc. You are able to reset forgotten password with security question and answer.  App Lock Plugin provides pattern password and number password and you can choose either way to lock up applications.   Delay lock offers you options to delay the lock time of apps, so as to allow free entrance within a limited time.   About All-In-One Toolbox  All-In-One Toolbox is the most comprehensive tool app to optimize your Android in optimal speed. Trusted by Millions of users world wide.   **Key features**  Junk File Cleaner Clean all process, cache, temp files, empty folders, residual files, app leftovers, clipboard data, SMS & call logs, saved password, search history, large files  Task Killer & Memory (RAM) Booster  Kill background running tasks whenever device slows down, lags or freezes to boost speed.  Pre-Installed & User Installed App Manager  Manage all apps. Root user can customize auto-start apps, move app to SD card, batch install&uninstall apps silently, uninstall build-in system apps.   SD Card File Manager Manage all files, folders stored on external SD card. Support all basic file operations.  Privacy Protector  Encrypt apps and everything you dont want to share  Useful Plugins 1. App Advertisement Detector  2. App Locker 3. Auto Clean & Boost Tasks  4. Game Booster  5. App Permission Check  6. Compass 7. Flashlight  8. QR & Bar code Scanner 9. Quick System Settings  10. Sensor Box 11. Quick Volume Settings  12. Pro Key ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'android.permission.GET_TASKS', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION']",
}