{
"name" : "Applock - App Lock & Applock fingerprint",
"url" : "https://play.google.com/store/apps/details?id=com.eco.applockfingerprint",
"package" : "com.eco.applockfingerprint",
"category" : "Tools",
"description" : "The best free App Lock with Fingerprint support   App lock - The fingerprint lock app helps you lock all your apps. You need to keep your personal information secure, you dont want strangers to access applications on your personal phone, immediately download Lock app, completely free, professional and convenient.  With the App lock fingerprint you can lock your app with your pin, pattern and even your fingerprint. You can also change the method to lock the app whenever you want. Now you no longer have to worry about your personal information being viewed by others by downloading the Applock - App locker application.  Applock - App lock fingerprint can lock all apps in your device:    Block all social apps, no one will be able to snoop on your private conversations anymore  Lock application system. System applications such as contacts, messages, collections, etc. can all be easily locked with one click.  All payment apps will have an extra layer of protection when you use Applock  Your images and videos will also be viewable only when you set password for app to lock them  Salient features of AppLock:  Screen Lock: The screen will never turn off or adjust screen brightness when the app is running  Uninstallation Prevention: Activate the feature so that others cannot uninstall the App Lock application, the locked applications will be absolutely confidential Intruder Selfie - Who try to break in my phone?: A photo will be taken and saved here when someone snoops on your apps  Questions & answers:     Q: How do I use a fingerprint lock? Answer: App lock fingerprint will work on Android devices running OS 6.0 [Marshmallow] and above and your device supports Fingerprint Recognition. Go to settings and enable fingerprint lock. After activation, you can use this feature immediately. Be sure to add your fingerprint information to the device beforehand to use this fingerprint lock feature.   Q: Why should use the Access to use permission? Answer: App Lock uses this permission to detect if an app is locked to launch.   Q: Does the application consume memory of your device and is it easy to set up and use? Answer: Applock has a simple interface you can perform any task easily and smoothly.  Thank you for installing and using App Lock - Lock app & App locker. If you see it useful, please rate 5 stars to encourage us to develop better apps. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.GET_TASKS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_FINGERPRINT', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BROADCAST_PACKAGE_ADDED', ' android.permission.USE_BIOMETRIC', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.BROADCAST_PACKAGE_ADDED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', ' android.permission.USE_BIOMETRIC', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.SYSTEM_ALERT_WINDOW']",
}