{
"name" : "Marathi English Keyboard 2019: Marathi Typing App",
"url" : "https://play.google.com/store/apps/details?id=com.unclekeyboard.marathi",
"package" : "com.unclekeyboard.marathi",
"category" : "Tools",
"description" : "Marathi keyboard app contains fantastic keyboard theme with Marathi keyboard google. This beautiful keyboard is designed for people who like Marathi keyboard for Marathi typing. Free Marathi keyboard download and apply its keyboard themes called Marathi keyboard, and Android keyboards. The app is developed to provide you a faster and smooth android keyboard experience. You can also express your deep emotions via messages using the heart emoji, taco emoji, smile emoji. Download this Marathi keyboard theme and type faster than ever.   Your computer Marathi typing keyboard seems totally cultural with Marathi bhasha keyboard. Download best Marathi keyboard theme and check it out! Marathi keyboard app for android will provide a plain and a unique keyboard. Marathi keyboard can be used for all social media platforms, which mean Marathi typing keyboard is the best English to Marathi keyboard app 2019.  How to Use:  In Google play store search bar write Marathi keyboard or Easy Marathi Typing App. 1. Now Download free Marathi bhasha keyboard and install Marathi English Keyboard 2019: Marathi Typing App in your mobile from Google play store. 2. Open Marathi keyboard 2019, click settings and choose the option of enable. 3. After enabling the best Marathi keyboard 2019 set the input method between the Marathi keyboard and device default keyboard.  Hundreds of different themes are available in your best Marathi bhasha keyboard. Features: -Add thousands of Emojis, Vocabulary, GIFs, Emoticons and stickers in Marathi bhasha keyboard. -Customize your keyboard color, wallpaper and layout. -Hundreds of colorful themes. -Word-precdiction and auto-correction in Marathi keyboard app download. - Text face. -Set your own photos in background keyboard theme  Privacy Policy Marathi Keyboard app download is completely safe and will NEVER collect your personal data without your own permission. Do give us feedback or any suggestions you have about our apps ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}