{
"name" : "Aquarium Assistant",
"url" : "https://play.google.com/store/apps/details?id=com.aitoros.aquariumassistant",
"package" : "com.aitoros.aquariumassistant",
"category" : "Tools",
"description" : "Whether you want to check the state of the water in the last month, the population of the creatures, or the state of the plants  youll find it all in one place. The application works for freshwater, saltwater, brackish and shrimp aquariums aswell.  Dashboard Dashboard is displayed as the default application screen. There are recent water parameters, current and upcoming assignments and other information  Aquarium information Allows you to view, create new and edit your aquarium data. In addition to basic data such as name and capacity of the aquarium, you will see the latest water parameters added to this tank.  Animals, Plants, Equipment Allows you to add and track animals, plants and equipment in your aquarium with the ability to create galleries. Records can be sorted by name, scientific name or purchase date  Tasks and fertilization plans Allows you to create and track all tasks, allowing you to view current, overdue and upcoming tasks. The application automatically recalls tasks and tasks that have not been performed. Fertilization plans allows you to setup your fertilization dosing plan and create task list linked with this plan.  Water Parameters Allows you to save and track multiple parameters of water separately for your aquariums. The configuration allows any parameterization of the entered data separately for each type of aquarium. It is possible to switch off the component, set the correct range, or turn on the timer. Corelation allows you to graph three freely selected parameters in daily, monthly and weekly time periods.  Estimative index Calculator for fertilization by Estimative Index. All settings and parameters for both Macro and Micro fertilizers can be saved to the template for later refinement.  Features:   Manage multiple aquariums.  Works with freshwater, marine, brackish and shrimp aquariums.  Log water parameters and view them on graph.  Track your Activities - add activity notes and photo.  Unit converters  Dosing Calculator for target water parameters  Notes created by Estimative Index and Dosing Calculator  Track your Expenses in predefined categories.   Check corelation between three freely selected water parameters.  Water parameter countdown timers.  Easy share your water parameters.  Track your animals, plants, equipment and create galleries for them.   Create fertilization plans and use them to create task list.  Manage your current, upcoming and overdue tasks..  Backup and Restore data locally and from Google Drive.   Estimative Index dosing calculator.  Templates for Estimative Index macro and micro data.  Share your Estimative Index dosing settings. ",
"desc_perms" : "['android.permission.WRITE_CONTACTS', 'android.permission.READ_CONTACTS']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.aitoros.aquariumassistant.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.google.android.c2dm.permission.SEND', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'android.permission.READ_LOGS', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BILLING', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_LOGS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.SEND', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS', 'android.permission.CAMERA', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
}