{
"name" : "Don't touch My Phone-Anti Theft Motion Alarm",
"url" : "https://play.google.com/store/apps/details?id=com.donttouchmy.phoneantitheftmotionalarm",
"package" : "com.donttouchmy.phoneantitheftmotionalarm",
"category" : "Tools",
"description" : "A must have application that guarantees your device safety and save it from getting stolen. Keep your precious data and expensive smartphone safe by using Anti Theft Motion Alarm. This application will get triggered when someone touches or picks your mobile.  Deter people from picking up your phone. To start securing your device just open the app, set a pin and set an alarm. Now whenever you are resting in the office, putting your device on charge, put your mobile in a bag in public or leaving your device back on the table just enable anti-theft alarm and do whatever you are going to do. Now from now onwards if someone tries to peek into your device, tries to unlock it, pick it, touch it, move it or pickpocket it, the device will get active with a loud bang and start playing the ringtone you set.  The intruder will either leave the device from where it was picked or attempt to unlock it. Any failed attempt will make the device ring with an even louder siren. Therefore, nobody will dare to pick your device and you will have your device always with you with the fear of losing it. Keep your phone safe from nosy people, kids, friends, and burglars. Once you activate the alarm, no one would dare touch it, because a loud alarm will be played if they move or unplug the phone. You will catch them red-handed!  Your phone will be safe and sound. It will not be stolen or used without your permission anymore. Leave your smartphone anywhere and still, no one will dare touch it!  Features: Easy 2-step setup: - Step 1: Set the pin and activate the alarm.  - Step 2: Put the device in a fixed place. Choose from different Alarm Sounds! Motion Alarm Triggered by even a minimalistic movement.  Password Protected Unlock. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.SET_WALLPAPER', 'com.android.vending.BILLING', 'android.permission.USE_FINGERPRINT', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SET_WALLPAPER', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING']",
}