{
"name" : "Ram Booster Pro - Cleaner Master",
"url" : "https://play.google.com/store/apps/details?id=com.xiamapps.boost.booster.cleaner.rambooster",
"package" : "com.xiamapps.boost.booster.cleaner.rambooster",
"category" : "Tools",
"description" : "Ram Booster Pro - Cleaner Master - is a super easy Android Ram Booster, Speed up memory, Super Cleaner, Cache Cleaner, CPU Cooler, Cooler Master and kill all extra Back running app and increase ultimate boost fitness of your device. With this Ram Booster, you can boost your phone speed by cleaning Ram and save battery usage that makes your battery last longer, and can help you get more battery life for your Android phone!. Enjoy this beautifully designed One-Click Ram Optimization, Cleaner Master, Super Cleaner, Battery Monitor & Battery Saver and Booster app, its super easy Cleaner and enhance battery life and make your phone cool!  *FEATURES* START BOOSTING This Pro Ram Booster can boost up RAM & clean up Junk files to boost your phone in average faster. Simply tap START BOOSTING button to boost your phone with one click and Boost all selected back running threads. It can even save battery and Indicates your phone speed with percentage. It will also resolve All RAM Threads & errors on clicking.  SIMPLE INTERFACE - Simple and easy interface  - Pure material design - Users can choose which apps to kill - Detailed of listed running apps  RAM OPTIMIZER  - RAM optimizer on only single tap  It will be perfect for everyday use and boost up your phone & save battery without any professional knowledge. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.RESTART_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.GET_TASKS']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.RESTART_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}