{
"name" : "Screen Light Table Lamp Lite",
"url" : "https://play.google.com/store/apps/details?id=com.display.light.TableLamp.lite",
"package" : "com.display.light.TableLamp.lite",
"category" : "Tools",
"description" : "Screen Light Table Lamp Lite app enables your smartphones screen/display to a multi-color light.  Alternative Flash Light You can use this app as an alternative to a flashlight/ torchlight. Super brightness with very easy controls.  Reduce Darkness If you dont like to sleep in dark, you can use this Screen Light Table Lamp Lite before sleeping. This light will make your night more comfortable.  Personal Moment Spend your personal moment in a cool dramatic environment by using Screen Light Table Lamp Lite. You can easily set your desired color to make your personal moment more beautiful.  Book Reading Light Using this app you can read books in the dark. You can adjust the brightness intensity and color. It also has a sleep timer option so you can use it and fall asleep while reading, without worrying about your phones battery draining out.  Meditation Time Soft light meditation helps to improve your mental stability and inner peace. Screen Light Table Lamp Lite app will help to make a nice environment with diminished light. You can easily control the brightness and color.  Color preset There is some cool and gentle color presets in the app regarding the color wheel. You can easily change the color by swiping left and right or tapping on the color circle. By default following preset color lights are given. White color light, red color light, yellow color light, green color light, blue color light, purple color light, magenta color light.  Lights color customization You can choose your desired color by the custom color picker. Multiple custom colors can be used in all the presets.   It has the easiest way to control brightness, set timer/sleep timer, change colors, and so much more.  - Reading Light - Perfect Timer - Ultra Brightness - Night Lamp - Dim Light - Flash Light - Torch Light - Display Light ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}