{
"name" : "Date Calculator",
"url" : "https://play.google.com/store/apps/details?id=com.ng_labs.dateandtime",
"package" : "com.ng_labs.dateandtime",
"category" : "Tools",
"description" : "This is a great tool for anyone who is interested in date related operations in Android device; its Free, fast, easy. It provides helpful information about date and time guide for more than 100 years, and also it will give you expert knowledge and point you in the right direction to plan future.  This is a simple and awesome date and time app to calculate duration between two dates with time like total years, months, days, weeks, hours, minutes and seconds and also it is useful to find date difference between events like work anniversaries, birthday, holidays, and important dates. It gives you a quick and simple user experience when you do date manipulations like date-to-date calculation, add or subtract from a date, find leap year, week day calculation and age calculator. Calculating time and date is easier than any other application in Android platform.  Do you want to know the exact amount of hours, minutes and seconds between two dates? This app provides the most popular features of date and days; it is the smartest and fastest Date Calculator app available in Google Play.  Key Features of this Application   Calculate date and time units between two dates in years, months, weeks, days, hours, minutes and seconds.   Use the Add or Subtract from a Date calculator to add or minus date and time units to get a new date and time, find weekday of the new date.   Using this app simply Find a leap year and also find total days in given year.   Day of the week calculator find week days Sunday, Monday, Tuesday, Wednesday, Thursday, Friday and Saturday to the given date.   Calculate how many working and non working days between two dates.   Calculate your accurate age in years, months and days as an age calculator.   Figure out how many days are left until a given date with the days countdown.   Calculate your financial dues as a due date calculator.   You can able to find current device time zone in navigation menu and settings page.  Dont keep Date Calculator app a secret! We grow with your support, keep sharing :)  Please dont leave negative feedback about a concern, bug or issue! Instead, please contact us @ ng.labs108@gmail.com and well do our best to solve your issues and appreciate all the support that has made this application more successful! Thank you! ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}