{
"name" : "GSam Battery - Root Companion",
"url" : "https://play.google.com/store/apps/details?id=com.gsamlabs.bbm.rootcompanion",
"package" : "com.gsamlabs.bbm.rootcompanion",
"category" : "Tools",
"description" : "Enables full Battery statistics on KitKat based Android devices for GSam Battery Monitor.  NOTE: This app is only needed for KitKat based devices. If you are running Lollipop or later, use the GSam Menu -> More -> Enable More Stats option. This will give you full statistics whether you have root or not.  Unfortunately, Google has removed the ability (KitKat 4.4 and later) for non-system applications to access battery statistics. This companion app restores this function by running as a privileged system application. Root access to your device is required. GSam Battery Monitor works fine without the root companion, however this app adds additional statistics.  Why Install?   If you are using GSam Battery Monitor on KitKat (4.4) or later, and the app informs you that it is unable to retrieve battery statistics, you should install this app.  What does this do?   This runs as a system privileged app and provides the caller access to the Battery Statistics that - prior to Android 4.4 - used to be accessible to any normal application.  This also provides the ability to read the content of small files to which the regular battery monitor has no access - wakelock files for example.  Is Root really required in KitKat?   Unfortunately, root is required to copy this app into /system/priv-app, which allows this app to run as a privileged system application. There are other alternatives, but all of them require root.   Is this safe?   Yes - the code is open source, and very simple. GSam Labs believes that any app that you install as root must be fully open source to allow you to inspect the application and ensure it doesnt do anything malicious. With that principle in mind, you can find the source here: https://github.com/GSamLabs/GSamBatteryMonitor-RootCompanion * NOTE: If you are unfamiliar with what root means, this app is not for you.  How do I install it?   Install this just like any other application from the store. Once installed, there will be a button that will copy the app to /system/priv-app, and prompt you to restart your device.   Flashable Zip: You can find a flashable zip in the github repository under the RecoveryInstallImages directory (http://goo.gl/0zcqbL). Flash this in the recovery of your choice. This should work for most phones, but since the google update binary differs between devices, there is no guarantee.  NOTE: This only works if you have root access to your device!  How do I uninstall it?   Once a system app is installed, the normal uninstall procedures dont work. To uninstall this app once it is a system app, simply launch the app and click on the Uninstall button.  Can I remove the icon from the launcher?   Yes - you can! Once you have the app properly installed, open the app and select the Remove from launcher checkbox. If you need to open the app in the future, simply go to GSam Battery Monitor, and select the Launch Root Companion menu option, or go to the Google Play Store, look up the root companion, and hit the Open button.  Will I need to re-install after an Android update?   Yes - android updates will typically remove any non-stock apps from the system app-priv directory, so you will need to re-install this app after an update to Android. If you are running a CyanogenMod derivative, then starting with version 1.4, it should automatically backup and restore during a nightly update.  Help! Things dont work after installing this!   Like all root applications, some care must be taken by the device owner when installing this app. This application is free and open source. GSam Labs is not responsible for any problems, though we will try and help - simply contact us via the Support link. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_SUPERUSER', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BATTERY_STATS']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.ACCESS_SUPERUSER', 'android.permission.BATTERY_STATS']",
}