{
"name" : "DSO Planner Free (Astronomy)",
"url" : "https://play.google.com/store/apps/details?id=com.astro.dsoplannerfree",
"package" : "com.astro.dsoplannerfree",
"category" : "Tools",
"description" : "DSO Planner Free is an astronomy observation planning tool with excellent star charting capabilities made by active and experienced amateur observers with a passion for visual observations. Free Edition comes equipped with Yale bright star catalog (9 000 stars to 6.5m) and 220 deep sky objects (Messier and Caldwell catalogs containing the brightest galaxies, nebula, globular clusters, open clusters and planetary nebula).   Consider other Editions for more stars / objects.  Application features:  + Planning tool. Filter any objects database by observer location, sky condition, astronomical equipment, time range of observation and object features (type, dimension, magnitude, minimal altitude, visibility and other fields of own custom catalogs). Remove duplicate objects when searching in intersecting databases. Create up to 4 observation lists. Easily track observed and remaining to be observed objects with note taking tool  + Double Star catalog. 50 brightest double stars from Yale catalog. Info Panel with PA and separation for each component.  + Unique visibility tool. Only objects that are visible with selected equipment in the current sky conditions could be shown on the Star Chart  + Cross-match names database. Search objects by less common names  + Famous Steve Gottlieb Notes attached to NGCIC objects  + Offline images. Integrated set of deep sky object images  + DSS imagery support. Download DSS (Digitized Sky Survey) images of any sky portion into offline cache and overlay it on the star chart  + PushTo for dobsonian mounts with setting circles. Level your dobsonian mount and perform one star alignment. The program will automatically recalculate az/alt numbers to easily hunt the object  + Nebula contours. Contours of famous nebulae  + Object contours. Ellipse in real dimension and orientation on the sky chart  + Bright Solar System objects. Sun, Moon, Mercury, Venus, Mars, Jupiter, Saturn shown on the sky chart  + Night mode. Red keyboard and menus  + Note taking. Take text and/or audio notes  + Observing places. GPS, manual coordinates, custom lists. Database with 24 000 cities worldwide  + Equipment. Keep track of all your telescopes and eyepieces. Use them for object visibility calculation and star charting  + Twilight calculator. Sun, Moon rise / transit / set. Moon Phase. Civil, Nautical, Astronomical twilights.  + 2 visual themes (bright and dark)  + Powerful share/export/import capabilities (of databases, observation lists, notes)  Disclaimer ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'com.android.vending.CHECK_LICENSE', 'android.permission.WAKE_LOCK', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.BLUETOOTH_ADMIN']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.INTERNET']",
}