{
"name" : "Free VPN Proxy - Secure Tunnel, Super VPN Shield",
"url" : "https://play.google.com/store/apps/details?id=com.free.secure.tunnel",
"package" : "com.free.secure.tunnel",
"category" : "Tools",
"description" : "Secure Tunnel - Free VPN & WiFi Security Master  Which app is the best VPN in the world?  Useful - unblock, anonymous browsingprotect privacy, security agent, WiFi hotspot, fast and stable. Easy to use - free, unlimited bandwidth, unlimited time, one-touch connection.  All our efforts are just hope in your heart, Secure Tunnel is the best free VPN app. Secure Tunnel work with 5G, 4G, 3G, WiFi and all mobile data carriers.  Secure Tunnel server has covered more than 20 different regions of the world, the number of more than 5000+ proxy servers.  Our high speed VPN proxy cloud servers are located in India, Australia, Netherlands, USA, Japan, Singapore, Canada, France, Germany, UK, etc ..  - vpn for United States - vpn for Germany - vpn for India - vpn for Singapore - vpn for Canada - vpn for Russia - vpn for Japan   Unlimited Bandwidth & Unlimited Traffic  No credit card required, no payment, we promise forever free. Without any registration. Unlimited bandwidth, unlimited time, unlimited traffic, please enjoy. Easy to use, one-touch to connect to VPN proxy server. We wont limited the server bandwidth, your real connection bandwidth wil depends on your local Internet bandwidth.  So, you can get up to 100Mb/s or even crazy 1000Mb/s. We will never limited your traffic, Wifi, mobile data, surfing without worry about exceed traffic.  1. Unblock VoIP networks and video call  2. Unblock video websites  3. Bypass the school firewall, free VPN proxy school wifi.   No Logs Secure Tunnel will never store your online behavior and will never upload your privacy information!   Bypass Censorship We use multi-techonlogy to ensure the quality of our service.  No matter whenever and wherever you are, you can get our stable service.   Protect your Privacy, Anonymous & Security Secure Tunnel successfully passed the DNS Leak test, can prevent DNS leaks effectively, to provide you with fake IP, hide the real IP. Use of our VPN service can avoid your IP exposure. Secure Tunnel can protect your network traffic under the WiFi hotspot anonymous browsing, without tracking. Anonymous browsing, truly privacy protect.   Secure your Connection All traffic (UDP / TCP) is encrypted by IPSec(IKEv2) when Secure Tunnel is running. We use much obfuscation and encryption method to protect your every connection.   Secure Tunnel unique features (our strengths)   No credit card required, no in-app purchase, permanent free.  No registration required, no login or password required.  Easy to use, one-touch connection.  Fast, will connect to the fastest and most recent VPN proxy server.  Anonymous no log, no DNS leak, protect privacy.  Attention: We do not provide BitTorrent and any P2P (pier to pier) service For policy reason, this service can not be used in China. We apologize for any inconvenience caused. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CHANGE_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}