{
"name" : "Auto Exec! Easy tasker",
"url" : "https://play.google.com/store/apps/details?id=com.synetics.auto.exec",
"package" : "com.synetics.auto.exec",
"category" : "Tools",
"description" : "Auto Exec! Easy tasker is the perfect companion to Stay Alive! Keep screen awake. If existing task managers seems too complicated, try Auto Exec! its easy, its simple and well integrated with Stay Alive! Simply configure it and let its small service run in the background to serve your needs.  It will allow non technical users to easily start apps on events like:   Device Boot  Power AC/USB  Desktop Dock  Car Dock  Headset  Automate tasks like:    Automatically start applications when you reboot your device.   Easily start your nightstand clock app when you dock your device and lower your device brightness.   Start your favorite music player when you plug your headset and go back to your launcher when you unplug them.  Auto Exec! allow you to specify applications to launch when an action starts. Donators can also specify applications to launch when an action ends and can adjust the the brightness level when an action start and ends.  We made this application Ad Free. Please, support this initiative by donating using the menu option in the application. Stay Alive donators will automatically get a 10% rebate for their support!  Please use our email address for support or feature requests, as comments on Play Store dont allow me to gather enough information to help you.  Contact Us: Support Forum: Soon Google+ Community: https://plus.google.com/u/0/communities/103504696247906095281 Email: autoexec@synetics.ca  Permissions:  WRITE_SETTINGS - Needed to change device brightness settings WRITE_EXTERNAL_STORAGE - Needed to write the user configuration. READ_EXTERNAL_STORAGE - Needed to read the user configuration. BILLING - Needed for the donation option! RECEIVE_BOOT_COMPLETED - Needed to auto start Stay Alive! on boot  Tags: Auto Exec!, Tasker, Task, Automation, Automate, Triggers, Job, Manager ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.SEND_SMS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.GET_TASKS', 'android.permission.READ_EXTERNAL_STORAGE']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'com.android.vending.BILLING', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}