{
"name" : "ARC Mobile Control",
"url" : "https://play.google.com/store/apps/details?id=com.kemppi.arcmobilecontrol",
"package" : "com.kemppi.arcmobilecontrol",
"category" : "Tools",
"description" : "For the first time in welding history, you can now control and monitor your welding machine wirelessly via a smartphone or tablet computer.   Kemppis ARC Mobile Control connects to your welding machine and gives you full control of its welding parameters, the system settings, and all memory channels.  It makes adjusting the parameters fast and easy. You can even copy the settings of a welding machine to several other machines. This puts all configuration of welding parameters for a particular welding job right in your pocket, in case you need to make a backup or move from one machine to another.  ARC Mobile Control can be used with Kemppis FastMig Pulse machines and the new black series of FastMig X machines, the best you can get for professional MIG/MAG welding.   If you dont yet own a suitable FastMig welder, you can still play around with the ARC Mobile Control app in simulation mode and see for yourself how easy it is to pilot the best of todays welding machines.   The application is available in 14 languages. Just tap the menu icon to pick the one you desire.  Use the Install button now to download the ARC Mobile Control application for your phone or tablet. Please see the requirements section below for further information.   Go ahead  its free to download!  ARC Mobile Control in brief: - Adjust welding parameters and settings wirelessly - Easily monitor parameters during or after welding - Copy settings from one welding machine to another - Back up the settings of the welding machine or memory channels - Control the machine in your own language - A simulation mode is available with full functionality  Requirements: - An Android 4.0 or newer operating system on the smartphone or tablet - Connects with FastMig Pulse or FastMig X machines equipped with an ARC Mobile Control Bluetooth adapter - For connection via Near Field Communication (NFC), a mobile device that supports this feature - A range of use up to 15 m from the welding machine ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.NFC']",
"perms_with_call" : "['android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.NFC']",
}