{
"name" : "Bluetooth GPS Output",
"url" : "https://play.google.com/store/apps/details?id=com.meowsbox.btgps",
"package" : "com.meowsbox.btgps",
"category" : "Tools",
"description" : "Share your GPS location over Bluetooth to nearly any device or software. Use with popular marine and aeronautical charting programs with the comfort of your PC, maps on another tablet, Android Wear or even to your own open-source Arduino or Raspberry hardware project**.  Professional features you wont find anywhere else:   Smart-fusion positioning with full GNSS support  Share with multiple devices simultaneously  Adjustable output rate  NMEA 0183 v3.01  Widget toggle button  Course over ground calculated using time-filtered great-circle geometry  Gyro-Stabilized Headings (HDG/HDT)  Atmospheric Pressure (MDA, MMB, XDR)  Video tutorials to get you up and running fast  Free Mode: 10 minute limit per run, reconnect unlimited times. Paid Mode: No limits + Automation intents  Prefer to share over WiFi or TCP? Try our NetGPS app here. [https://goo.gl/xDGFwn]   Pair with another Android phone or tablet easily using Bluetooth GPS Provider by mobile-j.de Comfortably use your favourite apps on your spacious tablet. [https://goo.gl/6A60M6]   Recommended for use with i-Boating Lake & Marine Charts by GPS Nautical Charts on PC and Microsoft Surface tablets. [https://goo.gl/OO0VHs]  Trouble getting started? Real human support staff is available to assist you - send us an email, watch the tutorials.  Do you use this app at work or in the office? Contact us for information on white label, volume licensing and custom solutions.  All existing paid users can upgrade, completely free. Make sure to update your license app.  Location Access Permission: This app collects location data to enable sending your location over Bluetooth even when the app is closed. A persistent notification is shown while the app is running to remind you the app is running in the background. You may stop this at any time from the main page of the app. We do not share your location data for advertising.  Languages: English Minimum Requirements: Android 6 or newer  *Brand names and trademarks are property of their respective owners. We are not affiliated nor endorsed by any holder mentioned. **Connecting to an Ardruino or Raspberry project does require a compatible Bluetooth receiver.  Pirated copies may contain malware, ads, viruses, or even generate bad location data. Dont risk your vessel, aircraft, or your personal safety. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS', 'com.android.vending.BILLING']",
}