{
"name" : "Yellow Max Booster-CPU Cooler, Max Booster Cleaner",
"url" : "https://play.google.com/store/apps/details?id=com.mastudio.phone.cleaner.cool.ram.yellowmaxbooster",
"package" : "com.mastudio.phone.cleaner.cool.ram.yellowmaxbooster",
"category" : "Tools",
"description" : "Advance Max booster is easy to use android app that boost phone max, clean deeply and optimize the phone in perfect manner. Real time phone boosting, cleaning, cooling and battery monitoring with advance booster. Kill and stop background running process to reduce CPU usage, overcomes the phone slow and heat problems, more battery consuming issue that make phone leggy, slow and hang. Now clean, cool, and boost your phone with this advance fast booster. More storage, more space makes your phone faster and smoother, clean up and speed up your android phone on just one tab to optimize your phone performance. Basically advance booster kill and stop background running apps and process for deep clean phone. . It is a total Android phone performance optimization solution that combines the advanced functionality of an max phone cache cleaner, speed and fast booster, storage (junk & cache) analyzer for your phone and battery save and optimizer, phone overheat solution and reduce CPU cooler. Easy to boost android phone make it fast and smooth. Easy to clean phone for more space and more storage. Battery usage analysis and monitor battery health. Close heavy battery consuming apps and process. Max Power Fast Cleaner provides Fast cooling algorithm to cool down phone and reduce CPU Usage.  Features of Advance booster, cleaner, booster, CPU cooler  All in one tool that optimize phone performance in real time. Combination of CPU cooler, Fast Booster, Fast super cleaner, Max Battery expert.  CPU Cooler: Cool down phone  Cool down your phone by phone heat and cooling algorithm to reduce CPU usage and cool down android phone. Real time temperature monitoring and controlling to overcomes the common heating problem of the android problem. Close heavy resources and consuming apps. Best CPU cooler app 2019 that works for you in a perfect manner.  Max Phone Booster, Boost Phone and Fast Finally boost your phone and make it fast by cleaning and unnecessary and background running process to enhance and optimize phone performance. Phone protect master. Clean junk and cache files that takes more space and make phone slow. Fast boosting algorithm make phone fast and smooth. You dont need to worry about phone slow problems. Advance booster is perfect and fast solution for the android phones. Cleanup all unnecessary process, task, and auto-start apps to boost the smart phone speed.  Max WiFi Booster: Boost your WiFi Network  WiFi Boosteris best app for analyzer and boost your connection speed. Improve the internet speed enhance its performance.   Battery Monitor Master and Saver Monitor your phone battery health and its analysis. Lower down burden from the battery. Boost and optimize battery max level for longer battery life. Extend battery life and enhance its performance with battery expert.   Easy to use app for android phone optimization. A powerful max phone booster to enhance performance performance. Make it fast, smooth, max cleaning, fast cool, and WiFi signal to the next up level. Max booster of the 2019 for all the android versions. Totally free app for the android phone and tablet. Best Way to Make a Phone Faster. If your Battery is Draining Quicker, your Device Become Leggy, Freezes All the Time & it Overheats when Running Apps; its Time to Take Care of It Before it Turns into a Turtle Phone! Restore your Devices Health with Fast: Memory Booster Cleaner for Free NOW ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.RESTART_PACKAGES', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RESTART_PACKAGES', 'android.permission.ACCESS_FINE_LOCATION']",
}