{
"name" : "Ibox WMP",
"url" : "https://play.google.com/store/apps/details?id=com.intesis.iboxwmp",
"package" : "com.intesis.iboxwmp",
"category" : "Tools",
"description" : "IntesisBox WiFi gateways allow an easy Air Conditioner integration in any kind of control and monitoring system using a simple IP Protocol.  New WiFi gateways family is specifically designed for Home Automation Manufacturers or Integrators interested in offering a control solution for the Air Conditioner System, allowing them to create a simple Driver for their Home Hubs controllers. - Does not require cable installation between the Air Conditioner & the Home Controller. - Easy creation of new Drivers for any Home Controller thanks to the easy IP protocol. - Control, through the Home Automation system, the responsible of more than 50% of your electricity bill. - Possibility to auto-discover the WiFi devices installed in the WiFi network. - Firmware upgrades with new functionalities. - WiFi configuration allows Dynamic IPs or Static IPs.  Two different type of controllers available: - Specific controllers: They use the proprietary communication protocol of each AC Manufacturer allowing real bidirectional communication with the AC system, offering also advanced parameters like error signals, error codes, Power Consumption, etc. - Universal Controllers: Offers compatibility for thousands of Air Conditioner models, it only requires an Indoor Unit that has an IR receiver working with a standard Wireless Remote Controller. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_SETTINGS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}