{
"name" : "Pokétch: Shiny Hunt Counter",
"url" : "https://play.google.com/store/apps/details?id=com.poketch.app",
"package" : "com.poketch.app",
"category" : "Tools",
"description" : "Poktch is the best Pokmon companion app to track, calculate, and enhance various features of in-game play such as shiny hunting and competitive battling.  Poktch currently includes only ShinyApp with many more trackers and calculators planned for future releases.  ShinyApp The perfect shiny hunting tool. ShinyApp currently includes basic functionalities to track elapsed time and encounters, estimate shiny odds, and import/store your shiny collection.   Start a shiny hunt for any Pokmon across all 7 current generations  See beautiful HD models of the shiny Pokmon you are hunting  Set user settings such as hunt defaults and counter display presets  Set hunt details such as game, method, and shiny charm  Track the number of encounters it takes to find a shiny Pokmon  Log the elapsed time it takes to find a shiny Pokmon  Calculate the odds of finding a shiny Pokmon (chain factors not yet included)  Adjust timer and counter, reset, or cancel a shiny hunt  Log additional details post-capture such nickname and pokball  Favorite and share your shiny Pokmon with friends on social media  Build your shiny collection  Manually upload existing collected shiny Pokmon  DISCLAIMER PoktchApp is an unofficial, free fan made app and is NOT affiliated, endorsed or supported by Nintendo, GAME FREAK or The Pokmon company in any way. Some images used in this app are copyrighted and are supported under fair use. Pokmon and Pokmon character names are trademarks of Nintendo. No copyright infringement intended.  Pokmon  2002-2018 Pokmon.  1995-2018 Nintendo/Creatures Inc./GAME FREAK inc. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}