{
"name" : "Volume Booster Equalizer : Sound Booster PRO Plus",
"url" : "https://play.google.com/store/apps/details?id=com.volumebooster.soundbooster.booster.bassbooster.equalizer.musicequalizer",
"package" : "com.volumebooster.soundbooster.booster.bassbooster.equalizer.musicequalizer",
"category" : "Tools",
"description" : "Are you looking for a professional volume booster app with Floating control window for your smartphone or volume booster for android? Do you want a  powerful equalizer sound booster app that can let you boost and increase the sound instantly? Lets download  Volume Booster Equalizer Sound Booster Pro for free. The perfect sound booster is ready for you now with Bluetooth volume booster! it is also AUX booster for cars which can also be AUX bass booster  Features:  - FREE & EASY TO USE! bass booster app - Boost volume super loud with equalization - Support all music media volume. - Support Bluetooth & external speaker. - bass booster with powerful  - Music equalizer - Sound equalizer - aux booster  Volume Booster Equalizer Sound Booster is one of the best sound booster tools, with superb graphics and good interaction design. Its the best way to boost all the sounds volume to max. it increases the music media volume and also the headphones and external speaker volume. Take a break and enjoy your favorite music, with song bass booster watch videos and play games with super loud volume. Using bass boost . volume booster for android  Volume Booster Equalizer Sound Booster is different from other audio boosters. It is good speaker booster .it combines equalizer sound booster and high quality to improve music experience. Enhance the volume of your favorite song, video, audio books, radio in one click! If you love good and qualitative music, youre going to love our Volume Booster Pro app! this is best for bass boosting. it is with AUX booster  its not so easy to control and boost the volume very loud with high quality! But with our application bluetooth volume booster, you will be able to feel the deep atmosphere of the concert hall just with your phone. can be used as AUX bass booster  Why you have to download and install Volume Booster Pro  Equalizer Sound Booster on your android smartphone instead of other speaker booster and bass booster apps? - Volume Booster Equalizer Sound Booster is very easy to use. It has bass booster. just install it for free on your device and use equalizer pro. The best thing is that you dont need to create an account before using our app. we have 3 band equalizer, 4 band equalizer and 5 band equalizer it depends on your device. use as AUX booster  - Volume Booster Pro  Equalizer Sound Booster Boost the media volume upto 200% with this equalizer pro  - Volume Booster Equalizer Sound Booster is free and it also contains music equalizer, it has the best music equalizer editor. these day its very important to have audio equalizer . speaker booster  Volume Booster Equalizer Sound Booster is a new refreshment in this popular tool category. If you love to boost your sounds volume, youll love Volume Booster Pro tool. volume booster for android, auxiliary amplifier  Download it for FREE and make all the sounds of your device much louder. now with auxiliary amplifier for cars ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.SYSTEM_ALERT_WINDOW']",
}