{
"name" : "Smart Touch (Easy Touch - Assistive Touch)",
"url" : "https://play.google.com/store/apps/details?id=com.blk.smarttouch",
"package" : "com.blk.smarttouch",
"category" : "Tools",
"description" : "Smart Touch is an easy touch, assistive touch tool which using a powerful floating ball on the screen to use frequent shortcuts, functions or application quickly and easily. Smart Touch also provides one hand feature to perform physical key easily.   It supports some other useful features such as: Screen shot (Screen capture), Screen Recording, Ram booster (Ram Cleaner). You can also quickly access to all your favorite shortcuts, favorite applications, games, settings and quick toggle too.   In another hand, Smart touch seems to be a type of Smart Intelligent Assistant. It is very useful for big screen smart phone.   Assistive Touch for Android - Virtual Home key - Virtual Back key - Virtual Power key (Android 5.0 up) - Virtual Volume key, quick touch to change volume and change sound mode - Virtual Recent Panel key - Virtual Volume Up/Down key - Ram booster and clean memory. Speed up your device and save battery from your home screen.  Quick Access (Quick launching) - Easy touch to open your favorite application - Direct opening application from circle menu - Direct opening shortcuts (Direct calls, Direct message, Direct contact...) - Direct to control quick settings  Advanced tools  - Easy touch to screen recording, supporting attached image or fron camera (included audio form mic, media system) (Require Android 5.0 and above) - Easy touch to screen shot ((Require Android 5.0 and above) - SOS signal   Quick settings  - Rotation setting button - Open Notification - Location on/off settings - Wifi on/off settings - Airplane mode settings - Bluetooth on/off settings - Flashlight on/off settings - Data settings - Sound control - Ringer mode - Setting access key  Customize - You can change icon of Smart Touch with many pretty icon, totally free with more than 40 items - You can change icon of Smart Touch with your image (from gallery or camera) - Customize size and alpha of floating ball - Drag and drop to change position of action - Able to customize the number of actions (the maximum is 10)  - Able to add more actions from screen  Language - Supported languages: English, German, French, Thailand, Spanish, Russian   Sensitive Permission - This app uses Accessibility services  It is for physical disabilities, Smart Touch provides powerful single hand features, you can use one hand to operate the phone, switch apps easily, replacing the navigation hard keys, which can hardly be controlled by one hand. Please be assured that Smart Touch will not collect any of your private information, it is only for performing global action such as BACK, RECENT, POWER.  - BIND_DEVICE_ADMIN: This app uses the Device Administrator permission which is only used to lock screen (pressing sort key instead of physical power button) and turn off the screen of your device.   - CAMERA: To turn on Flashlight and shortcut to snap photos. - CALL_PHONE: Add contacts to Action so you can make calls. It is for Direct Call shortcut not from our application inside.  Note - To prevent the app stopped by OS: System Settings > Battery > Battery Optimization > Add apps >Smart Touch > Checked Dont optimize (From Marshmallow) - If your brand is XIAOMI, please execute the following below: you must go to security ->choose permission -> permission -> SmartTouch and turn on pop up window. Follow up, you go to security -> Permisson -> AutoStart -> turn on SmartTouch. - Open app->uninstall menu if you can not uninstall the application. It is due to policy of google when you want to use Lock Screen feature because it requires Device Admin permission. - Screen shot (Screen capture), Screen Recording is only supported Android 5.0 up  If your phone meets some above notes, please do not give bad review. It is not our bug, it is a limitation from Android technical. Please contact to our developer for helps. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.EXPAND_STATUS_BAR', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.EXPAND_STATUS_BAR', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
}