{
"name" : "Cellular Scanner - Document Scanner",
"url" : "https://play.google.com/store/apps/details?id=com.appsfuturo.scannerparacelular",
"package" : "com.appsfuturo.scannerparacelular",
"category" : "Tools",
"description" : "Mobile Scanner is an application where you will find the necessary tools to scan documents and images, in addition to that you will also be able to scan bar codes and QR codes, and where that will be achieved using our application and the Camera on your cell phone.  If you were looking for a powerful mobile scanner with extensive features and that adamas of that was incorporated in your cell to take it anywhere and use it anywhere this app will love.  With this mobile scanner app you also have the option to save your documents in PDF format, so you can archive, edit and share your files with more people.  Scanner for mobile is an app that is constantly developing, always incorporating new features and improving the ones you have, so you always have the best scanner tools on your cell phone for free.  Lets take a look at what youll find in the mobile scanner application:  1- Document Scanner  This function is very useful because it will help us to scan any document or image you want, our application uses the camera of your cell phone to get an image of the document, image that you can save in PDF format, and then edit it as you like.  2- Viewing and Editing PDF  This function allows us to view the images we have stored in PDF format, then transform and edit them as you like.  3- Barcode Scanner  This feature allows us to scan any bar code you want, and allows us to easily and quickly view the encrypted information in the specified code.  4- QR Code Scanner  With this option we can scan any QR code, allowing us to do it with multiple options.  5- Create list  This option is quite special, since it will allow us to sort the QR codes we have scanned in the form of a list.  6- Notes  This last function allows us to create notes quickly on some document or idea that we have, being that it is easier to remember your ideas.  There is no doubt that the mobile scanner app is a necessary tool that you can not miss on your cell phone.  Do not wait any longer and download our app right now, so you have the best mobile scanner on hand for free. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.USE_FINGERPRINT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}