{
"name" : "Device ID",
"url" : "https://play.google.com/store/apps/details?id=com.evozi.deviceid",
"package" : "com.evozi.deviceid",
"category" : "Tools",
"description" : "Simple app to get your Device Info/ID/local IP/MAC addresses & Serial that allow you easily copy and share the ID of your mobile device.  An ideal tool for developers, customer support and user.  NOTE: this app doesnt send your ID to the internet so your information is safe.  For paranoid users, you can get Device ID without any network permission at : https://www.evozi.com/l.php?go=deviceid_no_network This will disable Local IP Address and MAC address.  Supported : Google Services Framework Key ID Android ID IMEI Subscriber ID (IMSI) SIM Card Serial WiFi MAC Address Ethernet MAC Address Bluetooth MAC Address Bluetooth Paired MAC Address Hardware Serial Device Build Fingerprint Please leave some suggestion.  Permission Explanation : INTERNET is used to get your local IP address BLUETOOTH is used to get your Bluetooth MAC address READ_PHONE_STATE is used to get your IMEI, IMSI and SIM Serial ACCESS_WIFI_STATE and ACCESS_NETWORK_STATE is used to get your MAC address READ_GSERVICES is used to get your Google Services Framework ID You are allowed to disable the permission using root app such as Permission Manager if you are paranoid  --------- For user that wanted to get both SIM Serial in DUAL SIM Phone, The default SDK does not have support to handle dual SIM phones. The function will only return one number, most likely from the first active SIM card. ---------  Links : Facebook : https://www.facebook.com/evozi/ Beta Testing Group :  https://www.facebook.com/groups/evozi/  NOTICE : Instead of rating 1 or 2 star,please email to support@evozi.com or leave a comment so that we can fix or improve it. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "[]",
}