{
"name" : "Image to DOC – One-click Converter",
"url" : "https://play.google.com/store/apps/details?id=com.free_simple_apps.photo2docx",
"package" : "com.free_simple_apps.photo2docx",
"category" : "Tools",
"description" : "The most simple Image-to-Word Converter in the world     Compose multiple images in one .docx document for easy sharing   Lightweight and easy-to-use app. Only one click for creating .doc from photo.   Features  takes a photo of your document with instant PDF creation  converts image to docx from gallery using share option  create Word-compatible documents from JPG, PNG or from camera shot  creates multiple-pages .DOCX from multiple images  portrait or landscape orientation for document and photo  standard .docx file, which can be opened in several apps (e.g. Word, Open Office) which support Office Open XML file format  sends your DOC file via email  shares DOC in any other way  saves a copy on your device    Step-by-step instruction  1. Take a photo.  Thats all, your .doc is ready, you can share it in any way you like or save it to disk.    How to create one .doc file from several images 1. Press Gallery button 2. Select one or more images in gallery 3. Choose how to share resulting DOC    Mission  We believe in simple apps, thats why we to create our own converter for our own purposes. The simple and good one.   Our converter is easy to use. You need a minimum of clicks for basic tasks. And you will get the result as soon as possible.  Please share your impressions about our converter  visit our Facebook page https://www.facebook.com/free.simple.apps  And have a nice day!   * * * * * * *  FREE SIMPLE APPS  is a team of professionals. Our goal is to create simple and usable applications helping the people around. We believe that it is possible to create one-task applications for most daily jobs. And we do it.  Our second interest is easy entertainment apps. We think we can spend our free time efficiently and use every spare minute more pleasantly.  Join the Facebook community to find tips, comments and latest news: https://fb.com/free.simple.apps We love any feedback! Tell us what you think about our apps  use facebook or email to contact us. Tell us any difficulties you face in everyday life  perhaps part of these problems can be solved with the right mobile app or web service.   Thank you!    ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}