{
"name" : "Notification Light / LED S20, S10 - aodNotify",
"url" : "https://play.google.com/store/apps/details?id=com.jamworks.alwaysondisplay",
"package" : "com.jamworks.alwaysondisplay",
"category" : "Tools",
"description" : "You need a notification light / LED for your Galaxy S20 / S10 / Note 10 or A51 series?  With aodNotify you can easily add a notification light / LED directly to Samsungs Always On Display!  You can select different notification light styles and show the notification light around the camera cutout, screen edges or even simulate an notification LED dot in the statusbar of your Galaxy S20 / S10 / Note 10 or A51 series device!  As the notification light is integrated in Samsungs Always On Display it has minimal battery consumption and doesnt drain your battery like other apps which keep your phone awake!  If you dont need the Always On Display, the app can also activate the Always On Display (AOD) only on notifications or show the notification light / LED even without the Always On Display!  With the notification preview feature you can directly see if you have important notifications without waking your Galaxy S20 / S10!   MAIN FEATURES  Notification light / LED for Galaxy S20, S10, Note 10 and others!  Low energy notification preview (android 10+)  Activate Always On Display (AOD) only on notifications  Charging / Low battery light / LED   MORE FEATURES  Notification light styles (around camera, screen, LED dot)  Custom app / contact colors   ECO animations to save battery  Interval mode (on/off) to save battery  Night times to save battery  Minimal battery consumption   BATTERY USAGE PER HOUR ~   LED - 3.0%  LED & INTERVAL - 1.5%  LED & ECO ANIMATION - 1.5%  LED & ECO ANIMATION & INTERVAL - 1.0%   NOTIFICATION PREVIEW - 0.5%   ALWAYS ON DISPLAY - 0.5%   Other apps use up to 5-10% per hour!   DEVICES   S20 / S20+ / S20 Ultra  S8 / S9 / S10 / S10+  Note 8 / Note 9 / Note 10  A51 / A71  A6 / A7 / A8 / A9  A30 / A50 / A70 / A80  C5 / C7 / C8 / C9  M30   NOTES   Samsung may block this app with future updates!  Please check if the app is compatible before updating phone software or always on display!  Altough we never experienced any screen burn in issues on our test devices, we recommend to not keep the notification light / LED active for a long time! Use at you own responsibility!  Samsung Galaxy is a protected trademark of SAMSUNG ELECTRONICS ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'com.android.vending.BILLING']",
}