{
"name" : "Bubble level:Spirit level",
"url" : "https://play.google.com/store/apps/details?id=com.bubblelevelruler.spiritlevel",
"package" : "com.bubblelevelruler.spiritlevel",
"category" : "Tools",
"description" : "An advanced utility application to transform your smartphone into a bubble level and spirit level, a very useful instrument designed to indicate the angle of an objects placement, to find whether a surface is properly aligned horizontally (level) or vertically (plumb). Properly calibrated and amazingly designed, makes the app very handy, accurate, fast, simple to use and an incredible addition to the existing capabilities of your smartphone.   The application is designed to mimic a traditional modern level meter, which has a slightly curved glass tube incompletely filled with a liquid, usually a colored spirit or alcohol, leaving a just a bubble in the tube for indication. A slight tilt and inclinations the bubble moves away from the center position, which marks the perfect horizontal or vertical positioning. The data this application represents can be considered as real level meter data.  Where can you use Bubble Level?  This level is extensively used in industries like construction, carpentry, and photography and in homes to determine if objects you placing or things like frames and clocks you are hanging leveled horizontally or vertically. The application can help you create properly leveled pieces of furniture, help you when hanging frames, paintings or other items on the wall, level a billiard/snooker table, table tennis table, set up a tripod for photographs, level floor while construction and much more.  You can recalibrate the app by opening calibration, putting your device screen facing up on a smooth leveled surface and press SET. Press RESET to get back to the app default factory calibration. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}