{
"name" : "Lux Lite",
"url" : "https://play.google.com/store/apps/details?id=com.vitocassisi.luxlite",
"package" : "com.vitocassisi.luxlite",
"category" : "Tools",
"description" : "The original custom auto brightness solution for Android.   Please note that this is the free version of Lux. For the full version please click the following link. Purchasing the full version supports further development of Lux, and is truly appreciated. http://market.android.com/details?id=com.vito.lux   To put it simply, Lux kicks the pants off of Androids stock brightness manager, and its worth every cent. - Lifehacker  Lux is a third-party app that allows you to easily calibrate your phones brightness sensor, saving you battery power and reducing eye strain if your phone is normally too bright in dark rooms. - HowToGeek   Lux isnt your ordinary brightness app. It intelligently adjusts the brightness of your display based on the environment youre in. If you step into a dimly lit room, Lux will automatically lower the brightness of your display to make it not only comfortable to read, but to also preserve battery power.   Lux is also able to adjust the screen temperature of your display automatically to make it appropriate for night usage. At sunset, you can have Lux automatically warm your display and switch to your Night profile. If youre an astronomer, you can enable astronomer mode to cut out harsh white light. If you have a root enabled phone, you may even be able to apply these enhancements at a low level with Luxs plug-in system.   Perhaps the best thing about Lux is that you can teach it how to behave. If the backlight is too bright or dim for your liking, simply open the provided Dashboard, adjust the brightness slider to the level you desire, then hold the link button. Lux will use this new link as a reference in future.   Give it a go! I want you to test Lux for more than the 15 minute refund period offered by Google. I understand that some devices may not have the best quality light sensor, and that you may need more time to play around with settings. If you find that Lux doesnt suit you after the 15 minutes is up, you can request a refund within a week of purchase via e-mail - no questions asked.    FEATURES  Stable, custom auto brightness with root plug-in support.  [Paid Only] Use your ambient light sensor or camera(s) to read in ambient light.  [Limited] Subzero brightness for night viewing.  [Paid Only] Select between Auto, Day, Night, Car and Cinema light profiles  [Paid Only] Automatic night mode. Change the colour temperature of your display for comfortable night time viewing.  Astronomer mode. Adds a red filter to your display to preserve the eyesight of stargazers.  [Limited] Power-user settings such as choice of interpolation, filters, and linked sample editing.  Add app specific exceptions via sleep mode.  [Paid Only] Customisable fade for backlight adjustments.  Tasker and Locale support  Battery efficient.  Backup to SD.  No ads or other nuisances.  Note: Please disable other brightness apps before using Lux. The author is not liable for any issues caused when using this app.   Want Lux in your language? Join the translation project here: http://crowdin.net/project/lux-auto-brightness   PERMISSIONS TAKE PICTURES AND VIDEOS: Used to read in luma values if camera input is selected.  DRAW OVER OTHER APPS: Required for night/astro mode.  READ PHONE STATE: Required to prevent Lux from interfering with phone controls in Android 4.1.  MODIFY SYSTEM SETTINGS: Brightness is a system setting, as is toggling the default auto brightness.  RETRIEVE RUNNING APPS: Required to make the sleep list functionality work, so Lux can disable itself when certain apps are in the foreground.  COARSE LOCATION: Required to automatically calculate sunrise/sunset times.  IN APP BILLING: Required for purchasing future device specific root only plug-ins, to enhance functionality. (Not currently used.)  Need assistance? Have questions? Contact me via the Send Feedback button in Lux settings, or via email at vcas720@gmail.com. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_SUPERUSER', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAMERA', 'android.permission.GET_TASKS', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_SUPERUSER']",
}