{
"name" : "Toolwiz AppLock (Open Source)",
"url" : "https://play.google.com/store/apps/details?id=com.cleanwiz.applock",
"package" : "com.cleanwiz.applock",
"category" : "Tools",
"description" : " Toolwiz App Lock(LockWiz) is a open source project from Toolwiz. It is an amazing way to protect your privacy and security on your Android phone. With LockWiz, you will never worry too much about the leakage of your personal sensitive date. Once you set lock for individual APPs and encrypt multimedia files  nobody will be able to access them without a correct master password - giving you entire control over who sees what.   Source Code: https://github.com/Toolwiz/ToolWizAppLock    Whatever you want to keep it to yourself, locking down your privacy has never been simpler at your fingertips. Now you can stay calm when you leave your phone, or even just sit and wait there to see whos been snooping on your phone.    Features:  Protect your messages, SMS, call logs, photos, videos, emails and more private content on your Android device.  Keep your social media APPs protected   Facebook, Twitter, Instagram, Pinterest, Tumblr, WhatsApp, WeChat etc.  Set controls for the games and APP store - prevent your kids from game addiction and random purchase.  Encrypt almost all multimedia files your phone: images, GIF animation files, documents, videos & audios and other files.    Top features of LockWiz:  Brand new user interface: simpler, sleeker, more intuitive and easier to use.   Take a snapshot of the person who entered wrong password up to three times.  A new cool Vault - its where you can encrypt strongly sensitive files and keep hold of them in it.   LockWiz can now be protected against accidental deletion. So it will not be deleted, unless the protection is removed.   Contact us Fore more information, please visit http://www.toolwiz.com Find us on Facebook: https://www.facebook.com/toolwizfamily If you have any question about LockWiz, please send an email to James@toolwiz.com  Toolwiz AppLock uses the Device Administrator permission. To enable Advanced Protection, please activate Toolwiz AppLock as device administrator. Its only used for preventing intruders uninstalling Toolwiz AppLock. Please be assured that Toolwiz AppLock will never use this permission to access your privacy data. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.launcher.permission.UNINSTALL_SHORTCUT', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.android.vending.BILLING', 'com.android.launcher.permission.READ_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.GET_TASKS', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FLASHLIGHT', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.CAMERA', 'com.android.launcher.permission.READ_SETTINGS', 'com.android.vending.BILLING', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}