{
"name" : "All Language Translator - Universal translator",
"url" : "https://play.google.com/store/apps/details?id=com.universal.alllanguagetranslator.withspeach.internationaltrnslator",
"package" : "com.universal.alllanguagetranslator.withspeach.internationaltrnslator",
"category" : "Tools",
"description" : "The application is perfect for language translation and does free translation for all.if you want to travel around the world and you want to interact with the other people around the world. language translation helps you interact with the people of the other countries of the world and helps you in traveling and interacting with others as well. Translator is your best language translator,We provide voice and text translation to enable you to communicate without any barriers to all parts of the world in the best possible manner.   The international language translator is best place to find the translation of all the languages of the world with both translator with speech and text translation. This is the best app for free and fast translation ,which can be used like a dictionary as well for all the languages of the world. if you are a student ,Tourist,A guide,or a traveler it will help you to learn the language.   Feature : ========= * All Language Translator for all the world languages * Translate / Interpret between any languages of world * Speech Recognition support, Translate spoken text. * Very useful app for easy and fast translations, which can be used like a dictionary * Its completely free, faster and very easy solution for translations.  * Beautiful and easy to use interface * Instantly translate words and sentences * Easily copy and paste sentences to speak n translate * Translate spoken text language * Free All Language Translation * Listen to the translation and speak the translated text * Share your translation with friends and family * Text To Speech support. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}