{
"name" : "Surfree VPN - Free VPN Proxy & Secure Service",
"url" : "https://play.google.com/store/apps/details?id=com.free.go.vpn.ivn",
"package" : "com.free.go.vpn.ivn",
"category" : "Tools",
"description" : "Why use Surfree VPN?  SNS, games or other content are blocked by the region; privacy leaks, etc. If you have these troubles, Surfree VPN is worth your try.  Key Functions:   Unblock  Bypass the firewall and access blocked content.   Privacy protection  Anonymous browsing, truly privacy protection   Game Acceleration  Surfree VPN perfectly accelerates the most popular games.   Surfree VPN successfully passed the DNS Leak test, which can effectively prevent DNS leaks.   Bypass the firewall, disguise your location to provide you with fake IP, hide the real IP.   Surfree VPN will never record your online behavior and will never upload your privacy information!   All traffic (UDP / TCP) is encrypted when Surfree VPN is running.   Features:  FREE & Unlimited   Unlimited Speed  Unlimited Use Time  No Credit Card Required  Free Forever  Easy to Use   Minimalist Design  Zero-configuration  One-touch to Connect  Fast & Stable   Our high-speed VPN proxy servers are located in Australia, Bulgaria, Hong Kong, Netherlands, USA, Japan, Singapore, Canada, France, Germany, UK, etc...   The high-speed proxy server has covered more than 10 different regions of the world, the number of more than 100 proxy servers.   Dont forget to give us a 5-Star () rating, if you like us.  Dont forget to share it with your friends, if you would like to help us. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}