{
"name" : "Prayer Times - Mosque Finder, Jamat Time & Qiblah",
"url" : "https://play.google.com/store/apps/details?id=com.hl.deeniyat.prayertimes",
"package" : "com.hl.deeniyat.prayertimes",
"category" : "Tools",
"description" : "In the Name of Allah, Most Gracious, Most Merciful.  Deeniyat Educational and Charitable Trust is pleased to announce the Islamic android app for Prayer Times, Qibla direction and Daily Quran & Hadees. The application provides all prayer timings for any given location in the world. The app makes use of your device GPS and/or Network for your current location, and displays prayer times for that particular day/time.   Below are the major features of the app   Prayer Times The app provides accurate 5 prayer times for the users current location without using internet(offline) using users devices location services. The app also covers Sehri End , Ishraaq, Chaasht and Iftaar times round the year which is not covered by any app for such type. Day Light Saving adjustment for Northern and Southern countries are also taken into consideration wherever applicable.   Mosque Finder with Jamat Time This is one of the key and unique feature of the app. The app finds nearby mosques based on user location. Not just this, it also helps to provide the Jamat Time of any prayer in the nearby mosques. Users are welcome to contribute for the data update in the live app   Selected Mosques Users can mark the mosques in their selected list to get notified about the time changes for prayer Jamat times   Daily Quran & Hadees One of the distinct feature of the app is it displays different Hadees or Ayat from Quran for every prayer. The content can be instantly shared as well over other communication channels. The content is available in all the available languages based on user language selection within the app.   App Widget The app is available with App widget for prayer times and Hadees, which can be placed on the home screen for quick access. The widget updates prayer name and time automatically for every prayer with beautiful background as per the current prayer time. The Hadees also changes along with every prayer   Qibla Direction The app makes use of your devices compass to show you Qiblah direction in addition to other directions of East, West etc   City Selection Added Option to check Prayer times for 27000+ cities offline   Access All Hadees You can access all Ahaadees at once on all hadees screen   Enhanced Share Function You can now share any Hadees from within the app and from widget as an image in multiple languages   Prayer timings for Entire year (Taqweem) You can access prayer timings for entire year on this yearly timing calendar. The timings would be based on that specific location   Location The app would also display the current country and city if internet connection is available   Prayer Settings The app provides maximum number of possibilities for prayer times settings like Calculation methods, Asr juristic method, high latitude calculations and 12/24 hour time format. Day Light Saving adjustment for Northern and Southern countries is inbuilt within the app.   Alarm The app has in-build support for playing Alarm, ringtone or notification when it is prayer time. The default option is off. You can enable this from settings.   Jamaat Time Change Alert The app shows notification for any jamaat time change in users selected mosque section once every day.   Help Help section provides details about various section or screens within the app.   Languages The app currently supports English, English Transliteration, Urdu, Arabic, Hindi and Gujarati languages. We would be supporting Tamil, Bengali and more languages soon Insha Allah.   Completely Advertisement Free   Please report if you see any mistakes or have any suggestions for us. We would address it at the earliest Insha Allah.  Jazakallah Deeniyat Educational and Charitable Trust ",
"desc_perms" : "['android.permission.READ_CALENDAR', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_BACKGROUND_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}