{
"name" : "PortDroid - Network Analysis Kit & Port Scanner",
"url" : "https://play.google.com/store/apps/details?id=com.stealthcopter.portdroid",
"package" : "com.stealthcopter.portdroid",
"category" : "Tools",
"description" : "PortDroid is a Network Analysis Application that helps Network Administrators, Penetration Testers and Hackers with several useful networking tools including:  Port Scanning  Identifying Devices on Local Network   Ping  Traceroute  Wake-On-Lan (WoL)  DNS Lookup  Reverse IP Lookup  Portscanner - Scans and ip for open TCP ports, optionally it will use Banner Grabbing on with each port in order to gain more information or discover a web service. When a service is found on a port external applications will be offered to deal with certain protocols (ssh, telnet, http, https, ftp, smb etc.)  Local Network Information - Find out whos on your wifi network. This will identify all devices on the same network and from here you can probe further and open the portscanner on any of the found devices.  Ping  Check if a host is online and how fast it responds  Traceroute - Perform a traceroute and geo-locate IPs to view on map  Wake-On-Lan - Wake compatible WOL devices.  DNS Lookup - Lookup the DNS records for a website  Reverse IP Lookup - Find out websites that are hosted on an IP address  Permissions Required:  Internet - Needed for remote connections (ping, port scan etc)  Wifi Connections - Needed to analyse wifi connections  Network Connections - Needed to analyse non-wifi network connections  In-App Purchases - To upgrade to pro version to receive additional features  This app is highly configurable and in active development, so feature requests and bug reports are appreciated! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}