{
"name" : "Translator App Free - All Languages Translator",
"url" : "https://play.google.com/store/apps/details?id=com.all.languages.translator.texttospeech.voice.translation",
"package" : "com.all.languages.translator.texttospeech.voice.translation",
"category" : "Tools",
"description" : "Language Translator: interpreter dictionary with over leaks of all Language words is translator app free. In this translator free, meaning of words and translation of sentences are provided with definitions. If you are looking for translation app to translate from one language to another, Language Translator: interpreter is available for what you need. This language translator is an awesome translate app. Translate free by using free translator to translate between multiple languages. No more communication problem for tourists or language problem in unknown places with this free translator. This free translator app is speech translator also. Text translator, free speech translator to translate voice. Free translator make it easy to learn language in a real like language learner platform to speak and translate over voice to text and find out the meaning of your desired statements.  With the Language Translator: interpreter, you can translate your work from one language to another language directly. This translator app translates the complete phrase and sentences in real-time. This free translation app becomes really handy for your translation needs when you are traveling across countries with different languages. With this free translator, you can find out what each phrase or word means in a different language.  Learn a language, speak and translate languages by using this multi language translator and also speak and translate like a pro-language learner. Free translate app to learn a language of any type and enjoy an awesome translator for all languages. Preserve everything you want with this language translator: interpreter Learn lots of languages using this global translator with a very responsive User Interface. Its really cool to have this quick translator app to use in real life to solve any problem we fetching with language.  Whether you want to know the meaning of a particular word or want to understand what your word is called in a different language, Language Translator: interpreter has an answer to all your language translation needs with a lot of conveniences. Just get started with this quick translator. It is free translation app to download.  Following languages can be translated:  Afrikaans, Arabic (), Bengali (), Bulgarian (), Bosnian (Bosanski), Cantonese (), Catalan (Catal), Chinese Simplified (), Chinese Traditional (), Croatian (Hrvatski), Czech (etina), Danish (Dansk), Dutch (Nederlands), English, Estonian (Eesti), Fijian, Filipino, Finnish (Suomi), French (Franais), German (Deutsch), Greek (), Haitian Creole, Hebrew (), Hindi (), Hmong Daw, Hungarian (Magyar), Icelandic (slenska), Indonesian (Indonesia), Italian (Italiano), Japanese (), Klingon, Korean (), Latvian (Latvieu), Lithuanian (Lietuvi), Malagasy, Malay (Melayu), Maltese (Il-Malti), Norwegian (Norsk), Persian (), Polish (Polski), Portuguese (Portugus), Quertaro Otomi, Romanian (Romn), Russian (), Samoan, Serbian-Cyrillic (C-), Serbian-Latin (Srpski-latinica), Slovak (Slovenina), Slovenian (Slovenina), Spanish (Espaol), Swahili (Kiswahili), Swedish (Svenska), Tahiti (Tahitian), Tamil (), Telugu (), Thai (), Tonga (lea fakatonga), Turkish (Trke)  Features:  Language Translator: interpreter is the best language translator app among all other language translators that offer online translation. Beautiful and easy to use and attractive interface. Instantly translates words and sentences. Easily copy and paste sentences. Voice translator free Translate spoken text. Listen to the translation. Text To Speech support. Speech Recognition support, Translate spoken text. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}