{
"name" : "CalcNote - Notepad Calculator",
"url" : "https://play.google.com/store/apps/details?id=com.burton999.notecal",
"package" : "com.burton999.notecal",
"category" : "Tools",
"description" : "CalcNote is a new generation of calculator designed for the smart phone. Just type a expression, the answer will be displayed instantly. No need to tap equals. It works like notepad or your word processor, you can see multiple questions and answers all at once. Its like a spreadsheet but much easier and simpler. If you make a mistake, you dont need to start again, you just fix the wrong expression.  Instant calculator & realtime results CalcNote will instantly evaluate any mathematical expression and display result in real-time. With a Notepad-style interface you write operations on each line and see results instantly. You can combine text-lines with calculations.  Multi-line calculations & references Every line in CalcNote is evaluated so you can write different operations on each. It even allows referencing lines as in Spreadsheet so you can do multi-line combined calculations (i.e. $2+$3 adds up the results from line 2 and 3).  Different keypads with operations Swipe right-left to switch between different keypads with multiple operations you can perform. Regular mathematical operations, logarithmic, trigonometric functions (i.e. sin, cos), permutations/combinations as well as a percentage calculator and unit converter.  Save & Export In CalcNote you can organize your calculation sheets, save them individually and even export expressions if you want to use them elsewhere (i.e. in Spreadsheet, in a scientific paper, etc.).  Customize appearance You can customize CalcNote by changing its background/text color, showing/hiding line numbers, fonts, display format, customize the keypad layout and much more.  Detailed Features List - Regular mathematical operations - Multi-line calculations - Supports mix text and numbers in your calculations - Supports a line reference - Supports declaring a variable inline - Percentage calculations - Modulo operation - Supports hexadecimal, octal and binary operations - Square root, Cube root - Power, Factorial - Permutations, Combinations - Trigonometric functions - Aggregate functions - Logarithm, Natural logarithm, Natural exponential function - Customizable display format (European style and Indian style) - Customizable appearance - Customizable keypad layout - Unit conversion (Area, Length, Weight, Speed, Temperature, Time, Volume) - Currency conversion (Supports 156 currencies and 5 cryptocurrencies) - Saving a expression - Exporting a expression  Please refer to online manual for more details https://github.com/burton999dev/CalcNoteHelp/blob/master/documents/en/index.md  This is a free version of CalcNote, which displays ad at the top of the screen. If youd like to remove ads, you can upgrade to Pro. https://play.google.com/store/apps/details?id=com.burton999.notecal.pro  Disclaimer burton999 makes no warranty as to the accuracy or reliability or suitability of any calculation results or information provided through the CalcNote. burton999 is not also responsible for any damages, direct or indirect, which may occur by the calculation results or information provided through the CalcNote.  If you have any concerns, feedback, or questions email me at burton9999dev@gmail.com I hope this app will be helpful for you. Many thanks. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}