{
"name" : "Smith Chart",
"url" : "https://play.google.com/store/apps/details?id=com.ericyf88.smith_chart2_free",
"package" : "com.ericyf88.smith_chart2_free",
"category" : "Tools",
"description" : "Features: NEW FEATURES:  Automatic Stub Matching, Transformer Matching (quarter-wave, Binomial, Chebyshev transformers)  Stripline and Microstrip calculator (PRO ONLY)   Matching ladder network circuit with serial/parallel capacitors, serial/parallel inductors, serial/parallel resistors  Add Q, Gain (GA, GP), VSWR, Stability (Source, Load) circles  S-parameter s2p file import capability.  Free version enables up to 2 matching circuit elements.  User friendly with adjustable seek bars and edittext boxes to move element parameter and the resultant impedance value in the smith chart with high precision.  First starting data point can be entered using either normalized impedance or reflection coefficient.   System impedance and operating frequency can be adjusted.  Provides additional details such as VSWR, Q, Return loss, normalized admittance value and transmission line physical length at each impedance value.  Capable of undoing circuit element and retrieving previous states.  Every impedance matching stage is clearly annotated with different colored line and number.  Serial transmission line, open-circuit and short-circuit stub matching elements.  Transmission line, open-circuit and short-circuit stubs can be designed with different line impedance and effective relative permittivity. Line physical length is provided as well.  Impedance sweep over a range of frequencies. Frequency sweep resolution can be adjusted.  Transmission line, open-circuit and short-circuit stubs can be designed with different line impedance and effective relative permittivity. Line physical length is provided as well.  Impedance sweep over a range of frequencies. Frequency sweep resolution can be adjusted.   GET PRO:  Up to 7 matching circuit elements!  Custom Q and VSWR circles  S-parameter s2p file import  Parallel Stub Matching  Transformer Matching ",
"desc_perms" : "[]",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}