{
"name" : "Magnifier",
"url" : "https://play.google.com/store/apps/details?id=com.binghuo.magnifyingglass.magnifier",
"package" : "com.binghuo.magnifyingglass.magnifier",
"category" : "Tools",
"description" : "Magnifier  This application turns your phone into a digital magnifier. You dont need to carry a magnifier anymore. When you want to magnify small things and texts, Smart Magnifier can be the solution.   Magnifier is a free android application. Simplest tool that anyone can use it without training. The best app that help you magnify small text. With Magnifier, you will read clearly and easily, and never missing anything. Whats more, you can zoom in or zoom out the camera by your fingers. Also smart magnifier can use flashlight whenever you need.  Magnifier is a useful application which allows you to turn your phone into a Magnifying Glass.  Features: - Zoom: from 1x to 10x. - Flashlight: Use flashlight in dark places or during night. - Take Photos: Save magnified photos on your phone. - Photos: Browse saved photos and you can share or delete them. - Freeze: After freezing, you can view magnified photos in more detail. - Filters: A variety of filter effects to protect your eyes. - Brightness: You can adjust the brightness of the screen. - Settings: You can adjust the configuration of the magnifier to meet your specific needs.  What you can do with this magnifying glass: - Read text, business cards or newspapers with no glasses. - Check the details of your medicine bottle prescription. - Read menu in a dark light restaurant. - Check serial Numbers From Back Of Device (WiFi, TVs, Washer, DVD, Refrigerator, etc.). - Replace backyard bulb at night. - Find things in purse. - Can be used as Microscope (for more fine and tiny images, though, this is not a real microscope).  Get Magnifier NOW! If you like it, please consider to rate us, as positive feedbacks help us to improve our apps. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}