{
"name" : "PLC Ladder Simulator",
"url" : "https://play.google.com/store/apps/details?id=com.casdata.plcladdersimulator",
"package" : "com.casdata.plcladdersimulator",
"category" : "Tools",
"description" : "IMPORTANT: Before you use this app, please see the tutorial video on how to use it.  - https://youtu.be/I9X7u_z0JCA   In industry the PLC is the most important automation device because of its role as the brain in running industrial processes. This brain uses a syntax to be able perform tasks in an orderly, sequential manner.  The native language of the PLC is called ladder logic. Ladder logic is graphical, in that it can be laid out in a form that resembles a ladder with rails and rungs. Ladder logic diagrams were developed originally from relay-circuit diagrams that were used for electronic circuitry prior to the advent of PLCs.   PLC Ladder Simulator is a simulator for the Android operating system with input and output objects that simulate the I/O ports of a real PLC. You can used PLC Ladder Simulator to create ladder-logic diagrams using components from the standard set used in these diagrams.  PLC Ladder Simulator features an unique option available in the world and its the possibility of program an Arduino board with a ladder design using an Android phone. So actually what it does is that transforms an Arduino into a PLC (Programmable Logic Controller). The app writes a code into the Arduino by using an USB OTG cable or a Bluetooth module.  The Arduino mode its compatible with the Arduino UNO (atmega328) and the M5Stack ESP32.  Note: This app doesnt work in tablets, only for Android phones, you can try it if you want to.  It doesnt work in some Samsung Galaxy Tab 4.  To ensure the possibility that the app works on your device, follow the example in the video tutorial.  Video Tutorial (english): https://youtu.be/I9X7u_z0JCA   PLC Ladder Simulator Website: http://plcladdersimulator.weebly.com/  If you have any question or problem, you can contact me at: casdata@gmail.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}