{
"name" : "Call Recorder - Cube ACR",
"url" : "https://play.google.com/store/apps/details?id=com.catalinagroup.callrecorder",
"package" : "com.catalinagroup.callrecorder",
"category" : "Tools",
"description" : "The most technically advanced call recorder. Records phone calls and VoIP. Supports call recording for most versions of android devices. If you have already tried to record calls using other applications for recording calls and did not get a satisfactory result, try Call Recorder - Cube ACR, it just works the best.  Call recorder - Cube ACR lets you easily record your incoming and outgoing phone calls and VoIP conversations.  The best part? Its FREE!  Cube Call Recorder supports: - Phone calls - Skype 7, Skype Lite - Viber - WhatsApp - Hangouts - Facebook - IMO - WeChat - KAKAO - LINE - Slack - Telegram - more coming soon!  NOTE This app uses Accessibility services.  WARNING: - Premium subscription grants access to extra features only. It wont improve your call recording experience. Please check how the basic version works before purchasing the subscription. - Not all devices support VoIP calls recording. Below you can find the list of tested devices where VoIP call recording is supported. But we recommend running your own test on the exact device you have. https://goo.gl/YG9xaP  Crystal Clear Sound Quality! Record your calls and conversations in the best possible quality.  Easy to Use! - Automatically record every call. Record each conversation the moment it starts; - Automatically record selected contacts. Create a list of people you want to always record; - Exclusion list. Create a list of contact who wont be recorded automatically; - Manual recording. Tap the record button mid-call to record only the selected conversations or parts of them; - In-App playback. Cube ACR has a built-in file explorer for managing your recordings, playing them, deleting on the fly or exporting to other services or devices; - Smart speaker switching. Bring the phone to your ear on playback to switch from loudspeaker to earspeaker to privately listen to your recordings. - Starred recordings. Mark important calls and filter them for quick access; - Call back and open contacts right from the app.  Premium features:  Cloud backup. Save your call recording to Google Drive and restore them if something goes wrong.  Pin lock. Protect your recording from prying eyes and ears.  More audio formats. Record calls in MP4 format and change their quality.  Save to SD card. Move your recordings to an SD card and use it a default save location.  Shake-to-mark. Shake your phone while recording your calls to mark the important parts of a conversation.  Smart storage management. Automatically delete overtime old unimportant (non-starred) calls and ignore recording short calls.  Post-call actions. Immediately play, share or delete a recording once you stop a conversation.  Works on tablets Even if your device doesnt support cellular calls, you can use Cube Call Recorder to record Skype, Viber, WhatsApp and other VoIP conversations.  NOTE If it doesnt work on your device or you hear only yourself on playback, try changing the recording source in the Settings, or use auto-on speaker mode.  Legal notice The legislation regarding phone call recording varies in different countries and states. Please, make sure that youre not breaking the legislation of your or your callee/caller country. Always notify the callee/caller that your conversation will be recorded and ask for their permission.  Contact us If you have any questions or issues, please, send us a message at support@cubeacr.app ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BIND_ACCESSIBILITY_SERVICE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE']",
}