{
"name" : "RusVPN – fast and secure VPN service for Android",
"url" : "https://play.google.com/store/apps/details?id=com.atrix.rusvpn",
"package" : "com.atrix.rusvpn",
"category" : "Tools",
"description" : "High-end encryption, access to blocked content and complete anonymity is how RusVPN stands out from its competitors.    RusVPN is the best choice for your Internet security: it uses high-end encryption of your connection through our secure proxy servers located all over the world.  Thanks to the VPN application for Android, you can easily guarantee complete anonymity, hide your search history, and get unlimited access to blocked resources.    Advantages of RusVPN:    Free VPN for 7 days  In order to try out our service you only need to install RusVPN and press the ON button.     One account for all devices  Just enter your email to sign up. If you are the new user your account will be created automatically. Your will get the password to email. As a registered user, you can use your subscription in other devices, such as laptops. Start using our applications and browser extentions in notebooks and laptops on WIN, macOS, Linux. Actually, you can sign in with your current account and use your active web subscription.    Full access to all Internet resources and websites  Discover a borderless visit to Facebook, Youtube, Netflix, Instagram, Reddit, Ebookee, LibGen, Freshwap, Bookfi, Freshwap, AvaxHome, Bookre, Spotify, LinkedIn, Telegram, Online Cinemas and many other resources with just one click. Choose one of the many VPN servers and unlock previously inaccessible resources bypassing censorship, geographical restrictions and local blockages.    Full security and privacy  Completely hide your traffic from your home and mobile providers. By changing your IP address, you ensure the confidentiality of your personal data on the network (including all logins, passwords, bank card data, personal photos, browsing history and much more). RusVPN is your assistant for safe work through public Internet access points at work, school and other public places.    Access to regional content  Our free VPN uses regional servers that allow you to connect to the network from anywhere in the world (including the US, France, the Netherlands, the UK and many others).    View adult content  Get full anonymity and security when using sites for adults. RusVPN provides full anonymity for you when viewing similar sites. No one knows that you visited a particular resource.    Save Money  By changing your IP address, you can save a lot on buying games on Steam, renting cars, paying for software and much more.    Why should You choose RusVPN?  RusVPN is the best VPN application for Android, which provides reliability and security on-line to a huge number of users from all over the world. Modern technologies and reliable encryption methods allow unlimited access to any previously inaccessible resource. We provide high speed of connection, complete confidentiality of your data and round-the-clock support of your users. ",
"desc_perms" : "['com.android.vending.BILLING', 'android.permission.READ_CONTACTS', 'android.permission.vibrate', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION']",
}