{
"name" : "C5 CDR Analyzer",
"url" : "https://play.google.com/store/apps/details?id=com.prosoft.CDR_Analyzer",
"package" : "com.prosoft.CDR_Analyzer",
"category" : "Tools",
"description" : "C5 CDR Analyzer is a free mobile application for on the go investigating officers, tech enthusiasts and individuals with a passion to fight crime with the help of data analytics. Import & analyse CDR data through your android device. Convenient and simple to use, find crucial information within seconds. Benefits Investigating Officers to take informed & demanding decisions from where ever they are.   A glimpse of what C5 CDR Analyzer offers:   Analyse Mobile CDR, IMEI CDR and IPDR Data: C5 CDR Analyzer offer various ways to anchor the data while investigating to generate possible leads.    Directly import raw files: The application is capable of handling large volumes of complex data, and can format it automatically.   Analyse multiple CDR at once: The application dashboard makes it easy to keep track of and view multiple CDR, providing a birds eye view of the data.   Works offline: Being on the go, data connectivity isnt vital to the application, once the files are updated from the local machine. However, for Geo Analysis a data connection is advised.    Smart suspect matching: The application lets you add the suspect mobile number, IMEI number or cell site data and auto matches it for a connected view of multiple CDR.   Cloud updates: The application updates details of Cell site, IP, ISD, IMEI and SDR data instantaneously, which helps in analysing the detailed CDR reports efficiently. (Access to SDR data is only from the local machine.)    Easy data legibility: C5 CDR Analyzer provides manageable, enhanced and definitive representation of data.   Comprehensive search: Is the best way to instantly search throughout the data fields and comes up with relevant results.   Geo Analysis: An all-inclusive feature that pins day-night calls, frequent cell sites visited and movements of target number on the map, along with finding route details and matching CDR.   Share: Share data on any multimedia messaging platform.   Common data: The C5 CDR Analyzer automatically gathers and displays all the common IMEI, Mobile CDR and common IP.    Data sync: Lets you sync data between mobile application and the local machine with C5 Desktop Software.   Data Visualisation: C5 CDR Analyzer is developed with data visualization in mind, which enables the Investigating Officers to visually interrogate the data using various types of graphics such as node representation.  We at Prosoft e-Solutions India Pvt. Ltd. are committed to technologically upgrade our Investigating Officers and we have endeavoured to develop this application, to precisely meet their requirements.  We are always eager for your suggestions & queries, please feel free to contact us.  Email: care@prosoftesolutions.com  Mobile No.: +91- 7090773306 / 60 Website: www.prosoftesolutions.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}