{
"name" : "Gujarati Keyboard",
"url" : "https://play.google.com/store/apps/details?id=com.gujarati.keyboard.for.android",
"package" : "com.gujarati.keyboard.for.android",
"category" : "Tools",
"description" : "Gujarati Keyboard lets you type in English characters which gets instantly converted to Gujarati.  Typing with this Gujarati keyboard is the fastest way to type - you dont need any other Gujarati input tools. It works inside all applications on your phone - no more copy-paste! Supports 21+ colorful themes with easy settings, this is the trendiest way to type Gujarati letters on Android, and the easiest Gujarati typing keyboard!  Chat with your friends and family in your native language - use native Gujarati text on any chatting or social media apps on your phone like a regular keyboard.  How to start Gujarati typing using this Gujarati Keyboard:  1. Open Gujarati Keyboard from your apps after installing 2. Enable and choose Gujarati Keyboard as your default keyboard. 3. Customize settings and choose from 21 amazing themes 4. Start typing Gujarati language everywhere!  Start typing in English and choose Gujarati word suggestions for what youre typing. Offline support coming soon. Works on Android phones and Android tablets. Simple to use with touch screen Gujarati text typing from phonetic transliteration using this keyboard.  - Gujarati keypad, Gujarati layout and Gujarati mobile keyboard in all your applications - Easy swith to English or Gujarati text as you need. Turn off Gujarati when you dont need by using the language button. - Emojis are supported: hold on the 123 number button and youll get a list of smileys. There are 3 pages from which you can choose what you need from the Gujarati smiley keyboard.. - Color themes can be changed from the settings page. Look for Gujarati keyboard in your apps to access this.  No more typing with slow manual keyboards - this is the best Android Gujarati Transliteration Keyboard that is free, fast, effortless and easy to use.  No personal information or credit card details are collected. We store anonymous statistics may be shared to improve your experience - share your suggestions at apps@clusterdev.com  Please leave great feedback - it helps us keep going! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}