{
"name" : "Gallery, Photo Editor and Collage maker",
"url" : "https://play.google.com/store/apps/details?id=com.rocks.photosgallery",
"package" : "com.rocks.photosgallery",
"category" : "Tools",
"description" : "Photo Editor and Collage Maker Gallery app with the gallery-vault feature is a nice app for android devices which has these features-  Key features Collage maker - Create a collage with 2 to 9 pics - Set Border and round shape on photos - shuffle the layout, recreate option for the collage in the same screen - different multiple layout support  Gallery Vault feature for Photos and Video - Create Pin for lock private photos - User can lock a video and photos in private folder - Pin recovery in a single click, in case of forgetting the pin    Rotate and Crop Photo - Crop photo freely (in multi-aspect ratios). - Crop photo for multiple aspect ratios. - Rotate photo to a perfect angle, horizontal, vertical, etc.   Add colored text to photos - Add text on photo with your choice of text color. - Add text on photo, and apply different styles and text size in a single text.   Customize Photo Filters with Adjustments option - Customize the filter with adjustment features. You can customize the lightness, contrast, saturation and temperature color of pics. - Add custom exclusive photo filters and effects, such as Film, LOMO, Retro, etc. - Background with blur effect and color with color palette support. - Fine adjustment for photo filters and effects strength.  Collection of Pics and videos in single Place.  Gallery vault with private folder locking feature - User can move photos and videos in a private folder and this is password protected. The password can modify any time.  All Photos section with sort by date - latest photos will show first.  Manage Albums and videos - Users can manage photos and albums with multi-select delete, share, edit options with filter, cropping and many more features.   Awesome Gallery app to manage and view photos and videos from internal memory and sd card. This helps users to browse, share, delete videos and photos from sd card.   Gallery App is an excellent, feature-rich app for organizing your photos. Organize them, display them slideshow style, share photos via email or social networks. it is a smart gallery, format galleries, collection Gallery with this android Gallery.  Spend less time managing and more time enjoying pictures. With HD Gallery you will be able to display images to fill your entire screen. You can use the pinch-to-zoom gesture or zoom buttons to get a more detailed view.  Event Album: Create and organize albums, and choose your preferred design With Gallery, you can freely create albums, and add photos and videos.  Photo Editor - In photo editor screen, you may crop, set filter on a pic, rotate, brush and can write the text with multiple text colors.   Albums Set - Create an album in the album section - you may create the album when you want to move the photos, the photo will be grouped in the created folder with the name of the album  Gallery is the well-designed gallery replacement for the built-in phone gallery. This is the Fast, light and modern gallery with special animated gallery looks for your phone. so it is also called as Rocks Gallery.  Please download this Free Photos(Gallery) Photo Editor and Collage Maker android app & enjoy it! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.WRITE_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_FINE_LOCATION']",
}