{
"name" : "Contact Backup",
"url" : "https://play.google.com/store/apps/details?id=com.tos.contact",
"package" : "com.tos.contact",
"category" : "Tools",
"description" : "Contact Backup now introduces beta version to send all / selective contacts to another Android device without internet. Best contact backup, sharing app fulfilling all your sharing needs. Contact Backup is providing a combined solution to transfer all your contacts from any android / iPhone device to another iPhone / Android device using your own gmail, Dropbox or sd card.  JUST take a backup and send to your own gmail. Open the attachment from your iPhone / Android device. Contact Backup & Transfer your contacts easily, quickly and safely. Contact Backup allows you to send information about your contacts as text by email, dropbox and sd card that can send text. Just choose a contact, then choose what contact information you want to share, and send it! Here you can transfer backup and restore data easily. --Transfer Contacts from an Android to Android;  --Transfer Contacts from an iPhone to Android; -- Move contacts from iPhone to Android -- Move contacts from Android to Android --Contact backup and restore  All contacts can then easily be restored any time by simply opening .vcf file from your mail attachment. Features- -- Backup all Contacts to another Android device / sdcard / gmail / drop-box. -- Restore vcf from sd card / gmail / drop-box without duplicate / overlap contact.  -- Restore all information in a contact, even the images - -User friendly user interface -- Contacts backup, restore & Transfer -- Backup Notification after certain contact limit -- Add contacts from Business card QR scanning -- Searching options on Contacts  Pros:  --Offline Backup. No need to sync to any server. Just email the backup file to yourself. --Restoring and backing up is very easy. --It is easy to use. Free of cost. --The interface and design is neat and user friendly. --Transfer your contacts easily, quickly and safely.  Backup your contacts in a simple and convenient way... You can backup all your contacts to sdcard / gmail / drop-box.   All contacts are in vcf format which will be supported by most of the smart phones (Android, IPhone, Blackberry).   You can import contacts by just downloading it from your mail. As the vcf file is in your mail, your privacy is maintained.  You can SMS any selected numbers to others.  You can directly import contacts from QR code into your device.   (Take backup from iPhone / iPad and restore on Android device)  App is in German (Deutsche), Spanish (Espaol) , French (Franais) , Arabic (  ) , Indonesian .  contact backup and move move contacts from iPhone to Android move contacts from Nokia to Android move contactsfrom android to iphone move contactsfrom iphone to iphone move contactsfrom windows phone to android move contactsfrom iphone to sim move contactsto sim move contactsandroid move contactsapp move contactsandroid to ios move a phone contacts to google move contactsto sd card move contactsto sim card move contactsgmail move contactsiphone move contactsnew phone  Transfer contacts transfer contactsfrom android to android transfer contactsfrom iphone to android transfer contactsiphone to iphone transfer contactsandroid transfer contactsapp transfer contactsapple to android transfer contactsbluetooth transfer contactsblackberry to android transfer contactscsv to iphone transfer contactscsv to android transfer contactsdropbox transfer contactsdownload transfer contactsemail transfer contactseasily transfer email contacts transfer contactsgoogle transfer contactsgoogle account transfer contactsover Bluetooth transfer contactsphone to sim transfer contactsto new phone transfer contactssim card ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.USE_CREDENTIALS', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_PROFILE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.FLASHLIGHT', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_CONTACTS']",
}