{
"name" : "Remo Duplicate File Remover",
"url" : "https://play.google.com/store/apps/details?id=com.remoduplicatefilesremover",
"package" : "com.remoduplicatefilesremover",
"category" : "Tools",
"description" : "Remo Duplicate File Remover is a powerful duplicate file remover app. It lets you easily search and remove the duplicate files on your android mobile phone and tablet.   Nowadays, with so much storage space in android devices, we usually dump whatever we can until the storage fills up to its brim. And the next step most of us will do is try to delete useless files. But we often throw a blind eye to duplicate files. On an average, about 10% of any physical device is filled with duplicate files. Remo Duplicate File Remover will help you to delete these files and free up space on your Android device.  Heres a sample of some of the features packed into this lightweight app:   - Free - Remo Duplicate File Remover is a free app - One Tap Scan  Just a tap will initiate scanning for entire storage space - Simple and easy-to-use interface - Displays three different Menu for Media, Documents and Others  - You will even get notifications for new duplicate files in every 15 days  Working with Remo Duplicate File Remover is easy:  Click Scan  After Scanning gets completed, itll display three tabs:  - Media - Documents - Others  Choose the tab which is appropriate to you In Media tab, select from Images, Videos and Audios Under Documents, all the duplicate files for example .pdf, .txt, .xls etc Others tab is for all other file types like .zip  Select one of the duplicate file and hit delete ",
"desc_perms" : "['', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}