{
"name" : "Voice Translator & Learn Languages - Language App",
"url" : "https://play.google.com/store/apps/details?id=com.bigoceanstudio.language.translator.ocr.language.learning",
"package" : "com.bigoceanstudio.language.translator.ocr.language.learning",
"category" : "Tools",
"description" : "Voice Translator & Learn Languages - Language App will give you free translation of all world languages. Voice translator is text to speech translation free app by auto translator language app. Easily Learn different languages from voice translator and text to speech and scan documents from paper scanner translation app by OCR camera. Voice translator-speech trans is word to word translation of sentences & texts to other languages in translation needs with higher accuracy and fast translations. All language translater is the free app and translation app convert English phrases into other languages as interpreter. Language learning OCR app scan documents and search into easy translation and translate foreign language from speak & translate languages app. Text tranductor is the best translator for the tourists to learn other countries languages easily. Language translator OCR is the app with this combination to scan document of multiple languages text and translate into all other language and find detail in a translation app to learn languages and translate free from this knowledge learning app. OCR language translator always find meaning in a translated native language. Voice Language translation for world language translators help you in learning the things by speaking. Voice and speak translator - Language App will allow you to use translator keyboard to find word for free for live translate voice & speak. Free World translator is here to learn languages and translate the images texts and paragraphs. Tranlater from English to any other language of the world from all language translator to translate free. In this world of communication everyone wants to learn and talk in English just speak and translate voice translator recognize your voice and convert it in your desired language. Online translator with the document scanning feature available. Language Translator - OCR & Language pick up the audio voice by speaking and then translate it to communicate with others easily. Camera OCR for scanning documents in this language translator and translation app for your study needs. Copy speech text from word translator and translate it into world languages to convey your message to anyone. World best translator have a feature to talk with your foreign friends and officials in their languages by this speaking app. Audio or sentences Translate all langue app for language learning with the famous verbals and phrases. OCR translation and text translator provide to scan documents. OCR & Language translator detect spellings and words to translate any word for language interpreter and language converter to learn a new language. This language translator and OCR translation is very fast and convenient app to scan documents or OCR scanner app Translate any language apps into Try Speech Text Translator & Free Voice Translation. Easy Language Translator as All Language Translator Free. Language Translator have features of Online Translate to talk. Speak and Voice Text Translate 2020 and all language learning speaking skills. Speech Translate with Voice Typing with All Language Translator of the world. All Multiple Language Translator with Speech translate. Interpreter & OCR is the main features for communication and scanning the documents. voice translator and OCR - all language translator 2020 is recommended. All Language Translator Voice Translator in All Languages of the world. Translate All Languages and Voice Translator is Free with Speak to Voice Translator and Communicate with friends. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}