{
"name" : "VPN Unblock Master - Unlimited Proxy & Hotspot",
"url" : "https://play.google.com/store/apps/details?id=com.bigoceanstudio.vpn.unblock.master.unlimited.proxy.hotspot",
"package" : "com.bigoceanstudio.vpn.unblock.master.unlimited.proxy.hotspot",
"category" : "Tools",
"description" : "VPN Unblock Master is an unlimited freevpn to speedify your internet connection. VPN unblock and VPN free unlimited proxy master is a secure and best VPN master for you. Free VPN proxy & VPM master hide your current server I.P and offer you to convert all blocked sites into unblock through 100 % easy VPN unblock master. Free BPN is fast and secure VNP with unlimited data and proxy. Unlimited hotspot openVPN offer you to access the unbelievable websites and secureline von bandwidth. This fast vpn is super and secure to protect your privacy with privacy hider for client. Vpn x protect your privacy when you are streaming your favourite sites and change your server to open all restricted websites. Multiple proxy websites and top speed server through secure BPN. Appvpn Unblock sites from free VPN proxy master server data hotspot. A high-speed super VPN for free unblock master is a proxy server to access the restricted websites that are not available in your country. VPM protocol is a service provider for proxy server to hide your server address and identity. Encrypted VPN with unlimited proxy free for unblocks sites and browse you privately. Your connection is now secure under Wi-Fi hotspot shield and change your address through worldwide free. Download free VPN hotspotsheild for fast browsing of internet to enjoy the multiple vpn hub sites. VPN Unblock Master is free xVPN provider and provide a network with pure private for use. Secure your network browsing traffic from VPM unblock master. Global VBN service and VPN service of world for all restricted websites. Keep your data protected by hackers. Maximum VPN speed, bandwidth and proxy vpn for you. App have only one touch link to Unlimited proxy and VPN provide you multi level encryption for your security and privacy through this VPN high speed unblocking restricted sites master. CPN unblock master provide you best streaming to forget buffering on the internet. Anonymously search the webs with Unlimited bandwidth through high speed BPN and total proxy for you. VPN with fast speed proxy and internet to change IP and hide identity from proxy free vpn app. VPN Unblock Master is a VPN Private Network with total proxy for you. VPN masked your identity and hide your IP address while visiting sites and trying social app. VPN connect you a website through HTTPS. VPN unblock master is proxy free internet bypass to change your server address worldwide and allow you directly access to all restricted websites and web pages. VPN secure your personal information and show your different information through worldwide and global server sites visit for you. Click on the button to get access of restricted and blocked sites and next time click cancel to change restricted sites into blocked sites. Protect your current IP address servers. Enjoy social sites and watch video or movies and protect security from privacy protection and unlimited bandwidth app. Get your fake IP address. Mask your real identity and access blocked apps and blocked sites easily. VPN is security free bandwidth and trustworthy connection for encrypted channels. Dont worry about unprotected data and unable to access some restricted websites than try this unblocked VPN to get access of blocked websites. VPN Unblock Master is here to access your favorite websites and browse securely. Hide your personal information from hackers and identity theft. VPN is most trusted security provider to watch blocked video or movies websites and links and feel fully protected from being threaten. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.bigoceanstudio.vpn.unblock.master.unlimited.proxy.hotspot.permission.C2D_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.android.vending.BILLING', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}