{
"name" : "Video Vault - photo hider & privacy keeper",
"url" : "https://play.google.com/store/apps/details?id=com.flatfish.video.privacy",
"package" : "com.flatfish.video.privacy",
"category" : "Tools",
"description" : "Use this best private photo and video vault  to hide photos, hide pictures, & hide videos behind a math calculator that really works!  Video Vault is a must-have privacy protector and the BEST secret folder for your personal information. After setting a password on the calculator panel, you can easily manage the folders or albums of photos and videos, hide videos and photos from system gallery while others could only see a useful calculator that works well installed on your phone. After installing this secret folder, no one can check these hidden files except yourself. Highlight Features:   >Icon Disguise - Disguise Video Vault as a calculator, nobody knows its existence except you - Your privacy including hidden photos and hidden videos can only be viewed after entering the correct numeric PIN on calculator panel. - Offer all the regular and scientific calculator functions to make perfect disguise  >Hide Photos  - Easily and efficiently hide pictures to our hidden photo vault from system gallery. - browse hidden photos in safe place. - Support multiple formats picture: jpg, png, gif and more.  > Video Hider and Locker  - Keep others from your private videos by hiding in Video Vault. - No need to worry that someone scan your private media when handing your phone. - Create unlimited secret folders and import files  >Break-in Alert  - Turn on the alert and get photo snapped when unlocking failed - Find anyone who try to break into your privacy.  > Easy Management - Organizing encrypted private files efficiently and seamless  >Recovery Email - Set a recovery email to make sure your privacy files never be lost.  >Without Any Fees - Easily hide your media with private video locker, and this privacy keeper is totally for free and charges no fees.  ------------------------------ FAQ ------------------------------  Q: How to open Video Vault? A: Enter your password and re-verify it after locked screen if you want.  Q: How to use Video Vault - the best secret folder? A: Step 1: Launch our Video Vault and press the middle button of Start to Use. Step 2: Set a desired password and repeat the password to confirm. Step 3: Start to use Video Vault, please allow the privacy keeper to access photo, media and files.  Q: What can I do if I forgot my password? A: In case you forget your password, you can always Recover Password by pressing the Forgot button on the top right button. The verification code will be sent to your registered email, just enter verification code and and follow the steps in the email to reset your password.  Q: What can I do if I want to change password? A: Please go to the Video Vaults Settings > Change Password > Input Current Password to change the unlock password.  Q: What about if I lost my phone or broken? A: Please be sure that your hidden files are stored only on your device and not online.  Video Vault is a fantastic privacy protection app to hide your pictures and videos. Feel free to use it now!   We focus on Full Privacy Protection and are also contributed to provide the most advanced video hider and photo locker to keep your privacy safe!   Contact us: flatfishteam@gmail.com ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.BLUETOOTH', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}