{
"name" : "Blue Proxy Unblock Websites Free VPN Proxy Browser",
"url" : "https://play.google.com/store/apps/details?id=com.udicorn.proxy",
"package" : "com.udicorn.proxy",
"category" : "Tools",
"description" : "Unblock websites you love to visit today for FREE. Freedom on the internet shouldnt be censored. Say NO to censorship and browse all the web using Blue Proxy Unblock Websites Fast Proxy Browser, and access all the blocked websites free of charges.  Why you should use Blue Proxy app? Your can use it for two main things, you can either: 1 Unblock sites that are blocked in your country, or 2 Protect your privacy online, since this app is a online proxy browser for android, your traffic is routed through US servers, so there no footprints left behind if you use our app, making it the perfect solution to escape government surveillance.  Here is the benefits and features you will get:  Unblock sites for life, unblock youtube, unblock facebook, twitter, etc...  The browser do not track you.  Your connections are secure and anonymous.  Bypass all websites firewalls.  Works on phones and tablets.  Our vpn browser app is professionally designed.  Built-in proxy VPN for user protection and security.  Unlimited bandwidth for browsing.  Material design and fast proxy browser.  Anonymous browsing while hiding your IP.  Unblock youtube, unblock instagram, and websites on your school Wifi.  Unblock web apps, unblock videos, images.  Access websites in UAE Dubai, Saudi Arabia, China, and many other countries.  Built-in fast proxy servers, no need to setup a proxi yourself, just open the app, browse and unblock your favorites websites as well unblock instagram, proxy youtube with our proxu brower.  DISCLAIMER! Please note that our Android proxy app will ensure your protection and private browsing only from inside the app, a proxy browser for android proxy app is working differently compared to a VPN.  Download this app today and enjoy your freedom! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.INSTANT_APP_FOREGROUND_SERVICE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INSTANT_APP_FOREGROUND_SERVICE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
}