{
"name" : "IPv6 and More",
"url" : "https://play.google.com/store/apps/details?id=com.tsts.ipv6",
"package" : "com.tsts.ipv6",
"category" : "Tools",
"description" : "IPv6 and More is an essential, ad-free app for network engineers, system administrators and computer geeks interested in IPv6, IPv4 and transition mechanisms from v4 to v6. The app also includes all the standard IP tools and tcp/udp/http/https testing. Some important features are:  1) Scan your local network and discover IPv6 and IPv4 devices.  2) Ping and Traceroute (IPv6 and IPv4) with many configurable options.  3) Recursive whois lookups for IPv6, IPv4 addresses and domains with configurable whois lookup depth and base whois server.  4) DNS lookups (dig) for many type of DNS records including AAAA (IPv6), A, PTR, SOA, NS, CNAME etc.  5) Connectivity testing for udp, tcp, http and https protocols. Response header inspection for http and https.  6) Device audit and explanation of the IPv6 and IPv4 addresses discovered.  7) Fully configurable tools (ping, traceroute dig, whois) - TTL, count, packet size, maximum hops, DNS server, DNS query type, whois server, whois depth etc.  8) Fully functional on install with no configuration required using default values. Options to reset values to default.   9) Remembers last 20 user supplied entries to reduce typing.  10) Single tap on the text box copies results to clipboard. Long-press clears display.  11) Tech and IPv6 news.  12) Generates Unique Local IPv6 address ranges (private ranges) by implementing the algorithm specified in RFC 4193.  As IPv6 adoption matures and its penetration in the Android stack as well as at ISPs increases, more features are being implemented in the app.   Feedback in any form (on the marketplace as well as from within the app) will be greatly appreciated. Feature requests are welcome.  Be prepared. IPv6 is here.  NOTE: App requires INTERNET permission. Please rate the app. Thanks !  Thanks to:  [1] The dnsjava library at http://www.xbill.org/dnsjava/ (under the BSD license - http://www.xbill.org/dnsjava/dnsjava-current/README)  [2] The jsoup HTML parser at http://jsoup.org/ (under the MIT license - http://jsoup.org/license)  [3] Fatcows for great icons - http://www.fatcow.com/free-icons ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
}