{
"name" : "PROTECTIMUS TOTP BURNER",
"url" : "https://play.google.com/store/apps/details?id=com.protectimus.totpburner.nfc",
"package" : "com.protectimus.totpburner.nfc",
"category" : "Tools",
"description" : "The application for configuring Protectimus Slim mini OTP tokens via NFC. Allows assigning new seeds, setting the lifetime of OTP passwords - 30 or 60 seconds, as well as checking current one-time passwords and information about the token. For programming the tokens, you need the smartphone with NFC support.  Protectimus Slim mini programmable hardware tokens are a more reliable alternative to applications for generating one-time passwords (Google Authenticator, FreeOTP, Duo Mobile, Authy, etc.) and SMS authentication. The OTP tokens self-sufficiency provides comprehensive protection against the interception of one-time passwords and against their theft from a users device that has become infected by malware.  The token is compatible with the two-factor authentication servers that support OATH standards, as well as solutions built on the basis of Google Authenticator. (Google, Facebook, VKontakte, Dropbox, Amazon, GitHub, Kickstarter, KeePass, Microsoft, TeamViewer, etc.) If your service isnt in the list, send us an email and well let you know if your system supports the Protectimus Slim mini-token.  Features: - The ability to program the Protectimus Slim mini token with any secret key the length of which is from 16 to 32 characters (Base32). - Choice of OTP expiration time (30/60 seconds). - Checking the current one-time password. - Viewing information about the token.  How to set up the token: 1. If you have an NFC-enabled phone running Android OS, just download and run the Protectimus TOTP Burner app. 2. Initiate the token setup on the system where you require enhanced security. 3. Save the secret key in a SAFE place so that you can easily restore the security token. 4.Scan the secret key using the TOTP Burner app, or input it manually. We recommend the automatic method. If you enter the seed manually, set the required OTP password lifetime. 5.Activate the OTP token and place it near your phones NFC antenna. While holding it near the NFC antenna, tap Burn the seed and wait for a message confirming that the 2FA token was programmed successfully.  Enjoy reliable and convenient protection for your account on any service  make hackers lives difficult.  To learn more about Protectimus Slim mini visit https://www.protectimus.com/slim-mini/ ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.NFC', 'com.protectimus.totpburner.nfc.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.NFC', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}