{
"name" : "forghetti - Password Manager",
"url" : "https://play.google.com/store/apps/details?id=com.forghetti.forghettiapp",
"package" : "com.forghetti.forghettiapp",
"category" : "Tools",
"description" : "Memorable, safe and stress-free. No passwords stored, no password stolen. Forghetti uses a formula unique to each user to generate passwords and therefore does not need to store them. Provided a user draws the same doodle every time, forghetti will generate the same passwords unique to them and to each individual site.  FEATURES:  - No passwords are stored - they are generated and then forgotten  - No master password required - you only need to remember your doodle  - Multi-layered doodle / pattern used as key to generate passwords making it incredibly secure  - YOUR pattern (doodle) generates the same passwords unique to you every time you need them and different for each separate login (even if the same pattern is used across all accounts)  - Breach report notifications - be alerted when global services are compromised and when to change your passwords  - Phone number login (just like WhatsApp) means you need no passwords  - Generate customisable complex passwords (by default 16 characters, letters, numbers and symbols)  - Generate Passwords, PIN numbers and Memorable words  - Groups enable password sharing amongst families, small teams and friends.  - Light/Dark mode and custom themes make forghetti fun!  - Over 150 pre-defined service presets  - Default usernames  - Touch ID/passcode to open app (optional)  - Multi platform support for all - including free users  Forghetti generates mind-bogglingly complex passwords the instant you need them. All you ever need to remember is a simple doodle.  We are different. We never save a password, we do not know your doodle and we cannot recreate it for you. You are the only person who can generate your passwords every time.  You only need to draw one shape. When you are done click the tick and your doodle will give you a password! Any doodle will generate a password, but when you draw YOUR doodle you get YOUR password.  Draw the same doodle and youll get unique, brain-scramblingly complicated passwords, PIN numbers and memorable words for each login. You choose.  You only need to remember your little doodle.  Share logins with family, friends or colleagues... it is easy to share and secure to access. Never again feel the stress of not remembering the password to your favourite websites.  Our Confoundry generates your passwords on demand when you need them. They are not saved in a database anywhere.  forghetti is committed to making regular donations towards selected charities.  Only one doodle, but many passwords how does this work? You need one doodle but this does not mean you have 500 sites with the same password - the doodle is just one of several unique elements that goes into generating a different unique password for everyone of your sites.  If you try to have a go you will see how simple it is.  You cannot store your current passwords in forghetti. Consider it a well overdue spring clean. Reset passwords for each site one time and thereafter you can forget them forever.   forghetti Premium is 23.99/year inc VAT.  forghetti is developed and edited by forghetti Ltd. Payment will be charged to your iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the users Account Settings after purchase.  You can read our privacy policy at: https://www.forghetti.com/eng/privacy-policy  Terms of service: https://www.forghetti.com/eng/terms-of-service ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.vending.BILLING', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'com.forghetti.forghettiapp.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.USE_FINGERPRINT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}