{
"name" : "Bitdefender for NETGEAR Armor",
"url" : "https://play.google.com/store/apps/details?id=com.netgear.bms",
"package" : "com.netgear.bms",
"category" : "Tools",
"description" : " The most advanced cybersecurity app for Android gives your devices absolute protection against internet threats and data snoopers.   NEW! VPN Added Surf the web anonymously & unlock geo-IP restricted content with VPN. Free - 200 MB traffic / day.  Upgrade to PREMIUM VPN and you get: - Unlimited traffic - Multiple virtual locations from all over the world including US, UK, IT, AU!   Features at a glance:   Malware Scanner  proven 100% detection rate   Account Privacy - verify whether your e-mail account has been breached or not   New: VPN - hide your IP & unlock geo-restricted content  App Lock  lock your sensitive apps with a PIN code   Web Security  real-time protection for Chrome and Androids default browsers   Anti-Theft  lock, track, and wipe your phone from any Internet-connected device   Privacy Advisor  shows which apps may leak your private information     Malware Scanner  With an independently proven 100% detection rate, Malware Scanner is always up to date with the latest intel on viruses and automatically scans apps for malware as you install them. You can also scan for malware manually at any time.   Account Privacy  How safe is your email address? Now you can find out whether your account details have been leaked or not by simply validating your e-mail with Bitdefender for NETGEAR Armor. We will run a check for you and let you know if time has come to change your password.  Smart Unlock  Make your life less complicated. When youre using a trusted Wi-fi network such as your home hub, Smart Unlock grants you direct access to your apps by disabling the PIN code.  New: Fingerprint Sensor Support  Unlock secured apps with the tip of your finger on devices with Fingerprint Sensor.  New: PIN Timeout  Someone else tries to gain access to your PIN protected apps? There will be a 30-second timeout after each 5 consecutive incorrect attempts.  Web Security  Whether youre using Androids default browser or Chrome, Web Security detects malicious content and keeps your browsing safe.  Anti-Theft   Lock, geo-locate, sound an alarm, and wipe your Android from any Internet connected device. Anti-Theft even allows you to listen in on your phone, and send out SMS commands. It will also alert you in case the SIM card has been changed.  Snap Photo  Active defense against thieves and intruders: your phone will snap a mugshot of any person who tries to tamper with your phone in your absence.  Privacy Advisor  Find out if any of your apps peek into your private data and leak it online. Privacy Advisor also tells you when apps access the Internet without your knowledge and download unwanted data.  This app uses the Device Administrator permission.  This app uses Accessibility services. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'com.android.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS', 'android.permission.INTERNET', 'com.android.browser.permission.WRITE_HISTORY_BOOKMARKS', 'android.permission.READ_PHONE_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.PACKAGE_USAGE_STATS', 'com.android.browser.permission.WRITE_HISTORY_BOOKMARKS', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}