{
"name" : "Kids Place Remote Control and Monitoring",
"url" : "https://play.google.com/store/apps/details?id=com.kiddoware.kidsplace.remotecontrol",
"package" : "com.kiddoware.kidsplace.remotecontrol",
"category" : "Tools",
"description" : "This app needs to be installed on Child device, where Kids Place is running. One of the best parental control & parental monitoring apps to monitor childs phone using remote kids monitor, kids control & kids tracker.  POWERFUL PARENTAL CONTROL TOOL Kids Place Remote Parental Control & Monitoring (Alpha version) - Allows you to remotely manage Kids Place Parental Control App on one or more devices from a cloud-based console at https://kidsplace.kiddoware.com. In that way, this parental control app enables remote parental monitoring and kids tracker features!   MONITOR KIDS PHONE FROM THE WEB The child monitoring app can be optionally used on parents device to monitor and change settings or parents can monitor children devices from our website at https://kidsplace.kiddoware.com. This kid control app is easy to use and gives you continuous access for remote kid control, tracking and monitoring no matter the computer or mobile device you are on!  PREVENT UNWANTED KIDS BEHAVIOUR Kids Place together with Kids Place Remote Parental Control & Monitoring app gives complete parental control to prevent unwanted and malicious behavior. Whether its a dangerous website that they view or harmful app that they use, you can control and prevent all that with the combination of one of the best parental monitoring and parental control apps!  WHY KIDS PLACE REMOTE PARENTAL CONTROL & MONITORING?  Cloud based Kids Place management tool.  Remotely add/remove apps from Kids Place  Remotely change Kids Place Settings  Export/Import Kids Place configuration and manage multiple devices.  Provides Geo Location Kids Tracking  Cloud Based Reporting/Dashboard platform  Parents can view/monitor what apps are being used in Kids Place and for how long  Provides remote locking or wiping a device  Easy to use kids tracker & kids monitoring  Free 15 days trial upon account creation. --- Control your kids behavior on their phones or tablets and completely protect them! Cyber attacks, harmful apps, software, and viruses are increasing danger, especially for kids. So add an extra layer of security that will give you a peace of mind with one of the best parental control apps with remote tracking and monitoring.  Download Kids Place Remote Parental Control & Monitoring for FREE! --- This app uses the Device Administrator permission. App requests for reset-password and force-lock user policies. This is completely optional but is requested in case parents want following features: 1. Reset Password: Required for changing device password remotely from Kids Place Cloud Console to lock the device for kids. 2. Force Lock: Required for remotely locking the device from Kids Place Cloud Console. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.INSTALL_PACKAGES', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permisssion.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.ACCESS_NETWORK_STATE', 'com.kiddoware.kidsplace.KPService.permission.Access', 'android.permission.INTERNET', 'com.kiddoware.kidsplace.providers.permission', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_GPS', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permisssion.ACCESS_COARSE_LOCATION', 'com.kiddoware.kidsplace.providers.permission', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.INSTALL_PACKAGES', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_GPS', 'com.kiddoware.kidsplace.KPService.permission.Access', 'android.permission.ACCESS_FINE_LOCATION']",
}