{
"name" : "simpli Clean Mobile  - BOOSTER & CLEANER",
"url" : "https://play.google.com/store/apps/details?id=com.simplitec.simplitecapp",
"package" : "com.simplitec.simplitecapp",
"category" : "Tools",
"description" : "Is your phone or tablet too slow? Are you running out of hard drive space or need to back up your mobile photos? simpli Clean offers powerful features to clean and optimize your Android device as well as protection of your privacy.  New! simpli Clean is now even faster. Weve completely revised the new version. In addition to a whole range of improvements, weve improved the stability and performance of simpli Clean so that you can optimize your Android device even further. We look forward to your reviews in the  app store.  Improvements in detail:  Improved battery use indicator  Improved design for visualizing device status  New privacy protection: Remove location information hidden in your photos which can reveal your whereabouts to other people.  Android 6 (Marshmallow): Make optimal use of the options in the new version of Android  Designed for tablets: Optimized for higher resolution and optimized display  App works faster and more efficiently due to performance optimization  Minimized memory usage: Weve reduced the size of the app again  Thank you for your suggestions and comments! Your feedback will help us improve simpli Clean further.  MORE SPEED AND MEMORY FOR YOUR PHONE AND TABLET! Superb system acceleration, cache cleaner and storage cleaning - Made in Germany!   Features:   MORE SPEED   Why is my device always getting slower?  Apps and processes running in the background frequently use up your phone or tablets resources unnecessarily. Speed up your system! simpli Clean allows you to locate and disable these apps, immediately optimizing your Android device for faster and better performance. Required permissions: Device & app history    LONGER BATTERY LIFE  Why doesnt my battery last as long as it used to?  Some apps use up battery power even though they arent being used. Put an end to excessive battery use! simpli Clean identifies and disables high-consumption apps, giving you more battery life and allowing you to use your phone or tablet even longer. Required permissions: Phone, Device & app history    MORE STORAGE SPACE   Why am I always running out of storage space?  Many apps create temporary cache files when being used. These files take up valuable storage space unnecessarily and are often not properly deleted once the app is no longer in use. Recover your storage space! Make more room for your apps, photos, videos and music! simpli Clean finds wasteful storage hogs, rids your device of unnecessary trash data and helps you uninstall apps completely. Required permissions: Photos/Media/Files    PRIVACY PROTECTION   Do I leave behind data that can be found and used by others when using my device?  Whether youre surfing the Internet, making a phone call or sending a text message, your digital fingerprint gets left everywhere. Protect your privacy! simpli Clean allows you to reliably cover your traces when surfing the Internet and communicating with others. Required permissions: Identity, Contacts/Calendar, Device ID & call information    BACK UP YOUR MEDIA   Are my photos and video clips backed up somewhere?  Normally your images, videos and music files only get saved to your phone, and if you lose your device, or it gets damaged, your files are lost. Back up your images, videos and music! simplitecs special wireless data transfer technology allows you to easily back up your media to your home PC. Required permissions: Wi-Fi connection information, Photos/Media/Files    NEW! WhatsApp Cleaner All the photos, videos and music files sent through WhatsApp are saved in the app, although most of these files are not needed anymore. This uses up storage space on your device unnecessarily. The Cleaner in simpli Clean lets you free up storage space used by WhatsApp in a single click!    Languages:  english, german, portugus, espaol, , franais, italiano    Stay in contact and follow us on Facebook: https://www.facebook.com/simplicleanapp  ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE', 'android.permission.SEND_SMS', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.READ_SYNC_STATS', 'android.permission.READ_PHONE_STATE', 'android.permission.CLEAR_APP_CACHE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.BATTERY_STATS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.browser.permission.WRITE_HISTORY_BOOKMARKS', 'com.android.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'android.permission.BATTERY_STATS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.KILL_BACKGROUND_PROCESSES', 'com.android.browser.permission.WRITE_HISTORY_BOOKMARKS', 'com.android.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}