{
"name" : "Wifi Hotspot, Net Share, Free Hotspot, App Hotspot",
"url" : "https://play.google.com/store/apps/details?id=com.gomin.portable.wifi.hotspot",
"package" : "com.gomin.portable.wifi.hotspot",
"category" : "Tools",
"description" : "App wifi sharing is the best solution for an easy and fast way to have free hotspot, your wifi share and app hotspot.   wifi sharing is one of the best /free hotspot/ to free hotspot your mobile data with other devices. This wifi share helps users create hotspot app for android from 2G/3G/4G/5G. You can share your mobile data, app hotspot with your friends or your family quickly by 1 tap!  MAIN FEATURES of tethering hotspot wifi:  1.Turn your phone into a free wifi sharing quickly with just one click. Your phone will immediately activate the wifi mode to free hotspot from 3G or 4G and 5G. 2. Share net share plus to your friends extremely fast and easily. Just 4 simple steps you can turn on wifi share from your phone and share wifi to your other devices as well as friends. Its great, isnt it ? 3. app hotspot turn on/off the net share extremely fast and easily Just press START or STOP button to Enable/Disable the free wifi sharing. 4. Track connected devices With the List Device Connected you can know all the devices that are using your free hotspot so its convenient! 5. net share plus for samsung, HTC, Xiaomi, Huawei ...  HOW TO USE wifi share  Step 1: Start the hotspot app for android on your phone Step 2: Type name the app hotspot on your phone Step 3: Set the password for the tethering hotspot wifi you want to share Step 4: Press  Start to activate your wifi sharing for android  NOTE   1. free hotspot will allow mobile social networking for your computer, laptop, tablet, smartphone, or any device that supports Wi-Fi and you can share unlimited net share. 2. wifi share support Android 4.x, 5.x, 6.x, 7.x, 8.x, 9.x... And latest versions and require some run permissions. Once you allow these permissions, hotspot app for android will run on your device to start free hotspot 3. The speed of the app hotspot is fast or slow depending on the 3G / 4G / 5G package that you have registered with the network operator. 4. After using, please turn off the wifi sharing access point to save battery energy.  App wifi share is the best app hotspot and wifi sharing to create free hotspot your mobile data with other devices.   If you have any suggestion or feedback while using this free hotspot, please let contact with us via email: gominmobile@gmail.com. We highly appreciate your valuable feedback because it helps us so much in improving the quality of wifi sharing better.  Help me translate into your language. Thank you very much! https://vulubu.oneskyapp.com/collaboration/project?id=170648 ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}