{
"name" : "Silent Scheduler - Auto Notify",
"url" : "https://play.google.com/store/apps/details?id=com.wikitech.silentscheduler",
"package" : "com.wikitech.silentscheduler",
"category" : "Tools",
"description" : "Silent Scheduler Auto Notify lets us create the timing list which will be automatically enabled your mobile mode on silent or on vibration. You dont need to worry about switching your phone to silent mode or general mode etc while you are in meeting, gym, or in mosque.  Silent Scheduler Auto Notify automatically enters into silent and vibrate mode for the given time of period and come back to its starting condition before starting that schedule time and also notify you that your phone goes into the silent/vibration mode.  This App will ensure that your mobile device enters and exits the Silent Mode or Vibration Mode between a given period of time.  It has following key Features.  - Simple User Interface. - Timed Silent - Mute Your phone - Switches back to Ringer Mode Automatically - Vibrate mode added - Just set Silent Hours - Automatically switches to Silent Mode between a given period of time. - User can select days in the week for which he/she want profile should run or no - You can edit your give schedule/profile at any time. - User can auto repeat same profile on different days. - Multiple Profiles can be added with different times - Prevents embarrassment - Manage various profiles at same time. -Auto notification feature added. -You can on or off scheduler if you want to temporarily stop working of app. -You can adjust the volume of normal mode.   This app contains Namaz Scheduler, Namaz Time Scheduler, Pray Time Scheduler, Pray Scheduler,Auto Silent , Silent Scheduler, Auto Silent Scheduler , Silent Mode, Scheduler Silent ,Silent Mode Timer,Silent Mode Manager,Silent Mode Switcher, Auto Silent, Auto Vibrate, Do not disturb, Scheduler, Silent Profile, Silent Mode Timer,Phone Automate, Silent Mode, Silent Sleep, Smart Silence, Silent Time, Phone Silent, Silent Manager, Silent Scheduler Auto Notify, Auto Silent Manager, Silent time, Do Not Disturb, Auto Silent Mode, Silent Time, Sleep, Auto Sleep, Namaz Time Silent, Pray Time Silent. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}