{
"name" : "Translator: Translate Chat & Voice Conversation",
"url" : "https://play.google.com/store/apps/details?id=com.chattranslation.conversation.voicetranslator.translatorappfree.audiotranslator",
"package" : "com.chattranslation.conversation.voicetranslator.translatorappfree.audiotranslator",
"category" : "Tools",
"description" : "Translator: Translate Chat & Voice Conversation and speak to translate app is a completely free conversation app. The purpose of conversation app English languages to all languages with voice translator is to provide easy translation to users by which they can converse & translate English and all languages to any other language interpretation anytime, anywhere in the world. Voice conversation works best with speedy online server and you all want it online translate. The problem with offline translation is it cannot be able to serve you with always accurate, an updated and correct translation of the English language from any other language. Chat translator provides you with an interactive platform that enables you to translate text or speech from one language to another language. The conversation is Small size application & freely available on play store. Translator: Translate Chat & Voice Conversation & translator app is working in steps like first by speech to text voice response feature it will receive your input (you can also use your structure of default keyboard for text input). The second phase by fast and accurate translation server it will translate that input for you in more than 100 languages and in the third step, it will speak that translated text for you by its auto-text to speech voice/audio output feature. You can do it all in few second with all languages free voice translator and speak & translate conversation app. conversation translator, speech to text converter and text to speech audio speaker but the conversation is a perfect language learning app. It makes the translations online and translator is used properly it may help you to learn languages and all you have to do is to speak or type to translate. Translator: Translate Chat & Voice Conversation helps you translate text from one language to another language. You can directly translate the content of the chat bubble, the content of the input box text. A language translator for conversations with strangers. Chat Translator is a language translator for a conversation with strangers. A translator is a complete typing keyboard that has a single button added for conversation translation. Works in all social networking apps and all other apps in which you need to use your phone keypad to write text. Chat Translator keyboard app is a language translator for a conversation with strangers. Translator app helps you translate text from one language to another language. Chat translator almost supportive all the languages. Translator: Translate Chat & Voice Conversation easy input method with Translator keyboard that also offers users to learn all languages while chatting with other language speakers. User can use a keyboard as a schemer that helps in writing any language or to improve typing and chatting skills. The translate button in service will help you convert the text from English to any language you want. Text translator is a keyboard with a translate option to translate text into any language you want. Keyboard translator app will help the user to write any language. Translator button in this language will help you to translate writing into a selected language. A single click on the button will translate your text. Conversation translator Very simple and user-friendly application. Feature of Translator: Translate Chat & Voice Conversation  Ask questions in other languages For travel, vacations or business trips Translate words or phrases Translate your voice Hear the translation (Text to speech) Fast and easy chat translation Voice recognition (Speech to text)  Conversation voice needs an internet connection Some languages do not have speech Download free voice translator for conversation in all languages and give us your valuable suggestions and feedback. !!Thanks!! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}