{
"name" : "electric imp",
"url" : "https://play.google.com/store/apps/details?id=com.electricimp.electricimp",
"package" : "com.electricimp.electricimp",
"category" : "Tools",
"description" : "Electric Imp is a combined cloud service and hardware solution that makes it simple to connect your devices to the Internet. With imp connectivity, you can remotely monitor and control the activity of your devices at home or out in the field.  Manufacturers and makers can use imp modules to connect a variety of useful devices, ranging from weather indicators and coffee makers to garage door openers and printers, to the Internet. Commercial users of the Electric Imp Platform may also integrate our patented BlinkUp technology directly into their own apps.  The Electric Imp app enables you to easily connect your prototype imp-enabled devices to the Internet in seconds using BlinkUp.  To utilize this app, which is intended for developers, you will need any Electric Imp development device, such as the impExplorer Kit (available from https://store.electricimp.com), and an Electric Imp account (sign up at https://impcentral.electricimp.com).  CAUTION BlinkUp uses flashing light patterns. A very small percentage of individuals may experience epileptic seizures when exposed to such light patterns or flashing lights. If you have an epileptic condition, or are othersue susceptible to flashing or strobing lights, please consult your physician prior to using this app.  NOTICE By using this app, you expressly agree to Electric Imps Privacy Policy (https://electricimp.com/privacy) and Terms of Service (https://electricimp.com/terms). ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}