{
"name" : "Video locker - Hide videos, Private video vault",
"url" : "https://play.google.com/store/apps/details?id=com.inno.videolocker",
"package" : "com.inno.videolocker",
"category" : "Tools",
"description" : "Keep your videos secure and private with video Locker. video Locker is the easiest and safest way to create a secure location on your device to store and protect your personal/important videos. video locker is your personal gallery where you can keep your most memorable videos and ensure that friends who use your phone dont see your personal videos if they browse through your gallery.  Features: - Password protected app access with a PIN / Pattern. - Lock videos directly from your default gallery - Works with your devices memory / SD card to import and export videos. - Album View to manage your videos faster. - No storage limitations with unlimited videos. - Multi-select feature to import hundreds of videos quickly. - Easy unlock with just a tap. - Optimized for HD tablets. - Does not show in recent apps list. - Automatically quits in devices sleep mode. - Intuitive interface for a great experience. - Share locked videos directly on Facebook, Twitter, WhatsApp, Etc. - You can hide your album thumbnail video - Set cover video to your albums - Material interface designs makes more live your app - Set theme to depends on your mood - Best rated video locker among people in Google play  How it works:  - Enter PIN / Pattern to log-in to the app. - Create folders right in the app to add and manage videos. - Import / export videos from your phone / SD Card. - Select the videos you want to lock. (Multiple selection allowed) - Press the Lock icon and there! As Secure as a vault!   PASSWORD RECOVERY: -------------------- In case if you forget your passwords we will send you to your registered e-mail id.  GET_ACCOUNTS permission is get user e-mail id for sending password.   FAQ: Q: Where do my videos go after I unlock them?  A: Your videos will be at sdcard/videolocker_UnLocked_pic after unlocking. Q: How can I change my password?  A: Tap the Settings icon which will show an option to change your password. Q: Are my hidden videos stored online?  A: No. Your videos are stored only on your device. We have no ability to remotely access your videos. Q: Which video formats are supported by Video Locker?  A: The app supports all major formats - .mp4 .wmv .avi .mkv .mpeg .3gp .VOB .MOV .MPEG4 .DivX   Having issues with video locker? Check out the FAQs or mail us at admin@innorriors.com.  - Follow us! : https://plus.google.com/101200578251750147543 - Love us? Like us! : http://facebook.com/innorriors - Twitter addict? Follow us : http://twitter.com/innorriors - Stay updated. Visit us : http://www.innorriors.com ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_FINGERPRINT', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK', 'android.permission.MANAGE_DOCUMENTS']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MANAGE_DOCUMENTS']",
}