{
"name" : "ROM Manager",
"url" : "https://play.google.com/store/apps/details?id=com.koushikdutta.rommanager",
"package" : "com.koushikdutta.rommanager",
"category" : "Tools",
"description" : "ROM Manager is THE MUST HAVE APP for any Android root user. (Over 10 million downloads and counting!)  * Flash your recovery to the latest and greatest ClockworkMod recovery. * Manage your ROMs via a handy UI. * Organize and perform backups and restores from within Android! * Install ROMs from your SD card. * Install your favorite ROMs over the air!   Premium Version: * Incremental update zips (save your data plan!) * Premium ROMs * Receive notifications for when your ROM is updated! * Automatic backups * Install Queue * Web Connect * Backup Download Server lets you easily transfer backups as flashable zips to your computer.  Do you prefer using only recovery manually? Check out the Touch Recovery in app purchase, for the most advanced recovery available!  Why does ROM Manager ask for account permissions? Web Connect only needs to access your Google account to connect it to your google account. It cant access any private data or passwords.  ClockworkMod Touch Recovery: ClockworkMod Touch recovery (and recovery) is work that needs to put in for every new device that is released by a manufacturer. If work on ROM Manager ceased completely, all the premium features would continue working without issue. However, new recoveries do not port and build themselves. Without ClockworkMod Touch being a per device purchase, there is no way to recoup recurring server costs and labor. Keeping ROM Manager free and operational costs tens of thousands of dollars a year, and that does not include engineering costs. Your support is appreciated.  Troubleshooting: Droid users: Stuck at the M logo? Flash an alternate recovery and flash back to ClockworkMod. HTC Users: Flash recovery not working? Try fastbooting a recovery on. Droid X/2/Pro Users: You must run the Bootstrap application first to use ROM Manager. Samsung users: You must flash a Clockwork compatible kernel first (see XDA forums)  IF YOU ARE HAVING LICENSE ISSUES, MAKE SURE YOU HAVE THE LATEST VERSION OF FREE (4.0+) AND THE LATEST LICENSE (1.0.8+) INSTALLED! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WAKE_LOCK', 'com.koushikdutta.rommanager.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_SUPERUSER', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.USE_CREDENTIALS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_SUPERUSER', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
}