{
"name" : "Simple Contacts - Manage & access contacts easily",
"url" : "https://play.google.com/store/apps/details?id=com.simplemobiletools.contacts",
"package" : "com.simplemobiletools.contacts",
"category" : "Tools",
"description" : "A lightweight app for managing your contacts loved by millions of people. The contacts can be stored on your device only, but also synchronized via Google, or other accounts.  You can use it for managing user emails and events too. It has the ability to sort/filter by multiple parameters, optionally display surname as the first name.  You can display your favorite contacts or groups on a separate list. Groups can be used for sending out batch emails or SMS, to save you some time, you can rename them easily.  It contains handy buttons for calling, or texting your contacts. All visible fields can be customized as you wish, you can easily hide the unused ones. The search function will search the given string at every visible contact field, to make you find your desired contact easily.  There is a lightweight dialpad at your service too, with smart contact suggestions.  It supports exporting/importing contacts in vCard format to .vcf files, for easy migrations or backing up your data.  With this modern and stable contacts manager you can protect your contacts by not sharing them with other apps, so you can keep your contacts private.  Like the contact source, you can also easily change the contact name, email, phone number, address, organization, groups and many other customizable fields. You can use it for storing contact events too, like birthdays, anniversaries, or any other custom ones.  This simple contact editor has many handy settings like showing phone numbers on the main screen, toggle contact thumbnail visibility, showing only contacts with phone numbers, showing a call confirmation dialog before initiating a call. It comes with a quick dialer that also makes use of letters.  To further improve the user experience, you can customize what happens at clicking on a contact. You can either initiate a call, go to the View Details screen, or edit the selected contact.  It comes with a modern dark theme by default, based on material design.   You can easily block phone numbers to avoid unwanted incoming calls.   To avoid showing potentially unwanted contacts, it has a powerful built in duplicate contact merger.  Contains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.  Check out the full suite of Simple Tools here: https://www.simplemobiletools.com  Standalone website of Simple Contacts Pro: https://www.simplemobiletools.com/contacts  Facebook: https://www.facebook.com/simplemobiletools  Reddit: https://www.reddit.com/r/SimpleMobileTools  NOTE: This version of the app is no longer maintained. To get all the latest and greatest improvements please take a look at the Pro version at https://play.google.com/store/apps/details?id=com.simplemobiletools.contacts.pro . Dont forget that if you uninstall any paid app within 2 hours, you will automatically be refunded. If you want a refund anytime later, just contact us at hello@simplemobiletools.com and you will get it. That makes it easy to try it out :) ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_SYNC_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.CALL_PHONE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}