{
"name" : "HTTP Injector Lite - (SSH/Proxy/VPN)",
"url" : "https://play.google.com/store/apps/details?id=com.evozi.injector.lite",
"package" : "com.evozi.injector.lite",
"category" : "Tools",
"description" : "Lite version of HTTP Injector is a professional VPN tool to browse the Internet privately and securely with multiple protocol and tunneling technologies build into one app.  Lite version use .ehil file format  HTTP Injector Lite is lightweight, quick to download, compatible with more devices and run fast on most popular Android devices.  It works as an universal SSH/Proxy/SSL Tunnel/DNS Tunnel/Shadowsocks client to encrypts your connection so that you can surf the internet privately and securely. Besides that, it also help you access blocked websites behind firewall.  Best part? You are able to configure your own server and connect using this app.  This tools is for professional users only Lite version come with smaller app size, faster app response and basic app security  Access any website and service on the Internet and secure your identity. Secure your Android device from hackers and online threats when using a public WiFi.  Features: - Secure your connection using SSH or Shadowsocks tunnel - No root needed - Specify alternate proxy servers to send a request through - Provide alternate headers and ability to strip headers from incoming http responses - Build in SSH client - Build in Shadowdowsocks client - Payload Generator - Apps Filter - Support Android 4.0 to latest android - Google DNS / DNS Proxy - Data Compression - Ability to change buffer size, etc  Tunnel Types - HTTP Proxy + SSH - SSH Only - Shadowsocks - SSL (TLS)  Provider Mode - Exported config is encrypted - Lock and protect the settings from users - Set custom message for customer - Hardware ID lock  Manual: https://apps.evozi.com/httpinjector/  How to use: >> Import config file created by other users (You can find it in your local group/group chats) or >> Open payload generator and press generate (no need to adjust settings) and select one of our server to connect   - Crashing or having problem? Email us to get it resolved Guide: https://blog.evozi.com/how-to-get-logcat-crash-log/  Full features: Get full version of HTTP Injector at - https://play.google.com/store/apps/details?id=com.evozi.injector  Beta Tester: https://play.google.com/apps/testing/com.evozi.injector.lite ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION']",
}