{
"name" : "Construction Calculator Pro",
"url" : "https://play.google.com/store/apps/details?id=com.snappyappz.cc_pro",
"package" : "com.snappyappz.cc_pro",
"category" : "Tools",
"description" : "C-Calc Pro is a calculator app designed by, and for construction workers. Unlike a standard construction calculator C-Calc uses the power of your phone to create a construction computer. This full function calculator works as a standard calculator but more importantly allows you to work in feet, inches and fractional inches. The calculator also features several other modules for performing material estimates, crown moulding, conversions, area calculations and volume calculations, arcs and archs, trig and triangles, and stairwells and stairs. Contractors, architects, tradespersons, builders and even do it yourselfers will find this app ideal. Features include;  - Add, subtract, multiply, divide, exponent, root and more with measurements in feet, inches, and fractional inches.  - Reduce fractions and fractional inches to their lowest common denominator.  - Convert decimal values to fractions and vice versa.  - 50 memory slots to store, recall, add and subtract memory values. Memory values are shared between all modules as well.  - Split screen shows result, memory, and measurement values all at once.  - Calculate square footage and cubic footage easily.  - Conversions for temperatures, distances, angles, areas and many more built in.  - Help screen and full instructions included in program.  - Estimate drywall, concrete, block, paint, tile, lumber and associated materials.  - Calculate surface areas and volumes of a large variety of shapes (including compound objects) for material estimates.  - Crown moulding module built in which supports any spring angle and any wall angle. Actually see the saw settings on your phone.  - Trigonometry calculator included for solving triangles, rise/run, rafters, slope, and more. Triangles are graphically mapped on your phones screen to give a visual.  - Advanced arc/circle calculator for solving arcs, radius, circumference, sector areas, sector angles, and circle areas.  - Stair calculator for solving rise, run, unit rise, unit run, # of risers, # of treads, incline, stairwell opening, and stringer length. Drawings are to scale and may be easily printed or saved.  Forget a bulky $100 calculator and simply download the free app. The app will always be on your hip when you need it most instead of in the trucks glove compartment.  C-Calc Pro has much more to offer in the coming months with free upgrades as well. We take our fellow tradesmens opinions very seriously and the app will grow to reflect the peoples opinion. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}