{
"name" : "Notification announcer - ByVoice",
"url" : "https://play.google.com/store/apps/details?id=com.codococo.byvoice3",
"package" : "com.codococo.byvoice3",
"category" : "Tools",
"description" : "ByVoice reads incoming calls, text messages and notifications from apps (such as Kakao Talk, Line, Twitter, Facebook, Watts app, Instagram, etc.) out by voice.  - You do not have to do dangerous things like turn your head and look at the phone to check your text messages while driving.  - If you are wearing an earphone while studying at the library, you can find out notifications even if you do not check your mobile phone.  - Even when you are cooking in the kitchen, you can recognize what the notification sound of the phone in living room means.  - Now , even in exercise, you can check the contents of your Whatsapp or Facebook messenger from your friends without having to touch your phone with hands wet with sweat anymore.  By using the rich options provided by ByVoice, you can freely set when to read alerts that are right for you.  - You can decide whether to or not to read notifications based on the connection status of various peripherals (such as earphones or Bluetooth headsets).  - If you are connected to multiple Bluetooth devices, you can set the priority of them so that you can automatically select which device will play voice.  - Because ByVoice allows you to set to read notifications only when you are connected to a Wi-Fi in a specific location, so you can set not to read notifications when Wi-Fi in your office is connected. And you can set to read notifications when Wi-Fi in your home is connected.  - You can set not to read notifications when a specific schedule of phones calendar is in progress, so you can set not to read notifications during a meeting or while studying.  - You can set not to read notifications only when the screen of the phone is off, or not to read notifications when you play a game in landscape mode.  - You can set notifications to be read only when the navigation app is running.  - You can set not to read notifications when you are using YouTube or Music apps.  - You can set not to read notifications from apps youre currently using.  - You can choose not to read notifications at certain times.  - If you suddenly hear a notification reading voice at a place or time that you do not want, you can make it stop by flipping your phone.  - You can choose not to read notifications that contain unwanted words, and you can set a word to be replaced with another word.  - If the performance of your phone is a little slower, you can set it to read notifications after a few seconds delay, and you can set it to read notifications at intervals of a few seconds.  - Because it supports the TASKER plugin, if you are using the TASKER app, you can set up more flexible notification timing.  Now you can listen to the notifications that ByVoice reads, like music, without having to touch the phone to check your notifications. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.BROADCAST_STICKY', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CALENDAR', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.READ_CALENDAR']",
}