{
"name" : "Rocklogger",
"url" : "https://play.google.com/store/apps/details?id=com.rockgecko.dips",
"package" : "com.rockgecko.dips",
"category" : "Tools",
"description" : "Rocklogger is a geological tool for measuring the orientation of rock outcrops. It uses the phones compass and orientation sensors to measure dip & dip direction, or dip & strike, in a single click.  GPS and magnetic field information can also be saved, along with details on the rock plane & type.  Key features: -Log dip & strike or dip & dip direction by placing the phone on the rock/plane in any orientation (using the rotating symbol and quick help features as guides). -Android Wear companion app to view and save (paid only) live sensor readings from your phone remotely on your watch, and vice-versa. Alternatively, log remotely using a wired headset (paid only) as a remote control. Great for logging hard-to-reach surfaces -Plot logs on a map, with correct dip/strike symbols -Plot logs on alternate basemaps from various sources including MapBox, zip files and the web (paid only) -Plot poles or planes from logs on a stereonet, and interpret by touching the plot to find trends and intersections (paid only) -Define your own extra text and dropdown fields, to fit your logging scheme (paid only) -Log the ambient magnetic field -Launch the camera to take photos while logging. Notes and GPS data are saved to the log file. Photos are stored with the log file, and are automatically attached when you send a log via email from the browser screen  The log is saved to a .csv file, which can be sent to Excel / Mapinfo / etc for interpreting. Paid versions can also export KML files for use in Google Earth (Android or desktop version).  Taking the strike and dip of outcrops with a compass / declinometer usually takes a few minutes per rock. With Rocklogger, many measurements of an outcrop can be taken in seconds (in any orientation). It also works upside-down, eg for logging overhang in a mine.  The evaluation version is limited to saving 3 records per 3 minutes, and has the stereonet plotter, KML export and custom basemap features disabled. Rocklogger Unlocker is available for purchase to disable the evaluation version restrictions. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.NFC', 'android.permission.VIBRATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.rockgecko.dips.permission.MAPS_RECEIVE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.rockgecko.dips.permission.MAPS_RECEIVE', 'android.permission.NFC', 'android.permission.ACCESS_FINE_LOCATION']",
}