{
"name" : "GPS compass map for Android",
"url" : "https://play.google.com/store/apps/details?id=com.maptool.gpscompass.weatherdaily.traffic.route",
"package" : "com.maptool.gpscompass.weatherdaily.traffic.route",
"category" : "Tools",
"description" : "GPS compass map for android is mobile mapping service application and technology provided offering satellite imagery, street map combined with digital compass and GPS navigation  GPS compass map is free access to maps, navigation & traffic. GPS map opens maps for Android phones and tablets with free navigation and map. You will have access to accurate maps in 220 countries   GPS compass map provides maps and navigation with live traffic conditions, incident report and finds best driving route.   Features:  GPS compass map is a smart compass app  It is a simple but higher accuracy digital compass and it is very easy to use  Digital compass app is a tool to search bearings (azimuth, directions) using embedded magnetic sensor.  Smart compass free is the most specific and performance upgraded compass app available. Best compass app supports magnetic field northern and true north using compass sensor  When travel, picnics, camping, hiking or even boating lost your way then look at your direction by GPS compass   It is a GPS navigation app  Whether you are travelling, commuting to work or driving professionally, GPS navigation & maps is your one tool for everything.  GPS compass navigation allows users to provide the location of your and navigate destinations via directions and search maps using a number of different methods.   It is map free  GPS compass map allows user to find Restaurants, ATMS, Hotels, Bank, Schools, University, Post office, Cafe and Police station etc nearby.  GPS map is free access to maps, navigation & traffic. You will have access to accurate world maps in 220 countries and territories.   Support: Please contact the application development team via mail when using the problematic app. We will contact you and solve the problem as soon as possible. If you like the app, please help me 5 star review. Thank you ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}