{
"name" : "Atlas VPN - Secure Free & Unlimited Proxy",
"url" : "https://play.google.com/store/apps/details?id=com.atlasvpn.free.android.proxy.secure",
"package" : "com.atlasvpn.free.android.proxy.secure",
"category" : "Tools",
"description" : "Atlas VPN is a free VPN proxy app that ensures private browsing by changing your IP address and encrypting your connections.   Use our free VPN proxy app to get:   Enhanced digital privacy   To enjoy unlimited and private browsing, pick one of our free VPN proxy servers from 3 regions. If you subscribe to our Premium Service, youll have an unlimited selection from 10+ regions.  Establishing a secure connection to one of Atlas VPN proxy servers will hide your real IP address, ensure your privacy online, and make it look like youre from somewhere else.   Websites can no longer see whos hiding behind that VPN shield which makes you anonymous online. You hide your browsing activity not only from websites but from other third parties as well.  Increased online security   Atlas VPN will secure your connections and ensure unlimited, private browsing on public WiFi hotspots. Using a public WiFi network is risky. Our free VPN app will secure you and ensure safe and private browsing.  Geo-restricted website access   Pick one of the secure and free proxiesusing our VPN connection will change your IP address so it looks like youre browsing from a different region.   Firewall bypassing   Its a common practise to block websites at school or work WiFi. After connecting to Atlas VPN app youll be able to go around these limits. Choose a VPN server that can hide your real location and try accessing the site with your new IP address.  Also, some countries apply heavy limitations online. Luckily, using our VPN proxy servers can help you bypass these limitations by changing your IP address and allowing you to access blocked websites.    IP location change for a better Netflix catalogue   By using a secure, and unlimited VPN connection, youll be able to hide your real IP address and change it to one from another country. You can stream as much as you wish as we dont apply any usage limitations on our free proxy servers.   Atlas VPN free proxy access offers:  1. No-log policy   Have peace of mind privately browsing on our free proxy app. After connecting to our proxy server you become anonymous and you can browse the internet in complete privacy. We guarantee a strict no-logs privacy policy. You become completely anonymous online since neither your connections or your true IP address is collected.  2. No intrusive ads  Although we provide a free VPN service, we promise not to bombard you with annoying, interruptive ads.   3. No hidden fees   Get unlimited and secure browsing with our free VPN proxy app without any hidden fees.  4. 24/7 support  Our support will gladly help you to access geo-restricted content and ensure safe and private browsing. Just drop a line at support@atlasvpn.com or live chat with one of our agents anytimeour chat is available 24/7!  5. Fast and stable VPN proxy servers   Our VPN proxy servers are configured according to the highest standards in the cybersecurity industry. Atlas VPN ensures unlimited and private browsing while maintaining stable, fast, and secure online connections.   6. Streaming-optimized proxy servers  Atlas VPN offers unlimited and free proxy servers specifically adjusted for bypassing geo-restrictions that streaming services apply. Change your IP address by connecting to one of our VPN proxy servers and enjoy binging your favorite shows.   7. Free proxy servers in different regions  Choose from 3 free proxy regions for private and secure browsing on any public WiFi. If youre a Premium Service user, you can choose from 10+ regions and you can access all of our 500+ servers.  So, if you need a free VPN app that offers unlimited traffic, changes your IP address, makes you anonymous online, and protects your connections, youre in the right place. Choose Atlas VPNwell provide you with a VPN proxy service for private browsing, security, and freedom. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}