{
"name" : "Hide photos and videos - Calculator vault",
"url" : "https://play.google.com/store/apps/details?id=com.galleryvault.photohide.calculatorvault",
"package" : "com.galleryvault.photohide.calculatorvault",
"category" : "Tools",
"description" : "Calculator vault is a great privacy protection application to easily hide photos and videos you dont want others to see on your Android device.  Hide photos and videos - calculator vault keep your photos / videos safe and private with photo and video locker. Hide photos and videos app with the calculator application icon and keep your privacy safe. You can import your private images and videos into this secure repository and no one knows its existence except you.  Whats more, hide photos and videos are beautifully designed, it gives you the picture gallery vault a smooth and wonderful experience.  Outstanding features:  Hide pictures and hide videos easily  Change icon the application Hide video and photo with the calculator icon.  Beautiful, smooth and friendly user experience  The application security system is extremely secure, using the password you created to access the application  Video vault, photo hide, gallery vault and bring great experience for users ----------------------------- Frequently asked questions:  -  Can my hidden photo and video files be stored online?   No. The file is stored on your device, so be sure to back up all hidden files before switching to a new device or restore the original settings.  -  What will I do if I cant find my hidden photo?  Dont worry. Please contact the developer. We will support as quickly as possible In addition, please email us for assistance.  Download, use the hide photos and videos application for free now. Please email us if your device is not supported, we will try our best to support it. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}