{
"name" : "File Manager - Explore, Manage & Hide Files",
"url" : "https://play.google.com/store/apps/details?id=com.megafreeapps.filemanager.file.explorer.filehider",
"package" : "com.megafreeapps.filemanager.file.explorer.filehider",
"category" : "Tools",
"description" : "Manage your files, explore files, hide files with password, and a lot of other features like you do on your PC or laptop using Multiple Select, Move, Cut, Copy, Paste, Create, Search, Delete, Rename, Share, Send, Hide, Create Shortcut and Bookmark and many more. Easy, Free, Simply and Safely Manage your files efficiently with File Manager - Explore, Manage & Hide Files (File Manager)! This File Manager app is easy and powerful file explorer for all Android devices. Its free, smart, fast and full-featured app. Because of its simple Interface it is extremely easy to use. With this best File Manager app you can easily manage your files and folders on your device. Besides this, you can view all files & apps you have in your device at one glance immediately after opening File Manager - Explore, Manage & Hide Files. Hide your secret pictures,Videos,Audio or any type of folder and files in your android phone and prevent it from others. There is no delay in hiding files because in this file hider app move your files in hidden folder in secret location and access it with your password.  File Manager - Explore, Manage & Hide is a best privacy protection app to easily hide and encrypt your media files like photos, videos and any other files that you do not want others to see. Easy File Explorer | File Manager | File Hider is a full-featured manager app (Images, Music, Movies, Documents, app) for Android Devices! With several users worldwide, File Manager - File Explorer and File Hider helps manage your android phone files efficiently and effectively and share files without any data cost. File Manager FEATURES: * Best File Manager  manage, explore, copy, cut, move to, paste, hide your files easily. * Friendly User Interface. * Support multiple resolution. * List view and grid view for file explorer and manager. * Search and share files easily. * Select multiple files at a time. * Thumbnail support for media files. * Useful features like cut, copy, delete, compress, extract etc. easily and effectively. * Multiple themes support. * Quickly Navigate with navigation drawer. * Sort out media files according to name, size and date. * Timeline view of your media files. * View hidden files with your own password. * And many more features. File Manager - Explore, Manage & Hide Files is the best file explorer, file manager and file tool for android device manager with powerful features. File manager | File Explorer app is free, really easy to use with file organizer by category: Images, Music, Movies, Documents, Apps etc..  With this app manager for Android, you can manage your files and folders on device. This is the best explorer files app with useful and cool file manager android app features. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_FINGERPRINT', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}