{
"name" : "Theme For Lenevo Vibe",
"url" : "https://play.google.com/store/apps/details?id=com.lenovo.viber.theme",
"package" : "com.lenovo.viber.theme",
"category" : "Tools",
"description" : "The heme For Lenevo Vibe theme is packed with HD xxx wallpapers and exquisite Lenevo Vibe app icons, designed for mobile theme fanatics. Want to make your Android phone smoother and smarter? Please download the xxx theme now, more surprises are waiting for you to discover!  Install the Lenevo Vibe theme for: - Beautiful Lenevo Vibe lock screen to protect your privacy - Cool Lenevo Vibe app icons to make your phone shine among others - Dynamic Lenevo Vibe wallpapers with weather forecast, its more than just a wallpaper.  3D themes and live wallpapers: - Add Lenevo Vibe theme to your 3D theme - Lenevo Vibe dynamic wallpapers with a variety of touch gestures, so you can feel the beauty of Lenevo Vibe at your fingertips. - More 3D themes and dynamic wallpapers with fluid 3D effects, experience todays cutting-edge technology.  Other benefits: - Different variety of themes, wallpaper, app icons and daily updates. - We provide special designs during festive periods, whether its Christmas, Halloween and other holidays, we will have a theme for you and everyone, so you can feel the festive atmosphere that you love. - Like football, basketball and other sports? Find your favorite sports theme here, along with your favorite celebrities, cartoons, and anything else. - Experience smooth 3D and HD themes and wallpapers regardless of what phone model you use  Love it? Dont wait, download the Lenevo Vibe now to not only to experience the Lenevo Vibe theme, but also the surprises waiting for you! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_USER_PRESENT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.RECEIVE_USER_PRESENT', 'android.permission.READ_EXTERNAL_STORAGE']",
}