{
"name" : "App Backup Lite",
"url" : "https://play.google.com/store/apps/details?id=com.ruet_cse_1503050.ragib.appbackup.lite",
"package" : "com.ruet_cse_1503050.ragib.appbackup.lite",
"category" : "Tools",
"description" : "AppBackup Lite is a personally developed android application that lets you to Backup, Share and Manage the applications of your android device. It is the Lite version of an upcoming application named AppBackup PRO that packs a lot more feature.    This version has the following features:  1. Backup single or multiple apps at the same time that you can install later, without any internet connection. This includes all the apps on the device: system apps, user apps and sd card apps  2. Share single or multiple apps at the same time with your friend with all the available sharing options on your device. It is not necessary to have AppBackup Lite installed on the destination device.This also includes all the apps on the device: system apps, user apps and sd card apps.  3. Access each and every application settings, whether it is a system app or an user app or a sd card app - all in one place, with just a few clicks.  4. Separate dedicated tabs for system apps, user apps and sd card apps which makes it very much organized and easy for you to find an app  5. Easy search option that can search through all the apps - the system apps,the user apps and the sd card apps, all in one place,meaning you do not have to switch tabs before searching  6. Easily update and rate any apps available on google play. It directs you to the app in google play store  7. Directly uninstall apps without going to app settings (some apps may not be uninstalled, particularly the system apps)  8. Helpful indicator for showing available backups, so that you dont have to remember which app is backed up and which is not  9. Shows location of the application with icon which is pretty much helpful while searching for apps  10. Clean and Beautiful look, fast and responsive. no ads...guaranteed! , does what it says - nothing more, nothing less   Note that some applications may not install on some devices and some devices will not be able to run some applications as expected(or will not be able to run them at all). System apps are the main example of this. Some system apps are particularly designed for your device and will not be installed on other devices. But what ever the reason is, this may happen because of the limitations of your phones Operating System(OS) and hardware, App Backup Lite has nothing to do with it.  On version 2.0, each list row now contains useful information like the package name, version,full date and time of installation,and most importantly, compatible android version range associated with each app, so that you know in advance that the app you are sharing can be installed on the target device.  Note that, some applications may install on lower or higher android versions than displayed,but those app will not be fully compatible on those android versions, or some of the features of the apps will not be available or apps may misbehave. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CALL_LOG', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}