{
"name" : "Ghost Commander File Manager",
"url" : "https://play.google.com/store/apps/details?id=com.ghostsq.commander",
"package" : "com.ghostsq.commander",
"category" : "Tools",
"description" : "Ghost Commander is a dual-panel file manager (as well as a FTP, SFTP, SMB, WebDAV, Drive, BOX, Dropbox client!) which will let you to manage your files locally or remotely as well as tweak your system in the root mode.   This is an open source software (see http://tinyurl.com/gc-source) and does not show any advertisement! The project exists only because of your donations.  The main idea behind the user interface is classic: copy and move files from one panel to another. Simple. Also, to not overload the display with extra checkboxes, file selection is made as follows: each file row is divided by two zones: tapping on the left you open files and folders, tapping on the right you select multiple items. If you are left handed, that could be swapped in the settings.  Writing access to external sdcard drives and USB OTG is provided through a special Storage Access Framework mode. Native mode can give only a read-only access to external drives.  Ghost Commander supports FTP and SFTP servers and Windows network shares, as well (with plugins) as Google Drive, BOX and Dropbox cloud storage, plus it can create/extract crypted ZIP archives and work with them as it was a regular folder.  For advanced users, this file manager also supports root (superuser) mode, which is essential to work with protected system files on a rooted devices, like tweaking the system, change file permission attributes/owners (chmod/chown).  This file manager is very customizable and comes with a lot of options which allow you to adjust its appearance and behavior to your personal tastes and habits.  Heres a list of the file managers features which include, but are not limited to: * easy sorting by name, extension, size or date * customizable multiselect (by tapping, or select by wildcards) * root / superuser (su) mode: remount partitions and make changes in system files * change file owner and permissions (in root mode only) * modifying files on external SDcard via the Storage Access Framework (SAF) mode * ZIP archive support: create and extract ZIP files, view inside a ZIP without extracting * built-in FTP client: upload to/download from your own site or a public one * favorite shortcuts for folders and locations * calculation of file and folder size and MD5 and SHA-1 * file search by content and other properties * text editor (built-in or external) * text and picture viewers * sends files via email, Bluetooth and so on * personalization: colors, font size, interface language, custom toolbar, etc * Windows network support via an optional SMB plugin * Streaming audio/video from a remote location to a player app * Access to the Google Drive, Dropbox and BOX or any WebDAV enabled cloud storage (with plugins)  Requested permissions explanation: INTERNET - to make FTP and other network plugins be able to connect to the servers. No connection is established without your command to do so. ACCESS_WIFI_STATE - to not to let the WiFi go down during a file transfer. WAKE_LOCK - to not to let the phone go to a deep sleep during a file transfer. WRITE_EXTERNAL_STORAGE - to let the file manager copy files to the sdcard. VIBRATE - to let the phone vibrate when a long file operation is done. INSTALL_SHORTCUT - to create shortcut icons to the desktop. MOUNT_UNMOUNT_FILESYSTEMS - to do so when you have asked that. ACCESS_SUPERUSER - to let the root: mode of the file manager functioning properly. Not used for any other purposes. USE_CREDENTIALS - only to let the Google Drive plugin access to the Google based services.   The website: http://tinyurl.com/gc1site The source: http://tinyurl.com/gc-source Vote for new features: http://tinyurl.com/gc-user Help with localization: https://crowdin.com/project/ghost-commander  If you like this application, a small donation to help further development will be appreciated. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_SUPERUSER', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.USE_CREDENTIALS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_SUPERUSER', 'android.permission.REQUEST_DELETE_PACKAGES']",
}