{
"name" : "Assistive Touch for Android",
"url" : "https://play.google.com/store/apps/details?id=com.easytouch.assistivetouch",
"package" : "com.easytouch.assistivetouch",
"category" : "Tools",
"description" : "Notice: Some new advance function such as capture screenshot, screen recorder, power popup...only support high software version 5.0 and up. If your phone dose not supported please do not give bad review. Thank for your support  What is Assistive Touch? Assistive Touch is an easy tool for Android devices. Its fast, its smooth, and its totally FREE. With a floating panel on the screen, you can easily use your Android smart phone. More conveniently, you can quickly access to all your favorite apps, games, settings and quick toggle. You can use smart clean function to clean running background apps, help your phone faster. Assistive Touch is also an ideal app to protect the physical buttons (home button and volume button). It is very useful for big screen smart phone.  Assistive Touch for Android - Virtual Home button, easy touch to lock screen and open recent task - Virtual Volume button, quick touch to change volume and change sound mode - Virtual Back button - Clean ram, boost speed, one tap ram booster. - Easy touch to open your favorite application - Go to all setting very quick with a touch   Quick touch setting include: - Capture Screenshot (5.0 and up) - Power popup (5.0 and up) - Open Notification - WiFi - Bluetooth - Location (GPS) - Ring mode (Normal mode, Vibrate mode, Silent mode) - Screen rotation - Volume up & down - Airplane mode - Flashlight Bright - Launch all applications or games on your device   Ram Booster - Clean Memory Boost your phone, free up memory (RAM), speed up your device and save battery. Our 1 Tap Boost make it easy to optimize directly from your home screen. This is a fast and use full booster feature to clear unnecessary apps running background, smart clean ram memory.   Screen Recorder - Screen Recorder is the best function to record the screen of your Lollipop. It does NOT require root access, no time limit, no watermark, ad free and very easy to use with one action to start and stop recording.  - Screen recorder lets you record your screen to HD and FullHD videos. You can also record audio from the mic and it is automatically muxed into the videos. That makes it very convenient to create tutorial, promotional video, comment about your game and gameplay or record video chat.   Dark Mode - It saves battery, mainly if the device uses an OLED or AMOLED screen. - While the dark text on a white background is the best in terms of readability, Dark Mode is better for reducing eye strain in low light conditions. With the majority of the screen dark, the screen glare is reduced, thereby minimizing flickering and blue light.   Customize - You can change color of background with your favorite color - You can change icon of Assistive Touch easy with many pretty icon, totally free - Gesture Setting for Floating Button (One tap, double tap, long press)  Feedback - If you like Assistive Touch please review and give us 5 stars - If you have any problem with this app please give us feedback for your problem, we will fix it quickly - Please email for us if you want send request new icon, color or function  Frequently asked questions: 1. Ask: How to uninstall this app? See this video: https://youtu.be/V8y7Gk2Qg_E - If you want to uninstall this Assistive Touch, please open app and go to setting, click on uninstall button. 2. Ask: Why my phone dont have Screenshot Capture function? - Screenshot Capture only available on Android 5.0 or higher.  This app uses the Device Administrator permission.  This app uses Accessibility services.  - CAMERA to turn on Flashlight, not take a photo.  - READ_PHONE_STATE only listen state of phone to make app work properly.  - BIND_DEVICE_ADMIN only use for lock the screen function. - We never publicly disclose any personal or sensitive user data related to financial or payment activities or any government identification numbers, photos and contacts, etc.  Thank for your support ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.EXPAND_STATUS_BAR', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.USE_FINGERPRINT', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.USE_BIOMETRIC', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.EXPAND_STATUS_BAR', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.KILL_BACKGROUND_PROCESSES']",
}