{
"name" : "Multi Chat - 2nd social accounts in parallel space",
"url" : "https://play.google.com/store/apps/details?id=com.clone.wechat",
"package" : "com.clone.wechat",
"category" : "Tools",
"description" : "Do you have 2nd or many social accounts/games accounts and tired to log in/out frequently of it?  Do you want to login 2 accounts or multi accounts on one phone at the same time just like your phone is an parallel space?  Now Multi Chat is available to satisfy your needs! Such as you can sametime online 2 WeChat, 2 Line, 2 WhatsApp, 2 Facebook, 2 Instagram, 2 Messenger, 2 Snapchat , multiple games accounts ,ect.   Multi Chat helps android app clone and run multi accounts of the same app simultaneously, and fast switch between multi accounts by one click!  Multi Chat helps users login multiple socialmedia & game accounts at the same time on one device,while messages and datas of your different accounts are in seperated parallel space. Multi Chat be compatible with most Android apps, such as social apps and games. Get Multi Chat immediately to manage multiple accounts, gain multiple fun!   One App, Multiple Social Accounts: Balance between users life and work easily. We support most Instant Messaging. Multiple accounts can work simultaneously on one device, connect different friends and share parallel information.  Double users online gaming experience: Log in many game accounts for Google Play and different experiences for both accounts at the same time!  Privacy and Security in app cloning: Hide users secret apps without worrying about prying eyes by keeping apps only in this dual space.  FEATURES: - Simple and Pure UI, clear notification to help you fast switch between multi accounts. - Different Acounts, Same Features, Separate Space, No Conflict! - Small and Low CPU Consume. - User Info are Safely Guarded.  Multi Chat powered by Years Tech, with the most light-weighed and powerful clone engine, can help you clone your app into another separated parallel space. Whats more, Multi Chat can help you manage notifications of the cloned app, and provide Privacy function to protect the cloned app. Multi Chat is compatible with most instant message apps, game apps and social networking apps. Google Play Service are supported, and you can connect with your Google Play Games or other services in your clones.  Notes:  Permissions: Multi Chat needs to apply for the permissions required by the apps added in to function normally.  Consumptions: Multi Chat itself doesnt take up too much memory, battery and data by which are actually consumed by the apps running inside.  Notifications: Please add Multi Chat to whitelist or exceptional list of some boost apps to ensure that notification of some social networking apps functions well.  If you like Multi Chat, please give us 5-star rating and share with your friends. For any problems, please contact us via the Feedback feature inside or email (nianyuxinxi@gmail.com). We are looking forward to your feed backs! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'com.android.vending.BILLING', 'android.permission.WRITE_SETTINGS', 'android.permission.CAMERA', 'android.permission.FLAG_GRANT_READ_URI_PERMISSION', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.CALL_PHONE', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.FLAG_GRANT_READ_URI_PERMISSION', 'android.permission.READ_PHONE_STATE']",
}