{
"name" : "Internet Speed test - Wifi Speed Test",
"url" : "https://play.google.com/store/apps/details?id=com.vtool.speedtest.speedcheck.internet",
"package" : "com.vtool.speedtest.speedcheck.internet",
"category" : "Tools",
"description" : "Internet Speedtest app is a professional network speed tester with high accuracy that gives you a really great experience.   Wifi internet speed test app allows you to the internet speed test for android: download speed, upload speed and ping rate of all internet networks right on your phone. Including: wifi network, 3G internet network, 4G, 5G and LTE internet network.   Key features of the speed test internet app  - Speed test wifi, 3G, 4G and LTE when downloading, check the upload speed and the ping rate of the network. - Select different internet networks to check the speed - Compare internet networks - Share with friends with just 1 click   Ping rate internet  - Ping indicates whether your connection speed is fast and stable or not, if the ping returns a high ms, it means that the network connection is not good, unstable, prone to jerks and lag. it is in units of ms (1/1000 of a second) - A ping rate of more than 150ms can cause lag during games, while less than 20ms is considered a very low latency.   Download speed test  - Download speed is the most important number, measured in megabits per second. It denotes how quickly data is downloaded to your phone, measured in megabits per second. - Test works by downloading multiple blocks of data into your phone, adjusting the size and number of connections to download as it runs. This maximizes your connection speed, ensuring it works as fast as possible.   Upload speed test  - Upload speed indicates the speed when you upload data. Compare the results of your speed internet with the speed given by the provider, to see if your wifi network is working properly. - Upload speed test works like download speed test, but in a different direction. Your phone uploads blocks of data, with adjustments made to make sure it uses the entire range of your connection.  NOTE: During the measurement of the connection speed, make sure that no programs are downloading or any phones on the intranet (if any) use the Internet connection to ensure that the measurement results are correct. In addition, you should also conduct multiple tests on many devices in different locations to get the most accurate results.  Speed test app has a simple design, is easy to use and has a modern nature of the digital age. You will be completely conquered by the exquisite, accurate and powerful product quality.   Development activities  Internet speed test app is a product in development. If you have any feedback or suggestions, please write  to us at speedtestinternet@ecomobile.vn. We look forward to hearing from you! ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}