{
"name" : "Screen Test Pro",
"url" : "https://play.google.com/store/apps/details?id=com.thjh.screeninfo",
"package" : "com.thjh.screeninfo",
"category" : "Tools",
"description" : "Used to test the characteristics of mobile phone tablet touch screen  Screen information: screen available area resolution size, pixel, density, DPI value and so on. Screen color test: detect the screen color rendering force, dead pixels, bright spot can be found at a glance. Screen Gray Scale Test: The more grayscale you can see, the better the screen color shades. Multi-touch test: detect multi-touch touch screen touch points. The screen can touch the area test: the full range of detection screen touch is normal. Screen Leak Detection: Detects whether there is a leak on the edge of the screen Text reading experience: detection screen text display, reading experience Maximum brightness test: detect the screen in the sun reading clarity Minimum brightness test: Test the minimum brightness of the screen under low light, night mode Resolution Sharpness Test: Test line clarity Color reproduction: the screen shows a variety of color accuracy, theoretically the higher the better. Touch screen pressure test: test whether the touch screen can respond to the size of the press Screen white balance: black and white color, some screen warm, some cold side  Sensor identification: (can check the number of sensors supported by the device) accelerometer sensor magnetic field sensor orientation sensor gyroscope sensor light sensor pressure sensor temperature sensor proximity sensor gravity sensor linear acceleration sensor Sensors rotation vector sensor relative humidity sensor ambient temperature sensor uncalibrated magnetic field sensor uncalibrated rotation vector sensor uncalibrated gyroscope sensor significant motion trigger sensor step detector sensor step counter sensor geo-magnetic rotation vector heart rate monitor ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}