{
"name" : "KALNIRNAY 2020",
"url" : "https://play.google.com/store/apps/details?id=com.awt.kalnirnay",
"package" : "com.awt.kalnirnay",
"category" : "Tools",
"description" : "The KALNIRNAY Group is known all over the world as Indias premier almanac publisher. Since its inception in 1973, the group has emerged as the No. 1 and most authentic almanac publisher, providing up-to-date information about Indias festivals, auspicious days and culture of all religions. According to the Audit Bureau of Circulation (India), it is the Worlds Largest Selling Publication with a circulation of 1,81,87,168 copies.  Kalnirnay is a calmanac for solar as well as vedic lunar events. It shows lunar dates and year along with regular dates and year. Events are shown in a local language.   Currently Kalnirnay App is available in Marathi, Hindi, English and Gujarati languages.   For any feedback or suggestions, please write it to kalnirnaydeveloper@gmail.com  Important Features of Kalnirnay are : 1) Detail information about lunar events. 2) View of Monthly Bhavishya, Panchang and Auspicious days for marriage. 3) Facility to set reminders for events of interest. 4) Ability to take notes and set reminders for the notes. 5) View of monthly events grouped by categories.  Application supports following features : 1) Panchang 2) Horoscope 3) Important Dates- This section includes the following sections: a) All Events - This section includes events for all the religions. b) Indian Holidays - This section includes list for Government declared holidays in India. c) Indian Festivals - Includes all the Festivals observed mainly in India. d) Next Year Events - This section includes list of events of upcoming year. e) Sankashti - This section shows the details of Sankashti in every month.In important dates section we can also set reminder for each event. 4) Reminder. This is a list of user reminders set for notes as well as events. There are 3 sections :  Past section shows reminders for past events. Today shows reminders due to be shown on current day including any advance warnings. Upcoming shows reminders set for even dates in future but does not include advance warnings. 5) Personal List. This section shows list of personal notes by month. Single Note can be added for a day using Set Reminder button on this screen. A reminder can be set for a note by clicking Set Reminder.  6) Settings a) Reminder Settings - User can set reminders for different events as well as notes.  b) Events to Remind - Events to remind screen shows types of events like Purnima, Sankashti, Gurupushya etc. These types represent group of similar events which repeat throughout the year. c) Language Settings  User can select Language of his/her choice from the available 4 Languages  Marathi, Hindi, English, Gujarati d) Location  User can select user specific location in order to customize Sunrise and Sunset timings only. The timing denoted on a particular date will always be shown in IST.  Third party applications like Clean Master, Anti Virus Apps and may affect the performance of Kalnirnay app on certain phone models. User should check/change settings of those particular apps in order to ensure Kalnirnay app functions properly. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.awt.kalnirnay.permission.C2D_MESSAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.alarm.permission.SET_ALARM', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}