{
"name" : "Max Remote - Computer",
"url" : "https://play.google.com/store/apps/details?id=com.bitunits.maxremote",
"package" : "com.bitunits.maxremote",
"category" : "Tools",
"description" : "Turn your Android device into a WiFi universal remote for your computer. Control your mouse, keyboard, slide shows, video players, and your favorite games with more than 20 models of joysticks and much more all from your Android device.  DOWNLOAD SERVER https://maxremote.wizlle.com  TUTORIAL https://wizlle.com/tutorial  SUPPORT support@wizlle.com  FAQ https://maxremote.wizlle.com/#faq  REMOTES   Basic Input (Mouse and Keyboard)  Browser  VLC Player  Media Player Classic  Windows Media Player  You Tube  Slide Show  Run  Transfer Text (Type or speak the text)  NumPad  GimpPad  CorelPad  Power (Shutdown, restart, hibernate...)  JOYSTICKS   NES  SNES - Super Nintendo  Nintendo 64  Saturn  Gamepad  Gamepad 2  Shooting Mode  Shooting Mode 2  Race Mode  Race Mode 2  NES Max Remote   SNES Max Remote   Nintendo 64 Max Remote   Saturn Max Remote  Gamepad Max Remote  Shooting Mode Max Remote  Shooting Mode 2 Max Remote  Race Mode Max Remote  Race Mode 2 Max Remote  * In Android 2.2 and 2.3 Joysticks only support single touch.  OTHERS FEATURES   Speech Recognition  Automatic server detection  Custom Remotes (Android 2.2 and up)  Custom Joysticks (Android 3.0 and up)  Custom/Android keyboard support  Single/Multi touch mouse  WiFi (TCP/UDP)   Max Remote also lets you open several programs remotely, including:   Microsoft Word  Microsoft PowerPoint  Microsoft Excel  Writer  Calc  Impress  WordPad  Notepad  Google Chrome  Mozilla Firefox  Internet Explorer  Opera  Windows Media Player  Calculator  Command Prompt  * If you prefer you can also use the Run tool to open your favorite programs.  Special thanks to Trevyn Mace ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}