{
"name" : "Ruler App – Camera Tape Measure",
"url" : "https://play.google.com/store/apps/details?id=com.grymala.photoruler",
"package" : "com.grymala.photoruler",
"category" : "Tools",
"description" : "ARCore Ruler app - Powerful tape measure tool, which takes advantages of the use of Augmented Reality. Please note that AR Ruler app works only on ARCore-supported devices. Check device compatibility: https://developers.google.com/ar/discover/  AR Ruler app uses augmented reality technology (AR) to tape measure the real world with your smartphones camera. Target aim on the detected plane and start to use ar tape measure tool:   1) Line - allows to tape measure linear sizes in cm, m, ft, yd, apply mm ruler or inch ruler. 2) Distance meter - allows to tape measure distance from device camera to a fixed point on the detected 3D plane. 3) Angle - allows to tape measure corners on 3D planes. 4) Area and Perimeter.  5) Volume  allows to tape measure size of 3D objects. 6) Path - allows to calculate the length of the path. 7) Height - allows to tape measure height relative to the recognized surface.  Photo Ruler app is designed to accurately tape measure the size of any object by either taking a picture of it or to measure it on the screen. Photo Ruler app allows you to measure things just as conveniently and precisely as with a traditional mm ruler or tape measure tool.  Ruler app is ALSO AVAILABLE FOR IPHONE: https://itunes.apple.com/us/app/photo-ruler-measure-and-label/id1020133524?mt=8  How to use Ruler app:  Photo Ruler app:  Firstly, please ensure that the object you wish to tape measure and the object of known length (Base Item) are in the same picture. There is a predefined list of Base Items in the ruler app settings, including Debit/credit card and Quarter. Select the one you have. Use the Base Item which is closest in size to the object you wish to tape measure using Ruler app.  Secondly, ensure that the Base Item and the object you wish to tape measure using Ruler app are in the same plane and the ruler app camera is (or was) parallel to them. This is necessary to avoid image distortions caused by the ruler app camera perspective.   Align the Blue arrows against the Base item and Green arrows against the object you want to tape measure. The length of the measured object is shown on the Ruler app screen.   Ordinary mm ruler app:  Use screen as a traditional mm ruler app. You can tape measure size of a small object by placing it on the devices screen and adjusting line limiters against the object. If you see that mm ruler app scale is visually stretched/ shrunken, you can reset mm ruler app calibration manually. On-screen mm ruler app can be calibrated using different Base Items, including Debit/credit card or coin. Choose between Imperial (inches) and Metric mm ruler (centimeters).  Accuracy of mm ruler app: Given that you have accurately aligned markers, you will receive a measure that is as precise as when using a traditional mm ruler app or tape measure tool. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}