{
"name" : "Applock - Lock Apps & Vault",
"url" : "https://play.google.com/store/apps/details?id=com.tohsoft.app.locker.applock.private.photo.video.vault.free",
"package" : "com.tohsoft.app.locker.applock.private.photo.video.vault.free",
"category" : "Tools",
"description" : "Apps locker & vaults is one of the best Android lock app with privacy guard, the best app locker with password & pattern lock screen, an amazing apps lock that provide high secure features.  This is the super aap locks that will protects your apps, hide picture, all features of app lock for apps & vaulty in a same lock box.  Privacy your photo, note, call, sms, email, settings..., all the privacy guard functions for you to ensure your phone security and keep your privacy safe. With this app loxk security protection, your privacy is well protected with password lock screen & pattern lock screen.  Application lock has option to enable invisible pattern lock. No more worry people may peep the pin or pattern.  Using this app locke, you will never worry about something like your kids mess up settings, paying for games! its so cool child lock feature! The app is perfect app lock that help you to keep your personal security, make protection app from everyone.  Features in detail: - Lock apps with a password, pattern password safe with anyone - The vault: Safe gallery vault, private photo vault help to hide pictures and hide videos.  - With the image vault & gallery lock, app move photo/video to secret vault by auto-deleting hidden images from the gallery after performing hide photos & hide videos - Lot of beautiful password lock themes, pattern lock screen themes - Customized lock screen password theme for the app, make privacy screen with style you wanted - App block Settings automatically right after app is opened at first screen, help to prevent some uninstall app - Protect your emails, SMS, call log - Three securities private mode: Lock apps with password lock, pattern lock or DIY. The keypad lock screen with passcode, DIY help you to make yourself keypad lock screen, pattern lock screen using your photo on the gallery - Option to make invisible pattern on unlock screen, people can not see your pattern lock screen while you are unlocking. More safe! - Easily to lock phone apps, unlock phone apps easily from an app list by one click - Explorer more apps and the locker themes from the More apps feature. - Password manager: Change password type between passcode, pattern, DIY and reset password - Unlocked by fingerprint (your device must support fingerprint sensor)  ===FQA=== 1. How to protect my phone ? You need to lock at least these apps: Settings & Google Play to prevent someone uninstall the app lock app  2. How to change password ? To password for apps, open the AppLock, click menu Settings then chose Change password  3. How to stop or uninstalling AppLock ? You must have password to uninstall this app lock, if you forgot passcode you can reset it via security email.  4. I forgot password, how to find it ? Enter your security email then click reset password.  5. If i lose private pictures when uninstall app ? Before uninstall, make sure to save photos by exporting your private photo from private photo vault module back to your Gallery. Note: the hidden photo will not be looked any more when you move out from pictures vault and this can be a risk.  Note: This is not a cloud videos storage or cloud picture vault, all pictures save in local storage and can be lost if you uninstall app without backup it.  Download this application locker right now, best app protector, app security and also keep hidden video, hide images inside the photo hider.  The privacy app: We does not collect any your personal & device information.  IMPORTANT NOTE: This app uses the Device Administrator permission. App uses this permission for Prevent uninstallation feature (on app left menu), when you turn on this feature, you will be asked to confirm before decide to active the Device Administrator permission, this is NOT REQUIRED, you can CANCEL if you do not want to grant the permission to app. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_ACCOUNTS', 'android.permission.RESTART_PACKAGES', 'android.permission.CLEAR_APP_CACHE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_ACCOUNTS', 'android.permission.RESTART_PACKAGES']",
}