{
"name" : "dataDex - Pokédex for Pokémon",
"url" : "https://play.google.com/store/apps/details?id=com.talzz.datadex",
"package" : "com.talzz.datadex",
"category" : "Tools",
"description" : "dataDex is an unofficial, beautifully designed Pokdex app for everyone to use. It contains detailed data on every single Pokmon, for every main series game ever released, including Sword & Shield and Isle of Armor DLC and Lets Go Pikachu & Eevee!  Multi-language support: - English, Italian, German, Spanish, French, Portuguese, Hebrew - Data only: Japanese, Chinese  Features:  Use the Pokeball multi-button to easily search, filter and sort the Pokmon, Move, Ability, Item or Nature youre looking for! Filter Pokmon by game version, generation and/or type to focus your results! dataDex also works OFFLINE, no internet connection required.  Pokdex A fully featured Pokdex that includes detailed data on every single Pokmon. Includes full entries, types, abilities, moves and so much more!  Team Builder (PRO feature) A fully featured Team Builder - create your Pokmon dream team. Choose a name, game version and up to 6 Pokmon to get a full team analysis, Including team stats, type relations and move type coverage. Tap any Pokmon in your party to customize even further with: Nickname, gender, ability, moves, level, happiness, nature, held item, stats, EVs, IVs and even your personal notes!  Location Dex A fully featured Location Dex - Find out which Pokmon can be  caught in each location, by which method, at what levels and more!  Move Dex A list of all moves from all games. Filter moves by generation, type and category! Get the most important data in a glance, or tap on a move to get even more data! Learn what Pokmon can learn each move quickly!  Ability Dex A list of all abilities from all games. Filter abilities by generation! Tap on a ability to see all data! Learn what Pokmon can have each ability!  Item Dex A list of all items from all games. Tap on an item to see all data!  Type Dex Choose any combination of types to view its weaknesses and resistances!  Nature Dex A list of all available natures. Learn how each nature effect your Pokmon!  Favorites and Caught checklist Easily mark any Pokmon as favorite or caught  for quick and useful managment of your collection!  --  * Disclaimer *  dataDex is an unofficial, free fan made app and is NOT affiliated, endorsed or supported by Nintendo, GAME FREAK or The Pokmon company in any way. Some images used in this app are copyrighted and are supported under fair use. Pokmon and Pokmon character names are trademarks of Nintendo. No copyright infringement intended.  Pokmon  2002-2020 Pokmon.  1995-2020 Nintendo/Creatures Inc./GAME FREAK inc. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}