{
"name" : "Phone Information",
"url" : "https://play.google.com/store/apps/details?id=com.inpocketsoftware.andInfo",
"package" : "com.inpocketsoftware.andInfo",
"category" : "Tools",
"description" : "Monitor phone (or tablet) usage Monitor CPU, memory and storage usage, the battery level and health, cellular and WiFi signal strengths. The status of each phone information category, CPU, memory, storage, battery, cellular and WiFi is shown with colored status bars.   Phone information Displays the key info about your phone or tablet. The Phone Information report can be emailed. Copy system information on the screen (long press) to easily paste into a 3rd party app.  The Phone Information report includes*: Device info (model, brand, product, serial number); Body (weight and dimensions); Operating system info. (version, API level, security patch level, uptime, build); Display (type, size, resolution, PPI, multi-touch); Processor (SOC, CPU, architecture, GPU); Memory (total and available); Internal storage (total and available); Primary shared storage; Camera (front, rear, video resolution); Battery info (Connection status, level, health, technology, temperature, and voltage); Telephony network info (IMEI, SIM state, network type, data connection, and cell information); WiFi network info; Bluetooth support; NFC support; IR support; GPS support; Fingerprint sensor support; Supported sensors and Temperature sensor values. * Where supported by the device.  More information Phone info: https://inpocketsoftware.com/android-phone-information/  Support support@inpocketsoftware.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}