{
"name" : "Calculator Plus Free",
"url" : "https://play.google.com/store/apps/details?id=com.digitalchemy.calculator.freedecimal",
"package" : "com.digitalchemy.calculator.freedecimal",
"category" : "Tools",
"description" : "USA TODAY named Calculator Plus among its 25 Essential Apps, calling it the handy calculator app thats garnered great user ratings  Im Calculator Plus - the perfect calculator for Android. Im easy to use and beautifully designed to do things better than your phone or handheld calculator ever did.  I love saving you time and effort. I remember everything you calculate, and let you review it anytime, making me perfect for shopping, doing homework, balancing checkbooks, or even calculating taxes. And if you quit the calculator and go do something else, its all still here when you come back. Youll never need to type the same calculation twice again.  Im attractive and effective and I make great use of your big, beautiful display:  - Youll never forget where you are in a calculation - I show you exactly whats happening at all times - I remember everything, so you can take a break, then come back later and pick up where you left off - I show your calculations in clear, elegant type thats easy to read, with commas just where they should be - You can use backspace anytime to correct a simple mistake, instead of starting over - Use memory to keep a running total you can actually see - My percentage key shows exactly what it did, so youre not left confused - Swipe memory keys aside for advanced math functions! - Full support for Multi-Window - true multitasking for your device. - My intuitive, lovable design makes it simple to do everyday calculations on your phone or tablet  Let Calculator Plus and your phone or tablet finally put that handheld calculator to rest!  This is an ad supported version - our ad-free version is also available.  Calculator Plus (C) 2019 Digitalchemy, LLC ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.VIBRATE', 'com.digitalchemy.calculator.freedecimal.permission.C2D_MESSAGE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY']",
}