{
"name" : "Call Recorder ACR: Record voice clearly, Backup",
"url" : "https://play.google.com/store/apps/details?id=com.cherinbo.callrecorder",
"package" : "com.cherinbo.callrecorder",
"category" : "Tools",
"description" : "IMPORTANT NOTE ABOUT OS ANDROID 10  https://docs.google.com/document/d/1SQEIZy3CY_bcEfMEU72BPVjZEwNWvBnALmU90P3lWqs/edit?usp=sharing  SUBSCRIPTION MANAGEMENT AND CANCELLATION https://docs.google.com/document/d/1Zdp51ozXs2j3mOGG3iYW3lJSc8gqgVrtqpzTHRQIuQQ/edit?usp=sharing  Not all phones support call recording, please dont give us bad rating if your phone doesnt support it. If you have any questions, please feel free to contact ceo@cherinbo.com, we will try our best to serve you.  Cherinbo Call Recorder, the worlds best call recording tool.  - Automatically record all incoming & outgoing calls, whenever and wherever - High quality of audio effect: Proprietary Amazify voice engine - Easy to use - The most compatible tool with nearly all devices - Better support Pixel \ Galaxy S7 (Edge, Note7) \ Galaxy S8 (S8+) \ Newer version  Main features  Call Recorder Automatically record calls to mp3 audio file format.   Cloud Backup Easily migrate to different devices. Data never get lost. Allows to back up call conversation information. A typical item includes recorded audio file (what), calls date and time (when) and calls phone number (who).   Wifi Transfer Easily transfer audio files with Mac and PC under the same Wifi. No USB! No data usage! No internet needed!   Voice Notes Speak a voice memo and have it automatically transcribed.  About Cherinbo and STAY CONNECTED Email: ceo@cherinbo.com Terms of Service: http://www.cherinbo.com/help/terms_of_service.html Privacy Policy: http://www.cherinbo.com/help/privacy_policy.html About Cherinbo (Videoshow.com): Cherinbo isfocusing on the fundamentals: data, video, and graphics. Our mission is to enable individuals and businesses to leverage the power of digital energy. Cherinbo specialists nearly all have 10+ years internet & mobile experiences.  Samsung has confirmed that Galaxy S9/S9+ dont allow call recording in Europe / Korea / India / Singapore / UK markets. Its said that update to the latest firmware would solve this problem. However, we cannot guarantee. We do seriously apologize. If we have the new solution, we will inform you immediately. How to update the mobile phone firmware? Go to Settings > Software update > Download updates manually  User Agreement Compliant with EU GDPR (General Data Protection Regulation) This Agreement is about Cherinbo cloud service, which we call theCherinbo cloud service or Services. Cherinbo cloud service login offers several types of authentication: email/password and third-party integration with Facebook, and Google. The user can backup and restore the local data within the app: call records in mp3 audio formats, structured data concerned with recorded items such as date and duration, and blacklist, etc. If click synchronize button, the cloud and the local status will be synced. For example, 1) phone A backs up 100 items to the cloud, then phone B can restore 100 items. 2) Back up 100 items to the cloud and delete 30 items locally in the same phone, then sync feature will cause 30 items in the cloud to be removed. Personal data had been protected by strict technical protection measures, effectively limiting the likelihood of identity fraud or other forms of misuse. The data could be accessed only by the user himself or herself. We provide the user with the right to erasure (Right to be forgotten). That means the user has the right to obtain from us the erasure of personal data concerning him or her without undue delay. The user can remove all the data synced to cloud by him or her, including the registered account. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_CREDENTIALS', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CALL_PHONE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE']",
}