{
"name" : "FINAL FANTASY XIV Companion",
"url" : "https://play.google.com/store/apps/details?id=com.square_enix.android_googleplay.ffxivcomapp_e",
"package" : "com.square_enix.android_googleplay.ffxivcomapp_e",
"category" : "Tools",
"description" : "The official FINAL FANTASY XIV Companion app helps you keep in touch with your friends and prepare for adventure, anytime, anywhere! Access your in-game friend list, chat with fellow adventurers, make and share plans using the event list, manage your items, and browse the market board!  Please note that an active service account and subscription for FINAL FANTASY XIV are required to use this app.  Please also note that some features such as chat can still be accessed for the first 30 days after your subscription for the main game has expired. You will lose access to all features after this period.    Features  Chat Chat with other players who are using the companion app; your in-game friends, Free Company and Linkshell members, and more!  Event List Create, edit, and manage scheduled events, bringing your friends together to take on raids, trials and more!  Item Management Sort, move, sell, or discard your items with the tap of a button!  *Please note that item management via the FINAL FANTASY XIV Companion app is not available while logged into the game with the associated service account.  Market Board Items can be purchased or listed for sale on the market board through the use of in-app currencies: Kupo Nuts or Mog Coins. Kupo Nuts can be obtained as login bonuses and Mog Coins are available as in-app purchases.  *Please note that access to the market board via the FINAL FANTASY XIV Companion app is not available while logged into the game with the associated service account.   Feedback & Bug Reports Your feedback is extremely valuable in helping us to improve the app and provide the best possible service. While the app review system allows users to evaluate the overall quality of the app, our Support Centre specialises in responding to more detailed feedback and reports of potential issues.   Should you encounter any issues when using the FINAL FANTASY XIV Companion app, please do not hesitate to contact the Support Centre at the address below or via the app.  Contact the SQUARE ENIX Support Centre: https://support.eu.square-enix.com/j/ffxiv   Device Requirements A supported device running Android OS 5.0 or later. * Using the app on an unsupported OS may result in crashes or other issues. * Using the app on a device with a screen smaller than 5 inch may result in display issues. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.square_enix.android_googleplay.ffxivcomapp_e.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}