{
"name" : "Assistive Touch 2020",
"url" : "https://play.google.com/store/apps/details?id=com.team.assistivetouch.easytouch",
"package" : "com.team.assistivetouch.easytouch",
"category" : "Tools",
"description" : "Notice: Some new advance function such as capture screenshot, power popup...only support high software version 5.0 and up. If your phone dose not supported please do not give bad review. Thank for your support  What is Assistive Touch? Assistive Touch is an easy touch tool for others OS, now has similar apps for Android. Its fast, its smooth, and its totally FREE. With a floating panel on the screen, you can easily use your Android smart phone. More conveniently, you can quickly access to all your favorite apps, games, settings and quick toggle. You can use smart clean function to clean running background apps, help your phone faster. Assistive Touch is also an ideal app to protect the physical buttons (home button and volume button). It is very useful for big screen smart phone.  Assistive Touch for Android - Virtual Home key, easy touch to lock screen and open recent task - Virtual Volume key, quick touch to change volume and change sound mode - Clean ram, boost speed, one touch boost - Easy touch to open your favorite application - Go to all setting very quick with a touch  Quick touch setting include: - Capture Screenshot (5.0 and up) - Screen Recording (5.0 and up) - Power popup (5.0 and up) - Back button - Open Notification - WiFi - Bluetooth - Location (GPS) - Ring mode (Normal, Vibrate, Silent) - Screen rotation - Volume up & down - Airplane mode - Flashlight Bright - All application on your device   Ram Booster - Clean Memory Boost your phone, free up memory (RAM), speed up your device and save battery. Our 1 Click Boost make it easy to optimize directly from your home screen. This is a fast and use full booster feature to clear unnecessary apps running background, smart clean ram memory.   Screen Recorder - Screen Recorder is the best app to record the screen of your Lollipop. It does NOT require root access, no time limit, no watermark, ad free and very easy to use with one action to start and stop recording.  - This screen recording app will let you make beautiful screencast videos by providing every feature that you need in a simple and elegant user experience design. - Screen recorder lets you record your screen to HD and FullHD videos. You can also record audio from the mic and it is automatically muxed into the screencast videos. That makes it very convenient to create tutorial, promotional video, comment about your game and gameplay or record video chat.  Customize: - You can change color of background with your favorite color - You can change icon of Assistive Touch with many pretty icon, totally free - Gesture Setting for Floating Button (One click, double click, long press)  Feedback - If you like Assistive Touch Easy please review and give us 5 start - If you have any problem with this app please give use 4 start and your problem, we will fix it quickly - Please email for us if you want send request new icon, color or function  This app uses the Device Administrator permission.  This app uses Accessibility services.  - CAMERA to turn on Flashlight, not take a photo.  - READ_PHONE_STATE only listen state of phone to make app work properly.  - BIND_DEVICE_ADMIN only use for lock the screen function. App does not use the permission for any other purpose.  - We never publicly disclose any personal or sensitive user data related to financial or payment activities or any government identification numbers, photos and contacts, etc.  Thank for your support ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.INTERNET', 'android.permission.EXPAND_STATUS_BAR', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.CLEAR_APP_CACHE', 'android.permission.USE_BIOMETRIC', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.EXPAND_STATUS_BAR', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.KILL_BACKGROUND_PROCESSES']",
}