{
"name" : "SEO SERP mojo - Rank Tracker",
"url" : "https://play.google.com/store/apps/details?id=com.SERPmojo",
"package" : "com.SERPmojo",
"category" : "Tools",
"description" : "SERP mojo rank tracker - Find out and track where your websites are ranking on Google for any keywords. Keep your SEO research up to date even when youre not at your desk. A must have tool for both SEOs and casual site owners.  With SERP mojo SEO rank checker you can: - Track an unlimited number of URLs - Track an unlimited number of Keywords - View unlimited ranking history for all keywords tracked  Features: - Track Google rankings (top 100) - Regional localization - Nice Graphs help you visualize better the ranking history - User friendly, thumb friendly and intuitive interface - Export rankings history as XLS, CSV and JSON data - Backup / restore your data as often as you like - Rank checking happens automatically once a day (when you open the app), but can be started manually for all keywords or only a few - Notification when the rank updates are finished  PRO Features: - Automatic background rank updates (ranks are updated daily, without having to start or keep the app open) - Analytics Insight - Keyword status (improved, maintained, lowered) - Total count of lost and gained positions - Total number of rank updates - Gained and lost positions per keyword  SERPmojo is free, there are no limitations on how many keywords / urls you can track, and there are no ads.  If you have any questions, please open the navigation drawer (swipe from the left edge, or tap on the application icon) and check the FAQ section.  If you find any bugs, incorrect rankings or simply want to suggest new features, please contact us. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}