{
"name" : "Low Brightness, Blue Light Filter - Light Delight",
"url" : "https://play.google.com/store/apps/details?id=com.gamemalt.lightdelight",
"package" : "com.gamemalt.lightdelight",
"category" : "Tools",
"description" : "Light Delight - Blue Light Filter to low screen brightness for Migraine. Light Delight blocks blue light by lowing screen brightness at night.  Light Delight becomes useful when it comes to protecting your eyes from blue light.  In light delight Blue Light Filter app you can low screen brightness by picking a color of your choice. Light Delight works as Low Brightness Filter that helps you to protect your eyes from blue light.  Twilight ensure eye care against blue light wavelength from screen light. Use night mode anti glare to protect your eyes from bluelight flux that causes chronic migraine, sleepless chronic headache.  what is blue light? -The visible light with the highest intensity is blue light, it is close to UV radiation.   Side effects of blue light flux? -Blue light is very harmful, particularly to our vision. It causes stress & headache -Higher exposure to blue light causes sleeplessness problem -Migraine pain  How Light Delight protect you from Blue Light? Mobiles brightness are too high even if we set it to a minimum level.  Light Delight Blue Light Filter reduce that brightness to a certain level that helps you to sleep better.  Night Mode - Blue Light Filter for Migraine work as your anti glare night screen filter and warm light night mode helps you by relieving eye strain and chronic headache during night reading. Its red light night mode is good for eye care against blue light rays from mobile screen light. so start your tired eyes care and improve eye health with blue light filter by using it as a twilight night light as soon as possible!  ---- Features -----   Premade Blue Light Filters Use one of 10 pre made anti glare, low brightness and blue light filter for best eye care.   Make own customized Night Mode Filter Create and edit already added night shift filter to protect your eyes perfectly from Blue Light with Twilight.   Temperature Control Use Temperature Control to decrease the intensity of Blue Light and protect your eyes from eye strain with Night Shift.   Simple Ui There is no complexity in Ui of Light Delight low brightness filter. it provides what exactly a filter provide in minimal non-complex settings.   Color Choice  Pick any color of your choice in Light Delight blue light filter.   Brightness Dimmer Low brightness filter dims each color also.   Opacity Dimmer You can also dim the color opacity wi specific darkness mode.   Auto start after reboot Light Delight low brightness night filter starts Automatically if it was enabled before device restart.   Dim Screen Brightness from notification Change color opacity & screen brightness directly from light delight night filter notification to dim brightness.   Screen Dimmer Low brightness is a brightness adjuster app that dims screen brightness.   Black as default color Low Brightness Night Filter has black color as default for night mode.   Small in Size This Bluelight flux night shift app has a smaller size.   Reduce Power Usage Anti glare night mode redue the battery useage by 30% while using in night to protect your eyes against migraine pain.   Light Delight Night Mode Filter also supports devices with navigation bar.(Soft Keys Devices).  Permissions : Draw over other apps: Required for the low brightness screen filter to work.  Tips:  Before installing any other app, please turn off Light Delight night filter to enable installation.  When taking screenshots, please turn off Light Delight low brightness screen filter app in case screenshots use the app effect. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}