{
"name" : "Urban Free VPN proxy Unblocker - Best VPN",
"url" : "https://play.google.com/store/apps/details?id=com.urbanvpn.android",
"package" : "com.urbanvpn.android",
"category" : "Tools",
"description" : "Unblock any website. Stay anonymous & safe with free, unlimited VPN for Android! Just one click and you are on your way!  How to enjoy unblocked, safe browsing for free? 1) Click INSTALL 2) Open the app & choose your preferred location 3) Thats it: you are connected through a secure, unlimited proxy!  Urban VPN is a subsidiary of Urban Cyber Security and the creator of one of the most reliable and secure, free virtual private networks in the world. Urban VPN Browser Extension offers you Quick and Easy Activation & Unlimited bandwidth!  Keep your device activities safe & private. Protect your device from harmful advertising and protect your device from malware and other vulnerabilities when using public Wi-Fi connections. With Urban VPN you can surf safely without fear of personal information theft, among other security risks.  Mask your IP and choose an IP from a constantly growing pool of international locations across the globe. Avoid being tracked by websites and advertisers - bypass firewalls and browse anonymously! Avoid harmful advertisement by enabling our ad-blocking feature.  We will not store, collect or process any Your personal data, the Urban VPN extension also ensures third parties will NOT be able to track your browsing activity and will not sell your data tracked or sold to third parties  your connection is encrypted and safe.  No need to download further software - just click to download install the extension and you are set to surf.  When you choose Urban VPN, you choose quality, safety and security!  - 100% Free  - Hide your IP & Encrypt your traffic  - Unblock websites and restricted geo-locations  - Stream and download content with ease and speed  - Simply and quickly swap IPs according to desired location ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.REORDER_TASKS', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}