{
"name" : "Assistive Touch,Screenshot(quick),Screen Recorder",
"url" : "https://play.google.com/store/apps/details?id=com.beyondsw.touchmaster",
"package" : "com.beyondsw.touchmaster",
"category" : "Tools",
"description" : "This application uses device manager permissions. It is only used when using lock screen feature and android version which is below 9.0.  This application uses accessibility services. Only used for auto clicker and global key operation. You need to grant this permission to perform these operations.  Assistive Touch for Android. A caring secretary for your smartphone. Help you operate your phone faster and easier. At the same time, it has powerful features such as screen recording, screen capture, phone boost (memory cleaning), music control, global gesture operation, automatic clicker .  Features:  Acting physical buttons (power, back, home button, recent programs, etc.) to help you extend the life of physical buttons  No Root required, multiple ways of fast and high-definition screen recording, no watermark, no time limit, support for pause, support for screen drawing during screen recording, and support for turning on the camera during screen recording.  No Root required, multiple ways to take screenshots quickly, and support editing screenshots (brushes, mosaics, cropping, etc.). Support to customize the quality and format of screenshots, and customize the save path.  Music control: Control music player app without open it, you can control the app that is currently playing music with a single tap on any interface, the next and previous song, play and pause, and even control the playback progress.  Phone boost: help you to quickly and deeply clean up memory and kill unnecessary processes. Speed up your phone.  Automatically crop the status bar and navigation bar when taking screenshots. (This feature is an advanced version and requires payment)  Lock screen, support fingerprint unlock.  Volume control (customizable volume source and volume control UI). One-touch phone mute and media mute.  Wifi, bluetooth, screen auto-rotation, flight mode, data flow, screen brightness and other switches are quickly set. There is no need to open the system settings interface for quick settings.  Flashlight  Customize the style and layout of floating buttons and floating windows, more beautiful and free  Add your favorite apps to the favorites panel and quickly launch the apps  Automatic clicker ( supports android 7.0 + , no Root required), fully automatic automatic click, can be used as a game assistant, etc., free your hands  Support global gesture operation and enjoy a richer and smoother experience than the full screen native gesture operation. Support custom global gestures, can be used as the back key, screenshot, screen recording, or even turn on the flashlight, if you want.  Support custom long press Home button behavior (screen capture, screen capture, open camera, etc.), with it, you can long press Home button to do what you want to do (support Android 6.0 and above systems, a few devices not support)  We are committed to creating truly useful, high-performance, excellent user experiences, and constantly improving and optimizing boutique applications.  If you have any comments or suggestions during use, you are welcome to send us an email: beyondsw.assistive.us@gmail.com for feedback, and we will deal with it as soon as possible. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.FLASHLIGHT', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.INTERNET', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES']",
}