{
"name" : "Ryn VPN - Unblock Free Unlimited Secure VPN Proxy",
"url" : "https://play.google.com/store/apps/details?id=com.secure.cryptovpn",
"package" : "com.secure.cryptovpn",
"category" : "Tools",
"description" : "Ryn VPN 2020 - A Secure VPN Proxy Master for UAE is a Free VPN based Proxy master that encrypts your data and safely connects you to any web site or mobile app. Ryn VPN keeps you safe by directing your data traffic through our secure servers. The Secure VPN Proxy Master 2020 is fully automated and it securely connects to the internet across the UAE.  What do you expect from a great VPN app?  # Unlimited Bandwidth to use # Endless list of countries to connect to worldwide! # Simple one click to connect # Super fast speed vpn # Unblock any apps and sites in any country # VPN for privacy , WIFI Security # IP vanish/ IP Fake # Hotspot VPN # Unblock VPN for VOIP(Based on openvpn, support all voice call and video call) # Unblock APP and site for school  With Ryn Super Turbo VPN, the ultimate vpn proxy master for UAE, your IP address is hidden and you are anonymous to browse the internet without revealing your location to anyone without permission. So now you can browse the internet safely knowing your passwords, credit card numbers, and bank accounts are safe from hackers. Also you can now privatize your online activities and location whether you are at work, airport, caf lounge, home using a shared public Wi-Fi.  Its a VPN server with no session, speed or bandwidth based restrictions. Yes its 100% unlimited. Download the most trusted vpn proxy service which offers a highly secured, private platform with top performance on speed and stability. RYN VPN gives you complete online freedom  bypassing geo-restrictions and accessing worlds content from anywhere, with just 1 touch.  So, now lets take a quick glance over the important features and benefits that are imparted by this new generation VPN proxy tunnel app:  A. Protect your privacy  Browse Anonymously Hide IP address and protect your identity when surfing/browsing the web with the VPN proxy. Protect your network traffic and internet under public Wi-Fi hotspots. Browse anonymously and securely without being tracked. Protect data privacy, personal information security and internet security while Ryn VPN is on.  B. High Speed with Wi-Fi & Network Security Encrypt and secure your android phones internet on public wireless hotspot. With 1000s of servers being provided, it helps in achieving a superfast speed. Our intelligent algorithm detects your location automatically and connects you to the nearest and fastest server. As a result, your connection will be much faster than any other VPN or proxy providers.  C. Unblock Websites & Apps Best way to unblock any website on the web. Be it at school wifi or within office firewalls, it can unblock anything and everything. You can freely access blocked websites, apps or games with VPN tunnel. Bypass and Unblock websites or social media sites with free VPN proxy server. Bypass the firewalls as well using free VPN proxy. Enjoy multiple proxy servers to bypass blocked website and apps.  Please dont download BitTorrent and any P2P. Otherwise, you will be blocked!  Porn sites and adult content(including Porno Torrent and Sex sites) are not allowed, you will be blocked!  So, what are you still waiting for? Download the Ryn free vpn app now and protect your privacy along with unblocking restricted contents. Try our free vpn server app once and we assure you that you wont regret using our app. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CALL_LOG', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}