{
"name" : "QR Code Scanner - QR Reader Pro",
"url" : "https://play.google.com/store/apps/details?id=com.media.qrcode.barcode.scanner",
"package" : "com.media.qrcode.barcode.scanner",
"category" : "Tools",
"description" : "Smart QR code pro is one of the fastest reader and scanner apps on the market  You want to find information about products, you want to check the origin, the origin and related information about the product? You want to check if the product information has been displayed on the product you are about to buy or if you care about whether it is correct. Or simply want to check if the product is genuine or fake. All will become extremely easy if you use our QR Code Reader application. QR code reader is the fastest qr code scanner pro and scan barcode application available on market so you can access product information easily.  Main features of the app  Scan without internet!  Support to scan all qr reader pro and Barcode  To scan the smart qr code pro and Barcode, simply open the application and insert it into the scanner. It takes couple seconds to display the results.  Save to list history code scanned.  Scans as: QR reader pro, Data Matrix, EAN8 / 13, Code39, Code128, Barcode, Quick Code ...  You can share, copy, seach... code scanned.  Support reading qr code scanner pro and scan barcode quickly and accurately  This is a smart application that identifies the qr scanner code as qr code reader and scanner  Support light in cases of qr code scanner and Barcode in low light environments or insufficient light  Help return information about the product you care about in a quick and extremely simple way  In addition, you can create your own Barcode Scanner easily  Exceptional Features   Automatically identify Barcode Scanner  Returns information accurately and almost instantly  Helping you become a smart consumer can access product information  Create your own Barcode Scanner for your product, making it the fastest access to users with just a QR code scanner pro.  Thanks! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.CALL_PHONE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_CONTACTS']",
}