{
"name" : "Simple Gallery - Photo and Video Manager & Editor",
"url" : "https://play.google.com/store/apps/details?id=com.simplemobiletools.gallery",
"package" : "com.simplemobiletools.gallery",
"category" : "Tools",
"description" : "Simple Gallery is a highly customizable offline photo gallery and file organizer app loved by millions of people all around the world for its great intuitive user experience. Use the photo gallery to edit photos, recover deleted photos, protect and hide photos, create secret photo album and easily crop pictures & view a huge variety of different pictures and video formats including RAW, SVG, GIF, panoramic and much more. Download this non-invasive photo gallery and manage your albums the way YOU want them to be managed!  ------------------------------------------------- Simple Gallery - Photo and Video Manager & Editor -------------------------------------------------   A beautiful modern photo album with option to recover deleted videos and crop pictures with no ads  Advanced Photo editor  crop pictures, edit photos, search images. Comfortable and easy to use file organizer + recover deleted videos  No internet access needed, giving you more privacy, security and stability - truly offline secret photo album  Quickly search images, hide, edit photos and recover deleted photos, videos, GIF & other files  Open and view many different photo and video types (RAW, SVG, panoramic, GIF etc)  A variety of intuitive gestures to easily edit & organize pictures in our photo manager  Lots of ways to filter, group and sort files  Protect and edit photos & videos with a pattern, pin or fingerprint  Use pin, pattern & fingerprint to protect the app launch or specific functions too  Recover videos from the recycle bin  Use the file organizer to toggle visibility of files to hide photos & videos, crop pictures  Create a customizable slideshow of your files with many options within the photo gallery Search images, edit photos & zoom high quality pictures, videos and GIFs easily with gestures  Easily force portrait or landscape orientation for easy video viewing  File organizer - the Simple Mobile photo gallery allows you to rename, copy/move, un/hide, delete images,videos, GIF  Set any image as wallpaper without hassle   ADVANCED PHOTO EDITOR Simple Gallery file organizer and photo album makes it easy to edit your pictures on the fly. Crop pictures, flip, rotate and resize or apply filters you desire.  SUPPORT FOR MANY FILE TYPES Simple Gallery photo gallery file organizer supports a huge range of different file types including JPEG, PNG, MP4, MKV, RAW, SVG, GIF, Panoramic photos, videos and many more.  HIGHLY CUSTOMIZABLE FILE MANAGER From the UI to the function buttons on the bottom toolbar, Simple Gallery is highly customizable file organizer and works the way you want it to.  RECOVER DELETED PHOTOS & VIDEOS Accidentally deleted a precious photo or video from your photo album? Simple Mobile Photo Gallery features a handy option where you can recover deleted photos - all thanks to this amazing photo vault app  PROTECT & HIDE PHOTOS, VIDEOS & FILES Using pin, pattern or your devices fingerprint scanner you can protect and edit photos, recover deleted videos,crop pictures & search images. You can protect the file organizer itself or place locks on specific functions of the app. For example, you cant delete a file without a fingerprint scan Check out the full suite of Simple Tools here: https://www.simplemobiletools.com  Standalone website of Simple Gallery Pro: https://www.simplemobiletools.com/gallery  Facebook: https://www.facebook.com/simplemobiletools  Reddit: https://www.reddit.com/r/SimpleMobileTools  DEPRECATED: This version of the photo gallery app is no longer maintained, get the Pro version at https://play.google.com/store/apps/details?id=com.simplemobiletools.gallery.pro . Dont forget that if you uninstall any paid app within 2 hours, you will automatically be refunded. If you want a refund anytime later, just contact us at hello@simplemobiletools.com and you will get it. That makes it easy to try it out :) ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.USE_FINGERPRINT', 'android.permission.SET_WALLPAPER', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}