{
"name" : "QuickShifter easy (iQSE)",
"url" : "https://play.google.com/store/apps/details?id=com.healtech.iQSE",
"package" : "com.healtech.iQSE",
"category" : "Tools",
"description" : "Attention: This app is compatible with the QuickShifter easy (iQSE) module only. For the 1st generation QuickShifter easy, please use the QSE app available on Play Store. This app is compatible with Android 4.0 and above.  Use this application to control your QuickShifter easy (iQSE) module from HealTech through your Android device via Bluetooth. After installation, it does not use internet connection and its Ad-free.  The app will require two permissions for the following reasons: - Location: Since Android 10, it is required for Bluetooth data connections. - Access photos, media and files: required for the open/save operation so you can save your settings. For both, we recommend selecting Allow only while the app is in use. The app does NOT collect or send any information from the users device, it is safe to use.  iQSE is a next generation standalone quickshifter module. - Easy to install. Easy to setup. Easy on your wallet. - The perfect choice for anyone aiming for quicker lap times, better 1/4 mile runs or simply more fun on the road. - Change settings any time you wish through your phone, wirelessly, without hassle. - With the unique sensor and bike specific wiring harnesses, installation couldnt get any simpler than this. - Packed with unbeatable features for an unbeatable price. Best price/value.  The product is available from our distributors and dealers in most countries. Please check out our website for other cool and useful products for your motorcycle. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.BLUETOOTH_PRIVILEGED', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_BACKGROUND_LOCATION']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.BLUETOOTH_PRIVILEGED', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_BACKGROUND_LOCATION']",
}