{
"name" : "Auto Screen On Off(Smart Cover",
"url" : "https://play.google.com/store/apps/details?id=com.danielkao.autoscreenonoff",
"package" : "com.danielkao.autoscreenonoff",
"category" : "Tools",
"description" : "Sometimes the power button is hard to press, or you want to save protect the hardware power button for longer use. This app and provided notification/widget can save you from accessing the power button all the time.  Feature: 1. By detecting p-sensor, automatically turn on/off the screen for you. 2. Allows you to only enable the function during charging. 3. Allows you to disable the feature when the screen is rotated. 4. You can set separate timeout values for screen on/off delay to prevent from accidentally triggering the feature. 5. A widget is supported to quickly toggle the function. 6. Notification is supported to quickly toggle function, or directly turn screen off. 7. Power Save Mode: works on some devices. Try if it works for YOU! 8. Play sound or vibrate while close. 9. Exclude apps you dont want automatically screen off feature 10. A widget to turn off screen! great power saver yet useful  Usage: 0. Modify Settings in Auto Screen Settings app and enable the function or  1. Add widget AutoScreenOnOff to your home screen 2. Press once on the icon to trigger Device Management Confirmation Dialog. 3. Agree to activate device management. (This is required to turn off the screen) 4. Now everything should work now. Try cover your hand over the top area of the screen (where the proximity sensor might be located) to see if it works.  Attention: - Since it uses proximity sensor to detect whether the screen should be on or off, this may use some power consumption. So, if you are not using your device for a long time, suggest you turning off the function.  - If you wants to uninstall the app, please do it from top of the app.  Translation Helps from: Hai Long Hoang: Vietnamese WebFrogeye : French Jn Kuera: Slovak Renek: Czech Xander Stone: Dutch Andrew: Russian, Ukranian Paul L. Scholz: German  ps. If you have any suggestions, questions, bug reports, or you are willing to help translate strings, please send me email. leinadkao@gmail.com ",
"desc_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.EXPAND_STATUS_BAR', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.EXPAND_STATUS_BAR', 'android.permission.DISABLE_KEYGUARD', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}