{
"name" : "Random Ringtones Manager (RRM)",
"url" : "https://play.google.com/store/apps/details?id=com.pwnplatoonsaloon.randomringtonesmanager",
"package" : "com.pwnplatoonsaloon.randomringtonesmanager",
"category" : "Tools",
"description" : "Android Random Ringtones Manager lets you randomize your phone call, SMS, Default Notifications, Gmail, Hangouts, Facebook, Snapchat, or any other app notification tones on your phone! Discover and post your playlists at reddit.com/r/androidrrm. Perfect for Halloween, Cosplay, theming, and a more fun phone! Setup your all your Ringtones with this android app!  Features 4.2 (March 2019) Updated the app to target SDK 28. Change the app to play ringtones through a custom media player instead of the Notifications API. Revamp the permissions structure. Migrated away from RECEIVE_SMS permission in favor of the Notification Listener API. Various other bug fixes and tweaks.  4.1 (October 2016) Added a Sound Inspector accessible from the nav drawer. Use this to figure out why notification ringtones are or are not playing!  4.0 (March 2016): -Default Notifications Support -Random ringtones for any application on your phone! -Brand new Nav Drawer layout -Free users get 2 Geofences now, instead of one -Custom NFC cards available!  New in 3.0!: -Share entire playlists with others! -Download playlists from reddit.com/r/androidrrm, entering a URL, or even an NFC card! -Playlist Editor -Add all songs in Directory -Add a song by browsing -1 Geofence -Material Design and animations, with a great look and feel  Paid 3.0 Features: -RRM Pro: More than 1 Geofence -RRM Pro: Geofenced Volume Control -RRM Pro: Remove Ads -RRM Pro: More to come. Buy now before the prices go up with the introduction of new features!  Features introduced in 2.0: -Playlists! Assemble a unique playlists for your ringtones and text tones. Access your playlists in the Navigation Drawer! -Edit a ringtone using Ringdroid from Random Ringtone Manager by long clicking -SMS random ringtones -Phone call random ringtones -Filter by: Ringtone, Notification, Alarm, External storage, Internal storage, and instantly search! -Easy to use and fast interface. Spend less time trying to remember what folder your ringtone is stored in, and more time putting together your ringtone list, and enjoying the ringtones when you are contacted! -Share and delete ringtones my long clicking   Permissions: READ_EXTERNAL_STORAGE and WRITE_EXTERNAL_STORAGE: For the app to look up and the ability to delete ringtones via long press READ_PHONE_STATE and WRITE_SETTINGS: The app needs to be able to change your default ringtone and read the media files currently stored on your device RECEIVE_SMS: When you receive a text, one of your selected ringtones will play ACCESS_NETWORK_STATE & INTERNET: Banner Ad. In future versions, you will be able to disable ads RECEIVE_MMS & RECEIVE_WAP_PUSH - MMS support VIBRATE - RRM can now vibrate with SMS notifications BILLING - For RRM Pro RECEIVED BOOT COMPLETE - RRM will startup when your device starts NFC - Find me promoting RRM at anime and gaming conventions in Texas. Ill have NFC playlists with me!   Special thanks to my graphics artists: Kyrsten Carlson - App icon Austin Rains - promotional artwork - https://www.behance.net/abrains3716 ",
"desc_perms" : "['android.permission.RECEIVE_SMS', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.NFC', 'android.permission.VIBRATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.NFC', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}