{
"name" : "RC Throwmeter",
"url" : "https://play.google.com/store/apps/details?id=com.pitchgauge.j9pr.pitchgauge",
"package" : "com.pitchgauge.j9pr.pitchgauge",
"category" : "Tools",
"description" : "RC Throw Meter App allow you to build your own Bluetooth throw-meter for a very reasonable cost. It doesnt require any soldering or cabling. You just need to have access to a 3D printer and that is all! The component is the BWT61CL from Wit Motion, a 6 axis Bluetooth attitude angle sensor with battery incorporated. It is based on the JY61 sensor, has Bluetooth or serial connectivity, integrates a dynamic Kalman filter algorithm, an internal voltage stabilising circuit module, voltage 3.3v~5v. The only drawback it has is that the Bluetooth BLE is only compatible with android. The battery has a 150mA capacity so last for a long operation time. The work is limited to the 3D printing of the clips that allow fixing the device on the trailing edge of the glider. It has been designed on DesignSpark and you will find the .rsdoc original file in addition to the STL file. https://planet-soaring.blogspot.com/2019/02/make-your-own-bluetooth-rc-throwmeter.html  The mount is removable from the device, its clips and the charging cable can be carried/stored in the plastic box it was received in.  Just print the part, in PLA or PETG or ABS, 100% in fill for me. The dimension is optimised for F3x plane wings and tailplanes. To protect the surface of the control surface and avoid the clips to slide/shift, I added a piece of rubber (a small piece of bicycle inner tube) on the clips surfaces, with double side tape.  The App supports two BWT61CL Bluetooth sensors connected simultaneously so you can measure two similar control surfaces at the same time. Once paired with one or 2 Bluetooth sensors, RC Throw Meter App measures angles, travels, max travels UP and DOWN to measure quickly current throws, and feature a visual alarm to help setting your throws without exceeding a limit you set. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.BLUETOOTH', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}