{
"name" : "MyPermissions Privacy Cleaner",
"url" : "https://play.google.com/store/apps/details?id=com.mypermissions.mypermissions",
"package" : "com.mypermissions.mypermissions",
"category" : "Tools",
"description" : "Check out our new, free app - MyPrivacy  https://play.google.com/store/apps/details?id=com.myprivacy  ****  Discover who can get you in trouble by accessing your social media account and reading your data & personal information. Find which apps have permissions to act on your behalf, to access your photos or contacts, use your location, and more. Disconnect offending apps with just a few taps.  What the press is saying  MSNBC: Finds and fixes all your privacy settings.   Mashable: Have 2 Minutes? Check Out Who Has Access to Your Social Media Accounts.  USA Today: See what programs and services can borrow your keys [...] and think carefully and skeptically to decide if they still deserve that privilege.   Wired: Finding the permissions pages can be tricky, but the nice folks at Privacy Cleaner made a handy dashboard linking to every one.  With MyPermissions, you can  Scan and discover threats to your personal information and data  Connect Facebook, Instagram, Twitter, Google+, Dropbox, and Yahoo to see detailed app permissions  View our detailed risk analysis for each app and its permissions  Clean & fix any privacy issue that threats your personal information and data.   MyPermissions Live Protection will scan your smartphone, tablet, and online service account 24/7 and notify you as soon as new threats and access permissions to your personal information and data are discovered.  With MyPermissions FREE account you can:  Scan & Discover * Scan & discover threats and access permissions to your personal information and data on your online service account * Discover apps you are no longer using or even forgot about, but can still read your personal information and data * Discover which apps have permissions to do what kind of activities, such as: -- Act on your behalf on social media -- Read your entire friends list -- Find out your birthday and age -- Access your contacts and photos -- Use your location -- Read your relationship history -- And more...   Risk Analysis MyPermissions Provides a detailed privacy risk analysis that allows you to: * Discover how your personal information and data are at risk through which app, and what sort of permissions those apps have * View the detailed risk analysis provides for each app on your online service account   Ongoing, Immediate, 24/7 Protection with Live Protection With Live Protection, MyPermissions will: * 24/7 protection against new threats * Alert you as soon as a new app gains access to your personal information and data  * Alert you as soon as an existing app gains new permission to access your personal information and data is scanned & discovered  With MyPermissions PREMIUM account you can:  Everything in our Basic plan  Clean & Fix Privacy Issues  With MyPermissions you can choose whether to: * Disconnect an app connected to your online service account completely and stop it from accessing your personal information and data   PRIVACY:  We do NOT use, collect, or store ANY of your personal information. Connecting your online service account is done by re-directing you to the accounts website and youll enter your data on the actual social networks servers.  We created MyPermissions because we believe in giving you control over your privacy, personal information, and data. To provide, manage, and improve our services, we collect a list of the installed apps on your device. We use the list solely in a way that does not allow to track who you are. We do not share this information with anyone. Ever.  You can read our full privacy policy here - mypermissions.com/privacy  For Frequently Asked Questions, please click here - mypermissions.com/faq ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.GET_TASKS', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}