{
"name" : "Malayalam Keyboard",
"url" : "https://play.google.com/store/apps/details?id=com.clusterdev.malayalamkeyboard",
"package" : "com.clusterdev.malayalamkeyboard",
"category" : "Tools",
"description" : "Manglish Malayalam Keyboard, commonly known as Manglish has transformed the way users type Malayalam on Android. Join 5M+ users who save time using our word predictions, accurate phonetic transliteration and Malayalam voice to text typing.  When enabling any keyboard that you download, Android shows a standard warning. Manglish Keyboard does not collect or store any personal or confidential information.  You can type by speaking to your phone using our all new Malayalam Voice to Text typing feature, called Manglish Voice.  Manglish has the best Malayalam movie sticker comments. Use these amazing fun stickers in your conversations inside any messaging app.  Typing with Manglish is the fastest way to type - you dont need any other Malayalam input tools. It works inside all applications on your phone - no more copy-paste! Start typing in English and choose Malayalam word for what youre typing. The most common words work without internet.  Chat with your friends and family in your native language - use Malayalam on Whatsapp, Facebook or any other app. The only app that supports Malayalam dialogue stickers in Whatsapp and other chat apps.  How to use this Malayalam keyboard 1. Open Manglish Keyboard from your apps after installing 2. Enable and choose Manglish as your keyboard 3. Customize settings and choose any of the amazing themes 4. Start typing Malayalam everywhere 5. Spice up your conversations by using Malayalam photo comments from our curated movie dialogue stickers  Features - Switch between Malayalam and English predictions by clicking on the  button - Add emojis/smileys in your chats from the keyboard. Hold the 123 key or press 123 and select the emoji icon to get a list of smileys - Click on the stickers icon in the suggestion bar to open the Sticker/GIF/Emoji section. You can also use the emoji key to open this - Malayalam Voice to Text app: type by speaking into your phone with Manglish Voice Keyboard  Settings - Choose Vibrate on keypress to add a small vibration when pressing each key - Enable Insert space after . , to add a space automatically after these characters - Enabling Press space to select word will automatically select the Malayalam prediction when you press space - Choosing Edit English on backspace will change the converted Malayalam text back to English for easier editing. Turning this off will let you edit Malayalam text directly by pressing backspace - Use offline predictions can be turned off to get only exact matches for what you type. This will need an active internet connection to work - Choose a theme that you like from Keyboared themes - To remove all ads from the app, click Remove Ads and make a purchase. This is a small one time price and helps support us  Premium You can choose to buy Manglish Premium from the Remove Ads section in settings. Your purchase will help us continue improving this application and pay for expenses towards running our infrastructure. Its a one time purchase and will give you premium features forever.  Typing FAQ - To get , type njangalkum - For , type aash and youll get the full prediction - To type just , type aashamsa and scroll the suggestions to select it - Some words needs internet to work - you might have to wait for a few seconds if internet is slow  Forget Handwriting Input, Indic Keyboard or other slow manual keyboards - this is the best Android Malayalam Keyboard and is fast, effortless and the top rated.    .  We respect your privacy - No personal information or credit card details are collected. A standard warning is shown by Android for all keyboards that you download. - Anonymous statistics may be collected to improve your experience as per our privacy policy  Share your suggestions by emailing us at mailprocrastinators@gmail.com ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_CONTACTS', 'com.android.vending.BILLING', 'android.permission.vibrate', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}