{
"name" : "C7 Lignum Urbem",
"url" : "https://play.google.com/store/apps/details?id=com.crcampeiro.lignum",
"package" : "com.crcampeiro.lignum",
"category" : "Tools",
"description" : "O aplicativo C7 Lignum Urbem tem o objetivo de contribuir nos processos de gesto e manejo de rvores no contexto de um espao urbano, sendo estruturado pelas seguintes funes: - Definio de rea Urbana. (Cadastro de Muncipio, Bairro, Vila e outros) a qual ficam vinculados logradouros/endereos. Nvel Primrio - Cadastro de Endereos. Logradouros Urbanos que possuem rvores ou que sero sujeitos a planos de arborizao, sendo que estes logradouros so cadastrados com vnculo a uma rea Urbana. - Cadastro de rvores. Funo para o registro georreferenciado de rvores urbanas localizadas em um determinado Endereo/Logradouro. O questionrio para o levantamento de dados  baseado em uma publicao do CREA-PR de 2011, denominada Arborizao Urbana (http://www.crea-pr.org.br/index.php? option=com_phocadownload view=category id=37:cadernos-tecnicos). No banco de dados do aplicativo j constam o cadastro de 1423 espcies florestais de acordo com a RNC (Registro Nacional de Cultivares - MAPA), entretanto o usurio poder cadastrar novas espcies no banco de dados se necessrio for. So cerca de 30 informaes para a caracterizao de uma rvore no banco de dados, englobando dados dendromtricos, condies da rvore em termos de sanidade e vitalidade, necessidades de manejo em termos de podas e registros de conflitos (energia eltrica, rede hidrulica entre outros). - Plantio de Mudas. Funo para registrar plantios novos e ou reposio de espcies no logradouro, com dados de data de plantio, tipo e origem da muda, etc. - Registro de Danos. Funo para registrar danos ocorridos em rvores por causa de eventos diversos, como climticos, acidentes de trnsito, vandalismo, etc. - Manejo e Gesto. Registro de operaes realizadas, como podas, controles de pragas, limpezas etc. Individual por rvore ou por Logradouro. - Localizao. Funo que possibilita a identificao in loco de rvores cadastradas em um logradouro a partir do uso do GPS do dispositivo - Espacializao: Todos os elementos cadastrados (rvores, plantios e danos) podem ser visualizados e identificados e editados espacialmente no Google Maps. - Relatrios dinmicos com filtros referentes as funes de cadastro e manejo com opo de salvar em formato PDF. - Exportao do banco de dados e de dados de cadastro e de operaes em arquivos CSV e envio destes arquivos atravs de email no prprio aplicativo. Esta  a primeira verso do aplicativo e estamos no aguardo de sugestes e crticas por parte dos usurios, com o objetivo de aperfeioarmos o mesmo, atendendo assim as expectativas destes usurios frente as suas necessidades acadmicas e profissionais.. Acesse o vdeo tutorial e a apostila Guia Operacional em www.crcampeiro.net no link Srie: Como fazer The C7 Lignum Urbem application aims to contribute in the management processes and management of trees in the context of an urban space, being structured by the following functions: - Definition of Urban Area. (Cadastre Municipality, district, village, etc.) which are bound playgrounds / addresses. Primary Level - Address Register. Urban public parks that have trees or to be subject to afforestation plans, and these playgrounds are registered with ties to an Urban Area. - Trees Registration. Function to record georeferenced urban trees located at a certain address / Exterior. The questionnaire for the data collection is based on a CREA-PR publishing in 2011, called Urban Forestry (http://www.crea-pr.org.br/index.php? Option = com_phocadownload view = category id = 37 : roll-technical). In the application database already in the register 1423 forest species according to the RNC (National Register of Cultivars - MAP), however the user can register new species in the database if necessary. There are about 30 information for the characterization of a tree in the database, covering dendrometric data, tree conditions in terms of health and vitality, management needs for pruning and records conflict (electricity, water network etc.) . - Planting seedlings. Function to register new or replacement plantings and species in the street, with planting date data type and source of changes, etc. - Damage registration. Function to record damage in trees because of various events, such as weather, traffic accidents, vandalism, etc. - Management and Management. Registration transactions, such as pruning, pest control, cleaning etc. Single per tree or public place. - Localization. Function that allows the identification in loco of trees registered in a public place from the device GPS use - Spatial: All registered elements (trees, plantations and damage) can be viewed and edited identified and spatially in Google Maps. - Dynamic reports with filters regarding the registration and management functions with option to save in PDF format. - Database Export and registration data and operations in CSV files and send these files by e-mail in the application itself. This is the first version of the application and are awaiting suggestions and criticism from users, in order to aperfeioarmos the same, thus meeting the expectations of these users forward their academic and professional needs .. Access the tutorial video and handout Operating Guide www.crcampeiro.net the link Series: How to ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}