{
"name" : "Surveyor Tools Free",
"url" : "https://play.google.com/store/apps/details?id=com.sciencewithandroid.surveyortoolsfree",
"package" : "com.sciencewithandroid.surveyortoolsfree",
"category" : "Tools",
"description" : "Surveyor Tools Free uses your devices sensors to give you positional information about your surroundings. It is very similar to a theodolite, but it offers additional features.  It provides GPS location and altitude, as well as elevation angle, horizon tilt angle, and azimuth angle.  Surveyor Tools Free includes three screens: the main screen and two different compass screens. One is a simple compass that is like a traditional compass with a moving needle. The other compass is more modern and displays a number of useful datums. These include azimuth angle with bearing and magnetic field strength, as well as the magnetic field data accuracy.  Surveyor Tools Free displays the following information on the main screen:  -GPS latitude and longitude, -GPS (corrected - see below) altitude, -accuracy of the altitude, -artificial horizon, -elevation angle, -azimuth angle and bearing, -horizon tilt angle, -location of Sun, Moon, and Suns shadow displayed on the screen with appropriate symbols, -current local time, weekday, and date, -vertical and horizontal crosshairs centered on the field center, -calibration button, -picture button to take and save a picture of the current view, -direction type (magnetic or astronomical), -sliding drawer menu.  All the angles displayed on the screen are in degrees units. The artificial horizon is shown as a bright green line. It tilts and moves vertically to compensate for camera rotations.  The CAL button on the main screen is the calibration button. If you have not yet calibrated Surveyor Tools Free, the button will appear green. To calibrate Surveyor Tools Free first select the object you want to calibrate with on the settings screen (Moon, Sun, Suns shadow). Be careful when pointing at the Sun; use the Sun to calibrate only when it is cloudy and you can still see the Sun through the clouds.  Next, point the camera at the object and make sure it is centered on the gray cross in the center of the screen. Then press the CAL button. The button will change color to yellow, indicating you have calibrated the Surveyor Tools Free. The calibration will be remembered when you close the app. You can calibrate again as often as you wish. Only the most recent calibration is used.  Once you have calibrated the Surveyor Tools Free, the Direction type will change from magnetic to astronomical. Prior to calibration the compasses give magnetic directions; after calibration they give astronomical (or true) directions.  The calibration performed by the CAL button corrects for the difference between directions to the magnetic and true north as well as offsets between the center of the display and the measured azimuth and elevation angle values.  When the GPS coordinates cannot be determined, Surveyor Tools Free uses the last saved coordinates to perform the calculations to display the Sun, Moon, and Suns shadow.  The reported altitude is corrected to the EGM96 geoid. This provides absolute accuracy in altitude just under one meter. Location data are automatically saved when the app is exited.  A settings screen provides options to choose the altitude units (meters or feet) and the object for calibration.  When you take a picture of the current view, the image is named according to the date and time according to the following format: yyMMddHHmmss.png. The location of the file is briefly shown when it is saved. You might experience a 2 or 3 second delay between the time the picture is taken and when it is saved. You can access the saved files by connecting your Android device to a computer via a USB cable.  Applications of Surveyor Tools Free include geocaching, hiking, prospecting, emergencies, accident reports, real estate, surveying, observational astronomy, and archaeology.  This app is ad supported. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}