{
"name" : "Mobile Number Locator",
"url" : "https://play.google.com/store/apps/details?id=com.sri.mobilenumberlocator",
"package" : "com.sri.mobilenumberlocator",
"category" : "Tools",
"description" : "Welcome to Live Mobile Number Locator.  Have frequent unknown calls? Try our Live Mobile Number Locator to track any mobile number to its caller details.  Caller Location Tracker - Track unknown phone number, Mobile calls, STD & ISD codes.  Mobile Number Lookup is Live Caller ID and Location tracker: You can see who is calling & identify unknown incoming calls via the caller id with name & location information including city, operator, name, location, state.  Phone number Tracker: Our Phone Number Tracker helps you to search any phone number from USA, India, Russia, Brazil, Canada, Mexico, Indonesia and any other country in the world. The city, state, country and operator of the phone number will be displayed and the geographic location will be shown on the maps with your present location and distance.   Live Mobile Number Tracker helps you to track any phone number from any country in the world. City area, state, country and network operator of the phone number will be displayed and GPS location will be shown on the maps.    Live Mobile Number Tracker will maintain a history of your recent searches you performed. You can view the geographic location of tracked number from your tracked history as well.  Phone Number Tracker will helps you to track Mobile Numbers and Fixed or land Line Numbers from all over the world and show you from where youre getting the call.  Contacts & Call logs: By using option of Call Logs and Contacts, you can view the details of contacts like their Location of the Telecom Circle and Service Provider/Telecom Operator Name, location on map etc.  You can also search mobile numbers in offline mode as well.  Track Mobile Contacts, Cell callers, unknown callers with this useful tool mobile tracking tool.  Search for any name or number.   Current Location and Address Finder lets you view your present location in Map and text to share with friends and family.  Searching any mobile number is very easy, you can type the number or can select the number from your call logs, Live Mobile Number Tracker will suggest from your Address book to choose the number to perform mobile number search.  Mobile Number Tracker application in your device, you can easily get the caller details.  App Permissions: 1 Read/modify contacts: To find the caller information. 2 Location service: For finding caller location address & display caller information on map. ",
"desc_perms" : "['android.permission.READ_CALL_LOG', 'android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CALL_PHONE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.sri.mobilenumberlocator.permission.MAPS_RECEIVE', 'android.permission.MODIFY_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.location.GPS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.location.NETWORK']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.sri.mobilenumberlocator.permission.MAPS_RECEIVE', 'android.permission.MODIFY_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.location.GPS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.location.NETWORK']",
}