{
"name" : "Accurate Thermometer Free",
"url" : "https://play.google.com/store/apps/details?id=com.sciencewithandroid.accuratethermomenterfree",
"package" : "com.sciencewithandroid.accuratethermomenterfree",
"category" : "Tools",
"description" : "Accurate Thermometer Free uses your devicess built-in battery temperature sensor to measure the ambient temperature. The app does not simply read the battery temperature and report it. The battery temperature depends, in part, on the current supplied by the battery from running various processes on the Android device, such as the screen, CPU and sensors. In addition, the battery temperature will also be greater than the ambient temperature if the device is held in your hand or kept in a pocket.  This app circumvents these potential problems by keeping track of the devices motion and screen status (on or off) using its built-in sensors. From these data, the app only records the battery temperature if the device has been sitting motionless for at least 20 minutes with the screen turned off. There is no need for you to wonder if you device has been sitting still long enough for a good temperature measurement. Accurate Thermometer Free keeps track of this in the background and updates the temperature on the display when certain criteria have been met.  The displayed temperature is accurate to about 1 degree Centigrade. The display also gives the date and time the temperature was determined.  Here are the steps you should follow to get the best results (see help page for additional suggestions):  1. Open Accurate Thermometer Free.  2. Press the Start button. Use your Android device as you normally would. You can run other apps or put the device to sleep. Accurate Thermometer Free will continue running in the background.  3. To calibrate Accurate Thermometer Free press the calibrate button instead of the Start button. Enter the room temperature when the edit box appears. Then, press Go. You should leave the device sitting undisturbed for about an hour. When you return to Accurate Thermometer Free, CAL will be displayed if the calibration was successful. Press Stop.  5. When you are done with the measurements, press the Stop button. This will stop the background processes associated with the app.  If you have any suggestions for improvements or just want to share with us your interesting project with this app, please contact us at ggonzo47@gmail.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS']",
}