{
"name" : "Phone Secret Tricks",
"url" : "https://play.google.com/store/apps/details?id=com.advance_techno.secret_tricks.mobiles",
"package" : "com.advance_techno.secret_tricks.mobiles",
"category" : "Tools",
"description" : "Discover ways to get most out of your Android device easily by everyone. Get the best hidden Mobile tricks with this app and also help you to increase knowledge. You will also able to learn a lot of things about your android phone that you never know before. All the tricks are explained step by step in phone tricks and tips app. Master your Android phone within minutes using this app and Any Mobile device support several secret codes. Brief description is in app. Features of are: East to use. User friendly interface.  Mobile tricks This app is offline so you dont need to have internet connection. Take Screenshot. Phone tricks Deleted Notification recovery. Hard Factory Reset method. Record Screen. Control your Laptop. Control your Android. Not needed extra Special permission to install this app. Unknown Facts. Recover deleted Files. Improve Battery. Unlock Pattern guide if you have forgotten. Secret Codes. Wifi Hotspot connection guide. Android Useful Tricks Add Internet Speed Indicator Reduce Your Mobile Data Usage On Android Speed Up Android Unlock device guide Secret Codes Get Longer battery life on your smartphone Magical Tips and Tricks Impress and share unlimited Tricks with friends Free and offline Note: This is a read only app and does not makes changes to your mobile device. Before performing any action be sure to have backup. It is safe and easy to use! Stay connected with our Mobile Tricks and Tips app to get more details. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}