{
"name" : "Control Center IOS 13 - Control Center",
"url" : "https://play.google.com/store/apps/details?id=com.assistivetouch.controlcenter",
"package" : "com.assistivetouch.controlcenter",
"category" : "Tools",
"description" : "What is Control Center IOS 13? Control Center IOS 13 is an easy tool for Android devices. Its fast, its smooth, and its totally FREE. With a floating bar on the screen, you can easily use your Android smart phone. More conveniently, you can quickly access to all your favorite apps, games, settings and quick toggle, screen capture, screen recording. Control Center is also an ideal app to protect the physical buttons (volume button). It is very useful for big screen smart phone.  Control Center 2020 - Virtual Volume button, quick touch to change volume and change sound mode - Easy touch to open your favorite application - Go to setting very quick with a touch   Quickly change settings and open apps - Capture Screenshot: Capture screen - Record Screen: Record any action in your phone. (Support android 5.0 above only) - WiFi: Turn on Wi-Fi to browse the web, stream music, download movies, and more. - Bluetooth: Connect to headphones, car kits, wireless keyboards, and other Bluetooth-enabled devices. - Do not disturb mode: Silence calls, alerts, and notifications that you receive while your device is locked. - Brightness: Adjust the brightness of your display from any screen. - Screen timeout - Control audio: From here, you can quickly play, pause, and control volume of your favorite song, podcast, and more. - Airplane mode: Use Airplane Mode to instantly turn off Bluetooth, Wi-Fi, and cellular connections on your android device. - Flashlight Super Bright: The LED flash on your camera doubles as a flashlight, so you can get extra light when you need it. - Screen rotation: Portrait Orientation Lock, keep your screen from rotating when you move your device. - Calculator: Tap numbers and functions in Calculator, just like a standard calculator. - Camera: Never miss a moment to take a picture with quick access to your camera. - Alarms and Timer: Set an alarm, timer, or stopwatch, or check the time in another country or region. - Launch all applications or games on your device   Home Bar Gesture (VIP version) - Select action for swipe gesture (e.g. swipe to go to home, swipe to back...) - Select action for click gesture - Select action for double click gesture - Select action for long click gesture - Actions include: show control center, go to home, go back, open recent app, quick setting, notification center, power popup, capture screenshot.   Customize - You can change color of bar with your favorite color, totally free - Change position of the bar (left, right, bottom) - Change size of bar (width, height) - Change opacity of bar - Add or remove apps or controls on the Control Center  Feedback - If you like Control Center please review and give us 5 start - If you have any problem with this app please give us feedback for your problem, we will fix it quickly - Please email for us if you want send request function  Permission - CAMERA to turn on Flashlight, not take a photo.  - We never publicly disclose any personal or sensitive user data related to financial or payment activities or any government identification numbers, photos and contacts, etc.  This app uses Accessibility services.  Thank for your support ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.MEDIA_CONTENT_CONTROL', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.MEDIA_CONTENT_CONTROL', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}