{
"name" : "QR Code Scanner & Bar Code Reader / Generator",
"url" : "https://play.google.com/store/apps/details?id=com.qr.code.scanner.bar.code.reader.generator",
"package" : "com.qr.code.scanner.bar.code.reader.generator",
"category" : "Tools",
"description" : "QR Code Scanner & Bar Code reader is among best free apps for android phones. QR code Reader app for android is a powerful app to QR Scanner/QR Code Generator/Bar code Scanner App the fastest QR Code Scanner is here for you. QR Code Scanner & Bar Code Reader / Generator is an extremely easy app to use in free apps gives you information in few seconds. Bar Code Reader is extremely free apps QR code scanner is free to install simply point out to QR Code or Bar code you wanted to scan QR Code or flash Code.After scan the QR Code Scanner /QR Code Reader automatically show the information of Scan QR Codes/ Barcodes. QR Code reader& QR Scanner is specially designed to encode(Create QR Code) and Decode (Scan QR Code)information behind the Barcode. QR Code Scanner app and Bar Code Reader free apps can easily scan and read all types of QR Code including URL,Contacts, Email, Text, Location, Books, Wifi,andsupport many other formats.QR Code Generator can generate all types of QR Codes allows you to save and share QR Code you just generated. Install QR Code Scanner App& Bar Code Reader free app for android to scan pictures from QR Scanner and to access promotion via QR Code Scanner Bar Code Reader.QR Scanner Code when scanning the QR Code Scanner, if the QR Code contains a URL, Text, Contacts, Email you can open it and browse to the site. In addition you can share your QR scanner app results easily with just push of button. QR Code Reader/ QR Code Generator/QR Scanner app for scan of QR Code/ Bar code/flash code from existing photos in the gallery can be done in few seconds.QR Code Reader/ Bar code Scanner is extremely free app automatically recognized any QR Code.Scanner app Easy to use instant to scan all types of Codes is an essential free app for all to get ease access to hidden QR Code/ Bar codes information.QR Code Generator press the generate button to create the QR Code. There is different type of QR Code design also lot of colors you can Generate Different Colorful QR Codes.QR Code Scanner & Bar Code Reader / Generator have provided many QR Code categories like Business, Contact, Message, Text,and Email etc just choose any category to generate QR Code and share with your friends now. Instant Features: Instant Scan free Bar Code app Auto Zoom Scanner App Scan QR/ Bar codes from gallery  Keep Save Scan History Save & Share QR Codes  Upload an image to Auto Scan ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.CALL_PHONE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.CALL_PHONE']",
}