{
"name" : "Screen Cast - View Mobile on PC",
"url" : "https://play.google.com/store/apps/details?id=com.screencast",
"package" : "com.screencast",
"category" : "Tools",
"description" : "View your mobile screen to your PC, Mac, Tablet or Smart TV using Screen Cast. Use any device that has a browser and an internet connection to view your mobile screen remotely.   Use Screen Cast to demonstrate a presentation, show new concepts or features, display videos and pictures, and much more.   Allows multiple connections from different devices to connect and view simultaneously. An optional password can be required for connections, which can be changed from the App settings.   It works with any desktop, TV or mobile browser which supports MJPEG such as Google Chrome, Mozilla Firefox, Safari, Opera Mini, Dolphin and Internet Explorer 11.   Screen Cast and My Screen Recorder are a perfect combination when you need to create video demo of mobile app. My Screen Recorder is a screen capturing tool that enables you to easily record your PC screen along with your microphone audio. This tool is designed for creating a presentation and demo.   You need to install My Screen Recorder on your PC.  Watch the video tutorial to see how easy it is to record your mobile screen along with the PC screen.   Key Features :-    Connect multiple devices and view screen simultaneously.   Choose Wi-Fi, Mobile hotspot or Mobile Data to connect with your PC  Record your mobile screen along with PC using My Screen Recorder.   Set a password to prevent anyone from randomly viewing.   Control how and when your phones screen should stay on. It helps to prevent mobile  from going into sleep mode while broadcasting is in progress.   Supports multiple languages including German, French, Spanish, Portuguese, Italian and Dutch.   Note: Audio from Screen Cast is not supported.  If you need help with Screen Cast, please refer to our support forum.    LIKE US and STAY CONNECTED  Facebook: https://www.facebook.com/Deskshare-1590403157932074  Deskshare: https://www.deskshare.com  Contact Us: https://www.deskshare.com/contact_tech.aspx ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}