{
"name" : "Metabo",
"url" : "https://play.google.com/store/apps/details?id=com.efi.metabomobileapp",
"package" : "com.efi.metabomobileapp",
"category" : "Tools",
"description" : "With the Metabo app, you can always keep  your tools, and your individually selected services in view. You can register your tools for our services at any time! Quick. Easy. Professional.   The app also offers a vibration calculator to ensure you stay safe on the construction site. Of course, the Metabo app also helps you find a nearby Metabo dealer quickly. You will also enjoy other features, such as our product catalog, registration code scanning, and much more.  We want to support you in your everyday work and increase your efficiency.  Products: The Products area offers you a comprehensive overview and insight into all of the power tools Metabo offers. In addition to product properties, this section also describes our extensive safety features.  Vibration calculator: The Vibration calculator show you how long you can work with your power tool without any negative effects.   My registered products: Under My registered products, you can find all the details on your registered Metabo product, such as available services, your warranty certificate, your purchase date, and our dealers.  Register new product: You can register your purchased products for the Metabo XXL warranty, Metabo All-In service, and Metabo Full Service, as well as upload associated invoices via 2D Matrix Code scan. How? Just use the camera on your smartphone to scan the 2D code on the product.  Dealer search: You can use the dealer search to easily and quickly find nearby Metabo dealers. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}