{
"name" : "Calculator with many digit (Long number)",
"url" : "https://play.google.com/store/apps/details?id=com.kame3.apps.calculator",
"package" : "com.kame3.apps.calculator",
"category" : "Tools",
"description" : "[Simple Calculator with many digits] This is simple calculator, but we do not limit the number of digit. 12 digit ? 14 digit ? 16 digit ? 18 digit ? No, Unlimited (the decimal is up to 9999 digit).  It is a calculator that can calculate many digits, both large numbers and small numbers.  [Calculation history function] The formula and results are saved each time you press the equal button so you can check it later from the history list screen.  [Copy] You can copy values by holding down the value display part of the calculator. You can also copy expressions and answers by tapping items on the calculation history screen.  [Colorful Theme] You can choose the appearance color of the calculator from six colors, Orange, Pink, DarkGray, Blue, Light blue and Black.  [Customize decimal point calculation] You can change how many decimal places to calculate, truncate or round off, etc. by setting.  [Memory function] This simple calculator has a memory function. You can clear the memory including the long press of the CA button on the calculator.  [Other calculation function] %(Percent), log, square root, factorial, exponentiation calculation function is also supported by this calculator.  [About the number of digit] We do not intentionally limit the number of large digit. Therefore, it is theoretically possible to calculate it as far as the given memory area allows. However, if I continue to calculate large digits, I will not know at all what will happen.   Those who love to try out the limits of the calculator are self-responsible. I am not responsible.  [Others] No disturbing advertisement will be displayed at the end of the application. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}