{
"name" : "Poker Odds+ Texas Hold'em poker odds calculator",
"url" : "https://play.google.com/store/apps/details?id=com.craftywheel.equitycalculatorplus",
"package" : "com.craftywheel.equitycalculatorplus",
"category" : "Tools",
"description" : "The top Texas Holdem odds calculator on Android! Take your game to the next level with Poker Odds+, an advanced professional-level hand ranges and flop texture analysis odds calculator that goes well beyond any other app.  Poker Odds+ is the only poker equity odds calculator app you need to improve and drill your preflop range analysis when you are shortstacked and facing snapshove decision at the tables. Know the exact EV of the spot to make the best snapshove runout range analysis and practice them in nash and equity drills within the app. Youll find great drills to improve your tournament skills! Poker Odds+ allows you to compare hands and get equity from millions of possible outcomes.   Train Snap Shove, PkrCruncher, Pokerstove, Pokerbase, Call, Rejams and Calling Rejams regularly using our challenge mode and become a better poker player! Dont miss out. Gain your unfair advantage at the tables today!  Poker Odds+ uses state of the art algorithms to compare your hand to any other hand.  Some of the PokerCruncher features include:  - EV of every single shove and/or call is shown so that you can base your decisions based on EV and avoid those marginal spots as an exploit! - Poker analytics and poker range tool - Hand Equity Calculator using state of the art highly optimised algorithms to calculate hand equity - Training Mode lets you train to improve. - Easy to navigate and use - Eye-friendly color schemes to use the app for long period of times. - Hand Ranking Charts based on different models - No internet connection required and results are shown instantly as soon as you choose the spots! - 100% satisfaction guaranteed!  Our Roadmap looks like this:  - Bankroll management - Blind Timers - Hand History Recorder - Session Tracker with beautiful reporting charts and reports - Focussed Poker raining Drills. - GTO Preflop Ranges for RFI, 3-bet, flatting charts, playing vs 3-bet, 4-bet and more!  We are continuously working on the app to keep it up-to-date and adding more solves as we get them done. If you do have any suggestions or feature request, please email us on info@craftywheel.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATION', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.VIBRATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}