{
"name" : "AppLock",
"url" : "https://play.google.com/store/apps/details?id=com.litetools.applockpro",
"package" : "com.litetools.applockpro",
"category" : "Tools",
"description" : "AppLocker - smart AppLock, Privacy guard & Security Lock! With App Lock to lock apps to keep security and safe.   Download the best Security Lock - App Locker ( AppLock ) to be your phone App Locker and privacy guard! Your privacy will be well protected with password lock & pattern lock& fingerprint lock! A great anti-intrusion tool for you.  With Security Lock - AppLocker ( AppLock ) , you can lock apps such as Facebook, WhatsApp, Snapchat, Messenger and any app you choose, including gallery, phone settings and app markets!  Safe notes lock note to keep secret your private notes, and auto-saved, you dont have to do anything. Keep your notes privacy.  Now lock apps with Security Lock - AppLocker ( App Lock ) , the personal security app to secure your privacy!  -----------Features-----------   Protect your privacy Hide your personal pictures and videos by locking gallery and photo apps with AppLocker ( AppLock ) . Protect your message by locking your social apps with AppLocker ( AppLock ). Keep your social data security from prying eyes. Give your phone 360 security protection.   Lock app market Keep your children from purchasing games by locking app market in your phone with the app locker. Security Lock is your AppLocker ( App Lock )!   Catch intruders Protect your privacy in real time. No one can snoop on your apps without your permission. Take a photo of who tried to unlock your apps immediately. And you can see the detail information in the app lock app, including photo, date and time. This is a great anti-intrusion tool for you. To find out the intruder to keep your phone safety.   Gallery Lock Transfer pictures and videos from Gallery to a photo/video vault. Hide picture & video of photo album to keep your secret photos & videos safe!   Lock apps Security Lock - AppLocker ( App Lock ) can lock apps. Prevent unauthorized access and guard privacy. Ensure security!  Privacy Notes It gives you a safe, quick and simple notepad editing experience when you write notes, memo, email, message, and mark note with different background colors. Most importantly, it is secret and has password protected.   Lock Phone Settings Prevent others from changing your phone setting ( WiFi, 3G data, Bluetooth, Sync, USB and so on ) by locking settings. To be your smart App Locker ( AppLock ) !   Unlock more secure Hide pattern draw path and be invisible. Give you overall privacy protection.   Install monitor Notify to make a lock when a new app is installed! And you can close the notification at any time.   Pattern Lock & Password Lock & Fingerprint Lock Pattern lock & password lock have many kinds of themes. Pattern lock is more faster to unlock. And the mode of pattern lock, you can hide draw path. Much safer for you to lock apps. Fingerprint lock just presses your fingers on screen, AppLocker will scan your fingerprint, then the screen will be unlocked in a second, more convenient to use. Switch any unlock mode! Well-designed theme is waiting for you!   Easy to Use Just One Click to set locked apps and unlocked apps.   Lightweight but Powerful Security Lock - AppLocker ( AppLock ) uses less than 2MB of space, but can protect all your privacy.  Security Lock - AppLocker ( AppLock ), a smart privacy guard, gives your phone 360 security protection.  How to set my passcode at the first time?  Open App Lock-Enter passcode-Re_enter your passcode . Choose apps that you want to lock-Next . Setting Apps with usage access-APP Lock-Permit usage access . Finish . ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'com.google.android.c2dm.permission.RECEIVE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BIND_ACCESSIBILITY_SERVICE', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.fingerprints.service.ACCESS_FINGERPRINT_MANAGER', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SEND_SMS', 'com.fingerprints.service.ACCESS_FINGERPRINT_MANAGER', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.vending.BILLING', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_FINE_LOCATION']",
}