{
"name" : "App Lock",
"url" : "https://play.google.com/store/apps/details?id=com.gamemalt.applock",
"package" : "com.gamemalt.applock",
"category" : "Tools",
"description" : "AppLock is an app locker that can lock your apps with fingerprint, pattern and pin to keep your privacy secure with minimum permission required.  -----NOTE----- If you want more featrures you can download advance version of our AppLock. https://play.google.com/store/apps/details?id=com.gamemalt.applocker  You can lock facebook, whatsapp, gallery, recent apps, settings or any other app to keep yourself safe from intruders.   Lock Apps  Requires Minimum Permissions  Lock gallery to keep your pictures and videos secure  Simple and beautiful UI  Small Size AppLock  Fingerprint Support (Hardware Required)  Battery friendly AppLock  Fast responce  ---- Features -----  Lock Apps / App Lock AppLock allows you to lock apps like gallery , message apps , social apps and email apps with fingerprint , pin , pattern and crash screen.   Lock Recent Apps You can lock recent apps page so no one can see the content of recently used apps.   Fingerprint Support Use fingerprint as secondary , or use only fingerprint to un-lock apps.   Turn Off AppLock you can turn off AppLock completely , just go to app settings and turn off the app.   Lock Timeout you can to re-lock apps after some time [1-60] minuets , immediately or after screen off.   Simple and Beautiful UI Beautiful and simple UI so you can perform any task easily.   Lock Screen Theme lock screen changes color according to the app that you locked , every time when lock screen appears you will experience AppLock differently.   Prevent Uninstall To protect AppLock from uninstall you can go to AppLock setting and press Prevent Force Close/Uninstall.   Shuffle Pin-Pad you can shuffle Pin-Pad in AppLock to keep your Pin secure.   Hide Pattern Path You can hide your pattern path in AppLock to keep your pattern secure.   Auto lock newly installed apps Lock newly installed apps without going in the AppLock.   Power saving AppLock does not drain your battery and use less memory.   Auto start AppLock on reboot AppLock auto restarts when your mobile reboots.  --- FAQ ---  How can i prevent AppLock from uninstalling? You can go to settings and press Prevent uninstall/force stop then enable device admin. No one can force stop or uninstall AppLock.   How can i hide my pictures and videos? Open AppLock and lock gallery app then no one can see your pictures and videos.   How can i uninstall AppLock? First open AppLock and remove it from device admin from settings page, then you can uninstall AppLock from you mobile.  AppLock Requires Minimum Permissions To Work  Draw Over Other Apps: AppLock uses this permission to draw lock screen on top of your locked app.  Usage Access: AppLock uses this permission to detect if a lock app is opened.  This app uses the Device Administrator permission : We use this permission to prevent other users from uninstalling this app so your locked content can be fully secured.  Internet: AppLock use internet permission to gather crash reports to ensure best user experience. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.USE_FINGERPRINT', 'android.permission.INTERNET', 'android.permission.PACKAGE_USAGE_STATS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_TASKS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.PACKAGE_USAGE_STATS']",
}