{
"name" : "AirKey",
"url" : "https://play.google.com/store/apps/details?id=com.evva.airkey",
"package" : "com.evva.airkey",
"category" : "Tools",
"description" : "Do you let a holiday apartment and handing over the keys constantly annoys you? Do you no longer have an overview in your company of how many keys are in circulation? Do you feel unsafe because of lost keys? Then its time for AirKey. With AirKey the smartphone is the key. You can safely send new keys to other smartphones and manage your access control system online.   But what do you need? An AirKey locking component, a smartphone and an internet connection. And if you dont want to use a smartphone, there are alternative access media too, such as cards or key tags.  Uncompromising security! The communication between smartphone and locking component is end-to-end encrypted, making it completely secure against interception. The app is secured with an additional PIN. The key tags also have state-of-the-art technology and they cannot be copied.  Other features  Send a key: Never hand over a key again. Its very easy to send keys to people, such as employees, freelancers or guests. You can also pre-programme this for particular times.  Geo-tagging: Get there quick. The smartphone knows where the locking components are and shows the way in the navigation app.   Component sharing Easily hand locking components over to other AirKey users, for example, in a shared office, for them to manage themselves and reduce expenses for key management.  Multi-administration Separately, quickly and simply manage multi-site companies with several administrators and always know who has been granted which authorisation.  Office Mode Full or semi-automatic office mode on certain doors. Automatically takes into account public holidays as well as summer and winter time.  Other practical features for businesses Import personal data with the click of a button and export system data, assign maintenance authorisations to smartphones, REST API to control certain AirKey functions via your own software.  AirKey meets the EU General Data Protection Regulations Together with a data protection expert, AirKey was developed into the access control system with the best data protection in order to manage our customers data in accordance with the law. The administrator can also turn off event logging of personal data in the online administration.  For a list of all tested, compatible smartphones visit: https://www.evva.com/en/airkey/compatible-smartphones/  Information on data processing relating to the AirKey product: https://www.evva.com/fileadmin/user_upload/Dokumente/Rechtliches/Datenschutzerkl%C3%A4rung/AirKey/lnformationen_zur_Datenverarbeitung_bei_AiRKEY_EN.pdf ",
"desc_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.NFC', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.NFC', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS']",
}