{
"name" : "PDF Reader, PDF Viewer for Android",
"url" : "https://play.google.com/store/apps/details?id=com.adobe.pdfreader.acrobatreader.free",
"package" : "com.adobe.pdfreader.acrobatreader.free",
"category" : "Tools",
"description" : "PDF Reader, PDF Viewer for Android is an app that is multipurpose and versatile in nature that not only a PDF reader but a scanner for your documents as well. Also PDF Reader provides you more add on that is it convert your PDF to Text format too. PDF Reader & PDF Editor is application to read and edit PDF files. It is a PDF processor and tool that allows to open, navigate, preview, write, annotate and draw over any PDF file. This functionality is provided using two main modules. With PDF Reader and PDF Editor pro 2018 you can organise all your PDF file on a single place that supports all kinds of files format. You can Scan your document and photos for keeping a digital copy of all these. PDF Reader & PDF Editor is a simple and easy to manage and view PDF file. With all features you need a PDF Reader, we will be provide you to pdf reader for best. PDF Reader with night mode makes it easy to read pdfs in the night without fear of eye fatigue. Variety of pdf viewer with either vertical or horizontal mode.  Powerful pdf manager lets you scan entire pdfs in your device. You can also review the pdfs you read in the recent section. Easily put a pdf file into your favorite list so you can watch it anywhere and anytime.  Is very simple to use this application. You just need to install the application and then select it as the default pdf viewer and pdf reader app. From any file manager you just need to click on the pdf file and this application will launch itself quickly.   Want to read PDF Files and Ebooks and documents? Thats what it does!  Want to list all the PDF Files stored in your phone ,browse PDFs you have? We got it covered!  Low storage capacity in your device for apps?  Looking for simple PDF Manager?  PDF editor text tools  PDF reader with highlighter and note   Want to quickly open PDF Files from email, the web, or any app that supports Share?  Share PDF files easily through other apps like Shareit,gmail etc.  Feature of PDF Reader and PDF Viewer   - PDF manager file: Scan and update all the pdfs available in your device as quickly as possible. List all the pdf files available in your device. List the pdfs you have recently viewed. Add your favorite pdfs to your favorite book, you can open it faster. - PDF Reader Search: Easily find your pdfs by name - PDF Viewer: The most important feature of this application is the pdf viewer. You can easily and quickly view the contents of the pdf files in your device. From anywhere, you can quickly launch this application to view your pdfs. - PDF next to page: Quickly move to the pdf page you desire. It is very convenient to see what is currently being viewed. - Search on PDF: Search the desired text easily and quickly in your pdf document  - PDF orientation: Vertical and horizontal views provide the most convenient experience for you  - PDF Editor  Text Marking: We provide PDF markup tools such as PDF underline, highlight text in PDF, copy PDF text, strike out,... so you can work best with your PDF files. Also, you can draw on PDF and read PDF as book. PDF Reader and PDF Viewer is a great, simple, convenient and fast application. It supports you all that you need for a pdf reader application.  We are always interested in your experience with our app to read PDF files for mobile, so please let us know your ideas by leaving a comment. We will dedicate to bring the best version of our PDF reader and PDF editor. Get the experience right this app. If it gives you a good experience evaluate 5 *. Thank you for using ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTEv RNET', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTEv RNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}