{
"name" : "New Status Saver Free Apps - Save All WA Statuses",
"url" : "https://play.google.com/store/apps/details?id=com.xilli.new.status.downloader.saver",
"package" : "com.xilli.new.status.downloader.saver",
"category" : "Tools",
"description" : "A friends whatsapp status touched your heart? Do you want to download friends whatsapp status? Dont you know how to download status of your friend? Here is the solution to all of your problems of downloading a story or status of your friends. As whatsapp status downloader 2019 will download it for you.  Xilli Apps presents you the new and unique app to save whatsapp status without any problem. Just Install Xilli Apps  Status Saver and sit back. Let WA status saver work for you even if you are offline because offline status saver will download all of your friends WA status offline downloader. Download either image status or video status of your friends and set it as your status song on your own WA status.   How to use Offline Status Downloader  Story Saver:  1. Check the story or status in the Whatsapp, which you want to download 2. Open our status saver app and click on the image or video you want to download offline into your SD card 3. Click the save button to download status direct into your SD card The saved video or image status will be quickly shown into your mobile gallery from where you can see it even after deleting status from whatsapp.  Features of save it - status saving app:  1. Save it all statuses of your friends 2. Share status direct from the status saver app 3. Save, delete, repost the status from within the app 4. Repost the status even without downloading it. 5. Built-in image viewer and HD video player to watch the statuses. 6. Easy and fast to save status. 7. Easy navigation in the app   Still confusing to use the app? Just install the status saver by Xilli Apps and dont forget to leave feedback for us to improve our app. Give your feedback in ratings. For more information, please contact us at xillicontact@gmaill.com For privacy information, visit the page at https://xilliapps.wordpress.com/privacypolicy/ ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'com.android.vending.BILLING', 'android.permission.WRITE_INTERNAL_STORAGE']",
}