{
"name" : "Notification Manager",
"url" : "https://play.google.com/store/apps/details?id=com.imoblife.quietnotification_plugin",
"package" : "com.imoblife.quietnotification_plugin",
"category" : "Tools",
"description" : "Notification Manager is a plugin belongs to All-In-One Toolbox. It is designed to bulk manage app notification messages from notification bar in an easy and fast way. It allows you to show important notifications and ignore annoying unnecessary notifications. Blocked messages will be hidden together in one place for later check. In this way, you can keep phone notification bar in a cleaner and tidy status.  How to use? Step 1: Install Notification Manager and its mother program All-In-One Toolbox(Cleaner)  https://play.google.com/store/apps/details?id=imoblife.toolbox.full, find it from All-In-One Toolbox- Toolbox- Plugins Step 2: Grant Notification Access to Notification Manager Step 3: Go to app Settings and enable Notification Manager Step 4: Pick apps you want to hide notifications, and it is done!  How to find blocked messages  Blocked messages are put together in Notification Manager; click Notification Manager on notification bar, you can check all unread notifications there. Drag a message right and you will be able to delete it.   Create shortcut for Notification Manager For easy access to this Plugin you can create a shortcut for it in this way:  All-In-One Toolbox- Toolbox- Plugins- Notification Manager  click the three Three dots settings on right corner- Create shortcut  Or you can fast access to this feature via All-In-One Toolbox widget:  Long press on blank home screen to add widget, and choose All-In-One Toolboxs widgets.   Features list in All-In-One Toolbox - Junk File Cleaner - Rom Cleaner - Duplicate file cleaner - Task Killer, Memory Booster  - Batch install/Uninstall app - Move app to sd card - Backup and restore app - System app manager - Startup app manager - Apk Manager  - SD Card File Manager - Privacy Protector  - Easy Swipe - CPU Cooler - Smart Charger - App Advertisement Detector  - App Locker - Auto Clean & Boost Tasks  - Game Booster  - App Permission Check  - Compass - Flashlight  - QR & Bar code Scanner - Quick System Settings  - Sensor Box - Quick Volume Settings   Please join our Google+ beta test group to help us improving app:  https://play.google.com/apps/testing/imoblife.toolbox.full  Any questions please feel free to drop us an email: support@aiotoolbox.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.imoblife.quietnotification_plugin.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_FINE_LOCATION']",
}