{
"name" : "PDF Reader",
"url" : "https://play.google.com/store/apps/details?id=com.gappstudios.autowifi3gdataswitch.san.basicpdfviewer",
"package" : "com.gappstudios.autowifi3gdataswitch.san.basicpdfviewer",
"category" : "Tools",
"description" : "Want to read PDF Files and Ebooks and documents? Thats what it does! Want to list all the PDF Files stored in your phone ,browse PDFs you have? We got it covered! Low storage capacity in your device for apps? Looking for simple PDF Manager? Want to quickly open PDF Files from email, the web, or any app that supports Share? Share PDF files easily through other apps like Shareit,gmail etc. Know who is calling if you dont have their number in your phonebook. Suggest alternative nearby places in case pizza guy doesnt picks up your call.  Then PDF Reader/PDF Viewer + Caller ID is the exact app you are looking for.  It is not big and clever, it is in fact a tiniest of all in the playstore i.e. 2.3MB and efficient pdf viewer.This PDF Reader supports basic tables, lists ,images and text but if you want a small size,clear,functional Pdf Reader app that lets you open a PDF from dropbox, the web, gmail ,other email attachments or your local file system then this will get the job done.This PDF reader for android free of cost will save your phones memory.  It is the basic version , but if you like it please leave a positive review and 5 stars. Every little contribution by your side helps,either it be sharing,reviewing,talking about the app etc. If you dont like it, please email me to tell me whats wrong before leaving me a negative review. That said, due to the volume of email I get, if the message doesnt explain clearly what the problem is and how to reproduce it, I will have to ignore it as this is something I do for free, in my spare time.  INTRODUCING Basic PDF Reader CALLER ID!-The Best Caller ID out there.   Basic PDF Reader caller ID helps you identify numbers real-time while the call is happening - even the ones not in your phonebook. No more number guessing or avoiding unknown callers  Basic PDF Reader is the basic caller ID which prepares you for the call. If your local pizza vendor doesnt pick up the phone when youre calling, then this Caller ID App will suggest alternative nearby places. You can always adjust your caller ID settings in the settings menu.   Coming Updates: Support for corrupted pdfs. Swipe gesture for turning pages PDF to other format converters- pdf to doc converters,pdf to docx converters etc Other formats like docx to pdf converters,doc to pdf converters,image to pdf converters.  Known Issues: Certain PDF files opens very slowly but few are very fast. Certain PDF files cant be opened due to reason that the pdf file may be corrupted and also due to a development stage of the library, will release the update for the above issues as soon as we can.  Q:Why this PDF reader when there are so many complex PDF viewers ? A:Truth be told,nobody uses all the features present in complex PDF file readers.Many of them (especially students) just require the pdf reader to read the PDF.   Icon Credits :https://icons8.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CALL_LOG']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}