{
"name" : "Cooling Master - Phone Cooler (Booster)",
"url" : "https://play.google.com/store/apps/details?id=com.masterappsstudio.coolmaster.phonecoolerapp.cooling",
"package" : "com.masterappsstudio.coolmaster.phonecoolerapp.cooling",
"category" : "Tools",
"description" : "Cooling Master - Phone Cooler is a professional leading cooling app to cool down phone and to reduce CPU usage and make phone cooling down within seconds. Cooler Master - Device Cooler is a professional temperature monitoring and controlling app that reduce your CPU usage, clean RAM, lower phone temp and cool down your phone CPU. Auto CPU cooler master controls and overcomes the overheat operations of apps and high temp problem of android phones, lower down phone CPU temperature. CPU Cooler detects and closes heavy resource consuming apps to reduce CPU, GPU, RAM usage and cool down your phone and lower down phone temperature in real time.  Cooling Master app behave as Smart Master Cooling and Device Cooler that all you need! Now multitasking with ease and comfort, without having any worry about device overheat because of cooling and phone cool down functions. Keep your device performance smooth and optimum with smart phone cooler and Cool down phone and optimize its speed. Enhance overall performance of your phone with CPU Cooler master. It is a best Cooling Master and Cooler Phone Pro application. Cooler Device detects certain apps on your phone keep running in the background, so your CPU is always being used a high rate. This causes the CPU to heat up and slows down cell phone operations. CPU Temp Controller app reduces this high temp and keep your device cool and low temperatures by kill background running apps. With a single tap, you can easily control the operations of heat-generating apps and reduce the usage of your devices CPU.  Extra feature of phone cooler is solving battery problems with battery saver mode. Extend your battery life with Phone cooler and give you better performance in multimedia and game usage.   CPU Device Cooler works for you in a perfect manner. Smart Device Cooler Clean your cache memory, free up RAM, Boost your memory provide Real time temperature monitoring and protection, optimize its speed, overheat prevention and cooling android phone. Master key feature of this smart android cooler is lower down temperature. It behaves like Temperature cooler and Auto CPU cooler. CPU cooler for android in other words cool master, cooling android phone, cooler expert master, phone cooling app, Smart cooler master and its heat minimization algorithm is highly effective to reduce CPU usage which ensures long battery life.   Features (Totally Free):  Features of Cooling Master - CPU Cooler Master: - Real-Time Temperature Monitoring Phone temperature monitors in real time, so you can see the change temp from moment to moment. When the temperature is too high, Cooling Master (Booster) will help you for one tap to cool down.  -Overheating Prevention and Dynamic App Detection/Controller Cooling Master(CPU Cooler) observe and analyse CPU usage dynamically and auto detects overheating apps.We use our original temperature detection and temperature prevention technology to so you never miss any hidden heated apps. Cooling app collects each apps usage of CPU, GPU, RAM, etc. and applies the smart algorithm Temp Control Engine to analyze the apps causing the phone to overheat. It then marks each apps temp heating level, so you never miss any hidden heating apps.  - Single Tap to Cool Down Close overheating apps with one tap to cool down feature and allow you to reduce CPU usage and cool down your phone.  - WiFi Booster and WiFi Strengthen  Fast WiFi booster that boosts your internet signals and makes it fast by cleaning the RAM storage  - Smart Battery Charge - Battery Optimise Save your battery power and optimize battery usage. CPU Cooler display charge status in real time, accurately estimating remaining charge time, allow you go for cool down your phone and battery cooler  - Ignore List added CPU Cooler will allow user to add Apps and games added in ignore list to prevent from cooling process ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.WRITE_SETTINGS', 'android.permission.INTERNET', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.RESTART_PACKAGES', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RESTART_PACKAGES', 'android.permission.ACCESS_NETWORK_STATE']",
}