{
"name" : "Transboard- Keyboard Translate",
"url" : "https://play.google.com/store/apps/details?id=com.sami4apps.keyboard.translate",
"package" : "com.sami4apps.keyboard.translate",
"category" : "Tools",
"description" : "Communicate now or speak any language you like with the Transboard keyboard. You can directly write and speak in all languages within your application without having to use external translation applications that you can use in chat, chat, social networking and any application you want. Translation directly via the keyboard does not need To copy and paste or to use other applications the translation will appear in writing directly and can switch between languages easily and all languages are available as well as contains emoji emoji and Japanese Emoticons and smile and a clipboard with themes  Also Keyboard Professional Writing ornament from which you can ornament your writing different types of finishes and decoration .. directly using the keyboard without having to copy and paste the decoration will appear as you type directly and can switch easily between the motifs and writing English language parser with the ability to activate and deactivate the patterning and writing without it.   Keyboard features:   Instant translation to any language you like while typing and speak it easily and with a click of a button.  - Contains more than a dozen types of decorations can easily switch between them while typing .  - The possibility of writing with English language parser .   Support for emoji and Japanese Emoticons, and three forms of emulators can be switched between.   Contains a clipboard to copy, cut, paste and save unlimited words.   contains different themes.   Ability to control the size of the buttons and the size of the characters on the buttons.   Control the sound of buttons and vibration.   Control the height of the keyboard in the horizontal and vertical position of the device.   Ability to change the background of the keyboard in a picture from the studio through the settings.   Ability to change the color of the keyboard characters through the settings.   Show suggestions for words to facilitate writing.   Full support for all languages.   Voice input feature.    Supported languages in the Transboard:   - English (US) - English (QWERTY) - Armenian () - Bulgarian ( ) - Czech Republic (etina) - Danish (DANSK) - English Dvorak (the language en_DV) - English / British (en_GB) - Finnish (Somi) - French (French, AZERTY) - German (Deutsche, QWERTZ) - Greek () - Hebrew (Hebrew) - Hungarian (Hungarian) - Italian (Italian) - Lao (  ) - Norwegian (Norsk Bokmal) - Persian () - Portuguese - Romanian (Romana) - Russian () - Russian Phrase (, RU-RPH) - Serbian () - Slovak (Slovenina) - Slovenian (Slovenina) / Bosnia / Croatia / Latin Serbian - Spanish (Spanish and Spanish Latinoamrica) - Swedish (Svenska) - Tamil () - Thai ()) - Turkish (newspaper) - Ukrainian ( ) - More in-app   =======================================   If you have any problem or have any inquiry or would like to add some ideas to develop the application please email us at the following:  keyboard.transboard@gmail.com ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.READ_USER_DICTIONARY', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'com.sami4apps.keyboard.translate.permission.C2D_MESSAGE', 'android.permission.WRITE_USER_DICTIONARY', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED']" 
"extra_perms" : "['android.permission.READ_USER_DICTIONARY', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_USER_DICTIONARY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}