{
"name" : "Digital Tasbeeh Counter Easy - Tally Dhikr Counter",
"url" : "https://play.google.com/store/apps/details?id=com.fortune.apps.countereasy",
"package" : "com.fortune.apps.countereasy",
"category" : "Tools",
"description" : "Counter Easy is a very simple and easy app for your counting needs. It can be used for counting Dhikr and Tasbeeh.  It is very lightweight and require only less than 2 mb of space.  The count is saved every time you close the app will be remembered when you reopen the app.  How to Count  Count Up: 1) Tap on the counter. 2) Use Volume up button  Count Down: 1) Tap on the [-] button. 2) Use Volume down button   New Counter: Select New option from top. Put the name of the counter in the dialog shown and press Ok. When a new counter is created your previous count will be saved in the Counter List.   Counter List: Goto Counter List from top right menu. Here you can manage all your saved counter. Tap on any counter to set it as your current counter. You can delete individual counters or delete all the counters by clicking the delete all button on the top.   Edit Counter: Select Edit option from top.   Setting lap count: Goto Settings from top right menu. Tap on Lap count option from the bottom of the settings. Here you can enter the lap count you require.   Delete Counter: Goto Counter List from top right menu. Select Delete button for the counter you want to delete.  Reset Count to 0: Select Reset option from top. It will reset active counter value to 0.   Settings: Goto Settings from top right menu. Here you can personalize your preferences the way you like it.  Features: Very small download size Counter with percentage display Lap count display Vibration and sound support Volume button controls Create and manage multiple counters Stores the count even after closing the app Lot of themes to choose from  More features coming soon... ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}