{
"name" : "Status Saver for WhatsApp - Video Downloader App",
"url" : "https://play.google.com/store/apps/details?id=com.status.saver.video.downloader.whatsapp",
"package" : "com.status.saver.video.downloader.whatsapp",
"category" : "Tools",
"description" : "To save the videos and images without asking your friends? Missing important status in WhatsApp? Just downloading this WhatApp Status Saver right now!   You wont regret choosing this amazing Status Saver for WhatsApp 1. Save and share videos & images without asking.   2. Auto save all viewed status forever.  3. Keep new status retention time for 3 days.  4. Never miss any new status.  5. One-click link to Status, Business Status & GB Status.   WhatsApp Status Saver App is a multi-supported WhatsApp status downloader to download new WhatsApp 2020. It is WhatsApp update latest version. With this status saver app, you can download WhatsApp status and download all the images and videos which from Status, Business Status or GB Status in an easy and fast way. All your friends story status will disappear after 24 hours. Some video and image status are very important for you, and some video and photo status are worth keeping. Using Status Saver for WhatsApp Apps is the best way to keep them forever! Do you want to save all the videos and images without asking? Do you want to save all the status you want? This is a completely free downloader for WhatsApp Apps. You can download and enjoy all the statuses for free! This is a perfect whatsapp status video downloader! Choose it! You wont regret downloading status saver for whatsapp video!   How to use: 1. Open Status Saver for WhatsApp - Video Downloader APP. 2. Open WhatsApp to view your friends story statuses.  3. Back to Status Saver for WhatsApp. 4. Check which status you want to save forever. (If you didnt set the function of Auto Save All Viewed Status.) 5. Click download button to download and save statuses you want.  P.S. If you forgot to save Statuses you want, your new status retention time in this app is extended to 3 days. If you have set the function of Auto Save All Viewed Status to work, all the video and photo statuses you have browsed will be saved forever.   Disclaimer:  Status Saver for WhatsApp - Video Downloader APP will not collect any personal or private information.  Status Saver for WhatsApp - Video Downloader APP is an independent one and is not affiliated with any 3rd Party including Whatsapp Inc.  Status Saver for WhatsApp - Video Downloader APP didnt use to clone or hack anything, it just displays downloaded video and images in Status.  Please make sure you have the right to keep the statuses before saving and sharing it.  If you have any suggestions or questions to the whatsApp status saver app -- Status Saver for WhatsApp - Video Downloader APP (WhatsApp 2020 new version), please feel free to contact us in time.  ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_SIP', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.USE_SIP', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}