{
"name" : "AIDA64",
"url" : "https://play.google.com/store/apps/details?id=com.finalwire.aida64",
"package" : "com.finalwire.aida64",
"category" : "Tools",
"description" : "Hardware and software information utility for Android based devices. Based on the extensive hardware knowledge of the AIDA64 for Windows application, AIDA64 for Android is capable of showing various diagnostic information for phones, tablets, smartwatches and TVs, including:  - CPU detection, real-time core clock measurement - Screen dimensions, pixel density and camera information - Battery level and temperature monitoring - WiFi and cellular network information - Android OS and Dalvik properties - SoC and device model identification - Memory and storage utilization - OpenGL ES GPU details, real-time GPU clock measurement - Vulkan, OpenCL, CUDA, PCI, USB device listing - Sensor polling - Listing of installed apps, codecs and system directories - Android Wear module: native app for watches  System requirements: - Android 4.2 or later  Required permissions: - ACCESS_NETWORK_STATE - ACCESS_WIFI_STATE -- also known as Wi-Fi connection information. AIDA64 requires this permission to show WiFi network information like signal strength and SSID. - INTERNET - CAMERA. AIDA64 requires this permission to show camera information like picture resolution. AIDA64 does not take any photos or videos. - On Android 4.2 to 4.3: READ_EXTERNAL_STORAGE -- also known as Photos/Media/Files. AIDA64 requires this permission to detect external storage (SD-card) total and free space. Note: Due to a bug in Play Store, even on newer Android releases Play Store will incorrectly ask for this permission, even though AIDA64 doesnt need and doesnt utilize the permission. After the installation of the app, you can check the actually utilized permissions in Android Settings / Apps / AIDA64, and you will see that this permission is not used by AIDA64.  Known issues: - Screen diagonal size calculation may yield to an incorrect value if the manufacturer encoded the wrong xdpi and ydpi values into the Android profile of the device. If you find the screen size incorrect, please send us the report of your device from the About page, and we will fix it up in the next AIDA64 app update. - Camera capabilities may show incorrect information if the manufacturer encoded the wrong values into the Android profile of the device. If you find misreported information on the Devices page, please send us the report of your device from the About page, and we will fix it up in the next AIDA64 app update. - Battery capacity can only be reported for factory default batteries. If the battery was replaced with an extended capacity battery, neither Android or AIDA64 will be able to detect the new capacity. - Battery charge rate may be reported incorrectly if the phone or tablet doesnt properly support the new battery API calls introduced in Android 5.0. Even new Android devices released in 2015, coming with Android 5.0+ may not support it properly (example: Galaxy S6 doesnt fully support the new APIs). ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}