{
"name" : "Er Translator—audio translator speak translate now",
"url" : "https://play.google.com/store/apps/details?id=com.shenglin.ertranslator",
"package" : "com.shenglin.ertranslator",
"category" : "Tools",
"description" : "The Er live voice Translator app can deepl translate texts and voice in 84+ languages in real time.Automatically translate texts and voice into the language you want to translate through text recognition and voice recognition. It is an intelligent online translator developed through AI technology. You need to speak when you travel abroad. When translating, you can use this translation software to connect a Bluetooth headset, and you can instantly translate Free for 3 days.  It is an international language translation mobile phone software.It avoids the complicated operation of switching or setting the translation input method on the mobile phone.Real-time translation of any two languages .such as english to spanish french japanese korean italian russian latin german hebrew arabic Chinese Thai and so on.  It can also be used as a translation dictionary for fast and convenient online real-time translation of Chinese, Japanese, Korean, Thai, Vietnamese, Indonesian, French, Lao, Burmese, Italian, Mongolian and other small languages, as a handheld dictionary translation tool assistant Query the meaning of text words.  Develop more functions such as : scanner Translator, photo translator+, camera translator, web page translation, ar translation, document translation, image translation text, translator keyboard, audio translator,baby voice translation, dog language translation, cosmetic translation, screenshot translation, image translator, recording translation, do Massive translation function Encyclopedia of Universal Translation.  Applicable scenarios: Haitao shopping international language translation, overseas travel translation, global online social chat translation, international business translation, reading news, novels, listening to music, watching live broadcasts, chasing dramas and watching videos, English learning translation, university level 4 listening oral translation , Composition translation, etc. make life More interesting and more fun.  Translation function Face-to-face translation: After selecting the headset mode, any two different languages can be translated simultaneously in real time through the headset voice dialogue, and the automatic and manual modes can be switched. Remote chat: Global social chat is unobstructed. After entering the ID of the other party and adding it as a friend, real-time online chat across regions and countries can be realized. Text translation/voice translation: Enter text in the text editor to translate text, automatically recognize the text language or select the language and then voice recording for translation.  Function Use Turn on the Bluetooth of the mobile phone, connect the Bluetooth headset to the mobile phone, and open the translation headset App to experience it for free. You can also register members through the mailbox, pay attention to the official information, there will be more discounts and other information. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.FLASHLIGHT', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}