{
"name" : "A-Calc Ark Tools: ARK Survival Evolved",
"url" : "https://play.google.com/store/apps/details?id=com.rssolution.acalcguide",
"package" : "com.rssolution.acalcguide",
"category" : "Tools",
"description" : "Are you a fan of ARK Survival Evolved? If your answer is yes, then this unofficial taming calculator and companion app guide is a must-have for you, as it offers an Ark taming calculator to let you know how much resources and time you need for domesticate dinosaurs and other powerful creatures in the game. This unofficial companion app delivers everything you should expect from such wiki and guide apps, and it even sets the bar to a higher level by offering data from DevKit and personal testing data, engram calculations and planning, maps, admin commands (cheats), dino stats, recipes, and a lot more.   No matter you play ARK Survival Evolved on your PC, Xbox One or PS4, weve got you taming tools covered. Simply download A-Calc for free, select your desired language and leave the rest to taming calculator features.   A-Calc Taming Calculator Main Features at a Glance:  Various calculators and guides for every tameable creature or dinosaur in ARK Survival Evolved, Scorched Earth, Aberration, Extinction and the new DLC Genesis   Dino taming and foodrate multipliers for unofficial servers - e.g. 0.5 / 2 / 5 / 0.25  An all-in-one cross-platform wiki guide & companion app  Always newest ARK Dev Kit data and personal testing data  Knockout details and calculations  Torpor timer and starve calculated timer for starve taming  Dino stats, dino trainee level calculation and Wiki links for extended informations  Overviews for dinos and creatures: carryable, dmg, stun and fits through  Admin commands (cheats), engrams, breeding times, breeding calculator, recipes and dyes, patchnotes for PC, Xbox One and PS4  Ark Maps for cave locations, creature spawns and resources  Available in different languages: English, Spain, French, Italian, Russian, Polish, German and Portuguese-Brazilian  Clean and neat design with fresh and intuitive interface     Fair Use Act Disclaimer Copyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for fair use for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.   2016 coded by A-Calc www.a-calc.de an unofficial community driven app and is not affiliated with the game publisher. App content is available under CC BY-NC-SA 3.0 unless otherwise noted.  Game content and materials are trademarks and copyrights of their respective publisher and its licensors (Studio Wildcard). All rights reserved. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}