{
"name" : "Alarm clock to wake you up",
"url" : "https://play.google.com/store/apps/details?id=com.sux.alarmclock",
"package" : "com.sux.alarmclock",
"category" : "Tools",
"description" : "If you use to dismiss the alarm while you are still sleeping, looking for a cool simple alarm clock without all the complicated features or just wants to set alarm within few clicks without being required to pay for advance features then this free app is for you!   The current version of the good & simple alarm clock includes some basic features: * A math question to dismiss in case you use to dismiss while you are sleeping. You can also choose the difficulty level of the math question. * Set unlimited number of alarms (great for heavy sleepers who wants few alerts in a row to make sure they wake up). * Set alarms in advance for the entire week. * Use your own personal tone A music file from the device or a ringtone from the android OS. * Special user interface for tablets. * Loud sound - The default music volume is the maximum volume for the phone. Great for heavy sleepers. * Gradual fading in of the alarm music to wake up gently. * Works in silent mode. Works when the screen is locked. * Works also on android 6 (marshmallow) unlike other alarm clocks. * Vibrate including some advance settings. * Snooze including some advance settings. * YouTube alarm. * Quick Alarm - Just move your finger on the screen to set the time you want the app to wake you up.  * Effective tips about how to sleep well, how to wake up energized, how to create the best morning routine and the best night routine.  * Set a default music. * Cool and simple user interface so everyone can use it easily.   So to sum it up. The good & simple alarm clock includes a simple and cool interface and is great for all the heavy sleepers, kids, and everyone who wants to set an alarm as easy and quick as possible.   I do my best to make the alarm clock as simple and effective as possible. If you think that my best is not good enough please contact me via email: SimpleUxApss@gmail,com and leave me a feedback (its better via mail because its a two way communication). If you love the have please review it on the play store and write why you think the app is so good.   Please notice that the android OS do not allow the alarm clock to turn off while your phone is off.   On future versions of the app more free features will be added so stay tuned. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.VIBRATE', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.READ_PHONE_STATE']",
}