{
"name" : "Laser Level",
"url" : "https://play.google.com/store/apps/details?id=com.exatools.laserlevel",
"package" : "com.exatools.laserlevel",
"category" : "Tools",
"description" : "Laser level (leveling instrument) is an excellent measurement app equipped with: laser pointer, regular 3-mode spirit level / bubble level (libella) and clinometer (inclinometer) for measuring vertical angles and determining the exact horizontal plane. Its perfect, handy and precise bubble level tool for every handyman.  Main modes of this laser level: - innovative laser leveling / laser pointer - using built-in sensors (gyroscope and accelerometer), camera and extended / augmented reality, helps you to determine the vertical and horizontal levels around you,  - regular spirit level (bubble level, libella) - works like a traditional bubble level tool, place your smartphone or tablet, on the surface or on the object to be measured or set at any angle,  - clinometer, also called an inclinometer, is primarily used to measure vertical angles and to determine the angle of inclination of any object from the vertical determined by the gravitational force.  These modes are equipped in precision digital and analog indicators. Data are presented in degrees and percentages and any different units which you choose.  Additional features,  you can: - calibrate level of your device, - adjust the precision of measurement, - read data in different units, - lock the orientation, - take pictures while measuring and you can send measurement results to anyone, - this app does not require internet access.  Sample applications: - you can measure the angle or inclination of any objects (including distant), such as roof, buildings, columns, mountains, trees, etc. - you can set any angle of inclination of the surface and the level of home installed appliances, devices, such as: install a refrigerator, washing machine or hang a shelf, painting etc. - suitable for repair and construction work, you can use it as a digital measuring tape or laser measuring tape, - useful for interior design, exterior works, in house and in garden, - many others.  You can use this leveling application wherever you are. This level app is accurate, intuitive, easy to use and very functional.  We wish you successful and accurate measurements. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}