{
"name" : "ApowerMirror- Mirror your screen on TV",
"url" : "https://play.google.com/store/apps/details?id=com.apowersoft.mirror.tv",
"package" : "com.apowersoft.mirror.tv",
"category" : "Tools",
"description" : "ApowerMirror is a screen mirroring app that enables you to mirror Android or iPhone screen to TV. With this app, you will be able to enjoy your phone screen on TV, stream videos and other media files to TV, and even do presentation on TV.   Key features Screen mirroring ApowerMirror allows you to cast your phone screen to TV so that you can share your phone screen with your family and friends on a large TV screen.  Video streaming It supports streaming videos from Android or iPhone to TV, including local videos and those on video apps. You can cast local videos after you mirror your phone to TV, and you can stream videos to TV from certain video app that has a streaming feature like DLNA. Supports mainstream Android TV This app has a high compatibility and can be used to mirror phone to Android TV running Android 5.0 and higher.   Other highlighted features Share gameplay. If you are a game enthusiast and want to share your gameplay with others on a large TV screen, ApowerMirror will help you. Once you mirrored your Android or iPhone to TV, you can enter a game and your gameplay will be shown on your TV.  Share photos. ApowerMirror supports accessing photos on your phone from TV and you can share your photos with others on TV.  Do presentation. You can do presentation with this app on your TV. Once you mirrored your phone to TV, open the file you want to present on your phone, including PPT, PDF, Word, Excel or any other documents, and then you and your audience will see it on the TV screen immediately.  Read eBooks. It also allows you to read eBooks on TV. Open the eBook on your phone, and then you can read it on TV as you wish.  Access phone apps. With this app, you may also access the apps on your phone from your TV and enjoy using those apps on TV for a better user experience.  Visit website on TV. ApowerMirror also provides you with the opportunity to visit website on TV and you can view all the contents you get on your phone from your TV.  Control TV with phone. After you mirror your Android screen to TV, you can use your phone as a remote control to play or pause the video, adjust the volume, forward or rewind, etc. Rotate screen. When you mirror phone screen to TV, you can rotate the screen to make it horizontal or vertical and get the effect you want.  Customize frame rate or resolution. You can choose 30 fps or 60 fps according to your needs. For iOS users, when you mirror iPhone to TV, you can adjust the AirPlay resolution to get the best quality.  Note: This app supports TV running Android 5.0 and higher.  ApowerMirror is a professional app that enables you to do screen mirroring and video streaming from phone to TV. To use it, please make sure that your phone and TV are connected to the same WiFi network. If you have any suggestions or problems about ApowerMirror, please feel free to contact us at support@apowersoft.com. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'com.apowersoft.mirror.tv.ACCESS_VIDEO_DATA', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.apowersoft.mirror.tv.ACCESS_VIDEO_DATA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
}