{
"name" : "IPVanish VPN: The Fastest VPN",
"url" : "https://play.google.com/store/apps/details?id=com.ixolit.ipvanish",
"package" : "com.ixolit.ipvanish",
"category" : "Tools",
"description" : "The best online privacy is the kind you dont even have to remember. IPVanish automatically conceals your IP address and encrypts your connection to keep your privacy protected.  With IPVanish VPN, protecting your personal data is effortless. Just subscribe to IPVanish, select a city from which you want your new IP address to originate, and select connect to start encrypting. The VPN app works as a tunnel that allows you to securely use your device, all while keeping third-party onlookers and trackers outside of the connection.   Once youre connected to IPVanish VPN with your online activity protected, youll finally experience a safe and free Internet. Put a stop to online identity theft, securely connect to untrusted Wi-Fi, and prevent your internet provider from interfering with your connection by utilizing this award-winning VPN app.   WHY IPVANISH? IPVanish provides a secure environment for everyday internet use. Once you establish a connection to the encrypted network, all of your online data (emails, instant messages, data transfers, browsing history, online banking) is protected. IPVanish is the only true Top Tier VPN service provider in the world. This means that IPVanish owns all of its VPN servers, manages its tier-1 network, and develops its apps directly in-house. By removing any middlemen, IPVanish ensures that your data remains as secure as possible.  Product Features:   Encrypted connections for up to 10 devices simultaneously  24/7 live chat and phone support  Split-tunneling, which allows specific apps to operate outside the VPN  IPv6 leak protection, which drives all traffic through IPv4   Absolutely no connection or activity logs are stored  Network presence in over 60 countries with 40,000+ shared IP addresses  Advanced-standard encryption (AES-256)  Access to more than 1,200 VPN servers worldwide  7-day money-back guarantee   PRIVACY POLICY http://www.ipvanish.com/privacy-policy.php   TERMS OF SERVICE https://www.ipvanish.com/tos.php   CONTACT US If you need help, have a question, or just want to leave some feedback, email us at support@ipvanish.com or visit https://support.ipvanish.com/hc/en-us ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE']",
}