{
"name" : "Swiss Post",
"url" : "https://play.google.com/store/apps/details?id=com.nth.swisspost",
"package" : "com.nth.swisspost",
"category" : "Tools",
"description" : "The following features are available:  CODE SCANNER  available via QR code icon: With the scan function, you can scan the barcodes and QR codes on consignment documents. You can also enter consignment numbers manually. Business cards with a printed QR code can be scanned simply and the information saved in the devices contact details.  LOCATION SEARCH: The app determines your location and indicates the nearest post offices, Postomats and PickPost points. The location search remains available even when your GPS is deactivated.  TRACK & TRACE: You can scan barcodes on letter mail, international consignments and parcels, and QR codes on receipts from post offices. The consignment number is then entered automatically in the Track & Trace overview. In order to improve the overview, you can add your own text to the numbers of the listed consignments.   HAVE PARCELS COLLECTED FROM YOUR HOME: With pick@home, the parcel carrier collects your consignment from your home or another address (Swiss Post login required).  PRICES: Calculate prices for consignments to Switzerland and abroad.  SMS POSTAGE STAMP?: No stamp at hand? Simply send an SMS containing the word STAMP to 414, write the code you receive on the right-hand side of the envelope and youre done.  COLLECTION NOTE: Is there a collection note in your letter box? Using the scan function, simply scan the code field on the collection note  then you can select further delivery options.  CUSTOMER SERVICE: Fast and easy access to Swiss Post Customer Service.  SETTINGS: Configure the Post-App to suit your needs.  The Post-App is available in four languages (EN, DE, FR, IT) and the language adapts itself automatically to the Smartphones system language. This can be changed in the Android settings. ",
"desc_perms" : "['android.permission.RECEIVE_SMS', 'android.permission.SEND_SMS']",
"manifest_perms" : "['android.permission.CALL_PHONE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.nth.swisspost.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.FLASHLIGHT', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}