{
"name" : "ESET Secure Authentication",
"url" : "https://play.google.com/store/apps/details?id=com.eset.esa",
"package" : "com.eset.esa",
"category" : "Tools",
"description" : "NOTE: Before installing ESET Secure Authentication, please note that the product requires server side installation. This is a companion app and will not work independently. Contact your companys network administrator to receive your enrollment link.   ESET Secure Authentication is an easy-to-install, deploy and manage, 2-factor authentication (2FA) solution for businesses. The second factor, which is received or generated by the mobile app, complements and strengthens the normal authentication process and secures access to your companys data.    The ESET Secure Authentication app allows you to:   Receive push notifications on your device that you can approve to complete authentication  Generate one-time passwords to use along with your username and password  Add new account simply by scanning QR code   Supported integrations:   Microsoft Web Apps  Local Windows logins  Remote Desktop protocol  VPNs  Cloud services via AD FS  Mac/Linux  Custom apps   Two-factor authentication is a combination of two security factors  something that the user knows , e.g. a password  with something that the user has, a mobile phone to generate a one-time password or receive a push for access.   Rely on ESET  a company with 30 years of experience in enabling businesses and consumers to Enjoy Safer Technology.   Find out more about ESET Secure Authentication for businesses: https://www.eset.com/int/business/endpoint-security/two-factor-authentication/  This app uses the Device Administrator permission. This app uses Accessibility services. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FLASHLIGHT', 'android.permission.CAMERA', 'com.eset.esa.permission.C2D_MESSAGE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
}