{
"name" : "3D Gallery",
"url" : "https://play.google.com/store/apps/details?id=com.vyom.gallery.lite",
"package" : "com.vyom.gallery.lite",
"category" : "Tools",
"description" : "Super fast gallery with cool 3D styles and best innovative display.  Well-designed gallery replacement for the built-in phone gallery. Gallery is a free, next generation photo gallery with smooth gallery user interface and best innovative display.  Fast, light and modern gallery with special animated gallery looks for your phone.  With 3D Gallery, you can: Enjoy 3D Styles Make your gallery photos alive with 3D styles like carousel, spiral, helix, circle and many more. Enhance gallery photos as per your choice using pinching in different 3D styles. Change styles using just one tap on Action bar icon and witness cool 3D animations. Cool 3D animation on single tap and double tap on gallery photo.  Create & Share WhatsApp Stickers Use gallery as personal sticker for WhatsApp - WAStickerApps to use your favourite photos as WhatsApp Sticker Packs and share them with your loved ones and friends.  Steps to add stickers on WhatsApp * Select your favourite photo and use Create Sticker option from Action Bar * Use Show Stickers option from Action Bar to view all Sticker Packs and add them to WhatsApp * You can also add other apps Sticker to Sticker Packs. Select Sticker in gallery and use Add Sticker option from Action bar.  Organise your gallery Quickly search thousands of gallery photos and use delete to organise your gallery photos.  Photo Editor * Rotate * Edit to share photos directly in premium apps like FaceApp, BeautyPlus, B612, PicsArt Photo Editor, etc.  Slideshow Play slideshow of gallery photos instantly in a high quality slideshow. Set background music for slideshow from gallery settings.  Share Easily share groups of photos and videos from your gallery, with just a tap!  You can share your pictures to social networks like Facebook, whatsApp, twitter, G+ etc.  Gallery Features * Auto-style change on position/orientation change of device. * Start browsing photos in gallery where you have left last time instead of starting again from first image * Set any image as Background  * Configurable Auto Hide Action bar * Customise as your choice from gallery settings  Like us on Facebook : https://www.facebook.com/vyomygallery  Note:  Delete will not work on SD Card for 4.4 OS due to system restriction. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
}