{
"name" : "Multi line - dual line app & multiple accounts app",
"url" : "https://play.google.com/store/apps/details?id=com.multi.line",
"package" : "com.multi.line",
"category" : "Tools",
"description" : "How to login to 2 social accounts or multi accounts on one mobile phone at the same time for balance your work and personal life?  Do you want to run 2nd game accounts on a single phone to get multi experience or reward? Now Multi Line is available to satisfy your needs!   Multi Line helps Android app clone & cloning multi games and you can run 2 or multiple accounts of the same app simultaneously in a dual space & parallel space, and fast switch between multi accounts by one click. Multi Line provide a solotion for users login to 2 line or multiple Line accounts at the same time on one mobile device, while messages and datas of your different accounts are in seperated parallel space. Multi Line also be compatible with most instanting apps, such as 2 Facebook, 2 Instagram, 2 WhatsApp, 2 LINE, 2 Twitter, 2 Snapchat or Mobile Games. Get Multi Line immediately to manage multiple accounts, gain multiple fun!   One App, Multiple Social Accounts: Balance between users life and work easily. We support most Instant Socialmedia&Messaging. Multiple accounts can work simultaneously on one device, connect different friends and share parallel information.  Double users online gaming experience: Log in many game accounts for Google Play and different experiences for both accounts at the same time!  Privacy and Security in app cloning: Hide users secret apps without worrying about prying eyes by keeping apps only in this dual space.  FEATURES: - Simple and Pure UI, clear notification to help you fast switch between multi accounts. - Different Acounts,Same Features, Separate Space, No Conflict! - Small and Low CPU Consume. - User Info are Safely Guarded.  Multi Line powered by Years Tech, with the most light-weighed and powerful clone engine, can help you clone your app into another separated parallel space. Whats more, Multi-Line can help you manage notifications of the cloned app, and provide Privacy function to protect the cloned app. Multi-Line is compatible with most instant message apps, game apps and social networking apps. Google Play Service are supported, and you can connect with your Google Play Games or other services in your clones.  Notes:  Permissions:Multi Line needs to apply for the permissions required by the apps added in to function normally.  Consumptions: Multi Line itself doesnt take up too much memory, battery and data by which are actually consumed by the apps running inside.   Notifications: Please add Multi Line to whitelist or exceptional list of some boost apps to ensure that notification of some social networking apps functions well.  If you like Multi Line, please give us 5-stars rating and share with your friends. For any problems, you can refer to the FAQ in the app or please contact us via the Feedback and service feature inside or email(nianyuxinxi@gmail.com). We are looking forward to your feedbacks! Thanks for your support! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.CALL_PHONE', 'android.permission.RECORD_AUDIO', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.FLAG_GRANT_READ_URI_PERMISSION', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.RECORD_AUDIO', 'android.permission.FLAG_GRANT_READ_URI_PERMISSION', 'com.android.vending.BILLING', 'android.permission.CAMERA']",
}