{
"name" : "Sensors Toolbox",
"url" : "https://play.google.com/store/apps/details?id=com.exatools.sensors",
"package" : "com.exatools.sensors",
"category" : "Tools",
"description" : "Sensors toolbox is the absolute all-in-one diagnostic tool that lets you know virtually everything about your mobile device status. Get full information about all sensors supported by your tablet, smartphone or wearable device. View in comfortable layout all data from your mobile device sensors in real time, make a sensors tests. Check data on chart (graphic view) and text output available for each sensor and check a detailed description of each detectors and parameters.  All multi tools and sensors device you need in one app: altimeter, metal detector, NFC reader, compass, thermometer, step counter, sport tracker and much more.  This sensors tool box app gives you access to data from:  - accelerometer readings (linear acceleration and gravity sensors) - gyroscope (calibrated and uncalibrated) - device 3D orientation - proximity sensor - step detector and counter, kinetics sensors - significant motion - rotation vector sensors - other motion and position sensors - light sensor (lux, lx) - magnetometer, ambient magnetic field values strength (micro Tesla, T)  - barometer, pressure sensor  - relative humidity sensor - temperature sensor - location, accuracy, altitude, maps, speed and GPS NMEA data (latitude, longitude, provider, satelites) - battery status, voltage, temperature, health and technology - sound level meter and microphone meter (decibel) - heart rate sensor - NFC sensor and reader - device front and back camera resolution - samrtphone display size, resolution and technology - device, phone memory, RAM and CPU parameters - IMEI number - multitouch info and others sensors available in your mobile device.   With this sensors multitool app you can check what kind of sensors contain your device and test all of this. It supports all the sensors an android device and you can check a lot of data from sensors supported by your hardware.  If you have any problems with this app or ideas to develop, please send us message to exatools@gmail.com  Have a fun at work with this ultimate tool! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.NFC', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.NFC', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}