{
"name" : "All-In-One Unit Converter",
"url" : "https://play.google.com/store/apps/details?id=com.gvapps.unitconverter",
"package" : "com.gvapps.unitconverter",
"category" : "Tools",
"description" : "All-In-One Unit Converter app is a simple and elegant conversion tool containing 2000+ units of measurements with 150+ Currency Converter live exchange rates and classy calculator. Perfect for work, school, engineering or in the kitchen.  List of Converters included in this Unit Converter app:  1. General Unit Converter  2. Electricity Converter  3. Engineering Converter  4. Fluids Converter  5. Heat Converter  6. Light Converter  7. Magnetism Converter  8. Miscellaneous Converter  9. Radiology Converter   This General Unit Conversion app contains the conversion factors for  Acceleration, Angle, Area, Data conversion, Currency converter, Density, Distance/Length, Energy, Force, Fuel Consumption, Frequency, Mass/Weight calculator, Power, Pressure, Sound, Speed/Velocity, Temperature converter, Time, Torque, Volume units and many more...  Features include:  More than 2000+ units of measurements in 75+ Unit categories and has all Converter Pro, Engineering converter and Converter plus features.   Adjustable precision and format of the result.  Built-in real-time Currency Converters and their latest exchange rates.  In Offline mode, an internet connection is only needed to update currencies.  Convert multiple units at once.  Calculator for expression input (e.g. (6+7)*40/3).  Supports both Metric and Imperial Units (UK and US).  INSTANT results while typing. No need to press that annoying Calculate button.  Simple to use with an easy Temperature Converter.  Convert Units - Calculator, Currency converter and Unit Converter also provide real-time live currency exchange rates with offline mode support and Instant currency conversion just by typing. Supports all currencies for every country including the US dollar, British pound, Indian Rupee, Australian dollar, Singapore dollar, Canadian dollar, Japanese Yen, Euro and many more.  This Professional Unit Converter calculator turns a smartphone into a universal and best unit converter.  Available unit conversions include: - Acceleration (km/sq sec, gal, Acceleration of Gravity, foot/sq sec etc) - Area (square kilometer, square mile, hectare, acre, etc) - Angle (degree, radian, grad, etc) - Data/Digital Storage (bits, bytes, megabytes, gigabytes, etc) - Density (kg/cubic meter, psi/1000 feet, Earths density, etc) - Length/Distance (kilometer, mile, meter, yard, foot, etc) - Energy (joule, Calorie, BTU, etc) - Force (Newton, kilogram-force, kilonewton, etc) - Fuel Consumption (miles per gallon, liters per 100km, etc) - Frequency (cycle/second, kilohertz, RPM, etc) - Mass/Weight (kilogram, pound, ounce, ton, stone, etc) - Power (watt, kilowatt, horsepower, etc) - Pressure (kilopascal, bar, PSI, etc) - Sound (decibel, bel, neper, etc) - Speed/Velocity (km/h, mph, knot, etc) - Temperature (celsius, Fahrenheit, kelvin, etc) - Time (year, month, day, hour, second, etc) - Torque (newton meter, dyne cm, kg-force mm, etc) - Cooking Volume (teaspoon, tablespoon, cup, pint, quart, ounce, etc)   Need more Unit conversions/units and Metric Conversion, just drop us an email and we will check to add them.  Thanks for downloading it. Your comments and suggestions are most welcome.  If there is an issue or feature request, please send us an email at itsgvapps@gmail.com.  Please dont forget to provide us with your valuable reviews and suggestions. It helps us to improve.  Disclaimer: The data collected is provided free of charge for informational purposes only, with no guarantee of whatsoever for accuracy, validity, availability or fitness for any purpose. Use it at your own risk. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}