{
"name" : "WiFi File Explorer",
"url" : "https://play.google.com/store/apps/details?id=com.dooblou.WiFiFileExplorer",
"package" : "com.dooblou.WiFiFileExplorer",
"category" : "Tools",
"description" : "Now with drag-and-drop file uploads and SD card write access on Android 5.0 and above, so you can once again upload, delete, rename and move files on your SD card!  * This FREE version is limited to a total of 50 file uploads. The PRO version is unlimited, is featured on Life Hacker, PC World & Android Central and recommended by Motorola. The ORIGINAL, best, steadiest and most popular WiFi file transfer app with now over 3 million users across all app stores worldwide! *  Browse, download and stream individual files that are on your Android device, using a web browser via a WiFi connection.   No more taking your phone apart to get the SD card out or grabbing your cable to access your camera pictures and copy across your favourite MP3s.  I wholeheartedly recommend going the wireless route with WiFi File Explorer! - PC World review - 5 stars.  Best couple of bucks I ever spent. - Top app of 2011 - from Android Centrals Jerry Hildenbrand.  ------  FEATURES  1. Using a web browser, you can browse and download all the files on your Android device without the need for a cable. Download entire directories with one click which no other similar app offers;  2. View all the camera pictures and videos or listen to all the music on your Android device streamed directly in a web browser. Use shortcut tabs to quickly view All Music, All Pictures and All Videos stored on your device, no matter which directory they are in;  3. Use the one of a kind gallery viewer to create a slide show of all your camera pictures directly from your Android device. Simply click on a pictures file name to launch the gallery viewer and then hit the play button to enjoy all your pictures in the web browser;  4. Search box so that you can find any file on your Android device;  5. Select between thumbnail and detail views to choose the best method to quickly browse your files. Thumbnails are supported for both pictures AND videos!  6. Upgrade to the PRO version to perform multiple file uploads/download do full backups, stream media playlists, create new directories, delete/rename/copy/zip/unzip files and auto-install apps saved on your device,   7. Runs as a service in the background so you can use other apps while you are making transfers;  8. Simple to use with no set up or buttons  it just works!  9. Password protected to prevent unwanted access;  10. Ability to configure the port settings;   11. Full support for special characters in file names which competitor apps do not support;  12. Visual indicators and stats of how much free space is on your Android device as well as real-time indicators of how much battery and WiFi signal you currently have;  13. Send an email to the web link from the app for easy connection;  14. Special Development Goodies mode to enable SSL protection  email developer for details!  14. LOTS more features in development;  ------  * Before emailing, check FAQs at http://dooblou.blogspot.com *  * Follow @dooblou on Twitter for all the latest news and updates as they occur *  * Find us on Facebook  Search for WiFi File Explorer *  ------  If you do have problems using this application on your WiFi network, it is most likely a configuration problem with your router/network. Please contact the developer if you have any questions and he may be able to help you ... but please dont rate low because your network isnt configured properly - that isnt the applications fault ;) ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SET_WALLPAPER', 'com.android.vending.CHECK_LICENSE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}