{
"name" : "MyPrivacy: Privacy Guard, VPN, Browser & Passwords",
"url" : "https://play.google.com/store/apps/details?id=com.myprivacy",
"package" : "com.myprivacy",
"category" : "Tools",
"description" : "MyPrivacy Is a VPN, Private Browser, Photo Vault, Password Manager & Social Permissions App, Trusted by Hundreds of Thousands Android Users.   Whether its your passwords, photos, videos or notes, wi-fi connection, we got you covered. MyPrivacy is the biggest & simplest privacy app ever made. This Privacy guard app will make sure your sensitive information is kept private.   How can MyPrivacy help you hide your sensitive information?   VPN - your location is a sensitive piece of information as any other. So as your Wifi connection. Hide your location and secure your connection with our fast and secured VPN. Whether you are looking for security VPN on public WiFi Hotspot or fast VPN for your Netflix show, you can get it all with our fast VPN feature.    Applock - Lock mobile apps to make sure that no one gets a glimpse of something they shouldnt. AppLock can lock all android apps, including Social apps such as Facebook, WhatsApp, Messenger, Twitter, Instagram, Snapchat, WeChat, and so on. No one will peep at your private chat any more.   Photo Vault - whats more sensitive than private selfies, embarrassing videos, or potentially reputation-devastating photos? Hide photos & videos, contacts, notes, and other confidential information in a secure photo vault by encrypting your Gallery. Keep children or snoopers away from your settings, deleting important things, or making in-app purchases.   Private Browser - every time you forget to delete your browsing history, you leave a trace of sensitive information behind. Instead of trying to remember to clear your history again, why dont you simply use Browser? Our private browser also blocks (ad blocker) various trackers, so your browsing is ads-free and super fast! Blocking ads has never been so simple!   Password Manager - all that sensitive information hiding in websites around the web, supposedly locked behind passwords? Unless youre using a strong password for every website, chances are hackers will eventually hack your accounts. Remembering a secure password is practically impossible; thats exactly what our passwords manager helps you solve.   Social Permissions - Remember all those little games and websites that asked you to connect your Facebook or Twitter? Whether it was to get a magic sword, to win extra life, or to expedite the growth of your crops, all those services still probably have access to your profile. Dont you think its time to do some spring cleaning? The social permissions feature allows you to delete all these services that are connected to your social profile.    Here is why MyPrivacy asks for specific permissions and for what purpose: - Accessibility used to lock apps - Storage used to import photos or videos from gallery to MyVault - Camera used to take a private photo or video and store it directly in MyVault - Audio used to take a video and save it directly in MyVault    Privacy Policy - http://myprivacy.io/privacyPolicy Terms: http://myprivacy.io/privacyTerms ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'android.permission.RECORD_VIDEO', 'android.permission.USE_BIOMETRIC', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FLASHLIGHT']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_VIDEO']",
}