{
"name" : "Mobile Counter | Internet Data usage  | Roaming",
"url" : "https://play.google.com/store/apps/details?id=com.mobileCounterPremium",
"package" : "com.mobileCounterPremium",
"category" : "Tools",
"description" : "Avoid unnecessary costs - no mobile operator offers completely unlimited data usage. This app can save your money. Mobile Counter is the best data counter to monitor and measure your Internet traffic. The best and easiest way to check your data consumption. Mobile Counter is compatible with all providers and operators on the world Practical solution for a limited data volume. You can measure your data package. The data counter have the perfect solution to control your Internet data usage for mobile connections and WiFi connections. Helps you monitor the already consumed and remaining data volume in the current billing period.  Mobile Counter shows the current consumption for limited data on the progress bar with a percentage. Display of daily, monthly data usage. Application can check your Internet speed for mobile and wireless connections  Track your data usage to save money on bills - download app now.  This is the same app like Mobile Counter 3G, WiFi but with material design (new Android 5.0 layout).  Features of Mobile Counter app  Bandwidth monitor for 2G, 3G, 4G (EDGE, GPRS, HSDPA,HSDPA+, LTE), monitor WiFi, GSM, CDMA data usage, internet Speed in notification, tethering data traffic via WIFI, mobile data tracker for roaming, hotspot data usage - measure wireless traffic for one SSID, schedule plan (your limited Internet data) for mobile traffic. Quota for plan is set with expiration time. Flexible solution if your Internet is limited. Alarm notification can be triggered for various events like daily usage bigger than some value, plan data less than configured value, left days to plan expiration less than defined value and much more. Each alarm can work separate, so you can define several alarm notifications in application. Data usage for applications, billing cycle configuration for mobile and wireless data usage Widgets for plan data usage, mobile and wireless traffic, notifications (support Wear devices), track historical consumption, alerts for plan data limits, real time traffic monitor (display speed for download and upload transfers)  Facebook profile for Mobile Counter 4G Premium: https://www.facebook.com/pages/Mobile-Counter-4G-Premium/1584614895121113?fref=ts  Official website: https://sites.google.com/site/mobilecounter4g/ ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.WRITE_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.PACKAGE_USAGE_STATS', 'com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}