{
"name" : "Gesture Control - Next level navigation",
"url" : "https://play.google.com/store/apps/details?id=com.conena.navigation.gesture.control",
"package" : "com.conena.navigation.gesture.control",
"category" : "Tools",
"description" : "Get the maximum out of your android device!  Get rid of your navigation bar and learn to appreciate the benefits of gesture-based navigation. There was never before, a more natural way, to control your smartphone. Let the future begin!  Who can benefit from this application?   Tech freaks, which want to have the latest features on their device  People with small hands or huge smartphones, it is much easier to expand navigation bar from bottom of screen, than from the top.  People with broken hardware buttons  People who use their smartphone with gloves or have problems touching the normal soft keys. The sensor area of this app is customizable, so everyone can find the perfect size.  Currently these gestures are available:   Swipe up/left/right  Swipe up/left/right and hold  Short Swipe up  Short Swipe up and hold  Double tap (Donation/Pro version)  Long tap (Donation/Pro version)  Double tap and hold (Donation/Pro version)  Currently you can invoke these actions with gestures:   Back  Home  Recent apps  Notifications  Quick Settings  Screen off  Most recent app  Power Dialog (Power off, reboot on some devices, etc.)  Multiwindow (Android 7+)  Google assistant (if installed)  Execute Tasker tasks (Pro, requires Tasker)  Volume actions (Partially Pro required)  Show information (Partially Pro required )  Media control (Partially Pro required)  Brightness control (Partially Pro required)  Launch other apps(Pro required)  Internal actions (Hide Bar for specific period, hide bar until app switch, etc. - Partially Pro)  Power off options, Take screenshot, etc. (Root, Partially Pro)  More is coming soon!   In order to provide the above-mentioned functions, the applications uses accessibility services features.   Privacy is important to me. This application will not send any personal data to the developer or anyone else.  This app uses the Device Administrator permission. This permission must only be granted if you want the Lock screen action to be used.  If you like my app, I would be very happy if you have a look at the donation/pro version (https://play.google.com/store/apps/details?id=com.conena.navigation.gesture.control.pro).  For more information about how the app works, please check out the following reviews:  (Text - Detailed) https://www.computerworld.com/article/3252807/android/iphone-x-gestures-android.html  Translation credits:  Chinese - Zhao Peng French - Julien Jaegy Japanese - TUVIn5f0 Portuguese - Adalberto Fontenele Russian -   Spanish - Fher Mosqueira  If you have any questions or want to translate the app into your language, feel free to contact me: info@conena.com. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'com.conena.navigation.gesture.control.SCREEN_OFF', 'android.permission.WRITE_EXTERNAL_STORAGE', 'net.dinglisch.android.tasker.PERMISSION_RUN_TASKS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_SETTINGS', 'android.permission.WRITE_SECURE_SETTINGS', 'android.permission.VIBRATE', 'com.conena.navigation.gesture.control.CHECK.LICENSE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'com.conena.navigation.gesture.control.SCREEN_OFF', 'android.permission.ACCESS_FINE_LOCATION', 'net.dinglisch.android.tasker.PERMISSION_RUN_TASKS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_SECURE_SETTINGS', 'com.conena.navigation.gesture.control.CHECK.LICENSE']",
}