{
"name" : "Pinyin Simplified MessagEase",
"url" : "https://play.google.com/store/apps/details?id=com.exideas.cp.words.pinyins",
"package" : "com.exideas.cp.words.pinyins",
"category" : "Tools",
"description" : "This package adds roman letters to Pinyin Simplified Chinese characters translation to MessagEase Keyboard. This package works with MessagEase keyboard Version 8.5 or higher   To use this package, install MessagEase keyboard (free from Google Play) and this package, then Add a new Latin-letter-based keyboard, such as English (from MessgEases Settings > Languages & Keyboards) then choose Pinyin Simplified for that keyboard. Make sure Word prediction is on. Once you do that, you can enter roman-letter Pinyin abbreviations and their Simplified Chinese character translations to choose from.  If you have not tried or experienced writing with MessagEase keyboard, instead of the tiny QWERTY, on a touch screen, you are in for a wonderful treat. Download MessagEase and see for yourself how you can text with easy and speed.   After you install this wordlist module, go to MessagEases Settings and then Word Prediction to configure this wordlist.     MessagEase is the most accurate and the fastest keyboard for your Android phone, or any touch screen device.   MessagEase has fewer keys; You only need to target nine keys. Most keys have two letters assigned to them, except the central key, which is quite special.   MessagEase has bigger keys, almost 3 times bigger, making them easier and faster to tap. Its optimized for touch-screen, thanks to its innovative letter arrangement.   With MessagEase you enter all characters with either Tap, or a Drag. Tap for the most frequent letters. And drag for the rest!   This combination of fewer, larger keys, and the special letter arrangement results in a typing activity which is mostly around the center of the keyboard with short and simple taps or drags!   MessagEases patented design is the result of many years of scientific research in the field of Computer-Human Interface (CHI). In addition to Android phones, MessagEase runs on the iPhone, Palm OS, Tablet PC (Windows), and Pocket PC.   MessagEase enjoys a large group of dedicated users on PDAs and Tablet PCs who consider it to be an indispensable tool. Join tens of thousands MessagEase users and experience the most innovative keyboard for your Android phone. ",
"desc_perms" : "[]",
"manifest_perms" : "[]",
"perms_with_call" : "[]" 
"extra_perms" : "[]",
}