{
"name" : "Huge Digital Clock",
"url" : "https://play.google.com/store/apps/details?id=com.cama.app.huge80sclock",
"package" : "com.cama.app.huge80sclock",
"category" : "Tools",
"description" : "----- Important!! ----- This app is not for the lock screen  This is a huge digital clock, the biggest! It reproduces the fabulous display of a digital clock. The display is always on. The design is customizable.  Features:  It shows an extra-large digital clock.  It can show the day of the week.  It can show the calendar date  Clock color is adjustable.  Clock font is settable.  Clock format can be set to h24 or h12 and is automatically detected at the first launch.  Works in landscape and in portrait mode. The orientation can also be detected automatically.  The status bar can be hidden.  Moreover, it is possible to set an alarm. The alarm works also with the clock in background or with the phone locked.  It is possible to use Huge Digital Clock to automatically start the app when the phone is charging. It is necessary that your phone is compatible. It is possible to configure this function from the setting of the app, or following this procedure: 1. Open Settings. 2. Tap Display. 3. Tap Screensaver to see a list of available apps. 4. Select Huge Digital Clock as screensaver. During the screensaver of Huge Digital Clock, it is possible to set the brightness of the screen using a dedicated icon.  Works on any device, including tablets. If you decide to use this clock during the night, since the monitor is always on, it is better to keep the device in charge. The luminosity can be decreased through the Night mode.  This app cannot be used to put the clock in the home screen as a widget. If you want this feature, try the pro version of the app! Its named Huge Digital Clock Pro.  If there is any problem, instead of give a bad review, please send me an email. I will try my best to resolve any issue! :) ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}