{
"name" : "Epson iLabel",
"url" : "https://play.google.com/store/apps/details?id=com.epson.ilabel",
"package" : "com.epson.ilabel",
"category" : "Tools",
"description" : "Smarter labelling  Epson iLabel makes it easy to create, store, and print labels from your Android phone or tablet.  Use your smart devices functionality, including voice transcription, contacts and image gallery, to add a new dimension to your labelling experience. Users can easily share label makers with the Epson iLabel app.  The Epson iLabel app works with the Epson LabelWorks wireless printers. To buy one of these label makers or LK/ PX tapes, please visit www.epson.com or contact your local supplier.  [Main Features] - Create, edit, and print labels wirelessly - Generate and print QR codes - Barcode printing: eight types supported - Support creating multiple length labels at once on Mix Length function. - Select and print from a variety of pre-defined, commonly used labels - Quick timestamp function  - Store label data on Dropbox or Google Drive for sharing with other smart devices. - Up to 100 created labels can be saved and reused - Up to 100 printed labels can be automatically saved and reused  [Additional Features] - The status of your label printer can be checked on your smart device (set tape width, errors, and connection status) - Three original fonts for ribbon tape creation, Algiers Medium L1, URW Chancery L1 and URW Coronet L1. - Voice transcription (enabled by your Android OS) *1 - More than 100 label design templates and over 400 symbols are available - Insert images from your camera roll (two-tone image conversion) - Drawing tool; sketch labels using the devices touch interface - Camera-based preview tool: digitally see your label on an item before printing *2 - Data can be shared with other smart devices through email. - Support to import and edit the label file(s) created on Label Editor for Windows (v1.70 or later)  *1 If your device supports it, you can use voice transcription to input text into the Epson iLabel app. *2 If only front camera is available, camera-based preview tool cannot be used.  [Supported Models]  LW-C410 / LW-600P / LW-1000P / LW-PX400 / LW-PX800 / OK600P / OK1000P / LW-Z5000 series/ LW-Z5010 series (Actual product name may differ across regions.)  [Supported Device]  Android 5.0 or later Screen definition should be more than 800x480 pixels  *Note: More information about Epson iLabel and LabelWorks solutions is available on Epsons website.  ----- We welcome your feedback. Unfortunately, we cannot reply to your e-mail. ----- Personal information that has been collected by Send email,  it will not be used for any purpose other than the application improvement. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}