{
"name" : "Tip Calculator: Calculate the Tip & Split the Bill",
"url" : "https://play.google.com/store/apps/details?id=com.jarfernandez.tipcalculator",
"package" : "com.jarfernandez.tipcalculator",
"category" : "Tools",
"description" : "TIP CALCULATOR  Tip percentage calulator app for free, very easy to use  that allows to obtain the final amount of the bill, including the tip. The final amount of the bill is calculated from the percentage of tip that is established or from a specific amount of tip.  The tip calculator also allows you to split the bill by the number of diners.  DONT WASTE TIME CALCULATING THE TIP  The tip calculator is a very useful tool when we go to lunch or dinner at a restaurant or cafe and we dont want to waste time calculating the tip that we have to pay and what it is up to each diner to pay.  Keep in mind that in many countries it is mandatory to pay a tip.  These are some of the countries where it is customary to leave a tip:   Austria   Canada   Czech Republic   Egypt   Germany   Hungary   India   Ireland   Mexico   Switzerland   Turkey   United Kingdom   USA   Use the tip calculator to avoid mistakes when paying the bill in a restaurant or cafeteria.  VERY EASY TO USE  There are many tip calculators, but none is as easy to use as this one.  The calculation of the tip and the split of the bill is done immediately, without the need to press any button.  WITH THE POSSIBILITY OF ROUNDING  If the amount to be paid per person is not a round number, we can round it up and down.  FEATURES  These are the main features of this tip calculator:   Very easy to use. Calculating the tip was never as easy as with this calculator.  Totally free forever. You will never have to pay for it and it has no features or functionalities for which you have to pay, now or in the future.  The amount to be paid for each diner and the total amount are calculated immediately.  You can round the amount to be paid for each diner.  You can use the decimal point or comma to enter the amount of the bill and the amount of the tip, and the amounts to be paid are shown with a decimal point or comma depending on the users local settings.  The last percentage of tip applied is remembered.  With button to delete the amount of the bill, the number of diners or the amount of the tip.  With a simple and clean design that follows Googles design guidelines (material design).  With support for different screen sizes, including 7 and 10 inch tablets.  Small size application.  No personal data collection.  CONTACT ME IF YOU HAVE COMMENTS OR SUGGESTIONS  If you miss any functionality, have comments or suggestions, or want to translate this app into your language, please contact me at jarfernandez@gmail.com.  THANKS!  Thank you very much for using my tip calculator! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}