{
"name" : "Best Mi Phones Ringtones",
"url" : "https://play.google.com/store/apps/details?id=com.superRingtones.MiPhones",
"package" : "com.superRingtones.MiPhones",
"category" : "Tools",
"description" : "This app provides you with the worlds most popular Mi Phones ringtonesand updates the latest popular ringtones in real timeDownload this app for free and youll have the worlds largest mobile ringtone media library! Including a variety of interesting sounds and magical sound effects, wonderful 3D surround sound music, lovely baby sounds; epic movie music, Marvelous EDM electronic music, the wonderful dialogue of the three Asian funny giants. Of course, we will not forget the couple in love, romantic love music is essential. In addition, there are all kinds of amazing animal sounds, Cock crow, the sound of wild animals in the virgin forest... all the ringtones are completely free, including the latest sci-fi ringtones, crystal sound effects, you can use this app to set your android phone Incoming calls ringtone, notification ringtones, SMS ringtones, alarm ringtones, you can set different personalized ringtones for different contacts.  This app can intelligently identify your phone models. If you have a Mi 6 phone, or a Mi MIX phone, or you are using the MIUI system, this app is your best choice, it can provide the best Mi Phones ringtone for your .  If you are using other brands of android mobile phones, such as GALAXY S8, you want to experience the latest Mi 8 phone ringtones, you are welcome to download this app, it can provide you with different models of Mi phone original ringtones, great!  If your phones volume is small, you will miss some important Incoming calls. This app can solve this problem. It can make your Android phone make the loudest sound. We use the worlds leading volume amplification technology. The volume is increased by 200%.  In addition, this app should have a powerful feature that can provide you with a large number of high-definition desktop wallpapers! Including 4K wallpaper pictures, 2K wallpaper pictures, 1080*1920 HD wallpapers, these wallpaper pictures are produced by world famous designers, very beautiful, you can download and use HD Live wallpaper for free, beautify your phone and protect your eyes.  Features 1. Using advanced volume amplification technology to maximize sound quality while ensuring sound quality is not lost 2.HIFI lossless music and high quality MP3 audio files, the sound quality is very good. 2 You can listen to and download these ringtones. 3 Set the default ringtone for your phone. 4 Set as the alarm ringtone. 5 Set to become a text message and notification ringtone. 6 Set a personalized ringtone for different contacts.  language support Support a variety of national and national languages, traditional Chinese, Simplified Chinese, English, Hindi, Indonesian, French, German, Russian, Japanese, Korean, Italian, Portuguese, Turkish..... ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}