{
"name" : "InstaMocks - App Screenshot Design Tool",
"url" : "https://play.google.com/store/apps/details?id=com.instamocks",
"package" : "com.instamocks",
"category" : "Tools",
"description" : "InstaMocks lets you wrap your app screenshots with pixel perfect device mockups, beautiful background templates and a fully loaded text editor.  You can work on upto 10 app screenshots at a time. Make changes in one screenshot and have them get updated in all the other screenshots with our Link All Screens feature.  Export your newly designed app screenshot mockups to your gallery in one click.  You can save your work and come back to it anytime.  Features include:   DEVICE MOCKUPS ------------------------------  Over 40 device mockups to choose from (Android, iOS and custom device mockups).  Align, Move, Scale and Rotate your device mockups as per your need.  You can also add Glare Effect, Shadow Effect and change the opacity of your device mockups  You can work on upto 10 app screenshots simultaneously. This makes creating app mockups extremely easy and quick.  BACKGROUNDS -------------------------  Our preloaded Flat Colour and Material Colour Palettes will bring your app mockups to life.  Add Gradients to your mockups using our Gradient Tool. You can choose from a set of preloaded gradients so set your own colours.  Add Images to your background or Blur them using our Blur Tool.  TEXT --------  With our text editor you can align, change font style, color and many more customisations.  You can also move and scale the text to fit your needs.   OTHER FEATURES -----------------------------  You can work on upto 10 screenshots in one time. Swipe left or right to view all the screenshots.  Link all your screenshots together so that changes made in one screenshot will be update to all other screenshots as well. This will drastically reduce the time taken to design your app screenshots.  Save as many projects as you want and come back to it anytime. You can also make a copy of an existing project using our SAVE AS feature.  Download all your mockups to your device gallery in one click.   I hope you enjoy using this app as much as I have enjoyed developing it. If you have any questions, feedback or would like to make feature requests, please write to me at contactus@vemoot.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.SET_WALLPAPER', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}