{
"name" : "DroidVPN - Easy Android VPN",
"url" : "https://play.google.com/store/apps/details?id=com.aed.droidvpn",
"package" : "com.aed.droidvpn",
"category" : "Tools",
"description" : "DroidVPN is an easy to use VPN software for android devices. Our VPN service can help you to unblock regional internet restrictions, web filtering, bypass firewalls, and browse the web anonymously by tunneling all your internet traffic from your android device to our servers.  What separates DroidVPN from other VPN Applications is it can tunnel your traffic through ICMP(IP over ICMP). This means you can browse the internet even if you are only allowed to send ping requests and internet browsing is blocked on your firewall.  UPDATE NOTICE You need to login to our website so you can update your account and enter your username before using the new version of DroidVPN  Notes and Reminders   You need to restart your device if it no longer connects after updating to the latest version.     * To all users who are using our app to get Free internet that is posting reviews that it is not working please understand that the problem is your ISP if you can no longer connect. Please read this for additional details: http://droidvpn.com/page/cannot-connect-because-port-x-is-closed-37/    * FREE ACCOUNT is limited to 100MB/day and can only login to FREE SERVERS.   * Subscription is required if you want to use all the servers and remove the 100MB/day limit  * If you are using any Free RAM/Task manager application, then add DroidVPN to its exclusion list to avoid DroidVPN from being unloaded in memory.  * If your phone is rebooting please read: http://droidvpn.com/page/phone-reboots-when-connecting-droidvpn-7/  * For CyanogenMod(Jellybean) users that cannot connect: http://droidvpn.com/page/droidvpn-cannot-connect-using-cyanogenmods-jellybean411-update-27/  FEATURES - 1 Tap connect through widget - Gives you unrestricted Speed - Encrypts your internet traffic - Unblocks web sites - Tunnel IP traffic through ICMP or UDP (ICMP only works on rooted devices) - Can sometimes connect to paid hotspots for free - Save network traffic through data compression - Block all annoying ads all over the web  LOCATION OF SERVERS: View complete list here: http://droidvpn.com/servers.php  REQUIREMENTS 1. Android version below 4.0 requires root. 2. On android phones below 4.0 you need a working tun.ko for your phone. (Look for our TUN.ko installer)  3. DroidVPN account. Signup for free here: http://droidvpn.com/signup.php  4. Working internet connection. DroidVPN is not a replacement for your ISP.  HOW TO USE 1. Enter the email that you registered and the password that is sent to you. 2. If you are using a free account make sure to change your server to Free Server by tapping the flag. 3. Press the large connect button.  4. When the DroidVPN is now connected message appeared, press the home or back button 5. You can now start browsing and all your internet connection will pass through our VPN server.   Features to be added soon: - Proxy Authentication  If you are having problems dont hesitate to send us an email or report a problem using the app so we can help you fix your problems.  PLEASE DO NOT REPORT customer support issues in REVIEWS! We will not be able to help you troubleshoot or report back to you any fix. Please send an email describing your problem in detail to support@droidvpn.com.   Do you need a vpn for your PC? Visit: http://www.pdproxy.com/ ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.READ_LOGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_LOGS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}