{
"name" : "Proxynel: Unblock Websites Free VPN Proxy Browser",
"url" : "https://play.google.com/store/apps/details?id=com.udicorn.proxybrowser.unblockwebsites",
"package" : "com.udicorn.proxybrowser.unblockwebsites",
"category" : "Tools",
"description" : "Proxynel: Unblock Websites Free VPN Proxy Browser is the top rated (4.6     ) proxy browser app for Android. It can unblock websites, change your IP and keep you anonymous online. With over 6 million users worldwide, the Proxynel app provides the best proxy browser and anonymous browsing services.  Why choose Proxynel? Your can use it for two main things, you can either: 1 Unblock sites that are blocked in your country, or 2 Protect your online privacy, since Proxynel is a online proxy browser for Android, your traffic is routed through USA, France, UK, Amsterdam and Canada servers, so there are no footprints left behind while browsing with Proxynel, making it the perfect solution to escape government surveillance.  Proxynel lets you:  Unblock sites for life, unblock Facebook, Twitter, etc...  The browser do not track you.  Your connections are secure and anonymous.  Bypass all government firewalls.  Our VPN browser application is professionally designed.  Truly unlimited, no bandwidth or speed limitations  Material design and fast proxy browser.  Anonymous browsing while hiding your IP.  Unblock websites on your school WiFi.  Access websites in UAE, Dubai, Saudi Arabia, Indonesia, China, and many more countries.  Built-in fast proxy servers, no need to setup a proxy yourself, just open the app, browse and unblock your favorites websites.  Unblock websites fast Proxynel proxy app is the fastest web proxy browser to unblock websites, by just opening the app you can browse and access almost any blocked website in your country. US Proxy servers are a built-in feature within the proxy browser app.  Choose your location You can change your IP to be located in US, UK, Canada, Amsterdam or France with our easy to use location switcher.  No logs policy We dont store users data on our servers to make sure its is safe and locked away from authorities.  Dynamic IP switching Proxynel proxy app automatically and dynamically assigns you a new IP every time the proxy browser makes a request to the internet, so you will always stay anonymous and untraceable on the internet!  Unblock social media websites, not their apps By using our proxy app you can unblock Facebook, unlock Instagram, unblock Twitter, unblock Netflix, etc..  Normal web browser when proxy is OFF You can turn ON/OFF the proxy mode and use the app as a normal browser by turning it OFF by just one tap. The proxy browser is lightweight and works very fast while you surf the web.  Disclaimer! Please note that our Android proxy app will ensure your protection and private browsing only from inside the app, a proxy browser for android proxy app is working differently compared to a VPN.  Download this app today and enjoy your freedom!  ---  Support Need support? Need to leave a feedback? Suggestions? Reach us by sending an email to: support@udicorn.com!  Privacy Policy: https://www.udicorn.com/privacy-policy ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.REQUEST_INSTALL_PACKAGES']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}