{
"name" : "MonkeyMote Music Remote Lite",
"url" : "https://play.google.com/store/apps/details?id=com.obsidium.monkeymotelite",
"package" : "com.obsidium.monkeymotelite",
"category" : "Tools",
"description" : "MonkeyMote gives you a full-fledged wireless music remote control for your Android phone.  It fully supports the popular foobar2000, MediaMonkey, Winamp, AIMP 2 & 3 and JRiver Media Center media players.  The app connects to the media player running on your Windows PC via your WiFi network and allows you to view information about currently playing tracks and control every important playback feature.  Key features:  Playback control  Display song information and cover art  View and control the current playlist  Load playlists from your library  Browse and search your media library and queue songs  View and set song ratings  Save multiple connection profiles  Small, fast, low resource usage, minimal permissions  Easy to setup and use  All you need to do to get it working is to download and install the plugin installer for your media player from www.monkeymote.com  In case you run into problems when setting up the app or plug-in, please visit the support page at www.monkeymote.com first.  Please note that the automatic server discovery feature requires at least Android 4.1 (Jelly Bean) and is not supported by all devices. It is disabled by default on devices that are not running at least Android 4.4 due to an operating system bug that can trigger reboots on some devices.  A 100% ad-free paid version is available as well: MonkeyMote Music Remote ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.obsidium.monkeymotelite.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION']",
}