{
"name" : "PDF Reader for Android: PDF Editor & Scanner 2020",
"url" : "https://play.google.com/store/apps/details?id=com.pdfreader.pdfviewer.forandroid",
"package" : "com.pdfreader.pdfviewer.forandroid",
"category" : "Tools",
"description" : " Are you looking for a handy PDF reader software on your Android phone or tablet? Want to easily zoom in, out PDF viewer and share your PDF file with friends?  => PDF Reader for Android will meet all your needs.   Download PDF Reader & PDF Editor for Android today!    PDF Reader & PDF Editor is a perfect viewer pdf and edit document to open pdf files on my cell phone which has search function. This application also supports to pdf ebook reader.  Like the famous pdf reader software such as Acrobat PDF Reader, Foxit reader. We bring you a simple yet powerful application that is not too hard for you to use. PDF Reader & PDF Editor is the ultimately designed for mobile view PDF reader. This app to PDF reader files for mobile, edit PDF documents for free and open documents offline anywhere or anytime. This is a PDF editor which is completely free and reliable for your phone. Support reader pdfs documents, bookmarks and options to display the screen to help you have the best experience when reading pdf with pdf viewer app for Android. You can easily upload your pdf documents to Google Drive, Dropbox, Onedrive, Box .... You can also download your existing documents from the cloud. With this application you can easily transfer the pdf from pc to your phone.   The PDF reader help you save memory with the PDF Viewer application    Features PDF reader and PDF Viewer:  Open, PDF Reader application utility, simple.  Quickly reader PDF files from storage of your phone, ...  Support to viewer PDF Reader downloaded file on phone  Support to documents pdf reader  Highlight, underline or strike through context;  Add text box, text call-out, shapes and freehand drawing.  Move, zoom in, zoom out the PDF file with PDF reader  Move to the desired page in the PDF Reader  The PDF viewer software searches and saves PDF files quickly  Full screen mode  Use as a comics application  Free pdf reader for android  Open the pdf viewer file weighs only little capacity 1s  Best pdf reader  Best PDF Viewer management software  Simple interface easy to use  A pdf viewer, pdf reader free  This is comic book apps free, ebook reader for android free and ebook and pdf reader  Support search pdf, pdf reader from the memory card ...  Optional display horizontally, vertically, mobile ...  Pdf document reader, pdf viewer free, pdf reader free, xps file viewer  Download PDF Reader & PDF Editor for Android now! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.pdfreader.pdfviewer.forandroid.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}