{
"name" : "Karaoke voice sing & record",
"url" : "https://play.google.com/store/apps/details?id=com.appocalypses.karaokevoicesimulator",
"package" : "com.appocalypses.karaokevoicesimulator",
"category" : "Tools",
"description" : "Karaoke voice sing & record: become a real karaoke party song star with a microphone. Artist, record songs & post your own superstar masterpiece! Have you ever dreamed as kids, of becoming a super star idol  a famous actor and singer? Then imagine being on stage in top superstars contest! Mic recording app with lyrics: upload your favorite tracks in the app (inspiring hip hop rhythms, rap, metal or club song in the show) & play karaoke machine: use free tunes to learn how to sing music & learn cool songs artist or upload your own party favorites!  What to do when youre bored? Party like a superstar & enjoy playing free karaoke games! Bet, you will appreciate to play voice game: upload your music song track & sad lyrics just like in musician education school for kids. Or just record singin in funny voices, dance & have fun singing music party star. Play favorite party sound games: make your own real tracks, uploading & recording your composition. Upload the tune & compete with friends singin as talented favorite stars. Imagine talent contest with your favourite artists, bands & idols!  Do you love street rhythms & hip-hop? Make real battles, feel as a battle rap & freestyle rap artist! Fight! Learn popular free hiphop text to compete with friends, playing favorite games  they will appreciate this! Play & imagine a rap battle with raps or a real hip-hop battle with hip hop dance! Or you love lyric rhythms? We have them too! Make hip-hop & dance band battles, fight as your favorite group stars would!  Choose micro phone, go choose a track from recommended list or upload anything & use professional vocal microphone for lyrical feelings song. Singing games & apps: dance & sing songs as a super star with a mic. Favorite singer: imagine how you play professional vocals singing competition & listen when you record it! Learn lyrics like in academy, then use professional vocal microphone recording to check your results! Record your voice like with a professional voice app.  App features: ~ Real mini karaoke microphone recorder for singers voice ~ Mix & find favorites tune tracks & music composition masterpiece ~ Bet you enjoy funny voices & cool tracks in sound, tune & noise game ~ Singing machine station: hiphop rhythm practice for singer voice only ~ Party track: feel bored? Practice dance & singing songs for kids free! ~ Uploading rhythmic sing song & track list for tracks learning ~ Favourite confidence game for competing with friends ~ Playing top singing apps like us with mic recording ~ Ever dreamed becoming a talented superstar idol on stage? Being idols & artists is fun! ~ Game with recording: make inspiring show songs, tracks & club tunes ~ Top singers & music performers: free hip hop, rap & club ~ Learn track: uploading songs track list & your favorite song artist ~ Singers list: track usage & uploading, find sound game ~ Loud mic sing game: famous metal, freestyle raps, free hip hop song  always popular! ~ Imagine real karaoke mixer & recorder station, have fun! ~ Songs sing, listen and record: like a true metal star ~ Sound singing app: search sound tracks mixer, listen metal  Please note, that even though that there are lyrics & running lines of text and you can match & sing karaoke music for real in this app, it doesnt evaluate your skills. Evaluation of your recordings is simulated. Application will select the evaluation of your talent randomly and it does not evaluate your skills or apply to anything. Neither it will not fix your voice like a fixer. This app is for fun and practice, not for a musician education. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}