{
"name" : "Physics Toolbox Sensor Suite",
"url" : "https://play.google.com/store/apps/details?id=com.chrystianvieyra.physicstoolboxsuite",
"package" : "com.chrystianvieyra.physicstoolboxsuite",
"category" : "Tools",
"description" : "Useful for students and teachers in science, technology, engineering, and math (STEM) education and academic or industrial researchers, this app uses device sensor inputs to collect, record, and export data in comma separated value (csv) format through a shareable .csv file. Data can be plotted against elapsed time on a graph or displayed digitally. Users can export the data for further analysis in a spreadsheet or plotting tool. This app also generates tones, colors, and a stroboscope. See www.vieyrasoftware.net for a variety of usage ideas for STEM education and publications from academia and industry.  A menu allows the user to sense or generate the following (dependent upon the users mobile device capabilities):  SENSORS (1) G-Force Meter - ratio of Fn/Fg (x, y, z and/or total) (2) Linear Accelerometer  acceleration (x, y, and/or z) (3) Gyroscope - radial velocity (x, y, and/or z) (4) Barometer - atmospheric pressure  (5) Roller Coaster - G-Force Meter, Linear Accelerometer, Gyroscope, and Barometer (6) Hygrometer - relative humidity (7) Thermometer - temperature (8) Proximeter - periodic motion and timer (timer and pendulum modes) (9) Ruler - distance between two points (10) Magnetometer - magnetic field intensity (x, y, z and/or total) (11) Compass - magnetic field direction and bubble level (12) GPS - latitude, longitude, altitude, speed, direction, number of satellites (13) Inclinometer - azimuth, roll, pitch (14) Light Meter - light intensity (15) Color Detector - detects HEX colors within a small rectangle area on the screen via the camera. (16) Sound Meter - sound intensity (17) Tone Detector - frequency and musical tone (18) Oscilloscope (audio) - wave shape and relative amplitude (19) Spectrum Analyzer (audio) - graphical FFT (20) Spectrogram (audio) - waterfall FFT  MULTI RECORD (21) Multi Record - choose one or more of the above sensors to collect data at the same time.  GENERATORS (22) Tone Generator  sound frequency producer (23) Color Generator  R/G/B/Y/C/M, white, and custom color screen (24) Stroboscope (beta) - camera flash (25) Play - challenges (26) Manual Data Plot  (27) AR - augmented reality visualization of magnetic field vectors (28) System Temperature - battery temperature (29) Wi-Fi - Wi-Fi signal strength  Features (a) Recording: All sensor data can be recorded by pressing the red floating action button. Saved data can be found stored in the folder icon and on the devices SD card. (b) Exporting: Data can be immediately transferred following recording by selection an option to send via e-mail or shared in Google Drive or Dropbox. Locally saved files can also be transferred from the folder icon. (c) Sensor Information: Clicking on the (i) icon within each mode provides information about the sensor name, vendor, and current data collection rate, in addition to a description of what kind of data is collected by the sensor, its physical operating principle, and links to additional resources, including webpages and videos that illustrate how it works.  Settings * Note that not all settings are available for all sensors. (a) Data Display: View data in graphical, digital, or vector form. (b) Graph Display: View multi-dimensional data sets on a single shared graph or in multiple individual graphs. (c) Displayed Axis: For multi-dimensional data on a single shared graph, select total, x, y, and/or z-axis data.  (d) CSV Timestamp Format: Record clock time or elapsed time with sensor data. (e) Line Width: Modify visual presentation of data with a Thin, Medium, or Thick line. (f) Sensor Collection Rate: Set collection rate as Fastest, Game, UI, or Normal. The sensor collection rate is displayed for each option when selected. (g) Keep the Screen On: Prevent the app from turning the screen off automatically. (h) Calibrate: Calibrate selected sensors. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}