{
"name" : "Flashlight",
"url" : "https://play.google.com/store/apps/details?id=com.happyhollow.flash.torchlight",
"package" : "com.happyhollow.flash.torchlight",
"category" : "Tools",
"description" : "Flashlight is one of the most popular flashlight apps. Flashlight also has a metric ton of features. Flashlight uses either your screen or the LED flash on the back of the device. Flashlight can strobe in various patterns and also in various colors (on screen only). There is also features custom effects, emergency effects, and more. Flashlight basically does everything. The Flashlight app is entirely free.  Flashlight isnt the most unique name, but its a decent flashlight app. Flashlight includes a simple UI, a quick on and off button, a widget, and you can even shake the phone to turn the flashlight on and off. Plus, it has the usual no permissions, its free. This isnt the most unique app on the market, but its simple, basic, and it gets the job done.  Flashlight is a very simple flashlight app. It works like most. The app engages either your phone screen or the LED flash for light. It also comes with a small installation size, no unnecessary fluff, a timer, and more. The flashlight works with the screen off. Flashlight is completely free and has no unnecessary permissions.  Flashlight is one of the simplest flashlight apps. It works with your device screen as well as the LED flash on your camera. The app strobes light in a variety of patterns (on the screen). That include stuff like Morse Code, SOS, and other stuff. Its a simple, free flashlight app.  Flashlight is the flashlight app with a good pedigree. Flashlight uses both the screen and/or the LED light on the back of the phone. The app also includes home screen widgets, multiple colors (on screen only), and a simple design. Its a solid flashlight app.  Flashlight is one of the few truly free flashlight apps. You open the flashlight, turn on your LED flash, and thats basically it. The interface is beautiful but simple. Its a simple flashlight app that just works right. Flashlight is a very popular flashlight app. It is a small app with a smaller install size than most. The flashlight app does contain extra compass feature without requiring extra plugins. The app also contains a persistent notification toggle (useful for newer Android lock screens) as well as support for on-screen flashlights as well as the LED flash in the back. Its simple, it work, and its free.   Flashlight is a surprisingly excellent and modern flashlight app. It uses both the LED on the back of your phone as well as the screen for a flashlight if you want to go that route. Additionally, the app features an AMOLED-friendly dark mode, one permission (camera for the flashlight), no other permissions, and its small in size. It hits every conceivable check box for a good flashlight app. This is an easy recommendation to be perfectly honest.  Note about permissions on flashlight apps: A lot of people with older Android systems may feel wary about every one of these asking for Camera/Mic. Older Android systems have bundled the microphone and camera permissions into a single permission. A vast majority of camera apps never even try to access the mic but do require the Camera/Mic permission in order to access your devices LED flash. This is totally unavoidable and youll never find a flashlight app without that permission (until you get to Android Marshmallow or higher when the app asks for these things separately).You shouldnt worry about microphone permissions. FEATURES  +++++The Interface+++++  ***More Lifelike Switch Button ***More Smooth Operation ***More Unified Interface   +++++The Functions+++++  ***Torchlight in Dark ***Customize Screen Colors ***Send any Information via Morse Code ***Accurate Compass & Map  +++++The Practicality+++++  ***Read Entity Books in Dark ***Illuminate the roads when Outdoor traveling ***Ask for Help when you get lost ***Gets the Current Exact Position  Our Flashlight will accompany with you at any time when you need light!   So, dont hesitate and Download it Now!!! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}