{
"name" : "Edit Highlight Cover for Ig Story",
"url" : "https://play.google.com/store/apps/details?id=com.Edit.Highlight.Cover.forIg.OGG",
"package" : "com.Edit.Highlight.Cover.forIg.OGG",
"category" : "Tools",
"description" : " People are using their phones and social media now more than ever! They use their creativity to make cover photo for ig highlights that will attract more attention to them. And we just want to help. We dont want you to waste your time, more than you need to. With our  Edit Highlight Cover for Ig Story , you will express yourself and gain more followers in a matter of seconds. That is a quality spent time if you ask us. Create highlight covers as well as unique caption for insta story that will leave all of your friends speechless. Your profile is your safe heaven and it should be nothing less than a work of art! So dont hold back and edit highlight cover like never before thanks to, with no doubt, the best app to gain followers!    Use your imagination to create beautiful insta background and cover for story highlight!    How to use  Edit Highlight Cover for Ig Story ;   Edit photos and create breathtaking highlight icon covers with our fun picture decoration app;  Choose one of the background textures or colors for your instastory highlight cover;  Upload any of your gallery pictures to decorate it further and make your own wallpaper ig story;  Beautiful frames: wreaths, vintage flowers, leaves, hearts...  Lots of cool photo effects and filters for pictures free;  Cute stickers feauturing travel, food, birthdays, love...  Tap to add text to photos;  Stylish text fonts and font colors;  Background patterns and colors for your thumbnail text;   Look through our rich collection of insta cover photos and decide which one is perfect for your latest post!    First impression is everything! Your followers wont tolerate missused stickers let alone insta stories highlight icons! Lucky for you, our highlight cover maker will stop you from making any mistakes on your profile. All you have to do is combine your creativity with our latest app! Just a piece of advice, make your insta story from gallery of your phone if you want to be unique. Your friends will appreciate the courage and heart you put into your work. Unite with our  Edit Highlight Cover for Ig Story  application and start creating art. You will never ever wonder how to get more followers and likes if you try out our highlight icon maker. With so much to gain and nothing to lose, what are you still waiting? Start making your instastory feed amazing right now!    Are you ready to make your own highlight cover?    Are you still scrolling through your cute pics for insta highlights not being able to choose which one to use? Maybe we can help you with that. We know how precious your time is and how difficult it might be to obtain ones popularity and relevance on social media. That is why weve created  Edit Highlight Cover for Ig Story ! A unique insta editor for even more special individual! Whether you had an amazing vacation abroad or successful day at a gym, you should share it with everyone! If you share even just one travel highlight from your trip, you might get more followers! No, not might, you will definitely get more followers! So, join us and create your very own cover for ig story!    There are many apps to create highlight covers out there, but none of them like ours!    When you visit someones profile, what is the first thing you notice? Cute insta story highlight covers, of course. This is still a new thing, so you should work fast if you want to win more likes and followers. Small details make big difference. So think fast and assemble as many photos as you want and leave the rest to our story highlight icons app. It will help you create a gorgeous story cover design that will draw everyones attention! Refresh your profile free story highlight covers and enjoy your success! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CALL_PHONE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}