{
"name" : "ESET USSD Control",
"url" : "https://play.google.com/store/apps/details?id=com.eset.securedialer",
"package" : "com.eset.securedialer",
"category" : "Tools",
"description" : "ESET USSD Control protects your devices from USSD code attacks executed via malicious SMS, QR code, or URL link.   Protect yourself from data loss through remote wipe or other harmful actions of USSD hacks.  In order to protect your device from remote wipe and other USSD attacks, make sure that ESET USSD Control is set as the default dialer:  1. Install ESET USSD Control on your device. 2. Use your Android phone to visit our test page: http://www.eset.com/tools/ussdtest (note that this only contains a checker and will not make changes to your phone). 3. When prompted to complete action, check Always perform this action and select ESET USSD Control.  For step by step installation please follow our Knowledge Base http://kb.eset.com/esetkb/index?page=content&id=SOLN3139  Please note that once installed, the app runs invisible in the background, with no icon on the home screen. ESET USSD Control only interacts with the user when an attempt to run a harmful USSD code is detected. To make sure the app is installed correctly, go to Android Settings > Applications and look for ESET USSD Control.  What is USSD?  The purpose of USSD codes is that telecom operators can provide distance support for phone devices. An example of such code is one that displays IMEI number (*#06#), but there are also USSD commands that can wipe all data and restore a phone to factory settings.  How can USSD attack be launched?  Protection against USSD (Unstructured Supplementary Service Data) attacks is an essential security layer for Android devices, since these attacks can be easily initiated by all means that lead to visiting a website containing malicious USSD command such as SMS, QR code, or simply by tapping a fraudulent link in the browser.   How does ESET USSD Control protect you?  By checking for malicious codes before they are executed, ESET USSD Control makes sure that all data on your Android phone stay safe. The app displays a warning window each time a malicious USSD code is found, blocking the execution of the potentially harmful command.  This app uses the Device Administrator permission. This app uses Accessibility services. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE']",
}