{
"name" : "Counter",
"url" : "https://play.google.com/store/apps/details?id=com.kiss.countit",
"package" : "com.kiss.countit",
"category" : "Tools",
"description" : "Counter is a simple tally counter app that you can use to count everything.   Count your diet portions eaten, count inventory items, count drinks sold, count calories ingested, etc.!   Counter is available for free! Counter is available for Android Wear! Keep track of your counts using your favourite counting app, now on your watch! Counter is a multi counter that allows you to keep track of all the important events of your life.  Never forget again how many ping pong matches you have won. Counter is the only Counter that supports decimal numbers!!    Counter features:  Create multiple tally counters  Customize the color of each counter   Set goals that you want to reach   Group items by category   Check your statistics for each counter   Export your counters statistics using a Excel file https://www.youtube.com/watch?v=Z11BL-2xsC4   Export statistics for a specific counter https://www.youtube.com/watch?v=g-5nF3B05e8   Configure count increment value, even to decimals!   Support for negative values, like how many time you end the night sober :D   Use our awesome widget   Keep track of thing on your Android Wear!   Generate funny random counters!    Use tally counter to:   Quit bad habits, like smoke or procrastination   Count won ping pong matches   Count drinks sold and cars that passed by you   Count the number of nights you went to the restaurant   Keep track of the score on card and board games.   Keep track of your diet    A very special thanks to the translators:   Patrick Studniarz, German  Leonel Gomes, French   Leave us an email if you want to help translate Counter to your language ;)   If you have any suggestions please do not hesitate to email us at andregpslourenco@gmail.com We appreciate your feedback, please rate us!  With love, KISS ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.kiss.countit.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}