{
"name" : "CQuanCleaner-Phone Cleaner,Booster,Protect Privacy",
"url" : "https://play.google.com/store/apps/details?id=com.quanqu.master.clean",
"package" : "com.quanqu.master.clean",
"category" : "Tools",
"description" : "CQuanCleaner is an Cleaner Master, and Protect Privacy Master.   Has your phone become lack of space? Has your phone worked slowly after a long time running? Has very important information(Facebook, WhatsApp, Line etc). Worried about leaking? Has your phone stored very private pictures, How to protect my private life? Turn on the phone, always popping up a lot of annoying junk notifications?  CQuanCleaner = Cache Cleaner + Junk Cleaner + RAM Cleaner + Memory Booster + CPU Cooler + Battery Saver + App Lock + Picture Password Box + Junk Notification Cleaner + Photo Manager + App Manager. Install this super CQuanCleaner, the all in one toolbox. Android Optimizer, and Android Master now to clean and boost your android phone. You wont ask how to clean my android phone any more.  Download CQuanCleaner - Fast phone cleaner & Super speed booster & protect privacy Master and Free up space for Android phones for FREE now!  CQuanCleaner is an easy to use app with small-sized, helps you the all-round solution to mobile phone jams and slow operation, and protect photos & information security, protect your Privacy Life absolutely! Why not use us  CQuanCleaner top features:  Get more space - Remove junk files, ads files, uninstall apps, and delete bad or similar photos  Improve performance - Clear cache, remove junk, and identify apps that are slowing down your device (RAM Cleaner & memory booster)  Longer battery life - Suspend background apps to prolong battery life and save mobile data  Protect privacy Master - Lock apps, protect photos, comprehensive protection of your privacy life (App Lock & Picture Password Box)  Notification Cleaner: mute and clean the unwanted notifications if necessary  1 tap boost: boost phone by one tap  CPU Cooler: cool down phone CPU temperature   Junk Cleaner Powerful junk file scanning engine Fast clean Junk Files - Empty folders, AD files, WeChat Cache, log files, residual files, invalid apk etc Maximize storage, improve speed and improve device and SD card performance   Cache Cleaner(Below Android 6.0) Help to analyze apps in android phone, and clean useless application cache files safely. This fast powerful cache cleaner helps to release more space.   Memory Booster(Phone Booster) Kill background apps to release memory, and speed up your android phone, boosting the phone effectively. Go to boost mobile phone now!   Battery Saver Hibernating apps help you prolong battery life and keep your device running faster for longer.   CPU Cooler CPU Cooler can cool down your android phone CPU temperature with one tap.   App Locker Protect any app you want to protect, such as Facebook, WhatsApp, Line, and Gmail, SMS, Contacts etc Using pattern password, easy to use Keep your secret safe from snoopers   Picture Password Box(Private Photo Master) Hide photos from gallery Protect photos by using PIN password Protect your privacy life  If Uninstalled CQuanCleaner: How to do with my unrecovered photos? Dont worry! As long as these two conditions are met:  Remember your PIN Password  Photos backup wasnt deleted by other apps then  Reinstall CQuanCleaner  Easily recover or delete your Photos with just one-click  Build your own Private Space, defend your Private Life absolutely Note: Dont forget your PIN password, it may not be a fun prank.   Photo Manager(Photo Cleaner) Fast and easy photo gallery optimization Find bad quality or similar photos Easily clean your photos and screenshots library Free up more storage space on your phone   App Manager Easily analyze apps on your phone Support single uninstall, and batch uninstall Free up more storage space with just 1 tap   Notification Cleaner Mute and clean the unwanted notifications if necessary  If you like CQuanCleaner, please rate us 5 stars!  Email: shenlintang@gmail.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.CLEAR_APP_CACHE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.GET_TASKS', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.KILL_BACKGROUND_PROCESSES']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_FINE_LOCATION']",
}