{
"name" : "Nox Security - Antivirus Master, Clean Virus, Free",
"url" : "https://play.google.com/store/apps/details?id=com.noxgroup.app.security",
"package" : "com.noxgroup.app.security",
"category" : "Tools",
"description" : "Nox Security is a free security and antivirus app with free virus cleaner, wifi security, message security, notification blocker, app locker, call blocker, file encryption...on Android devices.  NOX SECURITY FEATURES FREE Virus cleaner master : Keep your mobile from viruses and malware Message security master: Prevent others from peeping your notification preview Notification blocker master : Block annoying useless notification Applocker : Protect apps and guard privacy Wifi security: Protect your device from any network attacks No disturb master: Block spam and unwanted calls effectively  Battery saver master: Stop power-draining apps with only one tap Junk cleaner :Free up and get more storage space   Keep your mobile from virus and malware Nox Security provides the best protection for your mobile and protects against malware  including virus, spyware, rootkits, hackers and online fraud and more. It can help you a clean virus and also can protect your private files and make it safer.  Block annoying useless notifications Nox Security provides a powerful and efficient notification blocker and manager. You can use notification blocker now to get rid of junk notification from jamming and slowing down your phone by blacklisting apps that push annoying junk notifications. It will keep your phone from disturbing and make your notification bar clear.  Message security Are you worried about your privacy message peeing by others sometimes? With message security of Nox Security, it can help you prevent others from peeping your notification preview once you open message security function. Just install Nox Security, clean virus and stay away from the notification preview by others!  Free up more storage space with junk cleaner & max memory booster  With max cleaner, you can clean the junk file, including system cache, apps cache, useless APKs, residual files, AD cache. You can also manage and uninstall apps that are rarely used to provide more storage space that can speed up Android storage & speed at maximum.   Block unwanted calls Nox security will be your good choice if you are already tired of annoying calls like telemarketing, spam, and robocalls! The only thing you need to do is to add the unwanted numbers to the block list or to block calls, not in your contacts with easily one tap!  Protect apps and guard privacy with applocker Nox Security can lock all android apps and give your phone privacy protection by pattern lock and number lock. You can use it to lock your private apps and private files and keep away from being opened or viewed by others.  Real-time protection for anti-theft features Not only does Nox Security get the basic features such as device scanning, protection from malware, but it can monitor real-time device. Real-time protection protects against malware, viruses, adware, spyware, phishing, rootkits, and banker Trojans.    Network Detection & Security Check With WIFI security, Nox security can protect your device safe from any network attacks. WIFI security will help to check whether the WiFi you are connecting is safe or not. It will also protect your personal information during the time you are surfing the internet.  Stop power-draining apps with battery saver With max battery saver, Nox Security can help you close inactive applications which run at the background. It is the simplest way to keep your battery healthy by stopping power-consuming apps and monitoring battery status. ------------------------------------------- NOX SECURITY NOTES Nox Security will keep your information secure and not share it with anyone else by the Privacy and Cookies Policy. If you like our application, please rate 5 stars!  You are welcomed to share your thoughts:  https://www.facebook.com/NoxSecurity-1998700043513309/inbox/ NoxSecurity@bignox.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.launcher.permission.READ_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CLEAR_APP_CACHE', 'com.antiy.avltest.permission.ANTI_VIRUS', 'android.permission.PACKAGE_USAGE_STATS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.CALL_PHONE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.BIND_ACCESSIBILITY_SERVICE', 'android.permission.GET_TASKS', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.RECORD_AUDIO', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.WAKE_LOCK', 'com.bbk.launcher2.permission.READ_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WRITE_SECURE_SETTINGS', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.bbk.launcher2.permission.READ_SETTINGS', 'com.antiy.avltest.permission.ANTI_VIRUS', 'com.android.launcher.permission.READ_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.WRITE_SECURE_SETTINGS', 'com.android.vending.BILLING', 'android.permission.ANSWER_PHONE_CALLS']",
}