{
"name" : "Daily Motivation Quotes for Self-motivating",
"url" : "https://play.google.com/store/apps/details?id=com.fireshooters.motivation",
"package" : "com.fireshooters.motivation",
"category" : "Tools",
"description" : "In this motivation app you can find 10000+ motivation quotes for you to encourage yourself, these quotes are in different categories. You can find the quotes you exactly need. Here are some example:  Never do anything when you are in a temper, for you will do everything wrong. Nobody makes you angry, you decide to use anger as a response. Love is the same for a poor man, and a king.  Now you can feel it.  Key Features - Tons of motivation quotes in different categories. - Fancy user interface for you to read motivation quotes easily. - Share the motivation quotes with your friends just by one click. - Daily quotes push for you to keep motivating yourself each day.   Motivation Categories   Anniversary  Attitude  Awesome  Beard  Beautiful  Best  Bike  Birthday  Brother  Busy  Cheat  Childhood  Clever  College  Cool  Creative  Cute  Dance  Emotional  Exam  Facebook  Flirt  Food  Friends  Funny  God  Good Morning  Good Night  Gym  Happiness  Heart Touching  Hindi  Home  Hot  Husband  Inspirational  Insult  Jealous  Life  Love  Romantic  Kiss  Marriage  Men  Monday  Motivational  Music  Naughty  Party  Parents  Pets  Punjabi  Quotes  Rain  Relationship  Sad  Lonely  Break Up  Hate You  Heartbreak  Hurt  Miss You  Pain  Tears  School  Selfie  Selfish  Shopping  Sick  Single  Sister  Smart  Smile  Sorry  Summer  Sunday  Sweet  Thank you  Technology  Though  Tired  True  Trust  Unique  Whatsapp  Weekend  Wife  Winter  Wise  Women  Work  Fathers Day  Mothers Day  Success  Moving On  Alone  Forgiveness   If you have some great motivation quotes and want to share with all the users of the app, you can send them to us, and we will add them to this app and make an update. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}