{
"name" : "Files To SD Card",
"url" : "https://play.google.com/store/apps/details?id=cz.bukacek.filestosdcard",
"package" : "cz.bukacek.filestosdcard",
"category" : "Tools",
"description" : "Regular use of Files To SD Card gives you one-click free space on your internal memory. You can quickly move or backup your photos, videos or downloads from your device to SD card.  This app Files To SD Card is used to quickly move, copy or backup files from internal memory to your phones SD card. With this program, you can free up with one click your device internal memory or backup your files to the SD card.   Free up space by moving your files (documents, downloads, photos, videos and other) to SD Card  Back up your data to SD card  Save time, fast and easy usage  Select specific files by file extensions  Notification of new files via Notification  If you want to protect your files, regularly copy your files to SD card and you will always have up-to-date back up of your files from internal memory to SD card. When you copy files repeatedly, existing files on the SD card are automatically skipped.  Just select files you want to move or copy (back up), click a big button and thats all, fast and easy. You can also select specific files to move / copy by file extension and move or backup your files faster. App displays large preview of files with more details which appear after a long touch of the selected file  With the new function Notification, you will never forget to clean up the internal memory regularly for proper operation of your phone. Just select how often youd like to display notifications of new files on your phone. App is especially useful for devices with low internal memory capacity, which does not allow the phone to store the captured content directly on the SD card, or for users who want to quickly and easily back up files to SD card.  Also suitable for Android Go.  Recommended devices: Vodafone Smart Prime 6, Lenovo A2010 LTE, Moto G, Samsung Galaxy Core Prime VE, Sony Xperia M4, Nokia One.  The first time you use it and every time the device is restarted, you need to set access rights to the SD card. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_INTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.INTERNET']",
}