{
"name" : "White Screen Flashlight",
"url" : "https://play.google.com/store/apps/details?id=cz.nowi.whitescreen",
"package" : "cz.nowi.whitescreen",
"category" : "Tools",
"description" : "Mobile white screen that will make a flashlight from your phone. Very suitable for phones without camera flash. When the application is turned on, the display turns to full brightness. Use two sliders to adjust the brightness or adjust the strobe flashing frequency. There is also SOS mode for use in dangerous emergency situations.  App Features:  White screen  Table Lamp  Brightness slider  Sets screen to full brightness while open app  Strobe frequency  SOS emergency mode  Do not go to sleep  Very small app size   Great for storage unit buildings and fixer upper homes  Check screen silhuete on new phones for scratches or dents  Backlight screen to trace some drawings  That doesnt need your camera   Great for for assisting in installing a screen film for dust/fibers  Softbox for macro photography  Read at night? This really helped  Checkout burn-in screen on my phone  Checkout negative films or old school slides  To do hash off my phone at night  Create a decent reading light  See while feeding and changing the baby  See without disturbing partner at late night reading  Reading book without disturbing someone around you  Soft light to read by in the middle of the night  GreatestLightEver  Displays a white screen without requesting all possible permissions. Automatic adjust display brightness to maximum so the screen can shine as bright as possible.   * Have you ever used your phone as an emergency light source?  * Did it went to sleep just when you almost found your keys in the drain? * Well, the lock-screen probably isnt bright enough for that.  Here comes White Screen app to the rescue! It displays a completely white screen to maximize brightness and stays on until you turn off one touch. Use modern screen flashlight technology to find your way to the light switch in a dark room! Displays a white screen, which can be used as a backlight. Could be used as reading flashlight.  Need a flashlight or torch but no flash LED? Use the Bright White Screen app.   This will work for phones and tablets too! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}