{
"name" : "AutoSync Account Activator",
"url" : "https://play.google.com/store/apps/details?id=cz.psencik.simple.autosync",
"package" : "cz.psencik.simple.autosync",
"category" : "Tools",
"description" : "Enables/disables accounts autosync on configured conditions (connection to cellular data and wifi networks), exposes configuration options not commonly available (periodic sync).  You do not change manually autosync in Accounts configuration, it is set by this application according to rules.  It is possible in expert mode to reveal push sync authorities and configure them, e.g. disable.  Detailed description: Application enables/disables autosync for each account based on configured conditions for that account. Once installed you do not set autosync in accounts manually, it is done by this application.  For example you enable your google account on cellular data and no wifi. Then as soon as your phone connects to any wifi then autosync for that google account is disabled. If phone connects to cellular data, google account autosync is enabled again.  This is useful e.g. at work. You enable for your work wifi only exchange account autosync and disable everything else. Then when you are at work only your exchange account is syncing and nothing else (e.g. google accounts whose autosync could block phone because it could not get through firewall at work). As soon as you leave work phone connects cell data and your google accounts are activated and synchronized.  This feature protects also your privacy, because if you connect to some foreign wifi, then indeed no account is configured to be enabled on it so for all accounts autosync is disabled.  Periodic sync feature is standard Android feature - to synchronize periodically accounts which have enabled autosync. Periodic sync is syncing only if master autosync is enabled in Android. Because it is not possible to configure it in std. Android (there are no screens for it) I have incorporated it into this applicaton. For push sync accounts (e.g. Google) periodic sync is often ignored.   Used icons author: RRZE, http://rrze-pp.github.io/rrze-icon-set/licence.html, License: CC BY-SA 3.0 ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}