{
"name" : "Bautagebuch Site Journal App",
"url" : "https://play.google.com/store/apps/details?id=de.bauskript",
"package" : "de.bauskript",
"category" : "Tools",
"description" : "The Bauskript App is intended to help site-supervising architects, engineers, and construction companies document site inspections in a simple and easy to use manner. All important data, events and associated site photos are conveniently processed and managed with this App.   In addition to multiple input modes, note the following features:  Creation of individual daily reports and email transmission (HTML).  Input of the persons and companies involved in the construction project and access to this data within the program structure.  Photos showing the performance level and defects can be included in the daily reports.   Quick recording of: Weather, temperature and humidity, attendees and site staffing including hours of work, performance level, deficiencies, delays, hindrances, and acceptances, instructions and additional works given. Execution of important building operations, tests and measurements. Additionally statements on materials, deliveries, storage, machines, and drawing deliveries.   The App can be use as standalone or completely professional with the desktop version for Windows and MacOS which you can download for free at www.site-journal.com. You will need a Dropbox account for synchronization.  This program lets you enter daily progress reports right during your site inspection. It uses the company list of your project so that the actual writing effort is significantly reduced. With the dictation function and later transcribing on the Site-Journal desktop version, time is saved and the typing on small devices is reduced.  With the App you can create Site Journals, synchronize, edit and them generate HTML reports with the photos and send them via email. Site Journal for Windows and MacOS must be installed on your computer to synchronize and administrate the reports, to print them and create lists of man hours, equipments, materials etc. and create photo albums.  The synchronization between App and and desktop computer can be done by e-mail as well as via SD card or USB cable or a free Dropbox account at www.dropbox.com. In this case you also need to install the free Dropbox App for iOS or Android. After that you can activate the synchronization for any Site Journal you want, the process will work automatically. In the same way you can synchronize Site Journals between notebooks and other computers.  The App creates complete site journals with daily reports and photos, which you can open and edit at any equipment with Windows, Mac, iOS or Android. Several site supervisors can create Site Journals, that can be synchronized and processed with just one license for a desktop computer.  Management of deficiencies: The documentation of deficiencies is an unpopular but essential task of the construction manager. The app allows you to take photos in series, and then add a description of the problem to the photo. This description will immediately form part of the list of deficiencies, into which also defects without photo can be taken.  A deficiency can directly be assigned to a responsible company when the photo is added, and a removal date can be added too. In the version for computers (Windows / Mac) you can then print out a list of deficiencies, either as a complete list or by company. This has the advantage of being able to send each company its own list of deficiencies. Filtering by date range or report number is also possible and can be useful.  The photos of deficiencies can be edited with the version for computers (Windows / Mac): it can be shown with arrows, lines and other drawing elements directly in the photo on the defect and it can be labeled with text. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.STORAGE']",
}