{
"name" : "METAControl",
"url" : "https://play.google.com/store/apps/details?id=de.baycom.atemcontrol",
"package" : "de.baycom.atemcontrol",
"category" : "Tools",
"description" : "This App controls Blackmagic Design ATEM switchers from your Android device.  Supported devices: ATEM Television Studio, ATEM 1 M/E, ATEM 2 M/E and Production Studio 4K.  Requirements: Minimum software version 4.2 (Firmware 2.12)  Features:    All buttons are fully configurable with a long press: phones: 14 buttons, 21 buttons optional on high resolution devices tablets smaller than 10: 21 buttons, 28 buttons optional on high resolution devices tablets with 10 and more: 40 buttons   inputs: Every input can be mapped to a button showing its current state (preview, program or not used). auxiliary outputs: Every available input can be assigned to an auxiliary output. transition control: Transition styles MIX, DIP, WIPE, STING and DVE can be selected. upstream key control: Selection of upstream on air and on next transition. downstream key control: Selection of downstream on air, tie and auto transition. media player control: Full control over still & clip selection and media player operation audio tally: Device says Cam1 on preview, Cam1 on air or Cam1 off, depending on the tally state.  Tally control via GPIO  Some of these features are available only in the pro version that can be purchased through the App.  METAControl requests these permissions:   full network access is needed to communicate with the switcher via network. view network connections is needed to find out if the device is currently connected to any network. modify or delete the contents of your USB storage is currently unused but will provide a way to store, import and export settings and macros. modify system settings is being used to control the WiFi power saving function. In order to properly receive UDP packets in real time which is necessary for the ATEM protocol. prevent device from sleeping allows the App to keep the screen on. control vibration enables haptic feedback when touching buttons on the screen.  Privacy:   This App does NOT access, store nor transmit any personal information. This App does NOT make use of any advertisement frameworks nor user trackers.  Development:   The developer of this App is not related to Blackmagic Design. This App is a spare time project and comes without any warranty. If you want to take part in beta testing please  register for the beta program.  Please make sure to load the latest official software on the ATEM device (current version is 6.4) as previous versions could lead to serious stability issues of your ATEM device! The support page can be found here: http://www.blackmagicdesign.com/support ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING']",
}