{
"name" : "Volume Lock & Mute",
"url" : "https://play.google.com/store/apps/details?id=de.dieterthiess.stfu",
"package" : "de.dieterthiess.stfu",
"category" : "Tools",
"description" : "Widget to mute ringtone/notification volume or lock volume at current level to avoid accidental volume changes    Features: - lock ringtone/notification volume at current level - disable ringtone/notification volume and avoid accidental volume changes - unmute ringtone on incoming calls, so you wont miss any important calls -- These incoming calls are supported: -- all incoming calls -- incoming calls from numbers in your contacts -- incoming calls from numbers not in your contacts -- incoming calls with blocked number -- incoming calls from defined numbers. You can manage the numbers in the app.  Widget to enable Volume Lock and Widget to enable unmute on incoming calls are available  Required permissions Read phone state: To detect incoming calls for the unmute feature Read contacts: To check the phone number on incoming calls (contacts from phonebook feature) and to manage the numbers in the app.    No Internet permissions required, so your data will never leave your phone!    This app uses Accessibility services. No Ads.  - Available languages:  -- English -- German -- Italian (by Stefano Meroni) -- polish (by Romuald Jackowski) -- Svenska (by Gran Helsingborg) -- Spanish (by DigiGato) -- French (by Ozzii) -- Serbian (by Ozzii) -- Portuguese (by Bruno Xavier Lopo de Souza) -- Bulgarian (by Stefan Stefanov) -- Persian (by Mohsen Mirhoseini) -- traditional Chinese, simplified Chinese (by Denny Su) -- Turkish (by Canan zen) -- Russian (by Oleg Barbos) -- Croatian (by Marijan Smetko) -- Niederlndisch (by Vincent Riebroek)  ideas? issues? Write me an e-mail: dieter.thiess@gmail.com ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
}