{
"name" : "JTL-WMS Mobile 1.0 - 1.3",
"url" : "https://play.google.com/store/apps/details?id=de.jtlsoftware.jtl_wms",
"package" : "de.jtlsoftware.jtl_wms",
"category" : "Tools",
"description" : "Wichtig: Diese App wird nicht mehr weiterentwickelt. Fr Nutzer der JTL-Wawi Versionen 1.0 bis 1.3 bleibt sie jedoch mittelfristig verfgbar. Wir empfehlen Ihnen, zeitnah auf JTL-Wawi 1.5 (oder neuer) upzudaten und die entsprechende App JTL-WMS Mobile 1.5 (oder neuer) zu installieren!  Was bietet Ihnen diese App? Der Einsatz von mobilen Datenerfassungsgerten (Smartphone, Tablet, MDE mit Android) bietet Ihnen fr die Kommissionierung Ihrer Lagerartikel herausragende Mglichkeiten. Mit der Installation dieser App statten Sie Ihre Android-Gerte optimal aus, um zahlreiche Vorteile fr wesentliche Prozesse in Ihrem Lager nutzen zu knnen:   Direkte Kommissionierung am Lagerplatz & wegoptimiertes Arbeiten  Sofortige Plausibilittsprfung & stets aktuelle Lagerbestnde   Fehlerreduzierung & Dokumentation aller Lagerprozesse  Korrekturbuchungen direkt am Lagerplatz & optionale Sprachausgabe  Anbindung von Bluetooth-Scannern mglich  Neuere Funktionen & Features der JTL-WMS Mobile App (ab 1.4) entnehmen Sie bitte den Beschreibungen der jeweils aktuellen Version hier im PlayStore.  Voraussetzungen zur Nutzung & Einrichtungshilfen Bevor sie JTL-WMS Mobile App nutzen knnen, ist die Installation von JTL-Wawi zwingend erforderlich. JTL-Wawi ist die von uns kostenlos erhltliche Warenwirtschaft fr den Online- und Versandhandel. JTL-WMS (Warehouse Management System) ist die in JTL-Wawi integrierte Lagerverwaltungssoftware, die Ihre Lagerprozesse optimal untersttzt.  Mit der Installation von JTL-Wawi (bis Version 1.3) werden auch JTL-WMS und der ltere JTL-WMS Mobile App- bzw. Web-Server installiert. Auf diesen Mobile WebServer greifen Sie mit dieser App zu. Sollten Sie jedoch tatschlich eine Neuinstallation von JTL-Wawi vornehmen wollen, empfehlen wir Ihnen unbedingt die Version 1.5 (oder neuer) und die Nutzung der entsprechenden JTL-WMS Mobile 1.5 (oder neuer)!  Nhere Informationen zu unseren Produkten und Hilfestellungen finden Sie auf unserer Homepage und im JTL-Guide: https://www.jtl-software.de https://guide.jtl-software.de Important: This app is no longer being developed. For users of JTL-Wawi versions 1.0 to 1.3, however, it will remain available in the medium term. We recommend that you update to JTL-Wawi 1.5 (or newer) in a timely manner and install the corresponding app JTL-WMS Mobile 1.5 (or newer)!   What does this app offer you?  The use of mobile data acquisition devices (smartphone, tablet, MDE with Android) offers you outstanding options for picking your warehouse items. With the installation of this app you optimally equip your Android devices in order to be able to use numerous advantages for essential processes in your warehouse:   Direct picking at the storage bin & route-optimized work  Immediate plausibility check & always current stock levels  Error reduction & documentation of all warehouse processes  Correction bookings directly at the storage location & optional voice output  Connection of Bluetooth scanners possible  For more recent functions and features of the JTL-WMS Mobile App (from 1.4), please refer to the descriptions of the current version here in the PlayStore.  Requirements for use & installation aids  Before you can use JTL-WMS Mobile App, the installation of JTL-Wawi is mandatory. JTL-Wawi is the merchandise management system available free of charge for online and mail order business. JTL-WMS (Warehouse Management System) is the warehouse management software integrated in JTL-Wawi that optimally supports your warehouse processes.  With the installation of JTL-Wawi (up to version 1.3) JTL-WMS and the older JTL-WMS mobile app or web server are also installed. You can access this Mobile WebServer with this app. However, if you actually want to reinstall JTL-Wawi, we strongly recommend version 1.5 (or newer) and the use of the corresponding JTL-WMS Mobile 1.5 (or newer)!  You can find more information about our products and support on our homepage and in the JTL Guide: https://www.jtl-software.de https://guide.jtl-software.de ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE']",
}