{
"name" : "CyberGhost VPN - Fast & Secure WiFi protection",
"url" : "https://play.google.com/store/apps/details?id=de.mobileconcepts.cyberghost",
"package" : "de.mobileconcepts.cyberghost",
"category" : "Tools",
"description" : "Your Android device and CyberGhost VPN go together like milk and cookies.  Heres why they make the perfect match for your uninterrupted privacy.    Step 1: Choose a tough cookie  Ghosties are tough cookies. Weve been fighting for your right to privacy for 7 years and were not stopping anytime soon!  Over 30 million Ghosties trust us because we keep NO LOGS and we give them a flexible way to enjoy the free and open internet.   Step 2: Dont cry over spilled milk   We bet you dont want your confidential data spread across the web like spilled milk all over the kitchen floor.  Thats why we route your traffic through our encrypted VPN tunnel and keep it safe from handsy cybercriminals.    Step 3: Hands off, Santa!  Keep your cookies and milk secured at all times (not just on X-mas) with CyberGhost.  Its as simple as:   Automating your protection on Wi-Fi, no matter the network youre on.   Choosing from 6000+ servers in 90+ countries to unlock access to geo-restricted content.   Hiding your IP and anonymizing your online activity with the strongest encryption out there.  We keep your data safe from your ISPs prying eyes, snoopers engaged in mass surveillance, cyber criminals and scammers.   Step 4: No crumbs left behind  CyberGhost VPN keeps NO LOGS of your online activity while youre connected to our fast servers.  What you do online is your business. Ours is to protect your privacy as you move across the web.    CyberGhost VPN extras (aka the sprinkles on your cookies):   One-tap protection  start an encrypted connection in one tap  easy-peasy!   Best location  enjoy instant VPN protection as youre automatically matched with the best server based on your location.   Favorites - add your preferred servers to a special list and easily access them whenever you want to.   Access blocked content - hide your location and binge on your favorite shows and movies at excellent speed!   A company you can trust  were the only VPN company you can put a face on. Meet us (and our dogs) on our website!   24/7 support via live chat  ask us questions in 4 languages (or more - well just Google translate it  ) and well be happy to help with anything!    Where theres an Android device, theres a Ghostie to protect it!    Take a FREE VPN tour, on the house  Now that youre here, how about you take CyberGhost for a spin?  (Go on, do it, well wait...)   Dont take our word for it  heres what the experts say  THEVPNLAB - Even first-time VPN users will quickly understand how to use CyberGhost and what it can offer its customers. Users can choose to connect to whatever server they like, in any location they want, with unlimited data.  TechAdvisor - A slick, fully featured VPN with an interface simple enough for the beginner, yet with options that will also keep the serious privacy enthusiast happy.    And heres how Ghosties feel about it  Very easy to use and provides a great experience  Works exactly as advertised and the speed it great. Would recommend without hesitation :)    Very Good VPN at a correct price :)  Very Good VPN at a correct price :) . Works flawlessly and also does not dig a hole in your pocket, basically a very friendly VPN.    Discrete, fast, reliable service  This is an excellent VPN at a price that beats any competition. A large number of servers in numerous countries can be selected. The speed is fantastic, no difference from using the ISP server directly. Highly recommended!    Contact us:  If you need help, have a question or want to drop some feedback, get in touch with our support team on the website or email us at support@cyberghost.ro    You can also find us on:  https://twitter.com/cyberghost_EN  http://www.youtube.com/user/cyberghostvpn  https://www.facebook.com/cyberghostEN ",
"desc_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE']",
}