{
"name" : "Alarm Clock 3 - music alarm",
"url" : "https://play.google.com/store/apps/details?id=de.xipa.aclock",
"package" : "de.xipa.aclock",
"category" : "Tools",
"description" : "Alarm Clock 3 is an easy to use and reliable Music Alarm Clock with 3 customizable alarms, waking you up optionally with alarms or ring tones of your phone or with music of your own music collection. All basic alarm settings are easily accessible with a single screen touch. For testing and checking the sound settings and alarm volumes you can quickly playback the alarms from main screen.  Alarm Clock 3 respects your privacy: Our Music Alarm Clock does not require any rights for internet access and is free of advertising banners!  Features of Music Alarm Clock 3 (free Version): For each of the three alarms you can independently configure the: - alarm time, - music title, alarmtone or ringtone, - loudness / sound volume - fade in and fade out - phone vibration - alarm duration: one title or 1-20 min - alarm repetition: run the alarm just once or repeat it every day or repeat it on single or multiple weekdays - enable snooze and set snooze delay: 3-50min - auto snooze (reasonable for very short music tracks or alarm tones, e.g. with enabling auto-snooze you might let the cock crowing every 5 or 10 minutes in the morning).  Further apps features: - Switch-off alarms or snooze optionally by double click, by long touch (>500ms) or double long touch (to prevent accidental switch-off). - The background of Alarm Clock 3 is dimmable from translucent to completely black. - The analogue clock can be disabled. - Additional timer setup menu which pops up instead of the Alarm Time setup menu after long pressing the alarm time button. These timers can only be used when the daily or weekly alarm repetition is disabled (setting Do not repeat alarm in alarm preferences). - Simple Widget which shows besides a small analogue clock the alarm times ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}