{
"name" : "Vbatt - battery widget",
"url" : "https://play.google.com/store/apps/details?id=de.xipa.vbatt",
"package" : "de.xipa.vbatt",
"category" : "Tools",
"description" : "* Vbatt is a simple battery widget for Android smartphones and tablets. It displays the current battery voltage (Vbatt) and the remaining battery capacity (percentage) and optionally logs these values to a CSV-file. * For testing and benchmarking Vbatt provides a JBox2D** based discharger, which drains the battery and displays the clock and runtime and for CPU benchmarking the simulation frequency. * Vbatt does not require any internet access, is free of advertising and will remain so in the future!  The main reason for developing Vbatt was the differing behaviour of replacement batteries while discharging them in daily use. On of our batteries is almost empty when a remaining capacity of 5% is displayed. Another one does not even reach this level because the phone powers off before. A third battery; however, runs for many hours even with a displayed capacity of just 1%. For a better estimation of the remaining phone runtime the Vbatt widget displays in addition to the remaining capacity (percentage) the battery voltage. The upper and lower limits of the voltage bar graph are configurable because especially the lower limit (power off voltage) considerably varies from device to device and according to the battery load.  Battery Widget - Features: - Numeric and bargraph indicator for the current battery voltage (volt) and remaining capacity (percentage). - Configurable min/max limits for the voltage bargraph indicator. - Display of battery states: USB=charging, Batt=discharging, Full=full battery. - Display of battery temperature (depending on the battery/device) - Optionally logging the battery voltage, capacity and state in a CSV logfile on SD-Card: /mnt/sdcard/vbatt.log. The logfile can be analysed afterwards on PC with the help of MS Excel, Open Office Calc or most suitable with GnuPlot.  JBox2D** simulation (Discharger): - Discharging or draining the battery by running a JBox2D** based simulation (CPU) and keeping the display on (screen light), evaluation of the runtime until the device turns off. The longer the runtime the better the battery. Before starting the discharger the battery should be fully charged and the phone should be in a comparable state (screen brightness, phone, Wifi, GPS, Bluetooth etc.) - Displaying the clock and runtime, battery voltage and remaining capacity, battery temperature and the simulation frequency. (The simulation frequency can be used for basic CPU benchmarking.) - Logging of the last ten discharger runs (>10min) with date, achieved runtime and the discharged capacity.  **The Vbatt discharger is based on the open source software Java JBox2D physics engine, which has been ported by Daniel Murphy from the C++ Box2D physics engine, which has been developed by Erin Catto. JBox2D and C++ Box2D are released under the open source zlib license. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.vibrate', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}