{
"name" : "Video Downloader for Facebook",
"url" : "https://play.google.com/store/apps/details?id=downloadvideofacebook.app",
"package" : "downloadvideofacebook.app",
"category" : "Tools",
"description" : "Want to download facebook video? Well, you are at the Right App page   How to use? 1. From facebook app, click Share. 2. Choose More Options 3. Choose Facebook Video Downloader app. 4. Choose the desired video quality(Recommended HD).  Your Facebook video now is downloading automatically & will instantly sync to your Gallery when it complete   You can also download facebook video in other ways.  Thanks for Facebook Video Downloader   1. From facebook app, click  in the top right of the post. 2. Choose Copy link. 3. Open Facebook Video Downloader app. 4. Choose the desired video quality(Recommended HD).  OR   1. Login facebook inside the Facebook Video Downloader app, tab Browse. 2. Browse to the desired Facebook video. 3. Click on the Facebook video to download or play it.  Notable Features: * Protect your privacy - download facebook video without login(*). * Support download HD video. * Quick and easy to download the desired facebook video.  * Background, Multitasking, Cancelable download. * Notice when a download is complete. * Built-in Video Player. * Built-in Web Browser if you want to browse Facebook in the app. * Manage your downloaded videos with 3 modes. * Watch offline, share, repost, delete, view info the downloaded video. * Change the download location. *  free.  Install this awesome Facebook Video Downloader app & start downloading facebook video now!   Notes:  Do not use Facebook Video Downloader app to download or repost facebook videos without the permission of the respective owner. We respect the rights of Facebook.  Facebook Video Downloader app is not affiliated with Facebook, but it is a tool to help download Facebook videos.  (*) Most videos on Facebook have been shared publicly, but with some videos, it is only shared with some friends, so in this case, you need to be logged in to download. Thanks for understanding!    Still Reading this?  Please do give a Good Rating if you liked the App!  Probably a 5 Star  If you need to support, please email me smartuxapp@gmail.com. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}