{
"name" : "Easy VPN - Free VPN proxy, super VPN shield",
"url" : "https://play.google.com/store/apps/details?id=easyvpn.free.vpn.unblock.proxy",
"package" : "easyvpn.free.vpn.unblock.proxy",
"category" : "Tools",
"description" : " Easy VPNs unique features (our strengths)    Very Fast, will connect to the fastest VPN proxy server, show latency (ping time) and VPN Usage rate. that help you to select fittest VPN server.   Multi VPN Mode, switch easily to IPsec(IKEv2) Mode, OpenVPN TCP Mode, Openvpn UDP Mode, Shadowsocks Mode, Unblock any website wherever you are.Easy VPN is 100% VPN unblock master.  support specified app agents - you can enable proxy services for apps you specify, if your device system is higher than Android 5.0  Easy VPN - WiFi hotspot security shield and unlimited free VPN client for android Easy VPN is the best free unlimited vpn proxy clients for android. It can to unblock sites, bypass blocked apps, WiFi hotspot secure and protect privacy. Brings a high speed and encrypted VPN connection to improve your mobile better net to access internet, and WiFi security under WiFi hotspot.  Enjoy multiple proxy server and multiple VPN Mode to bypass blocked website and apps as if you were in another country.  faster, safer and more smooth, is definitely the best free VPN client for android and proxy server to optimize personal information security and private internet access. You should download the best super vpn for android now!    With Easy VPN ( Free super VPN & hotspot VPN shield ), you can:  Easiest - One tap to connect to VPN proxy server - really One Tap VPN, connect within 5 second - Easy to Use, just press a button and connect a betternet   Most Stable & Fastest - with turbo high VPN speed - 100+ free cloud proxy server to provide better net VPN service.100% top speed vpn server. - You can choose VPN servers easily with high speed, unlimited bandwidth and unlimited server switches, you can connect from anywhere in the world - vpn for United States, American VPN(USA VPN) is suitable for North American and South American users - vpn for Germany, suitable for users in the Middle East countries - vpn for India, suitable for users in the Middle East countries and South Asian - vpn for Singapore, suitable for Asian users - vpn for Russia, suitable for Ukraine and Russia, support VK for Ukraine - vpn for Japan, Japan VPN, suitable for Asian users, Philippines, Indonesia, Vietnam - vpn for Uninted Kindom, UK VPN, suitable for users in the Middle East countries - Support voice call and video call for Arabian countries, such as Saudi Arabia, the United Arab Emirates, Iran, Oman and so on   Unblock & Access your favorite sites wherever you are - Bypass the firewalls as school free VPN proxy for school wifi and school computer.  - Bypass geo-restrictions, internet filters and censorship  - Unblock websites with free VPN proxy server. It can also unblock video not available in your country. - Unblock social networks websites or apps, such as: Line, QQ, WeChat, Instagram, Snapchat, Twitter, Facebook, WhatsApp etc ... - Unblock VoIP networks and video call, such as: Skype, Viber, WhatsCall, Imo etc ... - Unblock video websites and download, such as YouTube, Netflix   Incognito browsing anonymously  - The most reliable privacy guard and safety shield tunnel for online browsing - never record your online behavior and will never upload your privacy information - passed the DNS Leak test, can effectively prevent DNS leaks, to provide you with fake IP, hide the real IP - Encrypts your internet traffic, protect your privacy, and keep you safe from 3rd party tracking for your information security - Protect data privacy, personal information security and internet security. - Protect your data from hackers and surveillance when youre connected to a public WIFI hotspot shield. - Avoid being snooped or monitored by your ISP or government censorships  - Encrypts data using IPsec(IKEv2), OpenVPN protocols (UDP / TCP), Shadowsocks.  We do not provide BitTorrent and any P2P (pier to pier) service For policy reason, this service can not be used in China. We apologize for any inconvenience caused. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}