{
"name" : "Timbeter",
"url" : "https://play.google.com/store/apps/details?id=ee.timberdiameter",
"package" : "ee.timberdiameter",
"category" : "Tools",
"description" : "Timbeter is the easiest and quickest solution for measuring roundwood and managing all the data digitally. The most accurate and easy-to-use mobile platform with cloud storage, online inventory & reporting for easy adoption. Using image recognition and machine learning technology, Timbeter is the best tool for roundwood measurement.  Measuring with Timbeter is easy: 1. Take a photo with Timbeter of the timber whether in a pile, on a truck or in a container. If your pile is too large for a single photo, then use the panorama setting. 2. Timbeter contains more than 10 formulas which are used by log measurers all over the world 3. Timbeter works remotely, so you don`t require an internet connection to do your measuring and you still get results. Measurements will be uploaded to the cloud/storage module via the Internet.  4. Timbeter determines the number of logs, volume and diameter of each log. You can filter the diameters to see how many logs are in the specific range. Every pile has is geotagged that makes tracking the timbers origins easier. 5. Every measurement is stored in a cloud providing a real-time overview of measurements related to their species and qualities. Timbeter enables you to re-measure every pile on the web should you need to. 6. To access the Storage module, go to timbeter.com, log in with your email address and use all the benefits provided 7. Timbeters Storage module enables you to analyze and share your measurements quickly. You can view inventories, active storage statuses and create instant reports in a few taps of a button, aiding managers and accountants to remain informed and up-to-date. 8. Timbeter allows users to have greater control over their measurements, as all the information can be easily audited and controlled. The digital data can be shared between parties 9. Users can view their storage status and detect assortment deficits or surpluses in a few clicks. For further workflow integration, Timbeter can be integrated via an API with your other company tools including CRMs, bookkeeping, payroll or ERP, thus streamlining your sales, logistics planning and reporting. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING']",
}