{
"name" : "Aquanotes",
"url" : "https://play.google.com/store/apps/details?id=es.dcarvajal7.aquanotes",
"package" : "es.dcarvajal7.aquanotes",
"category" : "Tools",
"description" : "Take the management of your aquariums up to date, with Aquanotes you will be able to have full control over the parameter measurements you make. It was born out of a real need to be able to manage the parameters of our aquariums in a different place than paper, where we can lose it, it does not give us more information than what we write down and besides, we must be a little more environmentally friendly!  In aquarium hobby, parameter management is a crucial practice for the proper development of our natural plants, corals and fish.  You can take specific measurements for fresh or saltwater aquariums, with a history of the following parameters for tropical, marine, cold water, shrimp or other aquariums: pH, KH, GH, NO2, NO3, PO4, K, Fe, salinity , Ca, Mg and TDS.  It is important to keep a diary of what happens in our aquarium for the health of it, to know what mechanisms we must apply to a problem. You can keep as many aquariums as you want, check the measurement history at any time and add observations in the notes field, you can also see the evolution of your aquariums in graphs with the latest measurements made.  Aquanotes, also has a social component, you can share your aquarium with other users to see the status of them and the last measurement made so that you can take other aquariums as an example for the maintenance of yours.  Also, it has a series of calculators with which you can calculate the liters / gallons that your aquariums have based on the measurements, how much substrate you need for your new project, calculate the correct amount to fertilize with NPK sales or calculate the amount of CO2 dissolved in the water.  You will be able to check in the atlas the different species and the appropriate parameters for their maintenance. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}