{
"name" : "WeSpice Demo",
"url" : "https://play.google.com/store/apps/details?id=eu.lindentree.wespicedemo",
"package" : "eu.lindentree.wespicedemo",
"category" : "Tools",
"description" : "Analog, digital and mixed-signal circuit design and simulation on your device!  WeSpice is a powerful and flexible electronic circuit design suite for everybody - professionals and hobbyists alike.  The simulation engine is NGSPICE, running locally on your device. No need to stay connected all the time to some server - everything is included!  == Features == + From transistor-level to advanced modeling, everything is easy to build and simulate. + Device TCAD, 1D and 2D modelling and simulation. + Flexibility to build hierarchical schematics, symbols, and models (including corners). + All tools work together seamlessly, so you can go fast from design idea to results. No need to look under the hood. + When you want more control, you have that also: all files are editable text that you can tweak. + At all steps you can import data and proceed (including models and spice input: netlists, commands, etc.). + Share literally anything (including schematics, symbols, models, netlists, results, screen snapshots), via mail or any other app. + Pre-made symbols for all primitive components. + Several sample schematic, including: folded cascode OTA, bandgap reference, chargepump, sigma-delta ADC models. + Easy-to-use results browser allows to plot and measure. Pick your outputs directly from the schematics or from a list. + No ads!  == Free Demo == Try our free WeSpice Demo! The demo version has less functionality, but still allows you to try out most of the features. We recommend installing the demo first, to check compatibility and ease of use (especially for small phones). Limitations: no Symbol Editor and Model Manager, large schematics are not saved, long simulations are truncated.   == Simulator == + The simulator is NGSPICE, based on Berkeley SPICE 3F5. Compared to SPICE 3F5, NGSPICE has many additions, is more stable and runs faster. + The XSPICE extension adds event-driven simulation capabilities, allowing efficient simulation of digital and mixed-signal schematics. It includes new code models for analog, digital and real functions, together with digital and real node types. + The CIDER extension adds device simulation (TCAD), by providing accurate one- and two-dimensional numerical device models based on the solution of Poissons equation, and the electron and hole current-continuity equations. + The simulator itself runs in background while you continue playing with this app or another. + Some complex device models are multi-threaded to take advantage of todays multi-core processors. Schematics with many BSIM3 or BSIM4 transistors run on four cores in less than half the time needed on one core.  + Analyses: OP, DC, AC, TRAN, DISTO, NOISE, PZ, SENS, TF. + MOS models: MOS1-3, MOS6, MOS9, BSIM1, BSIM2, BSIM3 (all up to 3.3.0) BSIM4 (all up to 4.7.0), BSIMSOI (3.3 and 4.4), SOI3, HiSIM. + Safe operating area (SOA) checks are available for resistors, capacitors, diodes, BJTs and BSIM MOS.  == Compatibility == Tablets and phones from approx. 3.7 upwards. ICS (Android 4.0.3) or later. SD-card or emulated equivalent storage. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.android.vending.CHECK_LICENSE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.CHECK_LICENSE']",
}