{
"name" : "UbikiTouch | Navigation Gestures  and Automation",
"url" : "https://play.google.com/store/apps/details?id=eu.toneiv.ubktouch",
"package" : "eu.toneiv.ubktouch",
"category" : "Tools",
"description" : "UbikiTouch allow you to improve all your applications by swiping the edges of your screen.   What can UbikiTouch do for you?  Use the gesture to navigate between or within your applications  Execute basic actions or use a remote cursor  Automate repetitive tasks and start them with a simple slide of the screen  Choose from three beautiful different visual effects, a classic pie menu or fluid effects  UbikiTouch has a unique feature: it allows you to define your own actions for each of your favorite applications! All applications are subject to improvement.  You can define an action for each screen of your favorite applications: press a button, select an item, make a swipe, etc. Even better, you can sequence actions to perform more complex tasks.  Use case available on this video : https://youtu.be/Vdn6GO4-Nlc  And of course you can also perform global actions such as:  Back Button  Recent Apps  Home  Previous App  Lock screen  Paste clipboard  Assistant  ...  Toggle Bluetooth, Wifi, GPS, Auto-Rotate, Split Screen, Sound, Brightness  Music actions Use remote cursor Launch an application Launch a shortcut (Dropbox folder, Gmail label, contact, route, etc.)  UbikiTouch is fully configurable:   Swipe LEFT-RIGHT-BOTTOM edge to perform actions.  Custom place, size, colors for triggers  Distinguish two different gestures: quick swipe & quick swipe + hold  Up to 24 different actions accessible at a single click  Choose from three different designs: pie, curve, wave and customize them to profid your needs  The app has no ads. The Pro version offer you:  Possibility to define tasks for an unlimited number of applications (limited to two in the free version)  Access to more actions, the ability to launch an application or a shortcut  Access to remote cursor  Possibility to completely customize the menu: animation, size, color...  Privacy We attach great importance to the protection of privacy, which is why UbikiTouch has been developed in such a way that it does not require Internet authorization. The application therefore does not send any data over the Internet without your knowledge. Please consult the privacy policy for further informations.  Translation UbikiTouch is currently fully translated into English, French, Italian, Russian, Ukrainian and Chinese. An incomplete and perfectible translation is available in German, Spanish, Dutch, Polish and Portuguese. If you would like to make UbikiTouch available in your native language or report an error in an ongoing translation, please do not hesitate to contact us at the following address: toneiv.apps@gmail.com. You can choose to change the default language of the application in the About / Translation menu of the application.  Navigation bar troubleshoot If youve uninstall UbikiTouch and that you have forgotten to restore the navigation bar before, you can always run this ADB command: adb shell wm overscan 0,0,0,0  FAQ Details informations available at https://ubikitouch.toneiv.eu/faq.html  Feedback UbikiTouch Group on Telegram: https://t.me/joinchat/InrYuhYDC-ZjVWnyAHPPrA XDA Thread : https://forum.xda-developers.com/android/apps-games/app-ubikitouch-gestures-automation-app-t3930661  Report issues GitHub : https://github.com/toneiv/UbikiTouch ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'com.huawei.permission.external_app_settings.USE_COMPONENT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'oppo.permission.OPPO_COMPONENT_SAFE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.VIBRATE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_SECURE_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.huawei.permission.external_app_settings.USE_COMPONENT', 'oppo.permission.OPPO_COMPONENT_SAFE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CALL_PHONE', 'android.permission.WRITE_SECURE_SETTINGS', 'com.android.vending.BILLING']",
}