{
"name" : "GZ & XZ Extract - Archive File Opener",
"url" : "https://play.google.com/store/apps/details?id=evansir.gzxzextract",
"package" : "evansir.gzxzextract",
"category" : "Tools",
"description" : "Extract tar, tar.gz, gz, gz2 and xz easily! Extractor tool that will open Unix type archives in few taps. Just choose gz or xz archive file and extractor will do all other for you. All are fully automotive, no need for long and hard step by step extract process.  GZ and XZ Extractor main features: - Intuitive interface - Shows only gz, gz2, tar, tar.gz and xz files - Open extracted files with any pre-installed app - Unzip tar, tar.gz, gz, gz2 and xz files - File explorer included  GZ and XZ Extractor do not have tools to open extracted files! It uses preinstalled apps on your smartphone!  Many are faced with a situation where it is urgently necessary to unzip the xz, tar, tar.gz, gz2 or gz files. Although this may seem like a daunting task at first glance, in reality, it is done in just a few simple steps. GZ & XZ Extract will help you quickly and easily get your files from the archive.  If you guessing what GZ means - its standard extension for files compressed by GNU zip and mostly used by Unix systems. XZ in same time is an extension for archives what uses XZ algorithm for compression, it is very efficient for large files and is commonly used to distribute Slackware Linux package distributions.  GZ & XZ Extract will help you to unzip tar, tar.gz, gz, gz2 and xz files. All files from the archive will be placed in GZ XZ Extractor folder and will be accessible from any installed file explorer on your smartphone.   If you have any suggestions on how to improve GZ & XZ Extract, feel free to contact me via e-mail. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}