{
"name" : "Super Fast Charging 2020 - Charge Battery Faster",
"url" : "https://play.google.com/store/apps/details?id=fastcharge.batterysaver.batterymaster.fastcharging",
"package" : "fastcharge.batterysaver.batterymaster.fastcharging",
"category" : "Tools",
"description" : "Super Fast Charging 2020 - Charge Battery Faster is the best applications produced to help mobile users boost charging speed (automatic fast charger ) with one click.  Have you ever faced with the issue of slow charging and time wasting on charging?   The fact shows that: When you are charging battery of your devices, plenty of background applications and services are still running; sometimes Wi-Fi, 3G/4G/5G, Bluetooth, NFC and many other connections are still available. This is the main causes resulted that your phone/tablet still consume a large amount of energy which leads to the consequence you have to spend much longer for battery charging. To have quick charge, there is only one method: Kill background, turn off all background services and applications, turn off all unnecessary connections to optimize your device. All these things will help your phone charge battery faster. However, all the ways above is too complicated and hard to do quickly. Dont worry, with Super Fast Charging 2020 - Charge Battery Faster, all those stuffs will be done automatically.  Only one click to charging boost speed ! Only one click to optimize devices and have fast charge! What an amazing application!   KEY FUNCTION ON FAST CHARGING   1 click optimize  Turn off Data Sync (Automatic)  Turn off Bluetooth (Automatic)  Clean RAM  Kill background applications and running services (Automatic)  Automatically reduce screen brightness to lowest  Boost charging speed on Android devices (Automatic)  Junk cleaner   When plug charging, Super Fast Charging 2020 - Charge Battery Faster will enable Fast Charge mode automatically.  All you need to do is choose Fast Charge and Fast charger battery will do the rest. All optimizing process to have fast healthy battery charge will be done automatically Then you can enjoy the quick charge battery process. Also you can change the setting of smart charging mode by click to setting icon   Fast charging support 99.99% Android devices  If you are looking for an app to speed up charging, Super Fast Charging 2020 - Charge Battery Faster is the best selection for you to have quick charger  The application is being developed. All the appreciations and Feedback from users is great supports for us to create perfect application for people all over the world. Hopefully we can see rating and feedback from you! Thank you so much! ",
"desc_perms" : "['android.vending.BILLING']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.CLEAR_APP_CACHE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_SUPERUSER', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.INTERACT_ACROSS_USERS_FULL', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_SUPERUSER', 'android.permission.INTERACT_ACROSS_USERS_FULL', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}