{
"name" : "FastVid: Video Downloader for Facebook",
"url" : "https://play.google.com/store/apps/details?id=fb.video.downloader",
"package" : "fb.video.downloader",
"category" : "Tools",
"description" : "Video Downloader for Facebook is the easiest Video Downloader app designed specifically to help you download videos from Facebook and save them using different methods, it allows you to download videos from Facebook and save them to your device using the video link/URL without login OR by sharing the video from Facebook to the Video Downloader for Facebook app OR by browsing your account and clicking on the videos you want to download and save on your device.   Video Downloader for Facebook allows you to browse your Facebook account using a secure built-in browser that protects your privacy and enables you to browse through the videos you want to save on your device so that you can watch or share them later from your gallery with your friends via different apps.   New: Now you can save videos from Facebook to your gallery using the video link/URL, just copy/paste the video link/URL and start downloading the video without login, no login required!   How to use:   Method 1 (Download videos from Facebook using the built-in browser):  1. Click on Browse Facebook.  2. Login and browse your wall.  3. Click the video you want to download.  4. Click on Download to save to your device.   Method 2 (Download videos from Facebook using the video link/URL without login):  1- Copy video link/URL. 2- Paste inside app. 3- Click on install.   Method 3 (Download videos from Facebook by sharing the video to our app):  1- Share the video from the Facebook app. 2- Choose Video Downloader for Facebook   Install Video Downloader for Facebook and start downloading videos from Facebook now!  Important Notes:  - This app is NOT affiliated with or endorsed by the Facebook official network.  - Any unauthorized re-uploading or downloading of contents and/or violations of Intellectual property rights is the sole responsibility of the user.  - This app is intended to be used by people aged 13+  - This app can download videos without login ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}