{
"name" : "App lock - Real Fingerprint, Pattern & Password",
"url" : "https://play.google.com/store/apps/details?id=fingerprint.applock",
"package" : "fingerprint.applock",
"category" : "Tools",
"description" : "Applock, Fingerprint App Lock for your apps with Intruder selfies, Dual advanced security lock screens and fingerprint enabled app lock that makes your phone total safe and secure.  It takes photo of snooper that tries to unlock your apps with wrong passwords, patterns or fingerprint and send email to you immediately with photo and details.  ~ Fingerprint app lock is supported by all phones who has Fingerprint hardware and Marshmallow Android Version and if you dont have one then our Fingerprint Simulator enables simulated App lock support for any phone you have. Enable Simulator from settings and you can simulate fingerprint app lock with PIN or Patten.  FEATURES:   Lock any App like System Apps, Social Apps, Lock your private Gallery, Downloaded Apps and games.  Supports wifi and bluetooth switches control.  Unlock with PIN,Pattern or Fingerprint.  Intruder Selfie supported. App lock takes selfie of persons who entering wrong pin, pattern or finger print.  Send immediately Intruder alert and photo to your email address you set in settings.  Fake Cover. App lock shows Force Close dialog on opening of locked apps and let you open them with trick.  Support sound and vibration effects.  Supports Protection option to avoid Force Stop by any other user bymistake.  No need to remember PIN or Pattern, you can Instant unlock with your fingerprints for compatible devices.  Automatic set colors in app lock screen for popular apps and system apps.  Are you bored typing passwords and using pattern everytime you unlock apps? Now Lock Apps easily with Advance Feature of Fingerprint Applock. Take the advantage of this Latest Applock with beautiful design and Amazing Features different from other applocker.You have to scan your finger to unlock apps so only you can open your private and social applications. The intruders trying to hack your security will caught by taking instant selfie and save inside app.   Applock with fingerprint can lock your private apps. Prevent unauthorized access, guard privacy and ensure security. Also you can have control for Install/Uninstall of new apps. PIN/Pattern or Fingerprint need to uninstall any app. Enable it from settings.  FAQ: Q: Can I lock ANY app or games? A: Yes, you can lock ANY installed apps and games in your device.  Q: How can I lock the app? A: Its simple, please lock for apps you want to lock, and set your PIN or Pattern. you can use Finger print automatically if already registered and existing with your phone.you dont need to set manually.  Q: How to stop other people uninstall AppLock? A: Please enable Prevent Force Stop in Settings of AppLock, so nobody can force stop or uninstall without your permission password. You can disable it whenever you dont want it.  This app uses the Device Administrator permission. Disclosure: To prevent App Lock being Force Stopped by other apps or Being Uninstalled, App Lock need Device Administrator Permission and App Lock never use any other Device Administrator permission except avoid force stopped & uninstall prevention by other users on your phone. This app uses Accessibility services. Disclosure: By using this service, It helps to use Power Saving mode. The service is only used to remind users with disabilities to unlock apps, and save battery usage.  Feel free to send your feedback to us! kohinoorapps@gmail.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'fingerprint.applock.permission.C2D_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING']",
}