{
"name" : "DevCheck Hardware and System Info",
"url" : "https://play.google.com/store/apps/details?id=flar2.devcheck",
"package" : "flar2.devcheck",
"category" : "Tools",
"description" : "Monitor your hardware in real time and get complete information about your device model, CPU, GPU, memory, battery, camera, disk, network, sensors and operating system. DevCheck gives you all the information you need about your hardware and operating system in a clear, accurate and organized way.   DevCheck provides the most detailed CPU and System-on-a-chip (SOC) info available. See specifications for Bluetooth, GPU, RAM, storage and other hardware in your phone or tablet. Find all the details about your WiFi and mobile networks, including dual SIM info. Get real time sensor data. Learn about your phones operating system and architecture.  DevCheck displays the most advanced camera specifications, including sensor size, pixel size, aperture, focal length, ISO range, RAW capability, face detection, 35mm equivalents and more  Dashboard: real-time monitoring of CPU and GPU frequencies, temperatures, memory usage, battery stats, deep sleep and uptime. Click on the CPU frequencies for a sortable summary of CPU frequency usage and time in deep sleep. Click on the temperatures for a complete list of temperature sensors on your device. Choose which temperatures to display on the Dashboard.  Hardware: displays all detail about your SOC, CPU, GPU, memory, storage, bluetooth and other hardware, including chip names and manufacturers, architecture, processor cores and big.LITTLE configuration, manufacturing process, frequencies, governor, memory type and bandwidth, storage capacity, resolution, OpenGL, and panel type. Some information requires root access.   System: get all info about your device, including codename, brand, manufacturer, bootloader, radio, serial number, device id Android version, security patch level and kernel. DevCheck can also check root, busybox, KNOX status and other interesting information.  Battery: real-time info about your battery status, temperature, level, technology, health, voltage, current and capacity  Network: shows info about your WiFi and mobile/cellular connections, including IP addresses (ipv4 and ipv6), connection info, operator, phone number, phone and network type, public IP and more. Most complete dual SIM information available  Apps: Detailed info and management of all your apps. Running apps provides list of apps and services running on your device, with current memory usage. On Android Nougat or later, memory usage is only available on rooted devices.  Specifications for front and back cameras: resolution (megapixels), sensor size, pixel size, ISO range, RAW capability, aperture, focal length, crop factor, field of view, focus modes, flash modes, JPEG quality and image format, max face count and available face detection modes  Sensors: a list of all sensors on the device, including type, manufacturer, power and resolution. Real time graphical info for accelerometer, step detector, gyroscope, proximity, light and other sensors.   PRO VERSION is available through in-app purchase The pro version includes benchmarking and completely customizable, movable, always-on-top floating monitors. This allows you to monitor CPU frequencies, temperatures, GPU frequency, battery, network activity, signal strength, memory and system load in real time while using other apps. The size, transparency and position of the overlay windows is completely adjustable. On Android 5.0 and above, the floating monitors can be conveniently docked to the statusbar. A click-through option also available.  The pro version also allows you to switch between light and dark Material Design themes and choose from nine different color schemes (amber, blue, slate grey, aqua, red, green, orange, pink and indigo)    PERMISSIONS This app requires many permissions in order to display detailed information about your device. No information leaves your device. This information is not shared or collected in any way. Your privacy is always respected. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_PHONE_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.USE_FINGERPRINT', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAMERA', 'android.permission.TRANSMIT_IR', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAMERA', 'android.permission.TRANSMIT_IR', 'com.android.vending.BILLING']",
}