{
"name" : "Flash Alerts On Call & SMS - Ringing Flashlight",
"url" : "https://play.google.com/store/apps/details?id=flash.ringing.flashlight",
"package" : "flash.ringing.flashlight",
"category" : "Tools",
"description" : "Do you have trouble missing your call, SMS? This application will help you.  Flash Alerts on Call and SMS allows you to blink the devices flash when you receive phone or SMS text or app notifications. This app will help you prevent missing any important Phone Call, SMS or Notifications. Super easy setting interface just one click enable feature and you are ready to go.   What Ringing Flashlight  Flash Alerts On Call & SMS can do:   You can enable / disable Flashing feature individually for Phone, SMS, Notifications.  Ringing Flashlight allow you to control the Flashlight speed individually for incoming Phone, SMS, Notifications ( customizable or each application ) or the blinking flashlight widget.  You could adjust enable / disable the Flashlight blink when using phone.  You could add any application inside the notification application list for flashing flashlight when you receive notification form those apps. And we are supported you to customizable number of flash or the speed of the Flash for individual Application that you added.  Allow you to temporary disable the flashing feature day by day, time to time. You could add many time span in a day as you want inside Manage Disable Times screen.  Save battery power and extend your phone battery life by 1 tap in Advanced Setting Saving Mode.  Call reminder feature when you have a miss call.  Common feature  Flash alerts when have a call.  Blink flash alerts when have SMS.  Ringing flashlight when phone have incoming Call and incoming SMS and Notification from all other app.  You can turn on or turn off service by manual over device status sound mode as Ring, Vibrate or Silent mode.  Very useful to help you not miss Call, SMS or Notification .  Advance  Allow adjust speed of flash light alert.  Turn off flash alerts when battery low, help you save battery.  Allow you to temporary disable the flashing feature day by day, time to time. Makes it easy to control the time to use this app as you want.  Call reminder feature when you have a miss call. If it helpful with you, give us 5*, please. Thanks for getting in touch and we appreciate your feedback.   Note: If you could help us to translate Ringing Flashlight  Flash Alerts On Call & SMS into your native language please email to us. Thanks so much.  ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.RECEIVE_SMS', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_PHONE_STATE', 'android.permission.BIND_NOTIFICATION_LISTENER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.FLASHLIGHT', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BIND_NOTIFICATION_LISTENER_SERVICE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}