{
"name" : "Fingerprint Lock Screen Prank",
"url" : "https://play.google.com/store/apps/details?id=fp.lockscreen",
"package" : "fp.lockscreen",
"category" : "Tools",
"description" : "Fingerprint Lock Screen Prank is an awesome tool which simulates to unlock your phone by scanning your fingerprint. The amazing fingerprint graphics and wonderful flying fireflies animation make it professional and funny. You can also set 4 digit or 6 digit Passcode orPattern style backup security lock screens along with fingerprint. Download HD wallpapers from our hand picked collection to set as lock screen background.  NOTE: Please know that this app this app is intended to simulate a fingerprint scanner.Fingerprint Lock screen Prank is designed for entertainment purposes only. It is a trick to unlock your phone and you can use it to prank your friends!  AMAZING FEATURES:  Full HD graphics.  Customized Fingerprint Lock Screen to unlock your phone with fingerprint simulator.  Support 4 digit and 6 digit Passcode and Pattern style backup for keypad lock screen along with fingerprint simulator.  ApplyBlur Effectwhen slides to passcode or pattern.  Shows Notifications for new incoming messages, missed call, mail etc. Enable Notification from settings inside app.  Support Slide to unlock where you can also set your own name.   Simulate beautiful animation of Firefly Effect on screen with hd backgrounds.  Awesome sound effects and unlock animations  Latest Firefly Theme HD Wallpapers to set as wallpaper of lock screen.  Choose from multiple new fonts for each items on lock screen and also apply your favorite colors to make it look pretty awsome and different from others.  Clean and Simple design to consume less memory and battery usage of your phone.  Now you can test the changes you made in customized lock screen by clicking onPREVIEWoption from the app.  On/off Fingerprint Lock screen in just a click.  STEPS TO USE: 1. First you need to Disable System Lock from app settings, to turn off system lock of your phone if you are using it. 2. Now click on Enable Screen lock option to start the lockscreen services.  3. Turn ON Fingerprint Lock to use fingerprint simulator and for backup you can set 4 or 6 digit PIN or PATTERN lock style.  Get this best Fingerprint Lock Screen Prank and be creative, or be realistic; its all up to you!  This app uses Accessibility Service. This service is only use to read notification for the users with disabilities into our Lock Screen. We never use/collect any private information from the service.  Disclaimer: This Lockscreen cannot really identify your fingerprint, its just a simulated app used for fun. For help or suggestions kindly contact us: kohinoorapps@gmail.com  Enjoy this wonderful and cool HD Lock Screen which is secure,customizable and free with various Themes HD Wallpaper and more. If you like it please share with your friends and remember to rate us 5 stars. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'fp.lockscreen.permission.C2D_MESSAGE', 'android.permission.USE_FINGERPRINT', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}