{
"name" : "Compass",
"url" : "https://play.google.com/store/apps/details?id=fr.avianey.compass",
"package" : "fr.avianey.compass",
"category" : "Tools",
"description" : "A magnetic compass with magnetic declination correction for best accuracy. A compass is an instrument used for navigation and orientation that shows direction relative to the geographic North. Geographic North is computed given the magnetic North and the magnetic declination at your current location. In some places around the world, the magnetic North can be as far as 20 degrees from the geographic North.   Use of GPS or Network location for best accuracy  Magnetic declination correction  True altitude above sea level  Altimeter  Elevation computation use EGM-96 model  Supports multiple coordinate formats UTM, DD, DMM, or DMS  Show Latitude and Longitude  Sunrise and Sunset times  Easy calibration  Show angle in degrees  Clean design  Install on SD  Save places for tracking them  Create multiple lists of favourite places  Show shorted path to a place  Search new places by name or address  Qibla Compass (find direction of the Kaaba in Mecca)  Place tracking allow you to save your current location for later find its direction from anywhere else in the world!  Note regarding horizontal accuracy:  The device location has an horizontal accuracy that depends on the quality of the GPS signal. The smaller the horizontal accuracy is, the better the location is accurate. In some cases, the horizontal accuracy can be so big that other information can be inaccurate : altitude, distance and direction to a place that is very close to you. Refreshing the location after a few second can give you a better horizontal accuracy.  Note regarding device calibration :  Smartphones use magnetic and orientation sensor in order to compute the direction of the magnetic North. Sensor might be in an unknown state when the application is started. Sensors requires a lot of values to reach optimal accuracy and precision. To do so, move your phone in space in a  figure pattern until the accuracy turns to high.  This application requires permissions in order to compute your location and the magnetic declination for a better accuracy of this compass and to provide you with further information such as true north, true altitude above sea level, direction and distance to any place in the world. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.CHANGE_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}