{
"name" : "Translate All Language - Voice Text Translator",
"url" : "https://play.google.com/store/apps/details?id=free.translate.all.language.translator",
"package" : "free.translate.all.language.translator",
"category" : "Tools",
"description" : "Translate All Language - Voice Text Translator  Translate all langue  Voice text translator is so cool for language conversion and translation. A little words translator app offers world languages package. Free live text translator app is hall mark for speech and written content exchange. Universal language speech translator is signified for translation from English to Spanish, English to Hindi, English to French, Chinese to English, Arabic to Swedish, interpretation from Dutch to Chinese Simplified () etc.  Globalized multilingual online Translate all langue  Voice text translator app is keen examiner and language translator camera which searches its language storage potential and changes the phrase into the demanded language immediately. Text translate scanner is friendly partner of all tourists who faced communication dilemma in the past decades. Easy to use app for translation text that translate text and voice using api of translate. This is the new era of online language converter, newly established world language interpretation app 2019 is empowered to translate pictures description, photo statements and complete paragraphs for you. Word to word text translation is a quick transfer of ideas, messages, non-verbal and verbal data into other languages when you feel helpless in the bitter circumstances of language disability.  Audio or sentences Translate all langue  Voice text translator is a blending of more than 100 languages such as Latin (Srpski-latinica), Slovak (Slovenina), Slovenian (Slovenina) and Spanish (Espaol). The unknown languages are not unapproachable, teatime automatic translation and language converter is an amazing biggest store of words dictionaries from different countries and various regions of earth. Text translator app luckily presents word reference, a detailed history of its origin and meaning of each word when you try to seek it. This app is translate using api of world best Translator . Feel easy and fast speed Translate all langue  Voice text translator. Translating camera captures the current translation and detects automatically which language is being used to write and speak. Language voice transmitter has added microphone to exchange languages system for audio data, speaking chunks and listening recording. Highlights for magical Translator  Words and sentences translate  Voice messages, audio and recording conversion  Text and written content language translation  Globally recognizable free language translator  More than 100 real time languages appearance  Microphone feasibility for speech and verbal language exchange  Complete meaning and history of the word with reference  Some of the given languages are: Following Language can be translated in easy and fast way:- Afrikaans, Arabic (), Bengali (), Bulgarian (), Bosnian (Bosanski), Cantonese (), Catalan (Catal), Chinese Simplified (), Chinese Traditional (), Croatian (Hrvatski), Czech (etina), Danish (Dansk), Dutch (Nederlands), English, Estonian (Eesti), Fijian, Filipino, Finnish (Suomi), French (Franais), German (Deutsch), Greek (), Haitian Creole, Hebrew (), Hindi (), Hmong Daw, Hungarian (Magyar), Icelandic (slenska), Indonesian (Indonesia), Italian (Italiano), Japanese (), Klingon, Korean (), Latvian (Latvieu), Lithuanian (Lietuvi), Malagasy, Malay (Melayu), Maltese (Il-Malti), Norwegian (Norsk), Persian (), Polish (Polski), Portuguese (Portugus), Quertaro Otomi, Romanian (Romn), Russian (), Samoan, Serbian-Cyrillic (C-), Serbian-Latin (Srpski-latinica), Slovak (Slovenina), Slovenian (Slovenina), Spanish (Espaol), Swahili (Kiswahili), Swedish (Svenska), Tahiti (Tahitian), Tamil (), Telugu (), Thai (), Tonga (lea fakatonga), Turkish (Trke) ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}