{
"name" : "VPN Proxy Master - free unblock VPN & security VPN",
"url" : "https://play.google.com/store/apps/details?id=free.vpn.unblock.proxy.vpn.master.pro",
"package" : "free.vpn.unblock.proxy.vpn.master.pro",
"category" : "Tools",
"description" : "VPN Proxy Master, 100% free, totally unlimited VPN, secured and easy to use. It is a super fast and the best unlimited free VPN proxy for you. It is the best unlimited VPN to unblock and bypass blocked apps, secure your device, protect your online activities.  No registration needed, totally unlimited bandwidth!  Super fastest and high VPN speed!  Unblock the world with just one button!    Install VPN Proxy Master for the following features:   Unblocked Websites and Apps Access any website - Connect to any website or app on the internet with a VPN proxy.  Super Fast Speed Unlimited speed - No throttling, Ever. Unlimited bandwidth - No bandwidth restrictions or download caps. Unlimited server switching - Switch between locations at no additional charge. Unlike other VPN providers, VPN Proxy Master never limit you. Connect to any VPN Proxy Master server, anytime, without restrictions or download caps. Easily switch between server locations at no additional charge. We have 100,000+ IP addresses for 2000+ servers in our server clusters, so connections are always available.  Secure all online activities Military-grade encryption - Secure your Internet traffic with cutting-edge encryption technologies. Double VPN - Encrypt your Internet traffic twice to create an extra layer of online privacy. No logs kept - VPN Proxy Master doesnt track or keep any logs of its users and their activities. Your security and privacy are guaranteed!  Privacy Protection Protect IP address - Send your Internet traffic through a VPN Proxy Master server to change your real IP address Protect connection - VPN Proxy Master will automatically protect you every time you are connecting to a new WiFi or Internet connection. You will never be vulnerable, again, in a hotel, airport, restaurant, or any other new, public space.  Improve Your Streaming Experience Streaming - Forget buffering, bandwidth throttling and enjoy secure streaming experience. SmartPlay - Get secure access to your favorite streaming sites with SmartPlay technology. Lightning speed - With VPN Proxy Master you can increase streaming performance and achieve faster streaming speeds. Our users achieved 10x faster speeds on streaming by using VPN Proxy Master.  Easy to use Easiest VPN ever - Download, install and start protecting your Internet traffic with just one button. Customer support - Experiencing any troubles with VPN Proxy Master? Contact our customer service.  End User Terms: By downloading and using this product, you acknowledge and agree to the end user license agreement and Privacy Statement at https://vpnproxymaster.com/static/privacy_policy.html  For policy reason, this service can not be used in China. We apologize for any inconvenience caused. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}