{
"name" : "PureVPN - Best VPN & Fast Proxy App for Android TV",
"url" : "https://play.google.com/store/apps/details?id=free.androidtv.vpn.proxy.purevpn",
"package" : "free.androidtv.vpn.proxy.purevpn",
"category" : "Tools",
"description" : "PureVPN - the best VPN & Proxy service in the industry, brings an unparalleled Android TV app, empowering you to unblock any content on the Internet and access any streaming service from any location you want.  PureVPN for Android TV offers you a no-log VPN experience which is audited and validated by a leading independent auditor.  Moreover, if you are looking for a VPN or proxy for not only unlimited browsing but also privacy, PureVPNs Android TV is the only app you need. The application packs a huge pool of servers and IP addresses that give you complete control on exploring the Internet in a seamless yet anonymous manner.  Heres what our Android TV VPN / proxy app has in store for you:  7-day free VPN / proxy trial  Availability of a good number of proxy servers and locations  Instant connectivity to any server or location of your choice  Dozens of popular streaming channels for easy accessibility  Blazing-fast speed for buffer-free streaming 24/7  Optimized servers for bypassing ISP throttling and achieving maximum speeds  Be it unblocking geo-restricted websites or browsing the web without leaving any traces, you can do all that and more with our anonymous Android TV app.  7-Day Free Trial: You can take our Android TV VPN / proxy service for a 7-day trial without paying a penny. The free VPN/proxy trial gives you the ease of checking out the service, speed, and performance to your hearts content. And, you can connect to any available server or location you want at any time of the day.  *Note: To continue using PureVPN, you will be required to subscribe to the premium plan once the 7-day free trial is over.  Why Should You Get our Android TV App?  Easy-to-install  Minimalistic yet intuitive User Interface for easy navigation  Quick connectivity  Dedicated support for immediate problem resolution  Fastest browsing and streaming speeds  And more.  Go Premium! When you opt for the premium plan, you get to use PureVPN app on different devices and operating systems. Moreover, you can use the account on up to 5 devices at a time.  The Complete Package With PureVPN, you get your hands on a whole set of dynamic features. You will be able to switch to any of the multiple tunneling protocols of your choice. You can set up Internet Kill Switch for keeping your connection anonymous and Split Tunneling for avoiding unnecessary switching between the local network and the VPN.  PureVPN comes up with years of trust and good word of mouth from several avenues, including TrustPilot, where we have managed to secure a rating of 4.8 out of 5.  Best of all, you will be able to connect to more VPN servers and locations. Currently, we have 2,000+ servers with over 300,000+ IP addresses.  We take great pride in offering secure dedicated IPs and port-forwarding feature as an add-on.  So, get our Android TV app today and join an ever-growing community of 3 MILLION+ users and enjoy the fastest and completely anonymous VPN / proxy service.  ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}