{
"name" : "VPN Proxy Master lite - free&secure VPN proxy",
"url" : "https://play.google.com/store/apps/details?id=free.vpn.unblock.fast.proxy.vpn.master.pro.lite",
"package" : "free.vpn.unblock.fast.proxy.vpn.master.pro.lite",
"category" : "Tools",
"description" : "VPN Proxy Master Lite,100% free, totally unlimited VPN.Its the basic features of VPN Proxy Master. 100% same speed servers,10% smaller APK size. No need any configuration,just tap one button, you can unblock the world securely and anonymously.  If you need wider server coverage ,you can download the full version of VPN Proxy Master from here: https://play.google.com/store/apps/details?id=free.vpn.unblock.proxy.vpn.master.pro  With VPN Proxy Master Lite, you can:  Unblocked Websites and Apps Access any website :Connect to any website or app on the internet with a VPN proxy.  Enjoy unlimited bandwidth No bandwidth restrictions or download caps. Unlimited speed : No throttling, Ever.  Unlimited server switching Switch between locations. 10,000+ high speed servers.  Keep your private data to yourself Protect IP address : Send your Internet traffic through a VPN Proxy Master lite server to change your real IP address. Protect connection : VPN Proxy Master lite will automatically protect you every time you are connecting to a new WiFi or Internet connection.  Unblock your entertainment everywhere Streaming : Forget buffering, bandwidth throttling and enjoy secure streaming experience. SmartPlay : Get secure access to your favorite streaming sites with SmartPlay technology.  Easy to download and use Easiest VPN ever - Download, install and start protecting your Internet traffic with just one button. Customer support - Experiencing any troubles with VPN Proxy Master lite? Contact our customer service.   End User Terms: By downloading and using this product, you acknowledge and agree to the end user license agreement and Privacy Statement athttps://vpnproxymaster.com/static/privacy_policy.html  For policy reason, this service can not be used in China. We apologize for any inconvenience caused. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}