{
"name" : "Gallery",
"url" : "https://play.google.com/store/apps/details?id=gal.galleria.galleryapp.gallery",
"package" : "gal.galleria.galleryapp.gallery",
"category" : "Tools",
"description" : "Gallery is an excellent, feature-rich app for organizing your photos. Password-protect your photos. Smart gallery galera album, format galleries album photo imagens,gallery photo collection Gallery with this android Gallery  Save your Valentines Chocolate & Valentines Flower photos of your loves ones in the gal app gsleria de fotos lbum gsleria iimajenes. Photo librarys great galleria, photography galleries, quick photo, photo album app for your mobile imagens.Gallery is the gallery pro app gleria Default Gallery is used hiding beautifully photograph galeria de fotos  Gallery app provide photo backup using photo bucket in drives.Gallery is really Great FOTO Gallery app lmagem imagem  Photo plus Gallery (grand gallery) - Phone Storage App Beautiful 3D gallery with latest graphics photo gallery gals appa imgenes photo gallery   Gallery pro use special gallery ics color gallery app for photos, hot videos, store photos imagenes rolls gaeria omagenes , imgenes movie collections gallery top rated application galerie photo gallery  gallery is smart gallery, format galleries, collection Gallery with this android gallery multimedia gallery app google play store photography galleries Arrange order of gallery items based on your selection photo gallery aubum camera sorter  gallery collection for fast user interface move photos camera roll to snapchat roll camera folder and camera sort henshin camera gqleria ymagenes  Gallery download free app gallery replacement galaxy app for the built-in phone gallery app for tami a1 imagen gleria de fotos galeria.Special animated gallery looks for my phone imagen ver gallery keeper on a roll  Smart Gallery Photo Viewer imagenes, Gallery Video Viewer clean gallery. Upload photos and enjoy gallery video and images clean camera roll   share pictures to social networks like Facebook, whatsapp, twitter etc gal.Picture gallery configurable photo storage thumbnail size/colors photo imgenes  ga  Photo album app for your mobile.Gallery download free app beautiful hot collection of gallery of smart phone aubum de fotos pname manage camera roll images fotos albums galeria gal. gallery photo lbum de fotos barely imagen versiones originales photos app  Gallery camera clean up camera roll galleria poto. pixel gallery album raw phot organize camera roll geleria gelre.gallery photo imagen album photo imagenes  Gallery android for photo manager (picture storage) photo sync and photo organizer gallery app device maintenance camera album folder camera gallery  Photo gallery albums & camera organize all in galilee photo library dsc . greeley save photos multimedia photo folder & picture storage image app gsleria de fotos    Original data wont be modified With Gallery(Photos), import photos galeria or videos from the fake Camera Roll,gallery default picture gallery saves the original   Pin Protection : gallery for private photos numeric pin protected. gallery upgrade Photo library user can hide private photos like girl friend photos, hot photos, naughty photos,camera roll gallery dirty photos, secret photos. so Gallery app is the strictly confidential, top secret, hidden application inmagem   gallery wall clear camera roll & album camera to photo saver gallery photos. gallry photos app & image viewer raw album picture folder your organize camera.galleria lbum de foto gallery app    Gallery Lock hide pictures and videos and aubum de fotos is an gallery locker protection of personal privacy of gallery lock apps download fotos lbum de fotos  favoritas Gallery Vault can hide app images and keep your privacy absolutely safe. Final Hide Picture and Hide Video app to protect your privacy gaeria photos app!   Gallery Pro smooth user experience is optimized for large screens and multiple finger gestures work  like work gallery as faster efficiency slideshow gakeria qlbum   Photo viewer & photo slideshow effects like Default,  Cube, Flip, Accordion, SlowBackground gqleria ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_FINE_LOCATION', 'gal.galleria.galleryapp.gallery.permission.C2D_MESSAGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_PHONE_STATE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.CHANGE_WIFI_STATE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.MODIFY_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}