{
"name" : "Gallery, Photo Album and Image Editor",
"url" : "https://play.google.com/store/apps/details?id=galeria.galerie.gallery.foto.album",
"package" : "galeria.galerie.gallery.foto.album",
"category" : "Tools",
"description" : " SEE YOUR IMAGES CLEARLY: Look at your photos up close and zoom into the finest details. Load even the largest images fast with a beautiful gallery that supports all file formats from animated GIFs to RAW images.   KEEP YOUR PHOTO ALBUM ORGANIZED: Launching the gallery will quickly scan your phone and SD card to find all your photos and videos. You can then search and filter photos by name, time or location and add new folders for easy organization. Tap multiple items to copy, move or rename them. Mark your favorite images or hide them from plain sight. Photo management has never been easier.   EASY EDITOR: The included photo editor enables you to easily resize all your images, crop, rotate and apply beautiful filters. Make your images picture perfect before uploading them to popular sites such as Facebook or Instagram using the in-app sharing function.   MANY SETTINGS TO CONFIGURE: Look in the advanced settings for many more options to configure. Customize the gallery to your liking. Change the color theme of the user interface. Add password protection to your photo album. And so much more.  Family, friends, holiday vacations. We take thousands of photos with our mobile phones and need the best gallery app to keep them all neatly organized. Download now and get started. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}