{
"name" : "Punjab & Haryana High Court: PHHC eCourts Services",
"url" : "https://play.google.com/store/apps/details?id=gov.highcourt.highcourt_ecourts_services",
"package" : "gov.highcourt.highcourt_ecourts_services",
"category" : "Tools",
"description" : "PHHC eCourts Services  PHHC eCourts Services App is useful to Public, Litigants, Lawyers, Government Agencies and Other Institutional Litigants. Services are given under different tab on left drawer. Search By Case No., Party Wise, Advocate Wise, Add/View Case No, Display Board, Track Copy Petition and Cause List. Simply by entering the Case No. one can get the current status and details of the case. Case Status can be searched by various options like Case Number, Case Type, Party Name and Advocate Name. Case Number Search option shows information of Party Name, Next Date, Purpose, Advocate name and current status of the case. In the option named Party Wise, case status information can be searched by Party Name. It generates list of all cases wherein his/her name is tagged with the case. In the option named Advocate Wise, case status information can be searched by Advocate Name. It generates list of all cases wherein his/her name is tagged with the case. In the option My Diary, cases are added or saved. It is shown in View tab. Saved cases can be viewed in View tab of the Add/View Case. Litigants/Advocates/Departments /Institutions can save all cases of his/her/their  interest, which will be shown under View tab of the My Diary. This helps  them to create and manage E- case diary of their cases or Personal Case Diary for  future use (if any). Litigants/Advocates/Departments /Institutions can view/delete/refresh their saved  cases in this App. Litigants/Advocates/Departments /Institutions can filter their saved cases  according to parties Name.  Litigants/Advocates/Departments /Institutions can prepare cause list of their saved  cases as per date. In the option Display Board, real time case hearing status in each Court can be viewed. In the option Copy Petition, Litigants/Advocates/Departments /Institutions can track/get their copy petition status. In the option Cause List, generate cause list of selected court. By default current date is selected for generating cause list. However, one can change this date to any date.  After enabling Autostart Options in android mobile setting, user can get notification of their saved cases, one day before case fixed for hearing. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}