{
"name" : "Delhi High Court",
"url" : "https://play.google.com/store/apps/details?id=highcourtapp.com.highcourtapp",
"package" : "highcourtapp.com.highcourtapp",
"category" : "Tools",
"description" : "About this app Official App of Delhi High Court.  Provides Case Status, Display Board, Cause List, Supreme Court Display Board, Access to important links of Delhi High Court website etc. Special features under Advocate Login option for advocates already registered with Delhi High Court e-Filing software e.g. Advocate Diary, Case Status of own cases, Application for e-Inspection, Request/Approval of Online Gate Pass, etc. You can access the app even as a guest user. This app is useful to Citizens, Litigants and Advocates. In the app, services are given under different caption viz. Case Status, Display Board, Cause List, Advocate Login, etc.  Highlights of the app:   Case Status can be searched by various search options like Case Number, Party Name, Advocate Name, etc.   Litigants can apply for issuance of new entry pass to visit Delhi High Court under Gate Pass Request tab.   Special features under Advocate Login tab for advocates already registered with Delhi High Court e-Filing software. They can create their login IDs by entering their registered mobile numbers.   In the Case Status option under Advocate Login, cases can be added and saved. It helps the advocates to create and manage their personal case diary.  Registered advocates can submit their application for e-Inspection.  Registered advocates can request or approve Online Gate Pass applications.   View Display Board of Delhi High Court.  View Display Board of Supreme Court of India.  View Cause List of Delhi High Court.  View Calendar of Delhi High Court.  In the Case Status option, you can view the last three orders of the case.  By the Important links option, you can access various important links of Delhi High Court website, e.g. CJ & Sitting Judges, Judges Roster, Pronouncement of Judgments, Nominated Counsel, Certified Copies, Case History, etc. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_INTERNAL_STORAGE']",
}