{
"name" : "Cometin",
"url" : "https://play.google.com/store/apps/details?id=host.stjin.cometin",
"package" : "host.stjin.cometin",
"category" : "Tools",
"description" : "Note for MIUI users: MIUI is known for breaking core functionalities in Android. If you want to use Cometin on a MIUI or Xiaomi device please read this: https://helpdesk.stjin.host/kb/faq.php?id=7 You can also join the Telegram group: https://t.me/joinchat/C_IJXEn6Nowh7t5mJ3kfxQ  What is Cometin Cometin is a free*, growing collection of tweaks and tricks to optimize your productivity and improve the Android experience.  More information I can create a separate app for every idea I have. But why shouldnt I put everything in 1 app? Google announced Dynamic Modules at the IO in 2019  With dynamic features you can split an app into several parts. This is exactly what Cometin is. Cometin is a growing collection of tricks and tweaks for your Android device, split into modules. This way you only download the features that you want to use and save your storage space.  Available modules (with some small descriptions)  Ambient display bring a customized Ambient display, Always-on-display and wave to wake to your device  App locker Lock apps behind a passcode or pattern  Better rotation Forces every app to be compatible with every orientation including 180 degrees  Caffeine Keep your screen on for a certain amount of time  Cometin Sync Sync notifications, and notes between phones and desktops  Darker brightness Go below the minimum brightness by applying a dark overlay on top of your screen  Flip to shhh (Cometin 2.0 and up) Flip your phone face down to silent notifications (except alarms)  Heads-up Hide head-up notifications  Immersive Hide statusbar, navigationbar or both  Parallel Create a work profile to seperate personal and work.  Remap assistant Execute a different action when opening the assistant  Shake actions (Cometin 2.0 and up) Execute a different action when shaking the device  Is this safe? Yes! All modules are only served from the Google Play Store, all modules are scanned by Google Play Protect so nothing to worry about!  Installing modules: The installation of modules is done immediately, and you can use the module immediately after installation.  Updating modules: Installed modules are automatically updated together with Cometin. No hassle with separate files!  Removing modules: Module uninstalls do not occur immediately. That is, the device uninstalls them in the background in the next 24 hours or with a new Cometin update.  Request for new features: Requests for new features are always welcome! However, I cannot promise anything about the actual arrival of these features. Request your features via my support ticket system: https://helpdesk.stjin.host/open.php. This way you can keep track of the status of features.  Need help or got problems? If you are stuck or need more information, dont hesitate and contact me viamy support ticket system: https://helpdesk.stjin.host/open.php. Or join the support telegram group: https://t.me/joinchat/C_IJXEn6Nowh7t5mJ3kfxQ  What permission Cometin asks for and why Every permission makes sense, and descriptions in the system settings explain which modules make use of what permissions.  * In order to use more than 5 modules at the same time a small donation is required.   Cometin Cloud  What is Cometin Cloud  Cometin Cloud is a cloud service for storing data so that it can be retrieved on other devices. Cometin Cloud consists of a database where information is stored temporarily and securely.  Deleting/managing data When creating a Cometin Cloud session, a unique ID is created under which information is stored. You can permanently delete all information at any time. In addition, all information is automatically deleted after 1 month of inactivity. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_SETTINGS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'android.permissions.DEVICE_POWER', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_BIOMETRIC', 'android.permission.USE_FINGERPRINT', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'android.permission.WRITE_SECURE_SETTINGS', 'android.permission.INTERNET', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.SET_WALLPAPER', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permissions.DEVICE_POWER', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.DISABLE_KEYGUARD', 'com.android.vending.BILLING', 'android.permission.WRITE_SECURE_SETTINGS']",
}