{
"name" : "Vyapar Barcode Extension",
"url" : "https://play.google.com/store/apps/details?id=in.android.vyaparbarcode",
"package" : "in.android.vyaparbarcode",
"category" : "Tools",
"description" : "This Vyapar Barcode extension can be used with Vyapar - accounting app to scan your items/products in your shop with just your mobile/ scanning device and generate the bill simply fast to ring up sales.   Scans all QR code & barcodes! Very simple & easy to use! A must-have Barcode Scanner (QR Code Reader) for Vyapar Users! Download now!   Vyapar is the only Business Accounting, Invoicing & Inventory app made for small Indian Business, that lets you manage, invoices/receipts, estimates, payments, inventory and clients. An ideal solution fulfilling all your Business Accounting needs. It is a GST app  Start your 30 Days FREE Trial Now !!  With this business accounting app, Vyapar, you can create and share GST compliant invoices and tally them, generate accurate financial reports, automatically calculate taxes, that help you file GST tax returns without any hassles. With this invoicing app, you can manage your cash flow in little time proving it as the smartest software to go for. Many businesses are happy with it!  *Ongoing support & updates included in this GST app.  Works both with or without internet.  Here is a look at the top features of this business accounting and invoicing app:  GST Complaint Business You can create invoices, receipts, generate business financial reports which are compliant with GST format defined by GOVT of India with this invoicing app. Hence with perfect invoices like these, youre GST-Ready as taxes are automatically calculated for the sale and purchase you make.  Invoice Themes Customisation With our professional set of customizable invoice themes, you can send personalized invoices / receipts to your customers. Add your own signatures, business logo etc with this invoicing and business accounting App.  Bill Wise Payment Tracking On Vyapar, it is very easy to keep track of each bill and the status of its payment, this is not so easy on Tally.  Business Reports  Here are some of the business reports Vyapar, the simplest Business accounting app has  - Profit and Loss Reports - Day Book Business Report - Tax Report - Custom reports - Item Wise Profit & Loss Report - Expense reports   Perfectly balanced inventory management Out of stock? you lose sales and customers.Excessive stock? Cash tied up at wrong place. Balance your stocks using Vyapar Invoice app to make more profits.  Printing Options Vyapar Invoice app supports A1, A2, A4 sized invoice printing. Vyapar accounting app supports Regular & thermal printers  Item Stock Tracking Track Individual Units of an item by their expiry dates, batch no and many other criteria to pick the right ones for upcoming sales.  Low Stock Indication Get alerts when items turn` Low in Stock and invest smartly. Fast moving inventory and slow moving inventory can be easily identified with this for you to act accordingly.  Auto Backup Automatically Backup of Business data to keep them fully safe on your device/google drive, so you can go back in time and restore a file before it was changed or deleted.   E-Way Bill Number Create E-way Bill Number invoices and move goods easily with this invoicing app.   Create Estimates Create Estimates for your business, anytime with the Vyapar Invoicing App   Transaction/Promotional notifications Easily send Payment messages, Marketing messages or alert messages to your vendors/customers. Transaction messages to your parties on every transaction to look more professional  Automatic Payment Reminders Automatic reminders are sent to your customers on their pending payments to help you chase unpaid Invoices and receipts and ensure payments are made asap.  Download the Vyapar Barcode Reader and add stocks easily & quickly on the Vyapar Accounting app & Inventory app. Only Accounting app made for Indians.  If you have any questions regarding our Barcode or Vyapar Accounting App , you can contact our Customer Support: contact@vyaparapp.in  Please dont download this if you are not a Vyapar user. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.FLASHLIGHT']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}