{
"name" : "File locker - Lock any File, App lock",
"url" : "https://play.google.com/store/apps/details?id=inno.filelocker",
"package" : "inno.filelocker",
"category" : "Tools",
"description" : "Keep your all files Secure and private with File locker. File Locker is the easiest way to create a secure location on your device to store and protect your important and private files which can be accessed only by you.  File Lock lets you password-protect your personal files (ex: photos, videos, documents, wallet cards, contacts, notes and audio recordings, etc... in your Android Phones.  File Locker encrypts your file and save in secret location in your SD Card so your file is completely secure. Hide any type of files with file locker. File Locker ensures that family and friends who use your phone dont see your private files, if they browse through your gallery, photo album or any file manager. This also works as Video locker, Image locker.    FEATURES:   Import files from SD Card / Phone Memory   Password protected app access with a PIN / Pattern / Finger print.   Applock to protect your apps   Break-in-alert: snap the snooper   Face down lock   Fake door : Disguise photo & video locker as an another app.   Fingerprint unlock (Only supported devices)   Slideshow photos   Set cover image to your albums   Material interface designs makes more live your app   Set theme to depends on your mood   Does not show in recent apps list.   Automatically quits in devices sleep mode.   Password recovery option (we will send password to your registered e-mail id).   Unlimited Files can be locked.   Hide your private files from others.   Extremely easy unlock process with just a click.   Fastest lock process with multi-select feature to import hundreds of files quickly.   Intuitive interface for a great experience.   Hide sensitive videos and pictures.   Opens documents directly from app.   All your files stored in the file locker are 100% private.   Lock down important documents   Smart looking through directories for documents, locked and unlocked files.    HOW IT WORKS:  LOCK  1 - Browse to the target file(s)and check the check box beside it.  2 - Press the lock button on the bottom bar.  3 - Files will be encrypt and save in secret location of your SD Card.  4 - thats it.   UNLOCK  1 - Select the file(s) in the app  2 - Press the unlock button on the bottom bar.  3 - Files will be unlocked and automatically gets saved in your SD Card folder name of File locker.  4 - thats it.    WHAT YOU CAN LOCK WITH FILE LOCKER:   Lock Videos   Lock Photos   Lock Documents   Lock Audio Files    PASSWORD RECOVERY:  In case if you forget your passwords we will send you to your registered e-mail id. GET_ACCOUNTS permission is get user e-mail id for sending password.    ALREADY A FAN? CONNECT WITH US   Like us: http://facebook.com/innorriors   Follow us: http://twitter.com/innorriors   Visit us: http://www.innorriors.com  Having issues with File Locker? send mail us to admin@innorriors.com ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.READ_PHONE_STATE', 'android.permission.MANAGE_DOCUMENTS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.MANAGE_DOCUMENTS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAMERA', 'com.android.vending.BILLING']",
}