{
"name" : "Photo & Video Locker - Hide Photos / Vault",
"url" : "https://play.google.com/store/apps/details?id=inno.gallerylocker",
"package" : "inno.gallerylocker",
"category" : "Tools",
"description" : "Best Secure and Private Vault on Play store.  Keep your Apps, Photos, Videos & Documents secure and private with photo & video Locker. Photo & video Locker is the easiest and safest way to create a secure location on your device to store and protect your Personal / Important Photos, Videos and Documents also it protects your apps with a Secret PIN and Pattern.  Photo & video Locker is your personal gallery where you can keep your most memorable photos and videos and ensure that friends who use your phone dont see your personal photos/videos if they browse through your gallery.  Applock helps you tom protect your chating apps from snooping eyes.  Documents lock help you to hide your most important and personal documents such as bank documents, company documents, Presentations and bills.  Keep safe all your private data in one place.    Features:  - Password protected app access with a PIN / Pattern / Finger print.  - Applock to protect your apps  - Lock photos, videos and documents directly from your default gallery  - Works with your devices memory / SD card to import and export photos and videos.  - Break-in-alert: snap the snooper  - Face down lock  - Fake door : Disguise photo & video locker as an another app.  - Fingerprint unlock (Only supported devices)  - Album View to manage your photos/videos faster.  - No storage limitations with unlimited photos/videos.  - Multi-select feature to import hundreds of photos/videos quickly.  - Easy unlock with just a tap.  - Optimized for HD tablets.  - Does not show in recent apps list.  - Automatically quits in devices sleep mode.  - Intuitive interface for a great experience.  - Share locked photos/videos directly on Facebook, Twitter, WhatsApp, Etc.  - Best lock app to lock your images and videos  - You can hide your album thumbnail of photo/video  - Slideshow photos  - Set cover image to your albums  - Material interface designs makes more live your app  - Set theme to depends on your mood  - Best rated photo vault among people in google play    PASSWORD RECOVERY:  In case if you forget your passwords we will send you to your registered e-mail id. GET_ACCOUNTS permission is get user e-mail id for sending password.    FAQ:  Q: Where do my photos/videos go after I unlock them?   A: Your videos will be at sdcard/GalleryLocker_UnLocked_Pic after unlocking.   Q: How can I change my password?  A: Tap the Settings icon which will show you an option to change your PIN / Pattern.   Q: Are my hidden photos/videos stored online?  A: No. Your videos are stored only on your device. We have no ability to remotely access your videos.    More FAQ checkout our website: http://www.innorriors.com/faq.php    Having issues with Photo & video Locker?  Check out the FAQs or mail us at admin@innorriors.com.    - Follow us! : https://plus.google.com/101200578251750147543  - Love us? Like us! : http://facebook.com/innorriors  - Twitter addict? Follow us : http://twitter.com/innorriors  - Stay updated. Visit us : http://www.innorriors.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.PACKAGE_USAGE_STATS']",
}