{
"name" : "QR Code Reader, Scanner + Generator - Fast, No ADS",
"url" : "https://play.google.com/store/apps/details?id=io.insider.apps.qr",
"package" : "io.insider.apps.qr",
"category" : "Tools",
"description" : "Our QR Code Reader is the fastest, most user-friendly and reliable QR reader and barcode scanner available! Scan and use the data in seconds or create your own codes that others can use and share at a glance. It has never been easier!  Intuitive, light and super-fast  its the ultimate QR code scan and read app for Android!  ADVANCED QR SCANNER Using the latest technologies, our supreme QR Code Scanner can scan and decode all the QR codes types you can find; plain text, telephone numbers, website URLs, contact information, SMS message, email messages, calendar event, locations and much more! All the scanned codes are saved in history and always available to you.  ADVANCED QR CODE GENERATOR Along with our cool codes scanner, we have an amazing QR code generator inside the app where you can generate QR code easily. You can generate any type of code: contacts, geo location, url or anything else.  USE THE QR CODE DATA RIGHT AWAY Our QR scanner optimizes the data of the codes and gives them in a ready-to-use format, meaning you can call, email or visit a website instantly after scanning the QR code. The QR code reader goes 1 step further giving you ability to even schedule events on your calendar based on the data.  GENERATE Make your own QR codes about your event, personal information or business information at a glance. We make it super easy and include tons of useful information that you can share. Even more so, the qr create app gives you an ability to customize the colors of your QR codes for even neater looks.  FEATURES: - Fastest QR Code and Barcodes scanner. - Automatically decode and understand all types of QR codes: contact details, plain text, website links, SMS, geocodes, events, wifi and more. - Act straight after scanning QR Code:  - Make a call after scanning telephone number. - Send SMS or email. - Open link in the browser. - Open maps application after scanning geocode. - Add events to calendar right after scanning. - Add a new contact after scanning a business card QR code. - Unlimited storage for scan history. - Generate any type of code: text, URL, email, phone number, SMS, contact, event and more. - Customize created codes. Change background and foreground color. - Share or save the generated codes. - Batch scanning for scanning without interruptions. - Flashlight supported for low-light environments.  HOW IT WORKS: - To scan a QR code or barcode simply open the app, point the camera at the code, and thats it! Our app will automatically recognize the code and open the page with scanned information. - After scanning you can perform any action: open URL in your browser, share text with a friend, call the number, send an SMS, or simply copy to clipboard.  WHY OUR qr scanner app?  The goal of our super-talented developers team is to build the best high-quality apps in the market to give our user only the best experience. And we wont interrupt you with annoying ads.  Now its time to do some fast and precise QR code scanning and generating!  -- > Download the best QR Code reader on the market! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CALENDAR', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.vending.BILLING', 'android.permission.WRITE_CONTACTS']",
}