{
"name" : "My Cafe Rewards Calculator",
"url" : "https://play.google.com/store/apps/details?id=io.kodular.domingotambasacan.MyCafeRewardsManager",
"package" : "io.kodular.domingotambasacan.MyCafeRewardsManager",
"category" : "Tools",
"description" : "My Caf Rewards Calculator is a very useful app for My Caf users. You can manage up to 5 Townships, each with 20 members.  Why should you use My Caf Rewards Calculator?  - The app is pure offline with little ads when used online, just to help the developer buy some coffee. - The app has refreshing real-life background. Simple and neat. - The app supports 8 Languages as of now. Perfect for most users. - You can manage up to 5 Townships individually. With each Township, you can add a full list of 20 members. All names will be saved and you wont be adding every time you open the app.  What can the Calculator do? The calculator covers all basic functions like the following:  - Add any amount of diamonds and rubies to be distributed. - You can choose whether to compute BY TROPHY, BY TASK or ANY PERCENTAGE you like. You can switch to any mode anytime. - You can easily add values on each slot, thanks to one-click next. - Result will be calculated instantly in descending order, with the MVP on top. - Raw total of the diamonds and tasks will also be visible. - AND you can edit all values without repeating all over.  Can I save the results? YES. The app has 3 tabs for all your data. Check this in the Records Section.  1. First tab shows your Weekly festival history. Details includes total diamonds, rubies, tasks and trophies. It can record up to 8 festivals. 2. Second tab records that graphical chart for your Township progress. Is there any improvement to your achievements? What should be your next goal?  3. Third tab is the most important. Here you can see all your members contribution for the past 4 festivals. You can see how many tasks they finished and how many trophies, diamonds and rubies obtained.  Well this is rather a simple app made with the intention to help Township Leaders. It is not affiliated with the actual game we love to play.  For any questions and suggestions, you may visit our FB page at: http://bit.ly/CalculatorFB ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.SET_WALLPAPER', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
}