{
"name" : "SCOM - Cartão de Cidadão e Assinatura Digital",
"url" : "https://play.google.com/store/apps/details?id=io.ptech.cc.mobilecc",
"package" : "io.ptech.cc.mobilecc",
"category" : "Tools",
"description" : "SCOM  uma aplicao que permite usar todas as funcionalidades do Carto de Cidado em dispositivos mveis, como a leitura e partilha de dados e a Assinatura Digital de documentos PDF.  Feito a pensar em pessoas em constante mobilidade, onde a utilizao de um computador no  prtica ou de todo impossvel, e cuja necessidade de interaco com o Carto de Cidado  importante.  Engenheiros Civis, Arquitectos, Mdicos, Empresas de Construo Civil, assim como entidades pblicas (eg. Presidentes de Cmara, Chefes de Servio) so alguns exemplos de profissionais onde a aplicao SCOM tem sido de grande utilidade.  Necessita de um leitor de Carto de Cidado compatvel. Consulte-nos para mais informao e ajuda na seleco do leitor: https://scom.pt/ SCOM is an application that allows you to use all the features of the Citizen Card on mobile devices, such as reading and sharing data and the Digital Signature of PDF documents.  Made to think of people in constant mobility, where the use of a computer is not practical or at all impossible, and whose need for interaction with the Citizen Card is important.  Civil Engineers, Architects, Doctors, Construction Companies, as well as public entities (eg, mayors, heads of service) are some examples of professionals where the SCOM application has been very useful.  You need a compatible Citizen Card reader. Consult us for more information and help in selecting the reader: https://scom.pt/ ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
}