{
"name" : "Spck Code Editor / JS Sandbox / Git Client",
"url" : "https://play.google.com/store/apps/details?id=io.spck",
"package" : "io.spck",
"category" : "Tools",
"description" : "Spck Editor lets you write code whenever, wherever. Quickly change code snippets, preview them, and commit to any git repository all with this tiny (but powerful) JavaScript IDE. Theres no more need to compromise when developing on your mobile Android device. Clone from Github/Gitlab/Bitbucket, AWS CodeCommit, or more, make commits and push them from your phone.  *Back up your projects before uninstalling the app, otherwise you will likely lose the data! Upgrading/updating the app should be okay.  Features include:  - Clone public or private (requires app password/token) repositories - Quick snippets keyboard for faster code edits - Git client integration (checkout/pull/push/commit/log) - Diff viewer for git-enabled projects - Preview webpages on your device - Project or file code searching - Code syntax analysis and smart auto-completer - Code completion and context provider (signature/definition lookup) - Auto code-indentation (using js-beautify) - Light/dark themes available - Integrated JavaScript console - Preview markdown - Export/import project/files to zip file - Works offline (fixed) - CSS Color selector - Cool JavaScript labs to play with  Main languages supported: - JavaScript - CSS - HTML  Smart code-hinting support: - TypeScript, JavaScript, TSX, JSX - CSS, Less, SCSS - HTML (with Emmet support)  Other popular languages (Syntax highlighting only): - Python, Ruby, R, Perl, Julia, Scala - Java, Scala, Kotlin - OCaml, PHP  - Golang, Rust, C, C# - Stylus, CoffeeScript, Pug - Markdown, Batch, Bash - ActionScript, Coldfusion, HaXe + More...  More features to come! ",
"desc_perms" : "['android.permission.READ_CALL_LOG', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MICROPHONE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MICROPHONE']",
}