{
"name" : "RaspController",
"url" : "https://play.google.com/store/apps/details?id=it.Ettore.raspcontroller",
"package" : "it.Ettore.raspcontroller",
"category" : "Tools",
"description" : "The RaspController application allows you to easily manage your Raspberry Pi remotely. Now it is possible for files, to control the GPIO ports, send commands directly through the terminal, view images from a connected camera and obtain data from different sensors. Finally, wiring diagrams, pins and various information are available for the correct use of the Raspberry Pi.   Features included in the app:   GPIO management (On/Off or impulsive function)  File manager (Explore the content of Raspberry PI, copy, paste, delete, download and visualize properties of files, text editor)  Shell SSH (Send custom commands to your Raspberry PI)  Cpu, Ram, Disk monitoring  Camera (Shows images of the camera connected to the Raspberry PI)  Custom user widgets  Process list  Support for DHT11/22 sensors (Humidity and temperature)  Support for DS18B20 sensors (Temperature)  Support for BMP sensors (Pressure, temperature, altitude)  Support for Sense Hat  Info Raspberry PI (Read all the information of the connected device)  Pinout and diagrams  Wake On Lan (Use Raspberry PI to send WakeOnLan magic packets)  Shutdown  Reboot    It use protocol SSH  Authentication: password or RSA  Tested on Raspbian  Plugin for Tasker app    Kindly dont use the Evaluation System for reporting bugs. Instead, please contact me directly. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE']",
}