{
"name" : "SmartStoves Royal",
"url" : "https://play.google.com/store/apps/details?id=it.royal1915.app.smartstoves",
"package" : "it.royal1915.app.smartstoves",
"category" : "Tools",
"description" : "Have you ever gone out, leaving your stove off or forgetting to programme it? From now on this will no longer be a problem. Thanks to a specific app developed by Royal, it will be a breeze to control your stove at home even if you are away. Your stove on your smartphone: just download the app and it will become quick and easy to control your Royal stove even if you are outdoors.   HOW DOES IT WORK? Just 3 simple steps and your stove will communicate with you: - Download the App - Connect the App to your stove - Manage all the parameters (operating times, timer, temperature, fan operation, etc.)  You can now: - Set the temperature on a daily and/or weekly basis (in this case the stove will automatically manage all its parameters to give you all the comfort you are looking for) - Set the operating times on a daily and/or weekly basis (in this case the stove will automatically manage all its parameters to give you all the comfort you are looking for) - Choose fully-customised management to set your stoves parameters    THE CHALLENGE The APP allows you to manage all the functions of the Royal pellet stoves from your smartphone in the comfort of your home or from outdoors. An all-Italian challenge, overcome by the leading Italian brand for ecological biomass heating. You will have the practicality of a real, cutting-edge, heating system that is remote controlled and thus avoids any kind of waste, promotes savings, protects the environment and contributes to your comfort. All at your fingertips.  Discover the Royal range with the standard supplied Connection Box: to manage your homes stove from your smartphone: http://app.palazzetti.it/ ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_PROFILE', 'android.permission.ACCESS_NETWORK_STATE', 'it.royal1915.app.smartstoves.permission.C2D_MESSAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_CONTACTS']",
}