{
"name" : "Jota Text Editor",
"url" : "https://play.google.com/store/apps/details?id=jp.sblo.pandora.jota",
"package" : "jp.sblo.pandora.jota",
"category" : "Tools",
"description" : "Jota is a text editor designed for a long text file. Its pronouced as i-o-ta.  Functions - Support until 1 million characters.  - Auto-Detect multiple character codes. UTF-8 UTF-16BE UTF-16LE UTF-32BE UTF-32LE WINDOWS-1251 WINDOWS-1252 WINDOWS-1253 WINDOWS-1255 SHIFT_JIS ISO-2022-JP ISO-2022-CN ISO-2022-KR ISO-8859-5 ISO-8859-7 ISO-8859-8 BIG5 GB18030 EUC-JP EUC-KR EUC-TW IBM855 IBM866 KOI8-R MACCYRILLIC HZ-GB-2312 X-ISO-10646-UCS-4-3412 X-ISO-10646-UCS-4-2143 (Whether you can decode or not depends on Androids implementation.)  - Change character codes. - Auto-Detect linebreak code. - Change linebreak code. - Keep linebreak code until saving a file. - Save position of the cursor with file. - Save history of recened files.  - Search/Replace (Support Regular Expression)  - Text sharing with external application. Mushroom Share (ACTION_SEND) Search (ACTION_SEARCH) Open (ACTION_VIEW)  Direct Intent : You can launch any one application on menu item.  - Scroll with Thumb-drag. - Scroll with Flick. - Undo/Redo - Support a Shortcut key with ALT/CTRL Key. - Customize colors. - Create a shortcut icon on HOME app. - Customizable shortcut key bind. - Text selector like Gingerbread. (Double tap to select the word , then touch selected area to show marker.) - Word wrap ON/OFF and set word wrap width. - Set tab width. - Viewer Mode. - Show Line numbers. - Word Counter. - Support Landscape Mode correctly. - Auto save. - Auto Indent. - Show Tab/Linebreak. - Auto capitalize. - you can used as SL4A editor. - Customizable Toolbar. - Customizable Syntax highlght. - Capture Screen shot. - Wallpaper customize.  - Support Android OS 1.6 or later. - Support both touch-screen device and qwerty-keyboard device.  - Forever FREE and NO-AD. - This software is an Open Source Software under the Apache License.  CAUTION RTL-Language and bi-directional text is not supported.   If you need a reply from me , DONT put it in Markets Review . Instead please let me know by E-mail or Twiter(@jiro_aqua) You can send a message to me from Jotas Preferences Screen.  If you need grep (search from multiple text files), try my app aGrep.  If you want to localize Jota Text Editor, see this page. https://sites.google.com/site/aquamarinepandora/home/jota-text-editor/howtotranslate ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.launcher.permission.INSTALL_SHORTCUT']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
}