{
"name" : "Simple White Blue Keyboard",
"url" : "https://play.google.com/store/apps/details?id=keyboard.theme.simple.white.blue",
"package" : "keyboard.theme.simple.white.blue",
"category" : "Tools",
"description" : "This specially designed simple white blue keyboard is for trendy people like you! This keyboard is compatible with ALL Android smartphones. And Its totally FREE! Start your unique typing experience with this cool simple white blue keyboard!  Why Us? It Makes Your Phone Cool and Trendy Well-designed in white and blue and simple smart styles, simple white blue keyboard provides exclusive background wallpapers, simple white blue themed buttons, personalized fonts and typing animations. Moreover, awesome simple smart effects correspond to your typing and gestures. They are 3D effects while tapping, dynamic particle effects, gesture input animation and simple smart touch tones. Install this simple white blue keyboard will bring you to the simple smart and white and blue world of simple white blue. How cute to make your phone cool and trendy and show off in front of your friends!  It Helps You Type Easily and Effectively If you are looking for a smart and smooth keyboard, take this simple white blue keyboard. It makes typing ever more enjoyable.  Smart Reply simple white blue keyboard is an artificial intelligent keyboard. It suggests replies based on your conversation context.  Popular Emojis and Gifs simple white blue keyboard includes 1,000+ most popular emojis and stylish gifs. You can either choose emojis from the keyboard list, or just type a word and our smart keyboard will suggest emojis for you. Our emoji pool is constantly being updated!  Theme Center There are 4,000+ FREE keyboard themes covering various categories of tech, animals, glitter, nature, cute ones, cartoons, flowers, love, luxury, cool style, business, simple type, sports, special for girls, etc. Visit our theme center and find your favorite!  DIY Themes You can customize your own keyboard in our Theme Store. Choosing background from various wallpapers or even your own photos, button skins, fonts and touch tones! Come and enjoy the fun of DIY keyboard.  Smart Typing Triple your typing speed now! simple white blue keyboard has the following cool functions to ensure smart typing: Personal Dictionary Cloud Prediction Gesture Typing Voice Input  Smart Search Tap the Search feature and you will be directed to what you are looking for. You dont even need to switch to a browser.  Languages Supported white and blue keyboard theme supports 85 languages covering 138 countries.  New Functions Selector and arrow buttons: make it easier for editing long text! Delete learned words: long press to get rid of the unwanted learned words in prediction bar!  Please Note To apply this simple white blue keyboard, you need to install our keyboard engine. Simply tap the APPLY button to complete installation for FREE.  Rate simple white blue Keyboard If you like this keyboard, please do not forget to leave a 5-star rating and comment to help others identify this wonderful keyboard. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_USER_PRESENT', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_USER_PRESENT', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE']",
}