{
"name" : "Via Browser - Fast & Light - Geek Best Choice",
"url" : "https://play.google.com/store/apps/details?id=mark.via.gp",
"package" : "mark.via.gp",
"category" : "Tools",
"description" : " Quiet Browser Via browser wont push news and other things to you. No bother to your android devices.  Mini Browser Via browser use much less memory usage on your android devices. Keep your android devices as fast as new.  Lite Browser Via browser is designed for Minimalism. Best choice for geek user and who enjoy lite products.  Customized Browser You can easily customize Via browser. This is your own web browser. Best android browser for you to design your own homepage.  Fastest Browser Via browser is smooth for most android device. And we optimized a lot for fast browse.   We hope you could enjoy your smooth and fresh browse time. That is what we are following. Here are some features of Via web browser. Fast as lightning This fast include the speed of open app and exit. Also include the fast speed of browse webs. Give your android phone fast-moving speed . Enjoy your fast web browse. Light but more All the design is light and lite. All the experiences are light. If you enjoy the light browser , you got to love this one . Enjoy your light web browse time. Mini on android The tiny apk. help save the memory of android device. Mini size also help android device smooth than ever. Enjoy your smooth web browse time. Best for Geek Efficient is especially important. And the lite interface give you a fresh feel all the time. Enjoy your fresh and efficient web browse time.  Here are some functions of Via browser  Date saving  Customize   Ad block  Privacy Protect  Bookmarks  Adds-on  Night-mode  Computer  mode  Translate  Find in page  Search engine switch  Web page save  Intelligence picture show  Free to design you homepage Via Browser Product Concept The main line of Via browser is geek. Make hard things simple. Via browser pay attention to experience of browse. Fresh and lite. Every android phone can keep Via browser well in hand because of its mini size and memory usage. Via browser have huge ability. Via browser have all formal function and advanced function such as web page code, weblog and more. In a word , Make hard things simple. Welcome to your feedback. Enjoy your time with Via Browser. Share Via Browser with others if you like . ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'mark.via.permission.BROADCAST', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.REQUEST_INSTALL_PACKAGES']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'mark.via.permission.BROADCAST', 'android.permission.ACCESS_WIFI_STATE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY']",
}