{
"name" : "Screen Time - Restrain yourself & parent control",
"url" : "https://play.google.com/store/apps/details?id=master.app.screentime",
"package" : "master.app.screentime",
"category" : "Tools",
"description" : "People are becoming more and more addicted to mobile phones. Whether it is adults or children, whether at the time of dinner or at the parties, the problem of mobile addiction has become more and more serious. More people simply dont realize that they spend a lot of time every day on their apps and games. Using Screen Time, we can better understand the usage of our mobile phones. Whether its a game or an app, when you install Screen Time, you are a person with time management awareness. A successful person can manage his time better.  Usually we dont realize that we spend a lot of time on some applications. with Screen Time, you can make you more aware of your habit of using your phone and make adjustments accordingly. Maybe you watched too many videos, maybe you spent too much time on social networks.  >>> App Daily usage Screen Time will show a detailed view of the daily mobile phone usage, accurate to the use of the phone in each hour, which apps have been opened. How long has it been used, With Screen Time, you can better allocate mobile phone usage time. with Screen Time, you can know the duration of each hour of use and the type of app used.  >>> App Weekly usage Up to a week of app usage. By checking the statistics of mobile phone usage in the last week. Know your daily mobile phone usage trends,  >>> App & Category Limit You can set a daily duration limit for each app or type of app, and you can set a different duration for each day, such as on weekends. There are more game usage times. You can set different time limits for each day individually. When the usage time arrives, you will be notified and a page similar to App Lock will be displayed. This will remind you that the usage of the app or category is overtime  >>> App Always Allowed List Some important applications in mobile phones, such as text messages, telephone calls, etc., can be whitelisted for these applications, so that the use of these applications will no longer be restricted. This will not affect your use.  *** We will not upload any of your information, including the usage of the app. All the data is on your phone *** ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.PACKAGE_USAGE_STATS', 'com.android.vending.BILLING']",
}