{
"name" : "Best LED Midnight Flashlight, NO ADS",
"url" : "https://play.google.com/store/apps/details?id=midnight.flashlight",
"package" : "midnight.flashlight",
"category" : "Tools",
"description" : "Best flashlight! Fast and brightest flashlight app that uses bright LED flashlight and adjustable screen light dimmer. Featured flashlight for Android phones and tablets. It will immediately make your phone more useful and turn it into one of the best productivity tools in your life.  Main features:  Adjustable dimmer for screen light brightness  Takes little space in phone memory  Strobe light with several frequency modes  Always available lamp - a powerful flashlight app is designed to be at hand when needed  Low battery consumption - the app is optimized to use the battery wisely  SOS flashlight frequency will help you to be prepared for emergency situations  Wonderful design  Uses phone camera flash light and screen light  Convenient super bright torch front and back  Better than a free game!  Very bright and powerful flash light   Vibration gives a real tactical flashlight feeling.  Useful screen flashlight for tablet without led flash.  The light illuminates when you click an icon on home screen and works like widget.  Totally free app  Definitely the brightest lamp with lighting spotlight available for free can be useful for you and your friends. Flashing light from the strobe can be seen really far in the darkness.   Why does a flashlight need access to the camera flash? LED (flash) is a hardware part of the camera. To enable LED, access to the camera flash is required. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['com.android.vending.BILLING', 'midnight.flashlight.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK', 'android.permission.FLASHLIGHT', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}