{
"name" : "CH Schilder",
"url" : "https://play.google.com/store/apps/details?id=mobi.koni.schilder",
"package" : "mobi.koni.schilder",
"category" : "Tools",
"description" : "Eine einfache Abfrage von Schweizer Nummernschilder fr Autos, Motorrder, Landwirtschaftliche Motorfahrzeuge, etc. CH-Schilder bietet eine Zusammenstellung aller Kantone der Schweiz um Halterinformationen zu ermitteln.  Je nach Kanton ist die Abfrage via SMS, Formular oder E-Mail mglich. Jeder Kanton regelt das auf seine Art.  CH-Schilder hat keine Verbindung zu den Kantonen oder anderen Anbietern. Abfragen von Halterinformationen knnen Kosten verursachen. Je nach Kanton sind die Kosten anders. CH-Schilder erhlt von diesen Geldern nichts. Die Abrechnung geschieht ausschliesslich ber die Anbieter der Abfrage-Services (Kantone, Telecom-Anbieter, etc.).  Was beinhaltet CH-Schilder nicht:  - Keine Registrierung bei CH-Schilder ntig - Keine Vollbild-Werbung - Keine E-Mail Werbung - Kein Gewinnspiel - Keine Gewhr fr Richtigkeit und Aktualitt   Markenzeichen gehren den jeweiligen Rechteinhabern. Rechtliches zum Autoindex: Gemss Art. 126 Abs. 1 der Verkehrszulassungsverordnung (VZV) kann der Name und die Adresse von Inhabern eines Kontrollschildes jedermann bekannt gegeben werden.  Die Benutzung der App geschieht auf eigene Verantwortung. Der Autor dieser App lehnt jede Haftung ab. Alle Daten (Name und Adresse von Haltern) sind bei Drittanbietern gelagert. Sie sind durch ihre rechtmssigen Eigentmer urheberrechtlich geschtzt. CH-Schilder speichert keine Daten und kann in keinem Fall fr Inhalte und Urheberrechte verantwortlich gemacht werden. Es ist Ihnen gesetzlich untersagt, die erhaltenen Daten kommerziell zu nutzen.   Titelbild by Jesse Collins on Unsplash A simple query of Swiss license plates for cars, motorcycles, agricultural motor vehicles, etc. CH signs provides a compilation of all cantons of Switzerland to determine holder information.  Depending on the canton, the query via SMS, form or e-mail is possible. Each canton regulates this in its own way.  CH signs have no connection to the cantons or other providers. Querying owner information can be costly. Depending on the canton, the costs are different. CH signs get nothing from these funds. The billing is done exclusively via the providers of the query services (cantons, telecom providers, etc.).  What does CH signs not include:  - No registration required for CH signs - No full-screen advertising - No e-mail advertising - No raffle - No guarantee for correctness and topicality   Trademarks belong to the respective copyright holders. Auth Index: In accordance with Art. 126 (1) of the German Ordinance on the Licensing of Vehicles (VZV), the name and address of holders of a nameplate can be announced to anyone.  The use of the app is at your own risk. The author of this app disclaims all liability. All data (name and address of owners) are stored by third parties. They are copyrighted by their legal owners. CH-Schilder does not store any data and can not be held responsible for content or copyrights. You are prohibited by law to commercially use the data obtained.   Cover picture by Jesse Collins on Unsplash ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}