{
"name" : "SeaHelp",
"url" : "https://play.google.com/store/apps/details?id=mwmbb.seahelp",
"package" : "mwmbb.seahelp",
"category" : "Tools",
"description" : "SeaHelp  the breakdown service at sea  With this kind of service, SeaHelp App is offering to all skippers the possibilty of asking for professional help on short notice in breakdown or emergency situations in the areas of Croatia, Slovenia, Northern Italy and the Balearic Islands.   After activating the application, the help button has just to be pressed once in order to generate a SMS which will be received by the SeaHelp operations centre, tranferring the coordinates of the actual position, the mobile phone number and, in the case of a SeaHelp membership, as well the membership number. The SeaHelp operations centre will then promptly contact the skipper of the damaged boat by phone to get more detailed information and then will initiate the necessary supporting measures.   This service is aimed at all skippers in the operational area as mentioned above. Nevertheless, SeaHelp would like to point out that, given the case of several simultaneous emergency calls, there will be priority treatment for SeaHelp members. This service, though, on no account, is meant as a replacement for the conventional emergency alarm scenarios as established in seamanship but, at best, may serve as a supplement.   No internet link is required for the application of the SeaHelp emergency call function. Although, when using abroad roaming fees might occur, so, please contact your provider for information about the rates for using SMS and telephone services abroad.  Persons seeking help and not being SeaHelp members will be charged the accruing costs as indicated on the pricelist stated on our website under www.sea-help.eu . Please inform yourself before using this application for the first time.  In case you should find any mistakes within the information contained, we kindly ask you to advise us accordingly via the support sites indicated.  Range of functions:  Appeal for help via SMS to the SeaHelp operations centre indicating the coordinates of the actual position of the person seeking help, the mobile phone number for recalls from the SeaHelp operations centre and the SeaHelp membership number guaranteeing priority treatment in the case of several simultaneous requests for help.  Possibility of applying via phone for a SeaHelp membership, the breakdown service at sea and support point partner of the ADAC for the Croatia region as well as a cooperation partner of the AMTC, the Austrian Sailing Federation and the Austrian Cruiser Federation.  Please note: activation of memebership will be made 24 hours after the application and receipt of payment by SeaHelp.  Direct access to the SeaHelp website.   Important notice: No liability will be assumed for the correct determination of the GPS coordinates by means of the phone as well as for the delivery of the SMS to SeaHelp.   This information is supplied without liability. ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.RECEIVE_SMS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['mwmbb.seahelp.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}