{
"name" : "Locca - screen lock",
"url" : "https://play.google.com/store/apps/details?id=net.pnhdroid.locca",
"package" : "net.pnhdroid.locca",
"category" : "Tools",
"description" : "Locca is a lightweight, ad-free app that helps you lock or turn off the screen of your device in any way you want. Currently, you can activate Locca by: - Tapping the launcher icon or 1x1 widget on your home screen or app drawer. - Touching the floating icon from any screen. - Swiping up from the Home button (before Android 6.0) or holding the Home button (from 6.0 onwards). This is known as the Google Now gesture or Assistant gesture. - Tapping Loccas notification. - Tapping on Loccas Quick Settings tiles (from Android 7.0 onwards). To activate the tiles, pull down twice from your status bar, tap the Edit (pencil) icon and drag the Lock screen or Screen off up from Drag to add tiles.  Before you use this app, please note: - This app uses the Device Administrator permission. As with any other screen locking app, Locca must be activated as a device administrator in Settings > Security > Device administrators. You will be prompted to do so on the first time you use the screen locking feature. Please note: If you are unable to remove the app, please disable it under Device administrator! - If youve set up a secure lockscreen, the screen locking feature requires a PIN or pattern next time you unlock the device. Use the screen off feature instead if you want to unlock by fingerprint. - On Android 8.1 and lower, due to Androids restriction, Locca bypasses the lock screen by showing a black screen and lowering the screen timeout. Therefore, on Android 6.0 and above, it must be granted permission to modify system settings.  - From Android 9.0 onwards, this app makes use of Androids accessibility service APIs to turn off the screen while keeping fingerprint unlock. - From Android 6.0 onwards, apps need your permission to draw over other apps. In Loccas case, you will be asked for approval when enabling the floating lock icon. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}