{
"name" : "Rx Monitor",
"url" : "https://play.google.com/store/apps/details?id=net.sf.rhino.rxmonitor",
"package" : "net.sf.rhino.rxmonitor",
"category" : "Tools",
"description" : "Rx Monitor provides real-time display of mobile network information that the phone communicates. Basic network information, call and data statuses, received radio signal from cell sites are included. Clicking on displayed information produces help dialog explaining many terms and acronyms. Cell information works on all technologies: GSM, UMTS, LTE, NR. Showing cells frequencies requires Android 7.0 or newer. NR requires Android 10 or newer.  Chart for signal level is also available and can be zoomed (pinch-zoom) and scrolled (swipe diagonally) with black vertical line app not running at that point. Events tab shows changes to phone status which may be of interest. Map tab shows the information overlaid on a map (GPS must be enabled first).  With neighbor cell information, following are examples of use cases to help figuring out what is happening with your mobile coverage:  - Find out how well you have LTE coverage. Whether you are in the cell area with strong LTE signal from one cell or at somewhere around cell edge where LTE signal from two or more cells have similar signal strength. If the cell you are using has problem, whether there is any other cell with good coverage as backup.  - If your location only has 3G coverage, you can find out what is the signal level of LTE. You can walk around with this app to find out where LTE coverage ends and the service drops to 3G.  - If you have Android 7.0, you can check signal level of LTE belonging to different bands. What is the signal level of the band you prefer (for example with large bandwidth, 4x4 MIMO, etc.) and which band the phone is using.   For phones with two SIM cards equipped, operator and service statuses can be displayed for each SIM card while registered (i.e. connected) cells and neighbor cells are for both SIMs combined on earlier Android versions. Beginning with Android 10, cells from different SIM card can be distinguished.   IMPORTANT: This app may not work at all or not give correct values on some brands or some models of phones due to the companies implementation of Android software in those phones.   The app offers in-app purchase for Pro version which will enable the following features. They are managed via option menu on the upper right corner of the app.  1. Remove ads.  2. Background monitoring. The app records (and possibly saves in log file) even when other apps are active on the phone. Notification message is shown to indicate that background operation is running. You can stop background monitoring by either using Recent Apps button (right button) and click X to close app, or disable background from the option menu.  3. Log file saving. Log files will be created in apps private folder. Log files created during previous app sessions can be moved to a public folder via option menu so that they can be managed by popular File Manager apps. Log files, both in private and public folders, can be opened using Files tab. (This tab is not shown if there is no log files.) Log file is in sqlite database format and is in the form RxMon--.db In case of log writing error, file with .db-journal extension is also produced. The .db-journal file will help fix the database when the .db file is opened. ",
"desc_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_PHONE_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION']",
}