{
"name" : "OpenVPN Connect – Fast & Safe SSL VPN Client",
"url" : "https://play.google.com/store/apps/details?id=net.openvpn.openvpn",
"package" : "net.openvpn.openvpn",
"category" : "Tools",
"description" : "WHAT IS OPENVPN CONNECT?  OpenVPN Connect is the official VPN application for Android developed by OpenVPN, Inc. It is a universal client serving the following OpenVPN products:   Access Server  server solution for businesses  OpenVPN Compatible Server  solution for self-hosted servers  If you need a VPN for private use and you do not have a server of your own, please download Private Tunnel, our paid VPN solution for individual users. Most of the commercial VPNs on the market actually use OpenVPN as the core protocol of their service. OpenVPN Connect is the only VPN client that is created, developed, and maintained by OpenVPN Inc. itself! Whether you want to set up VPN for a large company, protect your home Wi-Fi, connect securely via a public internet hotspot, or use your mobile device on the road, OpenVPN Connect uses cutting-edge technology to ensure your privacy and safety. Connect your world securely! OpenVPN Connect works seamlessly across all devices, no matter the complexity of your organization or your bandwidth.  WHY OPENVPN CONNECT?   Most Trusted VPN on the Market The only official VPN client created and maintained by OpenVPN Inc., used by over 50 million individuals and businesses worldwide  Free VPN, No Ads OpenVPN Connect is free to use and has no ads, ever. There is no throttling, ensuring fast connection with unlimited bandwidth for all accounts  Fast & Secure Connection Top enterprise-grade traffic encryption to keep your Internet access fast, safe and secure, and block online threats when connecting via Wi-Fi and hotspots  Easy Remote Network Access Easily set up and configure remote access for your organization to ensure full security and privacy when accessing resources from home or while traveling  HOW TO USE OPENVPN CONNECT?  You will need an existing OpenVPN Compatible Server or an Access Server subscription, depending on the service you want to use:  Your administrator gave you a hostname & username/password  Click on Access Server. Enter your hostname as well as username and password and enjoy full connection security!  Your administrator gave you an ovpn profile  Click on OVPN Profile. Import the ovpn file and enjoy full connection security!  FEATURES   Creates VPN tunnels encrypted with top enterprise-grade encryption ciphers. Data sent through the tunnel is 100% secure  Connect to your office network resources from anywhere, configure and manage access rules and connection properties across your office  Encrypt traffic over public Wi-Fi and hotspots, protect connection against hackers and sniffers  WHO ARE WE?  OpenVPN Inc. is the industry leader in SSL VPN technologies and a trusted name in cyber security. Our award-winning open source VPN protocol has emerged to establish itself as a de-facto standard in the open source networking space. OpenVPN has been protecting identities and data while providing anonymity to internet users for over 15 years, allowing both individuals and organizations to establish and manage fast and secure VPN connections. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.USE_FINGERPRINT', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
}