{
"name" : "Private Tunnel VPN – Fast & Secure Cloud VPN",
"url" : "https://play.google.com/store/apps/details?id=net.openvpn.privatetunnel",
"package" : "net.openvpn.privatetunnel",
"category" : "Tools",
"description" : "WHAT IS PRIVATE TUNNEL?  Private Tunnel is the official VPN application for Android developed by OpenVPN, Inc. Most of the commercial VPNs on the market actually use OpenVPN as the core protocol of their service. Private Tunnel is the only VPN service that is created, developed, and maintained by OpenVPN Inc. itself! Whether you want to set up VPN for a small office, protect your home Wi-Fi, connect via a public internet hotspot, unblock geo-restricted websites via proxy, or use your mobile device on the road, Private Tunnel uses cutting-edge technology to ensure your privacy and safety.  Private Tunnel secures and protects your path across the internet and works seamlessly across all devices, no matter what your bandwidth is. Connect your world securely! We offer a 7-day FREE trial for all new accounts!  WHY PRIVATE TUNNEL?  Most Trusted VPN on the Market The only official VPN client created and maintained by OpenVPN Inc., used by over 50 millionindividuals and businesses worldwide   Fast & Secure Connection Top enterprise-grade traffic encryption to keep your Internet access fast, safe and secure, and block online threats when connecting via Wi-Fi and hotspots   Free Trial for 7 Days Private Tunnel comes with a free 7-day free trial with no obligation to buy  simply register and start enjoying private and secure Internet access for free    Private Access from Anywhere Connect to our vpn servers around the world and keep your IP addressanonymous.   Unlimited Data, No Ads Private Tunnel has no ads, ever. There is no throttling, ensuring fast connection with unlimited bandwidth for up to 3 connected devices simultaneously   24/7 Support We offer 24/7 email support, live web chat support and ticketing support to resolve any question you might have in the shortest time possible  HOW TO USE PRIVATE TUNNEL? You would need a Private Tunnel subscription to use the services. If you already have a Private Tunnel subscription, simply enter your credentials. If you do not have a subscription yet, you can easily sign up for a 7-day free trial.  You can sign up for Fixed or Flexible accounts:  Flexible subscription allows the account owner to add Users and Groups to the account. Added users receive their own login credentials and have unlimited access to the VPN servers - perfect solution for your office, family, or group of friends!   Fixed subscription provides 3 concurrent connections = 3 devices with unlimited bandwidth and unlimited internet protection Once you log in, simply choose the vpn server you want to connect to and begin enjoying full internet access security and privacy immediately!  FEATURES  Creates VPN tunnels encrypted with AES-256-CBC, top enterprise-grade encryption cipher. Data sent through the tunnel is 100% secure  Encrypt traffic over public Wi-Fi and hotspots, protect connection against hackers and sniffers  Unblock geo-restricted websites via vpn  connect to one of our vpn servers around the world and retain full anonymity  WHO ARE WE? OpenVPN Inc. is the industry leader in SSL VPN technologies and a trusted name in cyber security. Our award-winning open source VPN protocol has emerged to establish itself as a de-facto standard in the open source networking space. OpenVPN has been protecting identities and data while providing anonymity to internet users for over 15 years, allowing both individuals and organizations to establish and manage fast and secure VPN connections. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.USE_CREDENTIALS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}