{
"name" : "Poker Analytics",
"url" : "https://play.google.com/store/apps/details?id=net.pokeranalytics.android",
"package" : "net.pokeranalytics.android",
"category" : "Tools",
"description" : "Poker Analytics has finally arrived on Android!  Get your hands on the favorite poker tracker of thousands of players!  Poker Analytics is a super friendly session tracker. It lets you enter all the data you want about your sessions and your bankrolls so you can make the best decisions before, during and after the game.  Weve just launched the app so please note that were working hard to add more and more features!  Here is what youll find:  * Tracking:  Log all your sessions, cash games or tournament! You can also log past sessions.  * Statistics: The app shows you all the key statistics from your cash games or tournament. See the evolution of your stats in beautiful graphs!  * Calendar:  The amazing Calendar tab is shipped in this very first version! Any stat, by month or year, in a single view, along the detailed time report of each period of time  * Reports: Get a full understanding of your performance with a whole range of reports. See how your game evolves, compare your results by stakes, by game or any parameter you want to learn about your strengths and weaknesses.  You can freely try the app for your first 10 sessions, then a yearly subscription will be required. You get an extra free month when subscribing.  You can learn more on our website. If you have any questions, please contact us! Have fun at the table! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
}