{
"name" : "Photo Locker",
"url" : "https://play.google.com/store/apps/details?id=net.newsoftwares.photolockeradvanced",
"package" : "net.newsoftwares.photolockeradvanced",
"category" : "Tools",
"description" : "Photo Locker (Hide Photos) locks your personal and confidential pictures on your Android phone using fast encryption techniques. It hide pictures from any unauthorized person. These encrypted images can only be viewed and accessed via your Photo Locker app. There are some images and photos that cannot be shared with others. Luckily, you no longer have to dread letting anyone go through your photo gallery on your Android phone as you can photo lock all these private images. Photo Locker can lock images and hide pics. Photo Locker works as a perfect photo vault and is a perfect photo keeper. The built-in image hider helps you to hide images. Best of all, theres no chance of losing your locked photos with built-in Dropbox backup.   FEATURES:  Photo Lock your personal pics Lock pictures that you do not want the world to see in your private photo vault.   Encryption The image locker locks your private photos using fast encryption techniques.   Time Scale View View all your secured pictures sorted by date, month or year inside your photo vault.   Multiple export, import and move options Import desired pictures from the gallery, devices camera or download them directly from the built-in private browser.   Create personalized albums Create personalized albums to manage, organize and sort out your photos conveniently.   Three security Credentials (password, PIN lock & pattern lock)  Secure photos with three security log-in credentials. Set up a strong password, a unique PIN lock or a complex pattern lock as your login credential for your photo vault.   Decoy Mode (fake user mode)  Decoy Mode allows you to set up a fake log in. It rescues you when you have no other choice except to reveal your pass code.   Dropbox Backup Avoid accidental loss of data with secure cloud backup. Use your existing Dropbox account to back-up your locked photos.   Panic Switch Switch to another app quickly by just shaking, flicking or placing the palm of your hand on the screen of your Android phone.   Secure Browser Browse the internet with the built-in secure browser; it leaves no traces of the internet usage outside the app.   Stealth Mode Hide your app icon using stealth mode, hence, no one comes to know that you are using an app to protect your personal pictures.   Hack attempt monitoring, The app clicks the images of the unauthorized users with the front camera, who tries to access your personal photos in your absence.  Note: Photo Locker Advanced guarantees you that all your files are stored only on your Android smartphone and we do not have access to any of your content.  For more information, you can visit http://www.newsoftwares.net ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.WRITE_SETTINGS', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.WRITE_INTERNAL_STORAGE']",
}