{
"name" : "QRbot: QR & barcode reader",
"url" : "https://play.google.com/store/apps/details?id=net.qrbot",
"package" : "net.qrbot",
"category" : "Tools",
"description" : "Scan all kinds of QR codes and barcodes with the QRbot QR code reader. Quickly access functions relevant to your scans: For example, add contact data to your address book or connect to a WiFi hotspot with a single click. Easily share arbitrary data such as website links by displaying them on your screen as a QR code and scanning them with another device.  ALL COMMON FORMATS Scan all common barcode formats: QR, Data Matrix, Aztec, UPC, EAN, Code 39 and many more.  RELEVANT ACTIONS Open URLs, connect to WiFi hotspots, add calendar events, read VCards, find product and price information, etc.  SECURITY AND PERFORMANCE Protect yourself from malicious links with Chrome Custom Tabs featuring Google Safe Browsing technology and profit from shorter loading times.  MINIMAL PERMISSIONS Scan an image without giving access to your device storage. Even share contact data as QR code without giving access to your address book!  SCAN FROM IMAGES Detect codes within picture files or scan directly using the camera.  FLASHLIGHT AND ZOOM Activate the flashlight for reliable scans in dark environments and use pinch-to-zoom to read barcodes even from far distances.  CREATE AND SHARE Share arbitrary data such as website links with the built-in QR code generator by displaying them on your screen as a QR code and scanning them with another device.  CUSTOM SEARCH OPTIONS Get specific information by adding custom websites into the barcode search (i.e. your favorite shopping website).  CSV EXPORT AND ANNOTATIONS Manage unlimited history and export it (as CSV file). Import it to Excel or save it to any cloud storage such as Google Drive. Annotate your scans and manage product inventory or implement quality assurance in your small business!  Enjoy one of the best QR code reader apps available for smartphones and tablets running Android 6.0 or higher.  Supported QR codes:  website links (URL)  contact data (MeCard, vCard, vcf)  calendar events  WiFi hotspot access information  geo locations  phone call information  email, SMS and MATMSG  Barcodes and two-dimensional codes:  article numbers (EAN, UPC, JAN, GTIN, ISBN)  Codabar or Codeabar  Code 39, Code 93 and Code 128  Interleaved 2 of 5 (ITF)  PDF417  GS1 DataBar (RSS-14)  Aztec Code  Data Matrix ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CALENDAR', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}