{
"name" : "SDFix: KitKat Writable MicroSD (ANDROID 4.4 ONLY)",
"url" : "https://play.google.com/store/apps/details?id=nextapp.sdfix",
"package" : "nextapp.sdfix",
"category" : "Tools",
"description" : "*** THIS APP IS FOR ANDROID 4.4 KITKAT ONLY ***  *** REQUIRES ROOT ACCESS ***  Android 4.4 KitKat removes your ability to write files to the MicroSD card (on phones/tablets that have both internal memory and user-installed MicroSD cards). NextApp SDFix restores this ability by modifying a configuration file. As this app changes a system configuration file, it requires root access.  WARNING! PLEASE READ BEFORE INSTALLING: --------------------------------------- * THIS APP REQUIRES ROOT ACCESS. IF YOU DO NOT KNOW WHAT THIS MEANS, PLEASE DO NOT INSTALL THE APP. * This app is used to change a device configuration file.  * Please read this entire app listing for a description of exactly what this app does to determine if it is appropriate for your device and/or custom ROM. * This app is designed to solve a specific problem. If you dont have that problem, dont install this app. * This app is only useful on devices that have a user-installed MicroSD card. If you have a Google Nexus device or other device without a MicroSD card that you physically installed yourself, then this app isnt going to be helpful. * This app is likely only useful if you have a stock ROM. If youre running an aftermarket ROM like Cyanogenmod, then there is no reason to install this app (good aftermarket ROMs dont suffer from the problem that this app corrects). * NO WARRANTY: as is generally the case with all root modifications, you assume all risk by using this software. * As with any root modification, ensure you have the knowledge to fully restore your device to stock if required.  [ About MicroSD Cards in Android 4.4 / KitKat ]  When Google released Android 4.4, they specified that applications you download can no longer write to user-installed MicroSD cards. Apps can still write to internal flash storage. Some devices (like Google Nexus devices) only have internal storage, and are unaffected. Other devices (e.g. Samsung Galaxy and Note devices) have the ability to expand their storage space by installing a MicroSD card. When KitKat is installed on such devices, apps are limited to only being able to manipulate files on the built-in storage, with write-access to the MicroSD card being restricted.  This change represents a removal of functionality compared with Android 4.3. 4.3 allowed apps to write to the MicroSD card, as did prior versions.   The limitation introduced in KitKat does not affect the capabilities of preinstalled apps, only apps you choose to install. Apps preinstalled by Google, your device manufacturer, and your carrier still have this ability. Only apps that you choose to install are restricted.  [ Technical Details ]  NextApp SDFix will modify the configuration file located at /system/etc/permissions/platform.xml to allow apps to write to the MicroSD card. Specifically, SDFix will add the Android UNIX group media_rw to the WRITE_EXTERNAL_STORAGE permissions configuration. This will enable apps (only those that you granted write access permissions to when you installed them) to write files to the MicroSD card. On many devices, this is effectively reverting the state of this permission back to the way it was configured in Android 4.3. This modification is carried out by modifying the existing XML file, rather than replacing it.   A backup of the original configuration file will be saved at /system/etc/permissions/platform.xml.original-pre-sdfix (provided one does not already exist). Reverting this modification can be accomplished by using a root -enabled file manager to replace the /system/etc/permissions/platform.xml file with the backed up version.  [ Additional Information ]  This app is free and has no advertisements (with the exception of links to other NextApp apps when it completes its task).  --- Please do not contact me with requests for information on how to obtain root access on your device. The process is different for every device, and often requires technical expertise to install. --- ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_SUPERUSER']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_SUPERUSER', 'android.permission.ACCESS_NETWORK_STATE']",
}