{
"name" : "Night Light - Baby Sleep Light And Sleep Lullaby",
"url" : "https://play.google.com/store/apps/details?id=nightlightandroid.jindk.com.nightlightandroid",
"package" : "nightlightandroid.jindk.com.nightlightandroid",
"category" : "Tools",
"description" : "PRIMARY FEATURES  [Night Light] NightLight uses your phones screen to illuminate a room, you can adjust the screen brightness. You can use a different color as the background color, so that the light is more gentle and not dazzling.This is very helpful for your baby to use before going to sleep. Customize your nightlight with a color palette, you can use the red, green, blue and many other colors as background light. Provide the default cute and soft static background image to the lovely nightlight background. Provide default romance and passion for dynamic background.This is the most convenient and fast candlelight, very romantic.Couples light up your passion. This is also a small and soft flashlight. You can use as a lamp and bedroom lamp at night.  [Lullaby] Provide a lot of natural and lively sound,such as air, fan, thunder, rain, wind, waves, white noise, bird and wind.It will help calm the mood and help sleep. Providing a lot of light music to help relieve stress and calm mood,It helps you relax your body and help to sleep. Music play support background play. Lullaby helps fall asleep instantly.  [Timer] Support Timing off nightlight and lullaby music. Support to keep the nightlight and lullaby music is always on. Set the nightlight to the time needed for your child to fall asleep. The timer function allows you to set how long you want the nightlight to shine before it gradually switches itself off. A tender and convenient way to accompany your kids to sleep.  Description:  NightLight helps to get rid of the fear of the dark. It is suitable for everyone.Simple pure color romantic night light.It makes you bright in the dark night.Night light brightness can be automatically adjusted to avoid harming the eyes.It can give the baby bedtime lighting to avoid darkness,It can also bring romance to lovers.Baby Nightlight is a magical app that lights up in the dark and gives off soft and comforting light until your kids is deeply asleep.Note:Best practice is hold the phone at a safe distance from the child, switch you cell phone mode to on the plane. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.DISABLE_KEYGUARD', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}