{
"name" : "Form Factory",
"url" : "https://play.google.com/store/apps/details?id=nl.gillz.cpm",
"package" : "nl.gillz.cpm",
"category" : "Tools",
"description" : "Formulieren App waarmee je keuringen, registraties en enqutes kan doen.  Pluspunten:   Gebruik je eigen huisstijl  Geen startkosten  Gebruik je eigen database om formulieren in aan te maken en/of te ontvangen  Stuur je formulier door naar een ander device voor goedkeuring  Extra feature: Stuur rapportages (pdf) naar je database en/of naar een e-mailadres.  Type vragen:  Scan QR code  Meerkeuze vraag  GPS Locatie  Datum- en tijd  Open vragen   In- /uitklapbare Sub formulieren  Maak een Foto en teken er vervolgens op  Getal invoer  Berekende velden  Diverse opties:  Alle velden kunnen worden voorzien van een voorkeurswaarde (default)  Velden kunnen, indien gewenst, alleen-lezen worden gemaakt   Mogelijkheid om conditionele (als antwoord is ja, dan) vragen aan te maken  Anders dan bij vele andere apps is deze app zo flexibel dat er veel meer kan dan dat we hier kunnen beschrijven. Meld je zeker aan als je voor geen tot weinig startkosten een oplossing zoekt die tot nu toe niet makkelijk gerealiseerd kan worden; of gewoon nieuwsgierig bent. Forms App lets you tests, can make registrations and surveys. Pros:  Use your own style  No activation fee  Use your own database forms to make and / or receive  Please send your form to another device approval  Extra feature: Send reports (pdf) to your database and / or an email address.  type questions:  Scan QR code  Multiple choice question  GPS Location  Date and time  Open questions  Input / folding Sub Forms  Take a photo and then sign on  Number entry  Calculated Fields  Various options:  All the fields can be fitted with a preferred value (default)  Fields can, if desired, be made read-only  Ability to create conditional (if answer is yes, then) ask  Unlike many other apps, this app is so flexible that it can be much more than we can describe here. Sign sure if you for little or no activation fee will remedy that can not be easily achieved so far; or are just curious. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}