{
"name" : "NZBManager",
"url" : "https://play.google.com/store/apps/details?id=nl.timkatgert.nzbmanager",
"package" : "nl.timkatgert.nzbmanager",
"category" : "Tools",
"description" : "About NZBManager is an easy to use tool, to manage all of your NZB services. Its not a stand-alone download application and depends on the supported software listed below. The current supported services are:  Supported Software - SABnzbd - NZBGet - Sickbeard (included support for SickChill and SickGear) - Sonarr - Radarr - CouchPotato - Headphones - Lidarr - Newznab Indexers - Jackett indexers - Transmission - Deluge - uTorrent - qBittorrent  Premium NZBManager Premium is now available aswell, when you purchase NZBManager Premium youll: - Have No Ads - Have the option to add NZBs to SABnzbd or NZBGet by URL & File. - Have the option to send NZBs from indexers to SABnzbd and/or NZBGet. - Have the option to add NZBs to click on links who point to an NZB files - Have the option to add Torrents to Transmission, Deluge or uTorrent by file or url. - Have the option to add Torrents by clicking on torrent links on websites. - Have the option to add movies to Couchpotato or Radarr by pressing the share button in the IMDB app. - Have the option to reorder downloads in SABnzbd and NZBGet. - Have the option to upload NZB files to SABnzbd and NZBGet from your file explorer. - Have the option to upload Torrents to Transmission, Deluge or uTorrent from your file explorer. - Have the option to scroll categorised through your media by long pressing the scrollbar. - Have the option to add shortcuts (Android 7.1 or higher) so you wont have to wait until the app has been booted to select a different service. - Have the option in Sonarr to receive notification about episodes that are about to air. - Have the option to search through your entire Sonarr, Radarr or Lidarr collection. - Have the option to filter only the Sonarr, Radarr or Lidarr items which are indicated as monitored. - Support me to continue the development for NZBManager.  There will be coming more features for NZBManager Premium in the future.  Rate I would really appriciate it if you leave some feedback below.  Contact If you find any kinds of bugs, please use the buildin issue reporter and ill try to fix it asap. For personal reasons send me an email at the addres below.  Terms of Use - The developer does not take any responsibility for use of this application. - The application uploads crash reports to a server. So its much easier for the developer to fix bugs. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_BIOMETRIC', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.USE_FINGERPRINT', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}