{
"name" : "nRF Mesh",
"url" : "https://play.google.com/store/apps/details?id=no.nordicsemi.android.nrfmeshprovisioner",
"package" : "no.nordicsemi.android.nrfmeshprovisioner",
"category" : "Tools",
"description" : "Seamlessly provision and configure your Bluetooth Mesh compatible fleet of nodes using nRF Mesh.  nRF Mesh allows you to easily deploy nodes to any Bluetooth Mesh compatible Nodes, giving you flexibility to deploy many different Mesh network Setups.  Features:  Node Control: nRF Mesh supports controlling GenericOnOff Server models  Provisioning: Deployment of a new Node is as simple as a press of a button, this version supports Numeric OOB authentication and static authentication (With no user input on the latter). nRF Mesh will automatically handle the Unicast addressing for you, Its also possible override that by simply entering the desired addresses.  Configuration: Setup your Application keys or use the randomly generated ones, add group addresses and configure your nodes into groups by simply setting their Subscription addresses.  Additionally, you may also run the following configuration commands on your network:   Add the publication address of a model  Add/Remove one of more subscription address on a model  Bind an Application Key to a specific model for full granular control of your networks security.  Explore the nodes capabilities by tapping the information button to view all elements, models, provisioning time and date, Manufacturer and all available vendor data.   Set the Default TTL on a per-node basis  Hardware support: - This version of the app is capable of communicating with any BLE devices that speak Bluetooth Mesh.  This app is supported on Android 4.3 and onward ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN', 'no.nordicsemi.android.LOG', 'android.permission.BLUETOOTH']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'no.nordicsemi.android.LOG']",
}