{
"name" : "Storage Analyzer - Check stats & clean low memory",
"url" : "https://play.google.com/store/apps/details?id=nrapps.android.storagetree",
"package" : "nrapps.android.storagetree",
"category" : "Tools",
"description" : "Unable to upgrade your device due to low memory? Does your device fill up too quickly and you cant figure out which files are taking the most space.  Your device may have several GBs of useless data without you even knowing anything about it !!!  Now micro manage your memory to the level of space taken by each and every file. Just check simple info about how much percentage of memory each file takes on your device.  Install CHECK STATS & CLEAN LOW MEMORY and check out the storage stats in great detail to narrow down what to delete and what to keep. Only keep the data that matters the most.  CORE FEATURES :  - App never runs anything in background. So no device heat up, no battery drain.  - Fresh and user friendly app design. (optimized for L)  - Check storage details of each and every file and decide which files consume most memory.  - See category wise storage details for Videos,music,photos,documents and others files on your device.   - See number of files present on your device. Too many files slows up your device !!!  - See files which are not visible in your file browser but takes up your valuable space.(Such as files hidden by some file hiding app)  - Provides QUICK SUGGESTIONS on what can be deleted safely like thumbnails, cache files etc. Also provides information about why is it safe to delete these unwanted files in case you feel suspicious while deleting them.  - Delete any suspected file or folder from the app with ease.  - Open any file from the app with ease.  - Never deletes anything on your device without your permission. So no risk of loosing any data or breaking another app.  - Scan entire storage at lightning fast speed.(upto 30,000 files under 30seconds) DISCLAIMER : Scanning speed may vary slightly depending on your device configuration.  For any feedback or concerns or to request any new feature, please contact nrapps.help@gmail.com. We would love to hear from you. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}