{
"name" : "Quick Dice Roller",
"url" : "https://play.google.com/store/apps/details?id=ohm.quickdice",
"package" : "ohm.quickdice",
"category" : "Tools",
"description" : "Quick Dice Roller is an app made for the tabletop RPG Geek. It allows to emulate almost all the complex dice rolls required by RPG and board games.  The dice can be added at will and organized in dice bags. Each die is defined by a formula such as 2d6+5 as well as special functions like rak(1d6,4,3) that allow to emulates the most complex game systems. An handy formulas builder simplifies the process, and allow to access to an online help. Check the list of all supported functions here: http://goo.gl/mZkcQS  Thanks to named values, as well as keep track of games scores, you can define formulas using variable parameters. You can create, for example, the named value Level with label lvl, then use the formula (lvl)d6 to determine the fireball damage. So when your mage level up you dont need to edit the formula: just change the Level value!  What you can do with Quick Dice Roller:   Roll dice with a touch  Organize dice in dice bags  Use same formulas youre familiar to (xdy+z)  Keep track of scores and use them in formulas  Read or listen the roll result in a clear way  Check the goodness of the rolls made  Apply modifiers on the fly with a touch  Sum a roll to the previous automagically or on demand  Paste last roll result from the clipboard in another app  Keep track of last rolls made  Other features of Quick Dice Roller   Simple and intuitive Formulas Builder  Many functions to emulate main systems  Online help  Read aloud the last result  Sound notifications  Highly customizable  Friendly and reliable developer :P  Persistence of data among various installations*  Import and export dice and dice bags definitions**  Some of currently supported systems   13th Age  Arcan Myth  Aeon IV  BASH!  Burning Wheel  Call of Cthulhu  Deadlands  Dungeon World  Dungeons & Dragons (all editions)  Dungeonslayers  Dystopian Wars  Exalted  Feng Shui  GURPS  HERO System  Legend of the five rings  Lords of Knowledge  MERP  Numenera  Pathfinder  Rolemaster  Savage Worlds  Shadowrun  Star Wars (D6 Space and d20 System only)  Traveller  World of Darkness  ...and many more!  Quick Dice Roller is a free and open source application for Android. Everyone can (and is invited to) contribute to its development in one or more of the following ways:   Join the official community on Google+  http://goo.gl/atlhS9  Become a beta tester for trialling of new features  http://goo.gl/UuJBSO  Improve translations or add new ones  http://goo.gl/9ySLIO  Check the source code for bug hunting (or for fun)  http://goo.gl/06fEHI  Make your friends know about Quick Dice Roller   *The availability of data and preferences backup depends on the devices manufacturer, and is only supported on Android 2.2 or later.  **This feature requires reading and writing to external storage. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "[]",
}