{
"name" : "Volunteer Rescue",
"url" : "https://play.google.com/store/apps/details?id=org.volunteerrescue.roman",
"package" : "org.volunteerrescue.roman",
"category" : "Tools",
"description" : "A set of tools for anybody involved with search and rescue, the tools are suitable for the new recruit through to the experienced rescue leader. Includes the following   1. Map and navigation tools  2. High angle rope rescue tools  3. Personal kit management  4. Search theory tools  5. Store and view rescue related web links  6. Save and load settings to and from the cloud   The mobile app is also a client to the main Volunteer Rescue service for members of organizations that also use the Volunteer Rescue service although this is not a requirement.  Map and Navigation  1. GPS Tracker, record your tracks for export to KML. For users whose group also uses the full VolunteerRescue service submit tracks in real time (internet connnection required) to the central VolunteerRescue service for real time tracking at the command post 2. Record and retrieve way point information 3. Convert coordinates between Degrees, Minutes and Seconds, Degree and decimal minutes, degrees decimal and UTM 4. Calculate the intersection of two paths 5. Calculate the distance and bearing between two points 6. Record and retrieve pacing charts for various terrain  Search Theory  1. AMDR instructions and calculator, links with pacing chart so you only have to count and enter paces and they will be converted to metres based on the pacing chart 2. Search probability calculator including Probability of Area, Probability of Detection, Track spacing, Effort, Probability Density, Probability of Success, Probably Success Rate  Other calculators  1. Rope anchor forces 2. Rope redirection forces 3. Slope forces chart 4. Marine TVMDC 5. Marine Distance, Speed, Time. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.RECORD_AUDIO']",
}