{
"name" : "Shortcut Master (Lite)",
"url" : "https://play.google.com/store/apps/details?id=org.vndnguyen.shortcutmaster.lite",
"package" : "org.vndnguyen.shortcutmaster.lite",
"category" : "Tools",
"description" : "Shortcut Master is a powerful tool for creating, capture, searching... shortcut. It can reveal any hidden shortcuts, hidden secret codes... in your device.   You can create shortcuts for any hidden functions or secret codes, such as App Ops, *#*#4636#*#* (Testing menu), etc...   To start creating a shortcut, follow these simple steps:  1) Find the target by using one of the following tools (under the Menu): - Secret Code Explorer - App Explorer - Search - Capture Shortcut  2) You can test the target by opening it (Launch button).  3) Create the shortcut in the list (Favorite button) or on the Home screen.  4) OR you can import the shortcut list into your app. Here is some sample shortcut lists for your convenience:  - Android Hidden Shortcuts (4.3): http://forum.xda-developers.com/attachment.php?attachmentid=2872474&d=1406473157 - Samsung Hidden Shortcuts (Note 3): http://forum.xda-developers.com/attachment.php?attachmentid=2872475&d=1406473157   * SECRET CODE EXPLORER:  Here you will get a list of all secret codes available in your device. You can filter the list by All apps, System apps or User (downloaded) apps.  For each item in a list, the first line is the code, the second line is app name and the last one is broadcast receiver name.  By tapping on the item, a context menu appears that will let you launch the code, explore the app (that owns this code) and add this code to the favorite list for easy access.  You have 4 options to launch the code: method 0 and 1 (broadcast the intent), method 2 and 3 (simulate the dialing on the dial-pad). By default, method 2 dials *#*#code#*#*, method 3 dials *#code#, but you can change these formats in the Settings. Method 0 requires root permission, while method 1 doesnt.  After testing the code, you can add a shortcut for this code to the favorite list. You also have 4 options to create the shortcut. Be noted that you can not create shortcut on the home screen for the secret code.   NOTE: For Samsung devices that have not been enabled HiddenMenu, you can still use this app to launch the secret codes.   * APP EXPLORER:  Here you will get a list of installed apps in your device. You can filter the list by All apps, System apps or User (downloaded) apps.  For each app, the first line is the app name, the second line is the package name.  Tapping on the app will open the list of all components (activities) in that app. By tapping on the item, a context menu appears that will let you launch the target, add a shortcut for this target to the favorite list or the home screen for easy access.   * SEARCH:  Here you can search the target by full text searching. Just enter any text to the search box and press the button to search. The text will be searched in the app name, package name and the target class name.  You can filter the search result by All apps, System apps or User (downloaded) apps.   * CAPTURE SHORTCUT:  You can capture the shortcut manually or automatically.  To manually capture, navigate to the desire app that you want to capture shortcut, pull down the system notification bar and tap on the Capture Shortcut icon.  To capture automatically, do the same and wait for the predefined period of time and this app will do auto capture for you.   * EXPORT/IMPORT:  You can export the favorite list to the file on the sdcard for backup. Use the file to import later or copy the file to other devices.   *** ACKNOWLEDGEMENTS *** - Some system functions may need ROOT permission to be launched. - Some system functions can not be created shortcut on the Home screen.  Please be noted that it is due to device policy, and these vary from devices to devices.   Supporting thread on XDA: http://forum.xda-developers.com/showthread.php?t=2800117   LITE Edition Limitation: - Show ads - Can not create shortcuts on the Home screen - Limit the number of shortcuts in the favorite list (max. number of shortcuts is 20) ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'org.vndnguyen.shortcutmaster.lite.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.GET_TASKS']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS']",
}