{
"name" : "Incognito VPN - Fast VPN & Ad Blocker for Android",
"url" : "https://play.google.com/store/apps/details?id=org.incognitolabs.vpn.app.incognitovpn",
"package" : "org.incognitolabs.vpn.app.incognitovpn",
"category" : "Tools",
"description" : "Incognito VPN protects your online data privacy throughout your entire device. Incognito is a faster, simpler, and more secure VPN which encrypts all your internet traffic & routes it to the fastest VPN servers on our network, allowing you to access blocked content from various geo-restrictions from all of the major content and video applications. The Ad Blocker feature blocks advertisements, trackers for all applications, including Browsers (Chrome), Games and all other applications.   Our mission is to protect online data privacy for every person and every organization on the planet. We believe Data Privacy is a fundamental human right, everyone should have secure and safe access to the worlds information without any censorship or judgement.  VPN - Hide Your Location Incognito VPN hides your IP address and location by multiple VPN servers around the world, all internet traffic are encrypted by utilizing open source military level cryptography, and are disguised (including VPN traffic itself) as typical web surfing traffic, even when subjected to deep packet inspection by firewall or organization. That means users traffic will be mixed in with all the billions of other HTTPS data packets transmitted daily, and the ISP or firewall cannot detect it, your activities no longer being tracked on the internet.  VPN - Faster than ever Incognito VPN utilizes the usage of internet bandwidth with the unique feature of simultaneously connecting to multiple servers, to automatically find the fastest servers and switch with 0 latency based on network type and quality. This makes your internet experience faster all around the world.   Free Ad Blocker for Browser and Applications Incognito VPN allows you to block ads for all installed applications, that means there will be no more ads or trackers in any browsers, applications or games on your device.   Free Data Control Incognito VPN keeps closed apps from sending and receiving data without your permission, no more stealthily collecting data any more, saving your battery power and money.   Get up to $119.88 credit of coverage by inviting your friends to Incognito. For every friend who installs Incognito, both you and your friend will get $9.99 credit of bonus Incognito Coverage.  Learn more about Incognito VPN: https://www.incognitonetwork.com/ ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_FINE_LOCATION']",
}