{
"name" : "Multi Timer Free",
"url" : "https://play.google.com/store/apps/details?id=org.catfantom.multitimerfree",
"package" : "org.catfantom.multitimerfree",
"category" : "Tools",
"description" : "Multi Timer Free is a simple, reliable and most customizable timer & stopwatch application. It can run many timers at once or separately. Very useful in many situations, such as cooking, sports, games and etc.   Reusable timers with many parameters Each timer can have different name, alarm sound, length, color label, vibration on/ off and alarm animation including a cute tail swinging cat alarm animation.   Intuitive and easy to use user interface The application is desinged to use easily and quickly.  Grouping timers Each timer Groups can have up to 100 timers and max 30 timer groups can be created.   Run in the background The application doesnt need to be running foreground. Once timers start, the application wakes up even after rebooting your phone when time is up. Its possible to show just notifications instead of bringing the application to front when time is up.   Timer linkage Timers can be linked. The linked timer will auto start when the linking timer finishes. Linking a timer group and starting all the timers in the group is possible as well.   Text To Speech (Voice Alarm) Each timer can have different voice alarm of free text. Reading out timer title, end time and timer note are supported.   Many color themes 24 color themes are available. You can even change colors of individual parts including notification icon colors.   Timer color labeling Each timer can be color-labeled.   Super customizable So many things are customizable. Font size, what buttons to hide/show, many notification related settings, alarm animations, bringing the application to front or not when alarm and more.   Useful sorting functions Timers can be sorted by remaining time, elapsed time, etc in real time automatically or manually.   Fixed number keypad allows for entering timer time quickly The number keypad on the timer creation window allows you to enter timer time very quickly.    Other features  Auto repeat timers (1 to infinite)  Single stopwatch  Enable/ disable timers  Timer Note for individual timers  Super flexible timer title (several dynamic parameters can be used within the title)  Four types of alarm animation. Alarm clock, bell, fireworks, bell and tail swinging cat  Display expected end time or remaining time in Notification  Import/ export timers and application settings  Notify when timers end or alarms end  Timer Event History  Expanding time of active timers easily (by quick menu, single tap and double taps)  Display elapsed time, expected end time and original timer time  Manual sort or real time auto sorting  Support Cloud backup so that setting and timers will be recovered upon device change  Four different sizes of fonts and button are selectable  Possible to select buttons to show and hide  Initial focus position and focus shift direction of time fields on Timer Creation Window are selectable  No advertisements for the paid version   ----------------------------------------------------  In case you experience any alarm delay, please check the battery saver setting of the phone as the delay is normally caused by that.  For any issues or requests, please email me at catfantom@gmail.com. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.VIBRATE', 'org.catfantom.multitimerfree.permission.C2D_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.DISABLE_KEYGUARD', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.DISABLE_KEYGUARD', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}