{
"name" : "DroidMote Client",
"url" : "https://play.google.com/store/apps/details?id=org.videomap.droidmoteclient",
"package" : "org.videomap.droidmoteclient",
"category" : "Tools",
"description" : "TO CONTROL THE OTHER DEVICE, YOU MUST INSTALL THE SERVER APP ON IT.  DROIDMOTE SERVER IS AVAILABLE FOR ANDROID, WINDOWS, LINUX AND CHROME OS.  DROIDMOTE SERVER FOR ANDROID https://play.google.com/store/apps/details?id=org.videomap.droidmoteserver  DROIDMOTE SERVER FOR LINUX, WINDOWS AND CHROMEOS https://www.videomap.it/download.htm  Control your Android, Windows, Linux or Chrome OS device from the comfort of your couch. This is the client part and can be installed on your Android device to control another device. Moreover, with DroidMote, you can use all multi touch applications and games , even on devices that do not have the touch screen ( e.g. when connected to a TV ! ).  QUICK START GUIDE https://goo.gl/9pTzS  HOW TO USE DROIDMOTE - VIDEOS https://goo.gl/as2eKY  MULTI TOUCH GAMES ON TV WITH AN HARDWARE CONTROLLER OR WITH YOUR PHONE AS CONTROLLER ARE NOT A PROBLEM !  IN THIS YOUTUBE PLAYLIST, FOR EACH MULTI TOUCH GAME CONTROLLED WITH DROIDMOTE, YOU CAN FIND A TOUCH PROFILE IN THE VIDEO DESCRIPTION. https://goo.gl/3QuHDK   FOR SUPPORT AND INSTRUCTIONS  Telegram: https://t.me/droidmote_support Forum: https://www.videomap.it/forum  DroidMote emulates hardware input devices in the Android, Windows and Linux OSes. Mouse, keyboard, multi touch trackpad, touch screen and a gamepad with 16 buttons and 6 axis. You can use the soft gamepad, an hardware gamepad or mouse and keyboard to play with all games installed on the server device, also those without the built-in gamepad support in virtue of the Gamepad2Touch functionality and the help of the touch profiles. Games that support hardware gamepads recognize DroidMote as an hardware gamepad. If you dont have a router, no problem. You can establish a connection point to point between the two devices with the function Tethering / portable hotspot of your device. (you do not need bluetooth, the bluetooth is slow and cover small distances)  YOU CAN PLAY MULTI TOUCH GAMES WITH YOUR PREFERRED HARDWARE GAMEPAD, ALSO WITHOUT A PHONE. YOU CAN CONTROL THE MOUSE WITH RIGHT STICK OF THE HARDWARE GAMEPAD. https://goo.gl/zkYAvd  Feature:   Mouse  Air Mouse  Multi touch trackpad  Two fingers scroll rotate zoom  Keyboard  Media controls  Dpad  Controller for games  Supports multiple phones simultaneously  Two virtual analog stick  Touch emulation allows you to map buttons and analog sticks to the screen. Play all your favourite games with full analog support, even those without built-in controller support!  Touch Mouse for games that not support an hardware mouse  Voice dictation  Copy and paste from one device to the other  You can connect an hardware gamepad to your phone via bluetooth and play with multi touch games or games that require mouse and keyboard. The game can run on Android, Windows, Linux or Chrome OS.  Android TV compatible  If your Android TV box have a poor wifi, you can connect the box via ethernet cable.  YOU DONT HAVE A ROOTED ANDROID DEVICE TO PLAY GAMES ? TRY THIS: https://youtu.be/HuLy2ERDfmY  FOR ANY PROBLEMS, CONTACT ME BY EMAIL. IM AT YOUR DISPOSAL 24 / 7 ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}