{
"name" : "Sign Doc - Sign and Fill Docs",
"url" : "https://play.google.com/store/apps/details?id=org.docsign.digitalSignature",
"package" : "org.docsign.digitalSignature",
"category" : "Tools",
"description" : "Sign Doc app is all you need to Draw Signatures, Sign and Fill - PDF, Images and other documents. Its the best available free app to create, manage & draw Digital Signature over various documents.  You can also use this app as a Pdf Maker / Pdf Viewer & Editor.   FEATURE HIGHLIGHTS - Your privacy, our first concern, we dont use any of the cloud or server storage. - No SignUp/registration to use this app - Easily Add, Create e-Signatures to Pdf, Doc, Xls, Ppt & Images. - Create a Digital Signature - Add Text, e-Signature to documents - Scan your document with an auto-crop feature. - Page edges are detected automatically. - Set page sizes for PDF (Letter, Legal, A4, and more) - Share PDF/JPEG files. - Print and fax the scanned doc directly from the app - OCR Scan, Add custom Text & Add Signature to IMAGES. - Auto Crop Corner Detection for Camera or Gallery Images. - Generate High, Medium or Low-resolution Images. - Generate A3, A4, A5, Letter, PostCard, Bussiness, etc PDF format to share with others. - Use Passcode to enhance App data Security. - Generate & Share Password Protected PDF. - Share Images in ZIP format. - Choose Image Resolution from a set of options.    The digital signature app can be used for many purposes such as signing a digital document and document signer. This digital signature app is the requirement of this this digital globe for digital sign and sign signature requirements. This e-signature works like sign easy for document sign and as a creator of e-signature. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}