{
"name" : "GSM Signal Monitor & SIM Card Info 📱",
"url" : "https://play.google.com/store/apps/details?id=paskov.biz.noservice",
"package" : "paskov.biz.noservice",
"category" : "Tools",
"description" : "Ever wanted to call someone, but your phone has no GSM coverage?   Or you are living / working in a low signal area?  GSM Signal Monitor monitors the phone (or tablet with SIM card) signal strength and alerts you when you are out of service  or in a low signal zone.   No signal / low signal alerts include: voice notifications, vibration, notification on the device screen and playing a ringtone. You can personalize how you get notified in the app settings.   GSM Signal Monitor can also notify you when the signal is restored, your mobile data is lost you are in a roaming area.   The app also provides information about device SIM cards such as phone number, voice mail number, SIM Card Serial number (ICCID), Subscriber Id (IMSI), mobile operator info and network type. This SIM card info can be easily shared by tapping on the share button or copied in the device clipboard.  GSM Signal Monitor logs  every signal related event in its notifications log. The notification log keeps information when the GSM signal is lost, restored or low. It also logs information when the mobile data is lost or roaming is active. You can configure whats logged in settings. The log can be exported in CSV, PDF and HTML formats.  You can monitor your signal strength as it changes dynamically from the app main screen or in the notification area.  Features:  Notifications when the signal is lost / restored  Notifications when you are in a low signal zone (available as in-app purchase)  Log events when data connection is lost or device enters roaming  Customizable log export in CSV, PDF and HTML formats. (available as in-app purchase)  Detailed SIM card info  4G (LTE) signal monitoring  Dual / multi SIM devices support (requires Android 5.1 or newer)  Quiet hours (the app can be configured to suppress its notification during specified time period)  Real time information about the GSM signal strength and quality in decibels (dBm)  Starting the app when the device starts  App shortcuts.  Great number of configuration options  !GSM Signal Monitor is NOT a signal booster app!  GSM Signal Monitor web page: http://vmsoft-bg.com/our-products/gsm_signal_monitor/  Thank you for choosing GSM Signal Monitor & SIM Card Info, we hope you like it! Let us know what you think in the review section or drop us a quick e-mail at support@vmsoft-bg.com  You may also: Like us on Facebook (https://www.facebook.com/vmsoftbg) Follow us on Twitter (https://twitter.com/vmsoft_mobile) ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_PHONE_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FULL_SCREEN_INTENT', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.USE_FULL_SCREEN_INTENT', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}