{
"name" : "CPU Cooler - Cleaner  - Booster - Fast Charging",
"url" : "https://play.google.com/store/apps/details?id=phonecooler.cpucooler.coolermaster.batterycooler",
"package" : "phonecooler.cpucooler.coolermaster.batterycooler",
"category" : "Tools",
"description" : "CPU Cooler - Cooler Master is a free app to cool down android CPU and cool down phone temperature for android professional manner and quickly. CPU Cooler can help you clean junk files, speed up and boost up your charge time. Is your phone running slower and slower? CPU Cooler is the perfect choice to clean RAM, improve device performance & boost your Android device speed!  CPU Cooler highlights features:  Clean and optimize storage space  Make phones faster than ever  Keep private app and data secure  Extend battery life with one tap   Drop phones temperature fast   Device information  Battery Information.  CPU information.  Manage Application and Apk file.  Game booster.  CPU Cooler capabilities:   CPU Cooler - Phone Cooler - Cooler Master  CPU Cooler will dynamically analyze and optimize your CPU usage. Find overheating apps and stop them to cool down your phone temperature.   Junk Cleaner Junk Cleaner helps to analyze all the log files, temporary files, history files, big file and AD files, and then recommend to clean those useless residual junk files to release more storage of mobile phone. Also, clean apk files after app is installed to release space.   Memory Booster - RAM Booster The excessive use of RAM makes your phone heavy. With just one click, Memory Booster can free up RAM and makes the phone lighter & faster. Memory Booster works smartly, making the Android user experience more comfortable.   App Manager CPU Cooler is the perfect Android app manager, giving information on apps that are not used based on usage. You can manage and uninstall apps that are rarely used to provide more storage space that can speed up Android. Analyzes and manages the status of apps intelligently. Manage APK file can help you find and manage apk file.   Battery Saver - Battery Optimise Save your battery power and optimize battery usage with just one Tap. CPU Cooler can analyze battery usage status and helps to find and stop battery-draining applications.   Game Booster CPU Cooler can analyze memory usage status and optimise help game smoother game.   Fast Charging CPU Cooler can analyze charging process and optimise help reduce charging time.  If you like our application, please rate five stars!  Wed love to hear any suggestions, questions or comments. You can mail us for support at feedback.flashalertsstudio@gmail.com Official website: https://sites.google.com/view/flashalertsstudio ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.WRITE_SETTINGS', 'android.permission.GET_PACKAGE_SIZE', 'android.permission.CLEAR_APP_CACHE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.VIBRATE', 'android.permission.REQUEST_DELETE_PACKAGES']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}