{
"name" : "Phone Clone: Transfer data to new phone",
"url" : "https://play.google.com/store/apps/details?id=phone.clone.transfer.data.innovagic.technologies",
"package" : "phone.clone.transfer.data.innovagic.technologies",
"category" : "Tools",
"description" : "Phone Clone, the data transferring and sharing application, gives you an opportunity to switch your mobile without losing your important data on old device. It lets you transfer Contacts, Messages, Recordings, Calendar events, photos, music, Videos, Documents and Applications from your old phone to new android phone. Its a cross generic android platform application meaning your old phone and new one can be of any company or any android device. Core Features of PhoneClone app: 1. Hassle Free Transfer: Transfers calendar, contacts, images, audio files, video files, documents and applications data without rooting the device. 2. Smart Share: Full data transfer, simple operation, super-fast speed, free and secure. 3. Transfer Everything: Ability to export complete data from old phone to new android device. 4. Cross generic android platform compatibility: Our latest data transferring application allows you to transfer data from any companys device to any new phone. 5. Security: Uses personal Wi-Fi hotspot and QR code for secure and fast connection. 6. Complete liberty: Complete liberty and easy way to choose what to transfer and what not to. 7. Data synchronization: Complete synchronized mechanism. All selected data information is also displayed on receiver device to know whats going to be written on new phone.  If you want to switch to new android phone and you have important data on old one, then Phone Clone is best application which can transfer all necessary data to new phone. Phone Clone uses latest android functionalities to transfer data with unmatched speed, reliability and security. It user QR code and QR barcode scanner to read Wi-Fi hotspot details to form a secure one to one connection. If you want to lose some unnecessary stuff present on old phone, you have complete liberty to choose what files should be sent and which file should be left unsent. Moreover this all data transferring application keeps receiver synchronized while data is being chosen on sender end so that receiver remains informed of what kind of data files are going to be written on it. Simply open the application on both the phones, select role of device, scan the QR code displayed, or enter ssid and key manually to connect and start securing the data to new device. Sounds simple isnt it? If your previous phone cloner is not working, this is the way forward for you as File sharing has become easy with this new remote phone cloning application. Hassle of transferring data to new mobile is thing of past now as new features of this new file sharing software will make your life easy when it comes to data and contacts sharing to newly bought phones. Phone switching is made easy. So, be it image transfer or videos sharing this app acts as file sharing application and phone cloning app as well.  Permissions: 1. Read & Write Calendar  app needs permission to access your calendar dates so that it can write the accurate date reminders to your new phone. 2. Read & Write Contacts  it needs permission to access your contacts so the app can transfer you contact list to your new phone. 3. Read & Write Storage  it needs to access your phone storage to transfer your storage file i.e. audio, video etc. files to your new phone. 4. Location  location permission is required to enable the hotspot as location is mandatory for hotspot. 5. Camera  it needs to access your camera to read the QR code. 6. Write System Settings  it will take this special permission on the run time to enable the hotspot/ Wi-Fi on/off. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_CALENDAR', 'android.permission.WRITE_SETTINGS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.NETWORK', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CALENDAR', 'android.permission.GET_ACCOUNTS', 'android.permission.NETWORK', 'android.permission.DISABLE_KEYGUARD', 'com.android.vending.BILLING', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_CALENDAR']",
}