{
"name" : "Phone & Home Shield",
"url" : "https://play.google.com/store/apps/details?id=phonehome.shield",
"package" : "phonehome.shield",
"category" : "Tools",
"description" : "Phone & Home Shield is an mobile antivirus for Android smartphones. The mobile antivirus protects your phone from malware, viruses and similar threats. Your smartphone will be safe and clean with just one click. Phone & Home Shields algorithms scan your files and folders for potential threats endangering your phones files and general health, covering both the phone and external memory card if present. The scan areas, time, and date, are all configurable, providing you full control over the application and settings. The app features an active protection mechanism, watching your safety 24/7 at all times. Phone & Home Shield also features an advanced app-behavior analysis that determines which apps on your phone are more likely to cause you trouble, but not only that, it also gives you the control over each action those apps can take. On top it all off, Phone & Home Shield utilizes a super-light detection engine that doesnt affect your phones optimal performance and battery life.   Phone & Home Shield Features   Virus Protection  Phone & Home Shields primary function is to protect your phone from any potential virus attacks with exceptionally high detection rate.    Real-Time Protection  Thanks to its advanced algorithms Phone & Home Shield is always on top of every rising threat informing you about potential danger instantly.   Scheduled Scans  Automate the app to run recurring scans and analysis automatically.   Automatic Updates  Its well-known that the source of most attacks is outdated applications. Phone & Home Shield keeps itself updated automatically at all times.   Detailed Reports  After each scan, youll be provided with a report of any detected threats.    Privacy Advisor - Monitor the permissions of the apps installed on your device, categorize them by danger level and remove them from inside the app if needed. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}