{
"name" : "Gallery HD",
"url" : "https://play.google.com/store/apps/details?id=photo.album.hd.gallery.quickpic",
"package" : "photo.album.hd.gallery.quickpic",
"category" : "Tools",
"description" : "Gallery HD is the best choice to manage your photos and videos because of HD Photo Gallery has smart album category, set Password-protect your photos, stylish design, powerful photo editor, easy photo collage and so on. Gallery is an excellent, full featured app for organizing your photos, it is a smart photo gallery, format galleries, collection Gallery.  Gallery is designed as all in one for photo view, photo edit and photo collage maker app. It must can bring you an amazing experience in your photos and videos management! Gallery can meets you all your photo gallery needs, display them slide-show style, share photos via email or social networks.  HD Quality & High Performance:You can enjoy your photos and videos in a HD quality as everyone want to. But the photo gallery strives to possess a high performance in the meantime. It can be adapted to Android 8.0 system to provide you with the latest experience!  Smart Album Category:HD Photo Gallery set smart album category so that you can view your favorites, watch your videos collection, take your collages quickly and record photos with locations in one gallery more convenient. And you can sort your customized albums by multiple ways and set different views.  Safe Encrypt Album:You can set a password and make your privacy in an encrypted album to protect your photos and videos in a safe way.  Stylish Design & Colorful Skins:The photo gallery is designed with a refreshing UI and six beautiful skins. You can choose your favorite color to make your exclusive photo gallery.  Powerful Photo Editor:Auto optimization, free trimming, stylish filters, multiple adjustment ways, modern mosaic and doodling, these powerful photo editing features can fulfill all of your photo editing as far as possible.   Excellent Photo Settings:Two distinctive viewing ways combined and cool slideshow as your screen-saver, it must will give you some surprise when you are using the gallery. And you can also set, rename, move and copy your photos or share with your friends through different ways.  Gallery is A fast, light, private and modern photo gallery which can smart manage your photos and videos! Hope you can enjoy the app HD Photo Gallery in your photos & videos management! If any problem exists, feel free to feedback to us! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SET_WALLPAPER', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS']",
}