{
"name" : "Best Tuner",
"url" : "https://play.google.com/store/apps/details?id=pl.netigen.toolstuner",
"package" : "pl.netigen.toolstuner",
"category" : "Tools",
"description" : " Precision tool that quickly will help you tune your guitar or other music instrument  Designed and tested by professional musicians  Perfect both for professionals and amateurs  Three modes: Auto, Sound and Play  Best Tuner is an easy-to-use application with which you will be able to tune your guitar or other music instruments quickly. Tuner includes sets of sounds characteristic for different types of instruments: - Guitar, Standard, - Guitar, Drop D, - Guitar, Open D, - Guitar, Open G, - Guitar,Open A, - Guitar, 4 string bass, - Guitar, 5 string bass, - Banjo, - Ukulele, soprano, - Ukulele, concert.  The algorithm in tuner has been adapted to recognize sounds of instrument most effectively. To get the best result of automatic tuning, play the sound few times.  Best Tuner has three modes: auto, sound and play.   Auto  automatic tuning - examined frequency of the signal is interpreted to the next clear sound of the specific frequencies of pure sound,  Sound  sound tuning - select a specific sound that will be tuned,  Play  generate the sound based on the particular frequency.  Features: - recordings of real sounds of guitar, - the ability to set different sound names: American, European and solmization, - sets of strings characteristic for different types of guitars, - the ability to set the frequency of sound a (concert pitch) in Hz, - the ability to determine the deviation from the base frequency in cents.  If you will have any problems with Best Tuner, please contact us: mobile@netigen.pl. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}