{
"name" : "Unicorn Alarm Clock",
"url" : "https://play.google.com/store/apps/details?id=pl.netigen.alarmclock.unicorn",
"package" : "pl.netigen.alarmclock.unicorn",
"category" : "Tools",
"description" : "Problems with waking up? Always being late? Sleep disorder? We got something for you!   Unicorn Alarm Clock  waking up will be much more pleasant with our beautiful design app with unicorn. Feel magic and start a new, great day!   Choose your favourite alarm: loud signal or soothing, relaxing melody. Select one of the smart way of disabling the alarm.   Ways of disabling the alarm:  Standard. Just turn off the alarm.  Solve a math problem. It can be hard; it can be easy  you choose. But we hope you are good at math!  Shake your phone. Set the number of shakes and shake like crazy in the morning! Morning exercises!  Catch the ghost. This little guy will be running on your screen  tap on him to disable the alarm.  We have a lot of energetic, extremely loud tunes, that will wake you up immediately and pleasant alarm sounds, if you dont need strong impulses to get out of your bed.    Unicorn Alarm Clock consist also a collection of calming, relaxing music, that will help you fall asleep. Our music will provide you a good, healthy sleep  you will wake up fully rested and ready for a new challenge. You will love our lullabies! Unicorn Alarm Clock will help you fix your sleep cycle.  Features:   Reliable  Extremely loud alarm sounds or pleasant melodies  Snooze time - choose how long will be your nap  Date - set up a specific date  Repeat - choose days  Manage alarms  Easy to use  Four smart ways to disable the alarm  Calming lullabies  Beautiful, magic, glitter, pink design  Great app for girls. Application is suitable for kids and teenage  Its all for free!   With our app, every morning will be good morning! Awake with magic unicorn!  This free Unicorn Alarm Clock will be the best choice for sure! Every girl will loves it!  If you need any help with Unicorn Alarm Clock, please contact us: mobile@netigen.pl  All rights reserved ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}