{
"name" : "Floating Calculator Free",
"url" : "https://play.google.com/store/apps/details?id=pnapp.pncalc.free",
"package" : "pnapp.pncalc.free",
"category" : "Tools",
"description" : "The calculator appears in front of any application running on your device. You can interact with any contents behind it, move it into any place on the screen or hide the calculators keypad.  Features  Simple and familiar interface of desktop calculator  Memory functions (MS, MR, MC, M+, M-)  Percentages  Mathematical functions (square root, 1 over x, round down, )  History of calculations with up to 5 items, ability to hold and restore items  In paid version  Parentheses  Copy to clipboard  Paste, paste one at choice  Much more math (sin, cos, tan, arcsin, arccos, arctan, sinh, cosh, tanh, square, cube, x powered y, exponent, power of ten, square root, cube root, x root y, natural logarithm, common logarithm, 1 over x, factorial, round half from zero, round down, )  Five user defined buttons  Up to 50 history items  Ability to share the results of calculations  Usage tips  Drag the display to move the calculator to any location on the screen  Click the display to hide or show the keypad  Use menu button on the displays left side for additional functions (make the calculator fullscreen and transparent, set its size, hide green buttons, switch haptics)  Memory button changes its behavior depending on context, but all memory functions are available by long press the button  Backspace and clear functions are switched automatically. Hold down the backspace button to clear the display at any time  Close button minimizes calculator into the notification area, so you can launch it again from within another application. Hold it down or use the menu Exit to close calculator without that notification  Click on calculators icon while it is on the screen and calculator will be minimized into the notification ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}