{
"name" : "Free QR Scanner - Barcode Scanner, QR Code Reader",
"url" : "https://play.google.com/store/apps/details?id=qrscanner.barcodescanner.barcodereader.qrcodereader",
"package" : "qrscanner.barcodescanner.barcodereader.qrcodereader",
"category" : "Tools",
"description" : "Extremely fast QR & barcode scanner that supports all QR & barcode formats! Its the must-have scanner app for all Android devices.  Its very easy to use, no need to press any buttons or adjust the zoom, just open it and point to the QR code, it will auto recognize, scan and decode the QR code. After scanning, several relevant options for the results will be provided, you can search the products online, visit the websites, or even connect to Wi-Fi  without entering the password...  QR code reader can scan and decode all kinds of QR code and barcode, such as contacts, products, URL, Wi-Fi, text, books, E-mail, location, calendar and so on. It is also commonly used to scan promotion and coupon codes in shops to get discounts.  Features: *Safe & easy-to-use scanner app *Instant scan *Privacy safe, only camera permission required *Price scanner *Support scan QR & barcodes from gallery *Scan history saved *Flashlight supported *Auto zoom *No internet connection required  How to use: 1. Open the scanner 2. Point the camera to the QR code/barcode 3. Auto recognize, scan and decode 4. Get results and relevant options  Support all QR & barcode formats QR code, Data Matrix, Maxi code, Code 39, Code 93, Codabar, UPC-A, EAN-8...  Scan history saved All scan history will be saved for instant viewing at anytime.  Price scanner You can scan product barcodes and compare prices online.  Auto zoom No need to adjust the zoom, its easy to scan far away/small QR code and barcode clearly.  Flashlight supported Easily scans QR code/barcode in dark environment.  QR code scanner Want QR scanner and QR code reader? Looking for QR code scanner? No satisfied QR code scanner? Try the best QR scanner and QR code reader! This QR scanner and QR code reader support all QR & barcode formats.  Barcode scanner The easy-to-use barcode scanner for Android devices. Its your must-have barcode scanner.  QR reader for Android Want to find a full-featured QR reader for Android? Here it is! QR reader for Android supports all QR & barcode formats and supports more than 10 languages.  Barcode reader and scanner  This one-in-all barcode reader and scanner allows you to scan all types of barcode, QR code, and coupon code. Its the best barcode reader and scanner that you deserve.  Scan QR code Need a scanner app to scan QR code and barcode? This light-weight scanner app is your best choice! Scan QR code fast and safely!  QR code scanner app Looking for a QR code scanner app to scan barcode or QR code? Try this free and accurate QR code scanner app!  QR code reader and scanner This is the best QR code reader and scanner that you can find. Try to use this QR code reader and scanner to scan all kinds of QR codes and barcodes.  QR code scanner for android Want a powerful QR code scanner for Android? This is your best choice. This powerful QR code scanner for Android allows you to scan all kinds of QR codes and barcodes.  Barcode Scan The QR & barcode scan only needs one step: auto-detect QR code and barcode as long as open the app. Free QR & Barcode Scanner brings extreme fast barcode scan experience to you.  Barcode scanner app This barcode scanner app supports all barcode formats. You can also create your own QR codes with this barcode scanner app.  Barcode scanner for android This small size barcode scanner for android can scan barcodes and QR codes fast and safely. Download this barcode scanner for android for free now.  Barcode reader Want a free barcode reader to scan all types of barcode or QR code? This barcode reader is worth a try!  Barcode scanner app free Superfast barcode scanner app free for all Android devices! Scan all barcodes and create your own QR codes with barcode scanner app free.  QR code scanner for school books This QR code scanner is also a QR code scanner for school books. Download it and scan school books with this QR code scanner for school books. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}