{
"name" : "Rajasthan High Court eServices",
"url" : "https://play.google.com/store/apps/details?id=rajasthan.rajhc",
"package" : "rajasthan.rajhc",
"category" : "Tools",
"description" : "1. Cause List may be viewed or downloaded by Court Number, Honble Judge Name, Case Number, Advocate Name, Petitioner or Respondent Name. 2. Live Display Board for at a glance view of the cases taken up in all the Courts. 3. Filing & Defect Status of newly filed cases in centralized filing section, whether the case is passed or is under defect and the listing date. 4. Case Status may be checked by Filing Number, Case Number, Advocate Name or Party Name. Related Judgment/Orders can be viewed or downloaded. 5. Certified Copies status viz. under process, under defect, prepared, delivered etc.  6. Judgments/Orders may be viewed or downloaded through multiple parameters search like Case Category, Date Range, Honble Judge Name, Advocate Name, Party Name and Bench Type. 7. Free Text Search on the contents of Judgment/Orders with following advanced search features-   Exact - It will search the exact word or string.  Any - It will search all or any of the words including similar words.  All - It will search all the words including similar words, may be at different places in the judgment/order.  Boolean - Boolean is a kind of advanced search. Following Boolean operators may be used in CAPITAL letters between the searched words-  AND for inclusion  OR for alternative  NOT for exclusion Search word or string will be highlighted in the judgment/order. 8. My Diary   User may save the desired cases in My diary.  Updation of My Diary - The My diary will get automatically updated every day when the app will be opened first time. The user may also update the My Diary anytime by using Update All option. Search of cases in My diary - Cases saved in my diary may be searched by Party Name, Advocate Name, Case Number, Pending/Disposed or date wise.  New Judgment/Order - If any new judgment/order will be uploaded in any of the case saved in My Diary after last updation, the same will be highlighted with flag of New Judgment/Order. This flag is displayed until user taps the case to see the details.  The above features are available both for Rajasthan High Court, Jodhpur and Jaipur. The user may choose any one and can at any time change it also. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE']",
}