{
"name" : "RC Car GearCalc",
"url" : "https://play.google.com/store/apps/details?id=redscrew.gearcalc",
"package" : "redscrew.gearcalc",
"category" : "Tools",
"description" : "GEARING Proper gearing is one of the most essential tuning options required to maximize the performance potential of a touring car. The key to proper gearing is finding and maintaining the best rollout for each track environment, motor/chassis setup and driving style. Rollout is the distance a car will travel in one revolution of the motor shaft. Pinion and spur gears are used to generate the rollout desired, considering the diameter of the tires mounted. Rollout determines top speed and acceleration. Usually a higher rollout will provide less acceleration and more top speed, and a lower rollout will be quicker off the line, but with less top speed.   TRANSITION RATIO  The transition ratio is the ratio of all the internal gears from the transmission, including differentials and pulleys. The transition ratio is usually different for each model of car. Your owners manual should provide this information, but keep in mind that some manufacturers use the words transmission reduction to indicate the transition ratio. The transition ratio in most cases cannot be changed, unless you are able to change the number of teeth on the pulleys and/or gears.  PRIMARY DRIVE RATIO The primary drive ratio is the ratio between the pinion and spur gear. This number is commonly rounded up to the nearest thousandth after the decimal point.  FINAL DRIVE RATIO The final drive ratio is the ratio between the transition ratio and the primary drive ratio.This number is commonly rounded up to the nearest hundredth after the decimal point.  ROLLOUT Rollout is the distance that the car moves forward for one revolution of the motor shaft (or pinion gear). Rollout is not affected by the motor, batteries, or electric components you are using; it simply defines how all of the gears, belts/shafts and tires work together to make the car accelerate and reach top speed. Rollout is calculated using the circumference of a tire and therefore the diameter of both foam and rubber tires make a difference. The diameter is more important if using foam tires since they can be used with a diameter anywhere from 64 mm down to 54 mm. As foam tires wear and get smaller, your rollout value will change a lot more quickly. Rubber tires do not wear down nearly as quickly or as much so the change to rollout will be very small over time. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}