{
"name" : "Faceit Assistant",
"url" : "https://play.google.com/store/apps/details?id=robin.vitalij.faceitassistant",
"package" : "robin.vitalij.faceitassistant",
"category" : "Tools",
"description" : "F Assistant is a mobile application that allows for viewing and analyzing Faceit users statistics. It is an indispensable assistant for the platforms players.   Download the app and get instant access to the most important Facit data.  Pay attention! The app supports the following games: Cs Go, PUBG, Battalion, Dota 2, League of Legends , World of tanks.  Players profile All the players information, from ELO rating to your average winning percentage. The data is supplemented by graphics, so that you could easily monitor your game progress. View the characteristics and rates of your maps and heroes for the chosen period of time, as well as the all-time statistics.  Comparison of players We are glad to provide you with an opportunity to compare your achievements against other players. With this option, you can see, who plays better on a specific map or hero. We currently support this comparison for the list of games noted above.  Competitions Are you familiar with the situation, when you urgently need to know about the upcoming tournaments, hubs, championships or organizers, but your laptop is not nearby? Now we have a solution! A full-fledged competitions block right in your pocket. Wherever you are, you can access the whole information about the upcoming events.   Faceit mobile application is your best assistant that allows to access real-time Faceit data wherever you are and at any time needed!   Note that for proper operation of some specific features and screens, working internet connection is required. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}