{
"name" : "Sensor Test",
"url" : "https://play.google.com/store/apps/details?id=ru.andr7e.sensortest",
"package" : "ru.andr7e.sensortest",
"category" : "Tools",
"description" : "Your can test sensors in your smartphone.  Supported sensors: - Accelerometer - Light sensor - Proximity sensor - Magnetometer - Gyroscope - Barometer (pressure sensor) - Compass   If sensor registered in system, it will be have green indicator, otherwise it will be red.  If sensor not report any data, it will be with label no data on sensor test screen. Than most situations it means that devices doesnt have it type of sensor, for other case it not working.  Showed total available sensors count. When press to it opened list of the sensors. You can test all of them with graph view.  Also useful for developers, who build custom kernels.   Details:  ---------------  Accelerometer - measures acceleration along three axes x, y, z; units measurement: m/s^2  When oriented along the axis, the normal value is equal to the gravitational acceleration (g = ~ 9.8 m/s^2). With the horizontal position of the device, the values along the axes: z = ~ 9.8 m/s^2, x = 0, y = 0).  Practice: Used to automatically change the orientation of the screen when you rotate the device, in games, etc.  Description of test: Test football. When the device is tilted, the ball should move in the direction of inclination. Try to score the ball into the goal.  ---------------  Light sensor - measures illumination; units measurements: lux.  Practice: Used to automatically adjust the brightness (auto brightness)  Description of test: Test with lamp. When increasing the illumination, the glow around the lamp changes from white to bright yellow. Move device to the light or, on the contrary, go into a dark room. Approximate typical values: room - 150 lux, office - 300 lux, sunny day - 10,000 lux and above.  ---------------  Proximity sensor - measures the distance between the device and the object; units measurement: cm. On many devices, available only two values are available: far and close.  Practice: Used to turn off the screen when you call by phone.  Description of test: Test with lamp. Close the sensor by hand, the light goes out, open - light up.  ---------------  Magnetometer - measures the magnetic field readings in three axes. The resulting value is calculated based on them; units measure: mT  Practice: For programs like compass.  Description of test: Scale with level, which showing the current value. Move device close to a metal object, the value should increase.  ---------------  Gyroscope - measures the speed of rotation of the device around the three axes x, y, z; units measurement: rad/s  Practice: Used in various multimedia programs. For example, in a camera app to create panoramas.  Description of test: Shows a graph of the speed of rotation along the x, y, z axes. When stationary, values tend to 0.  ---------------  Barometer (pressure sensor) - measures atmospheric pressure; units measuring: mbar or mm Hg. (switch in settings)  Description of test: Scale with level, which showing the current value of pressure.  Normal atmospheric pressure: 100 kPa = 1000 mbar = ~ 750 mm Hg. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}