{
"name" : "Device Info HW",
"url" : "https://play.google.com/store/apps/details?id=ru.andr7e.deviceinfohw",
"package" : "ru.andr7e.deviceinfohw",
"category" : "Tools",
"description" : "Device Info HW is a hardware and software information app for Android devices.  App trying detect components of your smartphone to provide complete information about devices hardware. Now detection is supported for lcd, touchscreen, cameras, sensors, memory, flash, audio, nfc, charger, wi-fi and battery; if that possible for your device.  I think app is interesting and useful for users and developers who build kernels or android.  App has a quick navigation, fresh design. Also supports dark, black theme (in PRO version or 2 week in free) You can switch by tab or use navigation panel. Many items are clickable and you can go to another tab or menu.  On recent devices begin android 7.0 reading some information blocked, and with new android releases some vendors blocked much more information. App trying provide maximum information as possible. If you have root, app can read more (turn on in settings)  Components  LCD - model. For recent android detection require root. Also you can check the colors in lcd test.  Touchscreen - show model, also you can check how much fingers are supported in multi-touch test.  Camera - model, vendor, resolution If cant detect, sometimes available a list of supported cameras. Hardware info by camera model and software by API. For 5.1+ used camera2 api by default, if you grant camera permission, it will be use old api.  Detailed info about SoC in you device CPU : model, cores, clusters, family, abi, governor, frequency. GPU : model, vendor, opengl, frequency, list of extensions. Click on the clock speed to open CPU monitor.  System: complete info about your firmware build.  Memory: type lpddr and for some devices operating frequency. Flash: chip and vendor emmc or ufs (scsi). You can go to the memory tab and see usage of memory and storage.  Battery: base info and for some devices available extra info: - Discharging speed is current consumption - Charging speed is charge current minus current consumption - Power profile - encoded by manufacturer for calculate consumption * Kernel profile * Model   Thermal: temperatures by thermal sensors.  Sensors: availability of basic sensors and tests for them.  Drivers: you can find other chips used in your device.  Partitions: list of partition and their sizes.  PMIC: list of power regulator voltages which applied to the components.  Input devices: list of input devices.  Applications: you can quickly find apps and see info about it, also provided system apps  Extra options: - Show i2c address of the chip - Open engineering menu for mtk and xiaomi - List of CPU codenames for Qualcomm, mtk, HiSilicon  Devices database  You can find info for other devices, compare and check similar drivers. It available on web page: deviceinfohw.ru Also you can upload your device info. See to the Info Center.  PRO VERSION  Theme  Supports all a light, dark and black theme, choose what you like. In the free version, dark available 2 weeks for the test.  Report  You can create a report with information about the device. It will be saved in file. Support HTML and PDF. You can open it or send to email by share button. See example: deviceinfohw.ru/data/report_example.html  Device list  List of i2c, spi devices. Its useful when available many chips or they uncategorized.  App Defender for protect your copy.  Also this supports development to improve app.  Supported platforms: full: Qualcomm, Mediatek, Exynos, Rockchip, HiSilicon basic: Intel, Spreadtrum and other  Note: Not for all devices can read drivers info, its depend on soc, vendor. If you want help, then upload your device info.  If you want translate app for your language or have interesting ideas or found bugs, write me to email or forum.  Requirements : - Android 4.0.3 and above  Permissions : - INTERNET is required for upload device info. Its use only for manual upload. - CAMERA is required for getting camera software characteristics for old camera api. - ACCESS_WIFI_STATE is required for info about wi-fi connection. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
}