{
"name" : "PDF Reader & Viewer",
"url" : "https://play.google.com/store/apps/details?id=ru.androidtools.basicpdfviewerreader",
"package" : "ru.androidtools.basicpdfviewerreader",
"category" : "Tools",
"description" : "Want to know why you need this PDF Reader for your device?  * PDF Reader & Viewer is an application for reading ebooks and PDF files, PDF documents, a good office tool in your device. * Automatic recognizes allows PDF Reader to display all device formats: PDF, Djvu, FB2, epub, rtf, doc, cbz, cbr, html, xml, awz3, mobi. * You can read ebook, PDF files and PDF documents offline. * Using PDF Reader for free! * The size of the APK file is 3 MB, compared to similar applications it is several times smaller, sometimes less than 10 times.  The features PDF Reader & Viewer:  * SEARCH AND READ PDFs: The app will quickly read the PDF documents you are looking for, without wasting time searching for them in your phone, because the reader stores and displays all your documents in one place. The tool allows you to filter the list of office folders where the application will scan files of different formats. In PDF Reader, you can set up a filter for the formats that you want the app to display.  * READING PASSWORD-PROTECTED DOCUMENTS: Supports the function of recognizing and reading a document that is protected by a password. If you send confidential documents that are not intended for public access, PDF Reader & Viewer will read the documents.  * EASY NAVIGATION: Navigation and menu PDF Viewer allows you to quickly navigate the large functionality of the tool. The simple interface of PDF Reader allows you to open PDF documents and e-books you need in one touch, rename, delete, zoom, and see the detailed properties of the document.  * SEARCH FOR A DOCUMENT AND ITS CONTENTS: If you have a large number of files, you can easily find them using the Search function in the PDF document management interface. PDF expert supports The search by document content function.  The document table of contents function makes it easy to navigate by the document content. Fast page navigation is implemented using the scroll bar.  Enter the page number of the book and go to it.  * CONVERT PDF TO VIDEO AND PDF TO IMAGE: PDF Reader & Viewer provides a transition to an application that allows you to convert PDF to image & PDF to video.  In order to keep PDF Viewer easy, we offer in the reader a free transition to another of our applications that specializes in converting files.  * OTHER POSSIBILITY: Share files and favorite e-books with your friends and office colleagues via email or any messenger. Configure convenient reading of a PDFs, the ability to go to the first or last page of the document, screen rotation, vertical, horizontal and scalable scrolling, and other tools.  In the work of office employees working with business papers, conducting business correspondence via PDFs, PDF Reader will be an excellent assistant. The app automatically recognizes new documents when you start and offers to open the document sent to you using PDF Reader. You can also install the program for recognizing PDF files (Basic PDF Reader) by default in the settings of your Android device.   PDF Reader for Android will also be a great assistant and friend to all our dear and beloved users. If you actively read books in PDF, like to view charts, graphs and diagrams in historical or statistical documents, or just sometimes you need to open an air ticket that is sent to the ticket buyer in PDF format, then the PDF Reader app will perfectly fulfill all the tasks that you assign.  You can disable ads in the app for a nominal amount, so you help our project! We are open to your suggestions and suggestions! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}