{
"name" : "Kaomoji ☆ Japanese Emoticons",
"url" : "https://play.google.com/store/apps/details?id=ru.kaomoji.kaomojiapp",
"package" : "ru.kaomoji.kaomojiapp",
"category" : "Tools",
"description" : "A few words about Japanese emoticons  Kaomoji () is a popular text emoticons style initially emerged in Japan and later successfully proven all over the world. Unlike regular emoticons, there is no need for kaomoji to be read sideways. So they look much more natural. There is a great variety of Japanese emoticons. Having evolved from anime and manga, they are capable of transmitting all set of emotions, a variety of actions, objects, and more. If you want to know more about kaomoji, please visit Japan or our website: http://kaomoji.ru/en/ How to use The app includes a large collection of Japanese emoticons (kaomoji) grouped into categories and subcategories for easier navigation and search. Just choose the emoticon you like and it will be automatically copied to clipboard and become available for use in text messages, social networks and wherever you want. To paste an emoticon from clipboard tap and hold the screen in any text box (for example, when writing a message) and then tap Paste.  The app also has Japanese emoticons editor which allows you to create your own collection! Each emoticon can be added to Storage (improved Favorites) either from Editor (with the button) or directly from subcategories (using the context menu). To remove an emoticon from Storage tap and hold the screen and then tap Remove. Simple as that! (^_<) ~  Features 1. Easy to use, fully functional and kawaii!  ~ (^) 2. Allows to create Japanese emoticons. 3. You can add emoticons to Storage. It is an advanced Favorites version. 4. Can be attached to the notification bar. A cute greeting included. 5. Multilingual. Your language is automatically detected by the system. 6. Optimized for both vertical and horizontal orientations of the screen. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}