{
"name" : "Mail.ru Portal",
"url" : "https://play.google.com/store/apps/details?id=ru.mail.portal",
"package" : "ru.mail.portal",
"category" : "Tools",
"description" : "A light and convenient app that brings all your favorite Mail.Ru services into one screen. View the weather, check your mail, find out the dollar or euro exchange rate, and read the latest news  its very simple with the Mail.Ru Portal app.    We really want to know your opinion! You can send any questions, suggestions, and comments to we.apps@corp.mail.ru, and well try to answer you as soon as possible.    Advantages of the app:  1. Lightweight and memory-saving. Mail.Ru Portal is fast and stable on any smartphone running Android version 5.0 and higher. Whats more, it takes up very little space (only ~10 MB). 2. Mail, VKontakte, Odnoklassniki, News, TV  all of Mail.Rus helpful services can be found on the apps main screen and are just one tap away.  3. Quick search. Mail.Rus built-in search engine will help you find answers to any question. You can search in different categories of content: video, images, or news. Search suggestions will help you refine your query and save time. 4. The news feed will pick up loads of articles on interesting topics: sports, cars, technology, politics, humor, and the economy. The feed adjusts itself based on how you interact with it. In time, it filters out the articles you arent interested in, and shows you more and more of what you do want to see. 5. Versatile settings. You can turn off the feed if you dont use it. You can also choose a beautiful background that suits your mood.  The Mail.Ru Portal app is compatible with Android version 5.0 and higher. The app has been tested on the following phones: Huawei P-Series, Samsung Galaxy Series, Xiaomi Mi Series, HTC One, Sony Xperia Series. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET']",
}