{
"name" : "Counter - Thing counter app, tally counters widget",
"url" : "https://play.google.com/store/apps/details?id=ru.uxapps.counter",
"package" : "ru.uxapps.counter",
"category" : "Tools",
"description" : "Counter by UX Apps is a powerful and easy in use tool to count items, clicks, days, events or anything else. You can use many parameters, such as an increment/decrement value or max/min value, to make counting even more comfortable and effective. This app allows you to create several tally counters, sort them, organize in groups and a lot more. Also you can add counter widget to home screen for super fast counting.  Features:   Multiple counters and counter list overview  Custom actions (for ex. +10, +50, -100 etc.)  Fullscreen mode (sound, vibration and TTS supported)  Detailed statistics  Tags to easily organize tally counters into groups and easily navigate between them  Custom sorting by dragging  Grid and list view  Dark theme (premium feature) - perfect night mode  Totally dark fullscreen mode (premium feature) - saves your battery  Count items and clicks using hardware volume buttons  Fast counting mode with customizable speed (to activate it just long press on +/- button and hold for a while)  Cool sound effects for clicks  Display always ON mode to prevent your device from going to sleep   Group operations (count, delete or reset several counters simultaneously)  Counter widget support (widgets are resizable)  Negative values support  Max and min value limits  Custom colors  Super fast performance  Modern material design  No unnecessary permissions required  We care about your privacy  Small app size (we care about your disk space)  Need a simple and robust click counter app with widgets? Try it now! ",
"desc_perms" : "['android.permission.vibrate']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}