{
"name" : "World of Tanks Assistant",
"url" : "https://play.google.com/store/apps/details?id=ru.worldoftanks.mobile",
"package" : "ru.worldoftanks.mobile",
"category" : "Tools",
"description" : "Giving access to the most important statistical information from the battlefield, this is the app youll check daily to track your progress and keep up with game events.  Note! This app doesnt support Xbox 360 Edition and Blitz accounts.   Player Profile Everything from personal rating to assisted damage, complemented by visual charts to help you get an in-depth view of your progress. Monitor stats of your vehicles for a certain period or overall time played. Learn more about the achievements!   Timeline We proudly introduce the Timeline! A perfect tool to stay in tune with your friends latest gaming activity, as well as to help commanders track their clanmates game progress. Battles count, current victory rate, and a lot more in a few taps.   Tankopedia How many times have you needed to check some tank characteristic and didnt have a PC around? We have a solutiona full-scale encyclopedia right in your pocket! Wherever you are, youll have a full tank knowledge database at hand. This feature will help to compare your favorite tanks and explore every characteristic of every vehicle, from armor and engine power to damage and view range.   Hall of Fame and Clan Ratings Interested in comparing your own in-game performance against those of your friends and clan mates? Youve come to the right place. Switch between four timeframes: overall, 4 weeks, 1 week, and 1 day, and view your ratings side by side with those of your friends and fellow clan members.   Our Clan Ratings will come in handy and help you track clan performance, no matter whether you are a fresh Recruit or a skilled Commander. Everythings at your fingertips!   Clan Wars Stay in touch with your clan status and struggle for territory on the Global map, and track your income and provinces. Analyze and decide which territory will be your next objective. Dont miss anything: weve got all your scheduled clan battles!    Share your triumphs with the world via social networks.   Follow the latest news!  This app is the best way to get the latest information, on the go, anytime, anywhere, and its free!  To use the app you need a working Internet connection.   App page North America: http://bit.ly/1zTPyed  App page Europe: http://bit.ly/1vjg7JF App page Asia: http://bit.ly/1Fm6ahM ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CALENDAR', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.VIBRATE', 'net.wargaming.mobile.permission.C2D_MESSAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'ru.worldoftanks.mobile.permission.C2D_MESSAGE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.READ_PHONE_STATE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.WAKE_LOCK', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'com.fingerprints.service.ACCESS_FINGERPRINT_MANAGER', 'android.permission.USE_FINGERPRINT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'net.wargaming.mobile.permission.C2D_MESSAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.fingerprints.service.ACCESS_FINGERPRINT_MANAGER', 'android.permission.GET_ACCOUNTS']",
}