{
"name" : "Bullion Test Free",
"url" : "https://play.google.com/store/apps/details?id=se.brolinembedded.bulliontestfree",
"package" : "se.brolinembedded.bulliontestfree",
"category" : "Tools",
"description" : "This app offers a cheap and easy to use method to help detect fake bullion coins, by examining their resonance frequencies.  The resonance frequencies of an object are determined by the objects shape and material. If the shape and weight of a silver coin is correct, but the material is not actually silver, then a resonance test could detect this. This is also known as a ring test or ping test.  Unlike the manual ring test, this app does not require that the user knows exactly how each coin should sound. The app will also detect resonance frequencies above the range of human hearing.  This youtube video shows how to use this app: http://www.youtube.com/watch?v=5pZnqp3bl3A  This free version supports three types of coins. Buy the full version to get support for many more coins.  How to use this app: 1. for best results you should perform this test in a reasonably silent room. Some electronic devices may produce high-pitch noises which could interfere with the test. 2. Select the type of bullion coin to test from the drop-down list. Currently only three types of coins are supported. 3. Press the microphone button to start the test. 4. Blue lines indicate the expected resonance frequencies of the selected coin. 5. Balance the coin on your finger, near the microphone of your smartphone. Tap the coin using your fingernail, or use some hard object. Do NOT use a second coin to tap the first one, since the sound from the second coin may affect the results. The sound level required depends on the sensitivity of the microphone in your Android device. For most devices is it sufficient to gently tap the coin with your fingernail. 6a. If the sound matches the expected resonance frequencies of the selected coin, you will see a green check-mark. 6b. If there is too much noise, or if the sound does not match the expected frequencies, then you will se a red cross. 6c. Some Android devices have microphones which are unable to record high frequencies above ~10kHz. If the app detects two out of three expected frequencies, it will indicate this with the fraction 2/3, and report that device limitations might be the reason why the last frequency was not detected. 7. Some practice may be needed to produce a clean enough sound from the coin. The app is sound-activated, you can tap the coin again to do another test.  Needed permissions: Record audio - To record the sound of the coin. Storage - Necessary to enable sharing of test results.  Disclaimer: There are no guarantees whatsoever regarding the function and accuracy of this app. There are many factors which could cause this app to report false positive or false negative results. This app should only be used to complement other testing methods, not replace them.  Forum thread for discussions and information about this app: http://forums.silverstackers.com/topic-38955-android-app-uses-resonance-test-to-detect-fake-silver-coins.html ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}