{
"name" : "Mobile Secret Codes 2020",
"url" : "https://play.google.com/store/apps/details?id=secretcodes.i_a_studi.free.mobiles",
"package" : "secretcodes.i_a_studi.free.mobiles",
"category" : "Tools",
"description" : "All Mobile Android Secret Codes Free contains secret codes of Acer, Asus, Bird, Benq, Blu, Hp, Sony, Lenovo, Motorola, BlackBerry, China, HTC, Karbonn, Verizon, QMobile, LG, MicroSoft/Windows, OPPO and Huawei Mobiles.  Check all common android secret codes include Network, GPS, Bluetooth, WLAN test, Firmware version information, factory tests, PDA, display the IMEI number, Super Mode, Service Menu, Check Update, Reset Device, Unlock the device, Recover Forgotten pattern, Engineering mode, GPS test mode, Machine information, Software Information, Hardware Information, Test Photograph RGB and much more.Now You can Discover the secret world of your Android and other OS base mobile! Devices. Some code of them may not work on specific devices, but you can still try them because their manufacturer does not allow them. When those codes are typed manually from the phone dialer or you can copy this code with long press on code and paste it on clipboard. There is also Functionality in the application to share with Social Apps.     All Mobiles Secret Codes Apps Features:  Repair Mobile  Problems of Mobiles  Other Android Codes  Device Type codes  Product Name codes  Country of Origin  Check Manufacturing Date  Color / Internal Storage  PDA Version  CSC Version  Check Baseband Version  Check Android Version  Check Build Number  Build Fingerprint, Description  Build Date, Change list  GPU (Graphics Processing Unit)  Modem Board  Hardware Revision  Check Total RAM  Sound Card  These secret codes can also be used for gaining access to the secret portal of the Android and its services. Check used Android phones before buying ,Detect manufacturer of the device, Detect the operating system version, know the hidden information on the camera, Make backup copies of your data. There are various symbolic or numeric sequences which easily allow one to gain access to the system settings for various usages  Disclaimer: After execute the hash code, your device might be effected. So keep backup your important data before execute hash code. We will not be responsible for any damage of your phone, no will be liable for any damage. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}