{
"name" : "App Lock & Photo Vault - Security Plus",
"url" : "https://play.google.com/store/apps/details?id=security.plus.applock.callblocker.lockscreen",
"package" : "security.plus.applock.callblocker.lockscreen",
"category" : "Tools",
"description" : " Applocker & photos Vault hide photos videos is the best Android app lock with privacy guard. Fast application locker pics vault with pin, pattern knock code and fingerprint apps lock.   Security Plus is fast app locking app that will lock your apps, hide photos, hide videos, all these features only in one application under one locker app.   Security Plus contains the best combination of security apps with Apps Lock and Gallery Photo Vault to lock and hide apps, photos.   With this apps locker security protection, your privacy is well secured with fingerprint lock.   Applock & Pictures Vault provides you overall privacy grantee. providing APPLOCK, GALLERY LOCK, VIDEOS LOCK, INTRUDER EMAIL, FINGERPRINT LOCK, NOTIFICATION LOCK, INCOMING CALL LOCK, LOCK-WATCH, CROOK-CATCHER and more privacy protection.   Lock Apps & Hide Pictures (photos)  App Lock & Hide Videos  Lock & Hide Photos  Block Calls  Lock Incoming Calls  Catch Crook (Thief)  Material Design UI  Key Features :  AppLock  lock apps containing private data with pin, pattern, knock Code & fingerprint lock.   App Locker Photo Video Vault  Hide pictures, videos, files, audio in private vault   Incoming Call Blocker & Call Lock - Call Blocker rejects unwanted phone calls automatically & Call Lock locks your important & private calls   Lock Watch - Protects your mobile lock screen against any wrong password attempts   Custom Lock Screen - with beautiful wallpapers & customizable features    Intruder Selfie with Email - Sends automatic email when snooper try to unlock your phone.  --- App Lock ---   Applock fingerprint let you lock apps under the maximum protection of pin, pattern, knock code & fingerprint lock. You can lock private apps containing sensitive data with just one tap. Now you dont need to enter pin pattern every time to unlock app, you just need to put your finger on fingerprint scanner and application locker will unlock the locked apps.   AppLock can lock incoming calls, lock gallery, Messenger, SMS, Contacts, Email, Chat, Settings, and any app that you choose.   Quick & Fast Apps Locker does not let any person to snoop into your locked apps content as it provides very fast app locking time.   Applock uninstall protection stops anyone who tries to un-install App Locker.    Prevent unauthorized access apps lock sends break-in alert email when someone tries to unlock your locked apps and Ensure security.   AppLocker plays warning voice message when someone tries to unlock your protected locked apps with wrong password.    App Lock lock recent apps drawer so no one can see what was you last opened app in recent apps drawer.   AppLocker brings feature of random keypad and invisible pattern so no one can snoop while you entering your password.  Photo Vault   Dont put your private photos on risk and start using Pics Vault. With Pictures Vault you can Lock Pictures from public gallery and hide pics in Safe Gallery vault. Not only pictures photo vault & gallery lock can also hide private videos & files.   Now dont worry while giving your phone to someone else while you have your private photos in it. You can lock photos in secret Gallery vault.   Hide and Lock private videos in Applcok & vault app.   Lock and Hide important files in pictures vault.   Hide audios in pics vault and your private audios will not appear in any music player app.   SD-Card video, photo, gallery locker: pics vault support SD-CARD, so you can hide private photos, videos, images in your SD-card.   Locked Photo Backup: Pics & Gallery vault keep backup of locked photos in your phone memory you can recover it even if you have installed appLock photo vault second time.  Note: This app uses the Device Administrator permission to detect wrong password attempts on lock screen. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.PACKAGE_USAGE_STATS', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.android.alarm.permission.SET_ALARM', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.WRITE_CONTACTS', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.BLUETOOTH_ADMIN', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.FLASHLIGHT', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.CAMERA', 'android.permission.DISABLE_KEYGUARD', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'oppo.permission.OPPO_COMPONENT_SAFE', 'android.permission.VIBRATE', 'android.permission.REQUEST_DELETE_PACKAGES']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.PACKAGE_USAGE_STATS', 'oppo.permission.OPPO_COMPONENT_SAFE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.GET_ACCOUNTS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.WRITE_CONTACTS', 'com.android.vending.BILLING']",
}