{
"name" : "SP Utilities",
"url" : "https://play.google.com/store/apps/details?id=sg.com.singaporepower.spservices",
"package" : "sg.com.singaporepower.spservices",
"category" : "Tools",
"description" : "SP Utilities is the starting point for you to learn and manage your utilities consumption, compare offerings from different retailers and choose the right plan for your home. For electric car drivers, locate high speed charging stations, scan to charge your electric car and keep track of your transactions.  Utilities - Manage and update your utility details - Be informed about your latest bill via push notifications - Add and save your credit card information securely for greater convenience - View your smart meter consumption on daily intervals - Browse past bills and payment history - Submit meter readings for electricity, gas, water consumption  Electric Car Charging - Locate AC and DC charging stations - Scan, charge and pay - Browse payments history - Charging status through push notifications  With the SP Utilities mobile app, we aim to deliver a more unified, seamless experience for our customers. SP Group is a leading energy utilities group in the Asia Pacific. It owns and operates electricity and gas transmission and distribution businesses in Singapore and Australia, and district cooling businesses in Singapore and China. SP Group is committed to providing customers with reliable and efficient energy utilities services. More than 1.4 million industrial, commercial and residential customers in Singapore benefit from SP Groups world-class transmission, distribution and market support services. These networks are amongst the most reliable and cost-effective world-wide. For more information, please visit spgroup.com.sg or follow us on Facebook at fb.com/SPGroupSG. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.VIBRATE', 'android.permission.CALL_PHONE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.USE_FINGERPRINT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}