{
"name" : "Sensor Suite",
"url" : "https://play.google.com/store/apps/details?id=simplicial.software.sensor_suite",
"package" : "simplicial.software.sensor_suite",
"category" : "Tools",
"description" : "Sensor Suite provides high precision data acquisition, graphing, and export for all hardware and software sensors available on your Android device. Great for experiments, demonstrations, and learning about your devices sensors.   Android Sensor Types: Motion Sensors: (http://developer.android.com/guide/topics/sensors/sensors_motion.html) - Accelerometers - Gravity - Gyroscopes - Rotational Vectors - Step Detectors/Counters Position Sensors: (http://developer.android.com/guide/topics/sensors/sensors_position.html) - Orientation - Magnetometers - Proximity Environmental Sensors (http://developer.android.com/guide/topics/sensors/sensors_environment.html) - Ambient Air Temperature - Device Temperature - Air Pressure - Illumination - Humidity Body Sensors: - Heart Rate   NOTE: Support for new software sensors introduced in Android 5.0 (Lollipop) is very primitive right now. Support will improve as more information becomes available.   An advanced graphing system provides a powerful data visualization tool to inspect parts of a graph or view exact measured values. On the lower graph view, touch controls and pinch gestures allow panning or zooming. On the top graph, touching or dragging controls a cursor that can be used to get the values of all sensor at any point time.   Any sensor or component value can be toggled on or off. All sensors that are part of a particular session are overlaid on a single graph to make correlation between different sensors easy. A Live Data mode provides a more interactive experience but less recording control.   An intuitive user interface makes tasks such as setting up a sensor data logging session or exporting to external storage such as an SD card easy. Logging settings include the ability to toggle any available sensor or set the session duration and update interval. Note that some sensors ignore the update interval by internal design, including event based sensors such as step counters and certain orientation sensors.   A background service (with notification icon) lets you capture sensor data over long periods of time, even when the device is locked/deactivated. After capturing sensor data you can view it in the applications graphing windows, save it to a .csv (Excel) file, or export the entire SQL database to an SD card.   Menu Options: Settings - Shows/Hides the sensor and setting checkboxes while viewing graphs. Save - Saves the data from the Live Data mode in a new session. Export - In the main menu this exports the entire SQL database to your external storage folder. While viewing a session this exports the data for that session to a .csv file. New Session - Takes you to the New Session window defaulting to the settings of whatever session you were looking at for convenience. Information - Shows you information about every hardware and software sensor available to your device. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BODY_SENSORS', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.BODY_SENSORS']",
}