{
"name" : "Battery Alarm",
"url" : "https://play.google.com/store/apps/details?id=simple.batttery.alarm",
"package" : "simple.batttery.alarm",
"category" : "Tools",
"description" : "I answered every email and every review, and I will reply to you too. For every 5 star rating: THANK YOU!  Feel free to contact me by email before you give me a bad grade!    Battery PRO version Link: https://play.google.com/store/apps/details?id=simple.battery.alarm PRO version supports: multi-language voice alert, different alarm delay periods, hide app icon (from Android 7.0 ), sound alert selection, male or female voice alert selection (some languages only) There is little difference between the free version and the PRO version, the functionality is the same !!! No ads !!! If you are unable to purchase the PRO version, please feel free to contact me, do not give a bad rating immediately.  If you have trouble running the application: 1. turn OFF battery optimization (Huawei, Xiaomi..) (HONOR users: Phone settings > Battery > App launch and then set BATTERY app to Manage manually !!!) Some phones have an option that automatically closes all apps when phone is on sleep mode. This prevents Battery Alarm app from starting. In order to avoid this issue, enable Battery Alarm app notification and then find the power saving option on your phone, open it and add Battery Alarm app to protected apps or disable optimization for Battery Alarm app . It is usually under Phone battery app settings.  This option might be called:  Power saving Batter optimization Battery usage App optimization  Check out the websites: https://dontkillmyapp.com/   Battery Alarm does not ask for any permissions or rooting of the phone. You can use a combination Voice Warning, Sound Warning and Notification Warning.  Voice Warning -> Media volume Sound Warning -> Ringtone volume Notifications Warning -> Notifications volume   Battery Usage - not all phones are supported Close App - Exits the application and is no longer active Minimize App - The app is active and monitors battery status   Languages (Only TEXT, not voice alert) supported: English, etina, dansk, Deutsch, espaol, franais, Indonesia, italiano, magyar, Nederlands, polski, portugus, romn, slovenina, Trke, , Ting vit, , ,  I use google translator, feel free to email me any translation errors to correct.   Thanks! Vujacic Zoran Serbia, Belgrade smart.silver.droid@gmail.com   This is the simplest battery control program (battery monitor), low battery alarm (warning), high battery alarm (warning). Min and Max alarms are separate. Set the alarm for maximum charge and the minimum battery alarm (prevents your mobile phone battery from being overcharged and discharged).  This is the simplest Battery charge Alarm (full and low)  Battery Alarm This app does NOT drain your battery, try it! Battery Alarm takes up a minimum of memory. Battery Alarm is one of the simplest. Battery Alarm is completely free and ad-free. Battery Alarm Does not ask for critical android permissions Battery Alarm It does not steal information from your phone Battery Alarm Does not use internet, gps, gsm ... Battery Alarm notify you when battery is full charge  Battery Alarm notify you when battery battery is low Battery Alarm is simple battery notification ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.WRITE_SETTINGS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.SEND_SMS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}