{
"name" : "Video Downloader for Facebook",
"url" : "https://play.google.com/store/apps/details?id=st.fb.video.downloader",
"package" : "st.fb.video.downloader",
"category" : "Tools",
"description" : "Video Downloader for Facebook is the best video download free for FB. It differents from other video downloader apps, it is very easy and fast  to use.  Wanna download videos from Facebook and IGTV? Looking for an easy-to-use and light weight video downloader for Facebook? You need to try this app!  Are you looking for an app that can easily download or repost IG videos and photo, copy caption hastag without logging in ? This is the best choice for you!  FEATURE:  No login required option  Watch video from FB online in our app.  Download video from Facebook to watch OFFLINE very quickly and easily than ever.  Manage your downloaded video saver for Facebook.  Save videos from FB in your gallery for free  Different from other Video Downloader app, this video downloader app can help you download and save videos from your Facebook news feed, groups, pages, friends, etc. You can easily download high-quality videos by following simple steps and check them in the history list.  Share downloaded videos with your friends  Fast download speed  So install this Video Download for Facebook and try now!  Steps to download videos from Facebook:  * Log in your Facebook ( Click on Browser) * Find and click the video * Choose SD or HD to download quality you want  This is the best video downloader for Facebook,itt not only can download videos from facebook, otherwise it can also help you download HD videos.  Disclaimer: * This app is NOT affiliated with or endorsed by Facebooks official network. * Any unauthorized actions (re-uploading or downloading of contents) and/or violations of intellectual property rights is the sole responsibility of the user. * We respect the copyright of the owners. So please DO NOT download or repost the videos and media clips without owners permission. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}