{
"name" : "Sub4Sub - Subscriber boost & Viral Video Promoter",
"url" : "https://play.google.com/store/apps/details?id=sub4sub.video.faster",
"package" : "sub4sub.video.faster",
"category" : "Tools",
"description" : "Sub4Sub for YouTube - Subscriber boost & Viral Video aim to help Youtubers to get real Subscribers, real video views, get a boost to channel, viral videos on YouTube, gain real Video likes and achieve high ranking on YouTube.  For the beginners, its a tough job to gain subscribers & video views, but dont worry We have a solution for YouTubers to grow and rank high your channel in the current competitive world. Sub4Sub for YouTube - Subscriber boost & Viral Video is a platform to boost subscribers, Video views & more likes to your channel that will help you to gain high rank on YouTube. You can also Viral Video by more views and likes to a particular Video.  Sub4Sub for YouTube - Subscriber boost & Viral Video is the best application to helps you boost your subscriber and make your channel more popular. We create a platform to help your channel reach out to many people around the world. You will get a real subscriber from real users easily and quickly. With the help of the App you can start earning from YouTube easily.  To reach to a potential user and make your video viral & gain subscribers on YouTube follow these steps:  - Search your YouTube video or channel from creating a campaign and share it with other people - Other users will watch your videos, like your videos, subscribe to your channel and make your video viral - Same way to earn coins, you need to watch others video for at least 75 seconds - And you can also subscribe to others channel to earn points  DONT WORRY, The App can not remove subscribers & video views from your YouTube channel, Never. Sub4Sub for YouTube - Subscriber boost & Viral Video is built to support each other and to help small YouTubers channels, Those are struggling to grow the channel and achieve High rank on YouTube faster.  Sub4Sub for YouTube - Subscriber boost & Viral Video is the easiest way to get a real boost to your YouTube Channel, achieve a high ranking, attract more real subscribers and start earning from YouTube.  All small YouTube channel & YouTubers have this kind of questions in their mind: - How to get more subscriber for my YouTube channel? - What to do to reach more users on YouTube? - Is there any YouTube Booster to promote my channel? - How to viral my videos on YouTube? - How to gain more likes & Views for my videos? - How to start earning through YouTube channel?  To all these questions answer is one Sub4Sub for YouTube-Subscriber boost & Viral Video App.  Take a note that we dont sell views as it is against YouTube policy. We only provide a platform to get your video content recognized by real users and make it viral.  Please feel free to reach us at our support email: dev.easylifeapps@gmail.com ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}