{
"name" : "Calcy IV - Instant IV, PvP Ranks & Raid-Counter",
"url" : "https://play.google.com/store/apps/details?id=tesmath.calcy",
"package" : "tesmath.calcy",
"category" : "Tools",
"description" : "** Start enjoying the fastest and easiest IV calculator for Pokemon Go **  Calcy IV calculates the IV, DPS & PvP Ranks of your Pokemon and displays them conveniently in-game.  You can see possible IV even before catching a Pokemon. Additionally, Calcy IV automatically generates nicknames in every possible format and assembles your perfect battle teams for Raids.   ** Full Feature List **   IV & DPS calculation  PvP Ranks & PvP-DPT (damage per turn)  Automatic Renaming  Battle Simulator  including Breakpoints!  Encounter Scan  Level-up and evolution costs  Simulate Purification  Gym-Badge progress reader  CalcyDex  History of scanned Pokemon for sorting and filtering  Export of all scans to a spreadsheet  Fully customizable outputs  --------------  Calcy IV only relies on screenshots, needs no login and is fully compliant with the Terms of Service (ToS). It can be used offline and is very battery-friendly. There is no need to leave the game while using Calcy IV.  --------------  ** Overview & IV **  Every Pokemon has hidden stats - the Individual Values (IV). They can be seen in the appraisal of your team leader and determine how strong a Pokemon can get in terms of CP or when fighting other players.  Without needing any setup or any clicks, Calcy IV adds a little overlay while you play Pokemon Go that perfectly integrates in the game and helps you to decide which Pokemon you want to invest stardust and candy in. With this app, you can see the IV range before you even caught the Pokemon. Additionally, you can add several stats like DPS or PvP Ranks to the output that you otherwise would not see in the game.  When you see a good Pokemon, you can tap the overlay to see its full stats, including DPS, the cost to level it up, and many more.  Are you a raider, a PvP player, a collector, or do you want to know just *everything* about a Pokemon? Whatever your goals, you can set up Calcy IV completely to your needs.  ** Trainer Battles / PvP **  Whether you are a PvP veteran or you want to start diving into the battles with other trainers, Calcy helps you finding the right Pokemon for it.  In fights against other players and against Team Rocket, all attacks deal different damage then usually. Calcy calculates the damage per turn accordingly in these fights.  Moreover, due to the CP limit for PvP leagues, the optimal IV for PvP fights are very specific combinations that may be hard to find. Calcy calculates these optimal IV and tells you for every Pokemon how close it is to perfection (the so called PvP Rank or PvP IV).  ** Battle Simulation & Raid Counters **  Calcys battle simulator will calculate the perfect battle team from all of your Pokemon for every raid. It is accessible by simply scanning a raid boss or pressing the overlay button a bit longer and then tapping the green raid boss symbol.  Calcy not only shows you how to beat the boss but also exactly how much damage you do. This allows you to decide whether you may need 2, 3 or 4 people for this raid. Of course, this calculation takes the different moves, weather and friendship buffs into account.  You can easily find the recommendations directly in Pokemon Go with the help of a generated search string.  +++++ The battle simulator always works with high precision and includes the Breakpoints of your Pokemon (the next level where the damage of your attack-moves increases) +++++  ** Renaming **  Calcy automatically generates a nickname based on many adjustable blocks (containing e.g. IV, move types, DPS, and PvP stats) and copies it to your clipboard. Then you can easily insert it in the game.  --------------  DISCLAIMER  Calcy IV is a fan-made app and is not affiliated with the Pokemon brand, Niantic, Pokemon Go, Nintendo, or the Pokemon Company. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}