{
"name" : "IPFS Lite",
"url" : "https://play.google.com/store/apps/details?id=threads.server",
"package" : "threads.server",
"category" : "Tools",
"description" : "IPFS  The InterPlanetary File System is a peer-to-peer (p2p) filesharing system that aims to fundamentally change the way information is distributed across & beyond the globe. IPFS consists of several innovations in communication protocols and distributed systems that have been combined to produce a file system like no other.  It attempts to address the deficiencies of the client-server model and HTTP web through a novel p2p file sharing system.  Official website of IPFS: https://ipfs.io/  Features  Support of the standard uses cases of IPFS (like add, cat, get, publish, etc). Provide a modern UI to realize this common use cases. Possibility to customize the configuration of the IPFS node. Enhancements  Precondition is that communicating nodes using this IPFS Lite application Enhance the pubsub feature of IPFS to share files between two nodes (Send Option) Integration of WebRTC via the pubsub feature of IPFS to support telephony between two nodes Integration of IOTA to support faster node detection and to support a kind of offline mode between nodes Inbox contains all notifications from other nodes which were sent while your node was offline (Stored on the Tangle, Data is encrypted) IPFS  The Interplanetary File System is a peer-to-peer (p2p) file-sharing system that aims to fundamentally change the way information is distributed across and beyond the globe. IPFS consists of several innovations in communication protocols and distributed systems that have been combined to produce a file system like no other.   It attempts to address the deficiencies of the client-server model and HTTP web through a novel p2p file sharing system.   Official website of IPFS: https://ipfs.io/  Features  Support of the standard uses cases of IPFS (like add, cat, get, publish, etc).  Provide a modern UI to realize these common use cases.  Possibility to customize the configuration of the IPFS node.  Enhancements  Precondition is the communicating nodes using this IPFS Lite application  Enhance the pubsub feature of IPFS to share files between two nodes (send option)  Integration of WebRTC via the pubsub feature of IPFS to support telephony between two nodes  Integration of IOTA to support faster node detection and support for a kind of offline mode between nodes  Inbox contains all notifications from other nodes which were sent while your node whats offline (Stored on the Tangle, Data is encrypted)  ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}