{
"name" : "Pomodoro Diary - Pomodoro Timer , Habit Tracker",
"url" : "https://play.google.com/store/apps/details?id=top.glimpse.tomatoplan",
"package" : "top.glimpse.tomatoplan",
"category" : "Tools",
"description" : "The new year has to set a new flag, and the flag needs to be implemented.  So I wanted to record it, but after trying the application software on the market, I was not satisfied, so I had to write one myself.  Overall, this is a habit tracker application that combines a tomato alarm clock with a check in. Record your daily time and the time you spend, and record your habits.  The basic functions of the first version are completed, and the saved data is saved.  The next step is to provide statistics, hoping to achieve what I want. In short, everyone should use it first.    Features: [habit tracker] Support multiple times, support for notes and generate time streams. Support record the number of check-in and the number of check-in days.  [Timekeeping Focus Function] Tomato refers to the time recording function. The punching task can set several time situations such as no time consumption, tomato time (25 minutes), custom countdown, and timing. If you forget to punch in, you can make up the card and record the time. But the time of recording is shown separately from the time spent by focusing.   [Time Stream] A check-in calendar and check-in record are provided in the time stream. You can click on the calendar to jump to a days check-in record to see what you do every day. In the time stream, you can make check-in records, edit check-in records, and delete check-in records. The time flow is divided into a total task and a single task, which are distinguished from each other.  statistics Statistics include the number of days of check-in, the number of check-in, the time of concentration, and the time of recording. The icon shows the number of check-in and check-in in the past seven days. Statistics also distinguish between total tasks and single tasks, which can be distinguished.  Archive When a target task is reached, it can be archived. It is convenient for ongoing task review, and it is also convenient to review the things that have been done before and the time spent.  [Backup - Pull function] When you synchronize data in multiple devices, you can use the backup pull function to facilitate multiple device switching scenarios.  More More features, everyone to explore, and more features are constantly being developed.   Design ideas: 1. Use this software to record your own habits and do more visuals to help you perform better.  2. The execution of the habit is important and the record is equally important. The development and production of this software is deeply influenced by the Liu Biefu Time Statistics Method in Fantastic Life. The key idea is that we are very important to control the time in the process of moving forward. So tomato punching is not only to record habits, but also to record time.  3. Everything you do in life is similar. If you can record it, you will be able to discover the mystery. For example, getting up every day, eating breakfast, reading, interest learning, work, leisure, sleep time, daily summary, and so on.  I will continue to study how to make the software work better. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CALENDAR', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FULL_SCREEN_INTENT', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}