{
"name" : "Shake Flashlight Torch",
"url" : "https://play.google.com/store/apps/details?id=torch.flashlight.app",
"package" : "torch.flashlight.app",
"category" : "Tools",
"description" : "Searching for the best flashlight app with advanced features?  Our app  is super easy to use and gives you lots of optional extras (all free):  - Shake to turn on/off flashlight! - Run in background - this will let you shake to activate the flashlight or screen light anytime, even with your screen off - no need to unlock your device! * - No need for a hardware button torch shortcut. This app is lite and battery friendly! It even adds a handy lockscreen shortcut! - You can also customize the shake strength (for example 70 would require a firm shake to prevent accidental shakes but is still easy to shake with one hand). You could choose a low shake setting & turn your phones screen into a useful shake nightlight. - You can also choose to use this as a simple lite torch app, place it as a shortcut on your homescreen and youll get the fastest light on/off times at a tap! - No spyware, popups or in-app purchases, always free, no root required - Option to use screen light instead of camera LED for flashlight (you dont need a camera flash light) - Optional vibration feedback - Auto off option - automatically turn the flashlight off after a set time (great for battery saving and nightlight use)  - Compatible with most devices, supports save app to SD card   To use the LED flashlight the camera permission is required (as the LED is part of the camera module).  To use the shake for torch feature whilst the screen is off, check you have activated Shake for torch and Run in background, adjust the shake strength (40 will work easily, 70 with a little more effort).  * To optimize background experience within app settings you can select enable Allow modify system settings and make sure the app is whitelisted by any battery saver/app killers. Background responsiveness will vary by device and OS restrictions.  Our aim is to make the best flashlight app on the market, please email nutlondon@gmail.com directly for help or any feature requests! ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.vibrate']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.INTERNET']",
}