{
"name" : "Total Car Check",
"url" : "https://play.google.com/store/apps/details?id=totalcarcheck.co.uk",
"package" : "totalcarcheck.co.uk",
"category" : "Tools",
"description" : " Free: Check if a vehicle is stolen AND full MOT and mileage history  Free: Check when a vehicles MOT & Road Tax expire  Purchase full vehicle history.  Total Car Check allows you to discover any hidden vehicle history before you decide to buy a vehicle. Dont make an expensive mistake, download today.  Free Check =========  Total Car Check lets you reveal the following vehicle details just by entering the vehicle registration plate:  - Stolen - MOT status and history - Mileage from MOTs - Road Tax Status - Exported - VIC Marker - Make - Model - Colour - Fuel Type - Engine Size - Registered Date - Vehicle Age - CO2 Output and Rating  In-App Purchase =============  For a small fee, via in-app purchase you can uncover more vehicle history including:  - Outstanding Finance (Gold Check Only) - Written Off  - Stolen - Scrapped - Unscrapped - Imported - Exported - VIC Inspected - Previous Number Plates - Previous Keepers - Previous Colours - VIN (Last two digits) - Engine Number - 50+ Data Fields Included ...  Information is provided by the DVLA, UK Police, Association of British Insurers (ABI), SMMT and outstanding finance data is provided by Experian Plc. Sometimes we will be unable to provide full vehicle details as the source data holders do not hold complete records..If you have an specific questions please get in touch using the details below.  Questions?  We are here to help, so if you have any questions drop us an email to enquiries@totalcarcheck.co.uk and we will always do our best to get back to you quickly and help resolve any queries you have. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
}