{
"name" : "QR Code & Barcode: Scanner, Reader, Creator",
"url" : "https://play.google.com/store/apps/details?id=tpcreative.co.qrscanner.free.release",
"package" : "tpcreative.co.qrscanner.free.release",
"category" : "Tools",
"description" : "QR Code Reader is a free scan QRcode application, it is both barcode scanner, QR code scanner, QR code generator.  QR & Barcode Scanner / QR code reader is extremely easy to use; simply point to QR or barcode you want to scan and app will automatically detect and scan it. No need to press any buttons, take photos or adjust zoom.  QRcode Reader free is optimized for QRcode / Barcode decoding . QRcode Reader is an ultimate barcode reader app for any Android device. Enjoy all the benefit by scanning QRcode / barcode from everywhere to access promotion and coupon .  The QR Code Reader app can scan and read all QRcode types including text, url, address , contact, calendar, email, location, Wi-Fi and many other formats.  You can scan any code you want, the application will decode and display the scanned information to you as quickly and accurately.  QR Code Generator application can generate QR code types and allows you to save, share code you just created.  Barcode Scanner is best supported for Android devices. Enjoy all the benefits of scanning QR codes /barcode everytime, everywhere.  To scan QR code, simply open the application, align code. QRcode Reader will automatically recognize any code. When scanning the QR, if the code contains a URL, you can open browser to the site by press browser button. If the code contains only text, you can instantly see.  Feature of QR code reader and generator - Make QR codes in multi colors - Scan QR code directly from Gallery - Scan QR code from another apps(Share items) - Easily scan QR code and generate code - Powerful QR decode speed - QR code generator allow you to complicate information, create codes for messages, wifi, phone numbers, location and share with friends. - Generate QR code for some of text, a web link - Create QR code for the message you want to send to your friends or relatives - Generate code for the directions map where you will go and share it with everyone. - Create QR from contacts or bookmarks for your friend to scan it on their device - Barcode Scanner allows you to view detailed product information by QRcode at stores, supermarkets, ... - QR code scanner does not need Internet connection to scan QR/ barcode - The QR code generator can saves and shares code you just encrypted - Save QR history, filter support and search your QR scan history - Code: EQS, QRCode Data Matrix,Quick Code, EAN8, Code39, Code128...  QR code scanner is widely used to decode QR/barcode such as ISBN, EAN, UPC, matrix data and other codes. QR code reader is designed with the permission of the camera. If you are interested in security, this is the application that scans the code you need. It is safe and fully compatible with Android devices The barcode scanner is comparable to a professional QRcode reader, QR code reader. QR code scanner is very fast and especially free.  If you have any questions or problem want to fix, Please mail me.  Your 5-stars ratting make us feel good let us have motivation to make more the best free apps. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.SEND_SMS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CALL_PHONE']",
}