{
"name" : "Namaz Vakti (Yeni)",
"url" : "https://play.google.com/store/apps/details?id=tr.gov.diyanet.namazvakti",
"package" : "tr.gov.diyanet.namazvakti",
"category" : "Tools",
"description" : "Diyanet leri Bakanl Namaz Vakti Uygulamas  Bu uygulama ile dnyann her yerinde Namaz Vakitlerine ulaabilirsiniz.  zellikleri:  - Setiiniz tm ehirlerin vakitlerini grebilirsiniz. - Bulunduunuz konuma ait namaz vakitleri otomatik olarak grntlenir. - Kble ynn bulabilirsiniz. - Namaz vaktine ve ncesine alarm kurabilirsiniz. - Yaknnzdaki camileri harita zerinde grntleyebilirsiniz (Trkiye iin) - Ezan ve ezan duasn dinleyebilirsiniz. - Aylk Namaz Vakitlerini grntleyebilirsiniz, - Setiiniz ehirler iin Kble saati, Kble as gibi bilgilere ulaabilirsiniz. - Dini gnler ve gecelerle ilgili bilgi alabilir, tarihlerini grebilirsiniz. (2019 eklendi ) - Gnn yet, hadis ve duasn grntleyebilirsiniz.  Not: Alarm kurarken listede ezan seslerini gremezseniz telefonunuzu yeniden balatnz.  Not: Widget uygulamasnda hata ile karlayorsanz cihaznza yeni bir konum ekleyerek tekrar deneyiniz.  https://www.facebook.com/MobilDiyanet  https://twitter.com/MobilDiyanet Directorate of Religious Affairs Prayer Time Application  With this application you can reach Prayer Times all over the world.  Properties:  - You can see the time of all the cities you selected. - Prayer times for your current location are displayed automatically. - You can find the direction of Qibla. - You can set the alarm to prayer time and before. - You can view your nearest mosques on the map (for Turkey) - You can listen to prayer of prayer and prayer. - View monthly Prayer Times, - For the cities you have selected, you can access information such as Qibla time and Qibla angle. - You can get information about the religious days and nights, see the dates. (Added 2019) - You can view the verse, hadith and prayer of the day.  Note: If you do not see the call sounds in the list when you set up an alarm, restart your phone.  Note: If you are experiencing an error in the widget, try again by adding a new location to your device.  https://www.facebook.com/mobildiyanet  https://twitter.com/mobildiyanet ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'tr.gov.diyanet.namazvakti.permission.C2D_MESSAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.FOREGROUND_SERVICE', 'tr.gov.diyanet.namazvakti.permission.MAPS_RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.SEND_SMS', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.SEND_SMS', 'android.permission.ACCESS_FINE_LOCATION', 'tr.gov.diyanet.namazvakti.permission.MAPS_RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}