{
"name" : "Language Translator, Free Translation Voice & Text",
"url" : "https://play.google.com/store/apps/details?id=translate.speech.text.translation.voicetranslator",
"package" : "translate.speech.text.translation.voicetranslator",
"category" : "Tools",
"description" : "Language translator, Free Translation Voice & Text is completely free and useful for all android users. Free language translator application translated your words very fast. Speech and translates more than 80 languages by using free voice translator app. Its a free foreign language translator application it will help you to communicate with foreigners in their native language. If you want to travel to another country and you cant understand their language then free language translator application will help you to translate all your voice and text words. Through free language translator - speak and translate application you wont have any problem to communicate with foreign people. You can easily understand other languages by using this multi-language translator application.   Free translation application is best for travelers, students and also for businessmen. If you are a student and want to translate any document in another language then all languages translator will help you to know the meaning of each word. Language translator audio application is the best word translation app you can translate Spanish to English, French translation, German translation through multi languages translator application. By using Language translator, Free Translation Voice & Text app you can also share your translated words with your friends on any social media website. Language translator app free will help you to learn a new language easily. There are two main functions of free language translator 2019 - voice translator.  Voice Translator:   The main function of free language translator application is voice translator. Just speak and translate all your words easily in the selected language. Speak at once and translate it multiple time in different languages. Press on the voice button and hold it on and speak words that you want to translate and your words will be translated in your desired language easily. Translate free is the best language translator by voice application.  Translate Different Languages:   This conversation translator application translates more than 60 languages. If you want to translate any language into any other language then the translation app will help you to translate your text in your desired language. You can easily share your translated text with your friends and family on any social network.  Features:    Translate words and sentences  Speak and translate text  Listen to translated text  Easily copy and paste text  Share translated text with your friends  Detailed history  Simple and attractive user interface  Free Translator with speech  Free Translate different language  Completely free and faster  Best word translation app  Translate more than 60 language  Copy and delete text with one click  Free language translator - speak and translate application supported the following languages: Afrikaans, Arabic (), Bengali (), Bulgarian (), Bosnian (Bosanski), Cantonese (), Catalan (Catal), Chinese Simplified (), Chinese Traditional (), Croatian, Czech (etina), Danish (Dansk), Dutch (Nederlands), English, Fijian, Filipino, Finnish (Suomi), French (Franais), German (Deutsch), Greek (), Hebrew (), Hindi (), Hmong Daw, Hungarian (Magyar), Icelandic (slenska), Indonesian (Indonesia), Italian (Italiano), Japanese (), Korean (), Latvian (Latvieu), Lithuanian (Lietuvi), Malagasy, Malay (Melayu), Maltese (Il-Malti), Norwegian (Norsk), Persian (), Polish (Polski), Portuguese (Portugus), Quertaro Otomi, Romanian (Romn), Russian (), Samoan, Serbian-Latin (Srpski-latinica), Slovak, Slovenian (Slovenina), Spanish (Espaol), Swahili (Kiswahili), Swedish (Svenska), Tamil (), Telugu (), Thai (), Tonga (lea fakatonga), Turkish (Trke), Ukrainian (), Urdu (), Vietnamese (Ting Vi), Welsh, Yucatec Maya, Yoruba ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}