{
"name" : "Download Twitter Videos - Twitter video downloader",
"url" : "https://play.google.com/store/apps/details?id=tweeter.gif.twittervideodownloader",
"package" : "tweeter.gif.twittervideodownloader",
"category" : "Tools",
"description" : "Twitter Video Downloader app helps you to download Twitter videos and gif that you love to your device in the easy and quick way, so you can open the video anytime, anywhere you want or share it with your friends, save the internet traffic. It uses the database to save your query, avoid download the same Twitter videos | GIF - the main reason makes waste a lot of data usage, which is the problem of other same category apps. Besides, you can choose the video resolution(if +1 available) to download, the app also show the size of the video, help you easy to decide which the video you should download, suitable for your needs. Design for best user experience, with beautiful UI and very little advertising. Lets  install this awesome app now!  Featured:  Download Twitter videos very easy and fast with some simple steps.  Use a database to save your query, save internet traffic, help you avoid download same Twitter videos | GIF.  Can choose the video resolutions(if +1 video available) to download.  Can show the size of the download video, easy to decide which the video you should download.  Built-in share function, easy to share the actual video to other social apps such as Snapchat, Instagram, WhatsApp, Facebook...  The downloaded videos saved to external storage, help you can play or access from other apps, like the gallery, file manager, video player app...  2 easy ways to download videos from Twitter, you can either copy/paste the link or access it directly from share options(recommended).  Built-in download manager, easy to control download progress.  Built-in Video Player, play video & gif.  Easy to access the downloaded video, view its path, play or share it.  Can save gif from Twitter.  Multi-task download, download a lot of files at the same time.  Very little advertising, best user experience, you will love it.  Lightweight, only 2.9 Mb.  How to download Twitter videos with this app?, its very easy and simple:  1 In the Twitter app, below the video or gif that you love, click the share icon. 2 Choose Share Tweet via... 3 Choose Download Twitter videos app. 4 Inside the download twitter videos app, click the download icon. 5 Select the video resolution that you want if +1 video available. 6 Wait or browse other twitter videos.  Another way to download twitter videos is copying the tweet that contains video or gif and pastes the link to the app if you dont open it yet, or it will automatically paste the link. Then click the download icon.    Lets install this awesome Twitter video downloader app now!   Notes:  Do not use Download Twitter Videos app to save videos, save gifs or retweet them without the permission of respective owner. We respect the rights of Twitter.  This Twitter video downloader app is not affiliated with Twitter, but it is a tool to help download videos from Twitter, save gif from Twitter.  If Download Twitter Videos app is helpful for you, please rate me , improve this app by giving me a feedback in the comment box, I will make it better.  If you need to support, please email me smartuxapp@gmail.com.  Thank you for using Download Twitter Videos app. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}