{
"name" : "Oratory - teleprompter widget",
"url" : "https://play.google.com/store/apps/details?id=ua.kulya.oratory",
"package" : "ua.kulya.oratory",
"category" : "Tools",
"description" : "A great speech is a definite way to increase the popularity of any live streamer and vlogger.  We know that a confident performance on the camera, taking into account each side of the prepared speech, is a rather complicated task. Especially when your actions are closely monitored by many viewers.  Unfortunately, none of the existing market applications in the form of mobile prompters is able to cope with this qualitatively, especially when it comes to live-streaming.  Thats why we decided to help those who want to make perfect speeches in their video blogs and live broadcasts. We remove all previously established restrictions and allow users to always see text while capturing any camera application (Periscope, YouTube Live, Facebook Live, Instagram, Snapchat), including standard ones. We have developed a unique widget that works on all applications (like Facebook Messenger Chat Heads), which provides a flexible and convenient functionality that will help you to easily make very cool performances during live broadcasts, thereby bringing pleasure to your precious viewers and subscribers.  The first prompter for live broadcasts on the Play Market available for you! Try it!  With Oratory you can: - change the size and position of the widget on the screen; - Configure the text size and speed of its movement; - At any time, pause the text movement and put it to the desired position; - Change the color of the widget and adjust the transparency of its background; ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}