{
"name" : "GeoLabel - GPS Photo Surveys for Android",
"url" : "https://play.google.com/store/apps/details?id=uk.co.bridlewise.geolabel",
"package" : "uk.co.bridlewise.geolabel",
"category" : "Tools",
"description" : "Take a picture with GeoLabel and you can automatically add the location, the direction you are facing, a timestamp and any notes you need directly into the image. Designed for surveyors and site surveys, this is a useful tool for any situation you need to be able to recall and share where and when a photo was taken. This takes one of the most useful functions of Theodolite, which is only available on other platforms, and brings it to Android. Images are organised into surveys and they can be shared from GeoLabel or accessed from your phones gallery app.  The location is also stored in the image metadata in a standard format so if you need to use GeoLabels output with any mapping tools they should work together automatically.  GeoLabel is free to use with no advertising but limited to a maximum of five surveys ( there is no limit to how many images can be in a survey ) and images are watermarked. There is a very inexpensive upgrade that allows you to create unlimited surveys and removes the watermark, if you find the app useful please consider paying for this upgrade.  Data that can be added to image labels: Survey name, Date and time, Coordinates, Altitude, Azimuth and Compass Direction. The accuracy of location data depends on your device. GPS co-ordinates can be stored as Latitude/Longitude or Ordnance Survey Eastings/Northings ( National Grid Reference or NGR ) if you have a different co-ordinate system you would like us to add, get in touch.  In addition to people creating surveys, working with GIS, needing to label images as they take them and anybody looking for something that works like Theodolite, GeoLabel is useful to archaeologists, geologists, farmers and agricultural contractors, rights of way specialists and anyone wanting to report problems on rights of way, field engineers, landscape gardeners, site contractors, ecologists, countryside rangers, botanists and field scientists - the fact is that anybody who works outdoors or is engaged in field work will find GeoLabel a valuable part of their toolkit. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION']",
}