{
"name" : "Unlock any Phone Guide",
"url" : "https://play.google.com/store/apps/details?id=unlock_device.password.iqra_tech_t.device_guide_phone",
"package" : "unlock_device.password.iqra_tech_t.device_guide_phone",
"category" : "Tools",
"description" : "Android mobiles are the most popular phone used by billions of users across the worldwide. Everyone need to secure data or preventing unauthorized use of his data. One method to protect your phone data is to lock your phone screen by pattern, pin or in other way like face recognition. This app provides various types of methods to unlock android, iphones and windows mobiles. This apps will be help you to unlock your android phone.There are a number of different ways to unlock an Android smartphone or tablet. Salient features of app are: Unlock any phone guidelines step by step. Provides screenshots for guidelines that are easy to understandable. How to Unlock Virgin Media Phone easily Unlocking android 4.4 KitKat or earlier versions How to unlock an EE phone safely Unlock phone by using forgot my password Method to Unlock without Gmail How to unlock phone without Gmail Unlock without a Google Account Unlock Samsung by factory data reset Android Forgot Password bypassing method detail Forgot IPhone Passcode and remove it Unlock without Factory Resetting phone Use Buttons (power, volume and menu) to Reset your phone Set Automatically Unlock Your Device Unlock Orizon Mobile Guideline to unlock three phone, Samsung phone, Virgin Mobile phone, EE Phone Provide guidelines to unlock phones by using third party PC software to remove passwords Using Samsung Find my Device at any time How to unlock a Three phone How to Unlock Mobile Wireless Device Use Google to Unlock Your device Use Restore factory settings to remove password Using third party Software to Unlock without losing Data Simply Reset your Android Device Use Fitbit to Unlock Your device Find, lock, or erase a lost Android device Recover data Note: This is not official app of any cell brand. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}