{
"name" : "Privacy Vault– Hide Photos and Video Locker",
"url" : "https://play.google.com/store/apps/details?id=vault.alarmlock",
"package" : "vault.alarmlock",
"category" : "Tools",
"description" : "Hide Photos, Video Locker app & photo hider Gallery Vault app that lets you hide pictures and personal picture lock and photo hider albums or secret videos behind secret clock. photo vault look like simple clock with the naked eye but has a secret gallery vault behind it.  Hide private photos and videos under the clock. Access Photo, Video Locker by time password on clock screen of this app. Keep safe, simple and practical photo vault hide pictures!  Timer Vault Gallery Lock open only by secret time that is set by you otherwise it functional as Clock. This way no one knows your mobile had installed gallery lock and you can secretly hide pictures to keep safe from others by this Smart Clock  -----------MAIN FUNCTION----------- Secret Door - Disguised and inconspicuous clock vaulty, hide private photos and video locker. - On the surface is a clock app to camouflage your private photo vault.  App Lock Fingerprint - You can use your fingerprint to Unlock your secret Time vault and Applock Fingerprint. - One tap to Lock apps like Messenger, Gallery, Browser, Contacts, Email and Settings.  Private Browser - Private web browser to download photos, videos and audios leaves no tracks in your system. - Download videos secretly inside app.  Intrusion Alert - Photo locker take time to record secretly when the password is entered incorrectly (if your device has a front camera). - If someone tries to break into private photo Vault, we will send you an alert to protect your photos and videos,keep photo safe.  Fake Password - Support Fake Locker system and show fake content when you input fake password to protect real gallery lock.  Files Protection - Turn ON app protection option from settings after you Hide pictures and Video locker to protect from deleting important photos and video files. - To prevent the loss of important documents, gallery vault give you the greatest security!  -----------SPECIAL FEATURE ----------- - Import and hide pictures, hide video from video & photo gallery. - Use Slide Show option and set slide interval from settings to relax and view photos - Video player to watch videos inside video vaulty. - You can edit landscaping for rotating and zooming.   Vault, makes it easier to protect your private files with the intelligent gallery vault and photo locker ensuring your photo safe even if your phone is lost or damaged.  This is a powerful gallery vault!Try this amazing functional photo locker and hide pictures & videos vault so that hide pictures not visible in photo gallery.  How to Use Time Lock? Step 1: Launch our Vault Clock and press the middle button of clock. Step 2: Set a desired time password by moving hour and minute hands and press middle button of clock. Step 3: Now repeat the password to confirm.  IMPORTANT: Do not uninstall this app before restoring your personal files otherwise it will be lost forever.  Device administrators Permission: Timer Vault photo locker and video locker needs Device Administrator Permission to prevent it from being uninstalled by intruders and this app never use this permission except for uninstall prevention. Enable this permission from Settings.  Accessibility service permission: Allow Accessibility service permission to use applock so that you can use the applock feature fast and reduce battery usage.  ----------- Frequently Asked-----------  1, How to Hide Pictures for the new users? Open the Time Lock app, set Time password, and then bind your mailbox, you can upload photos and videos in the Gallery Vaulty !  2, Forgot password. How can I reset it? To reset password you have to open our Timer Lock and enter 10:10 time on clock and press middle button. It will open password reset screen with secret question set by you, answer it correctly and set new password or press on ?symbol button on screen and it will open reset screen.  Contact us: wsinfotechsoftwares@gmail.com ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.READ_PHONE_STATE', 'vault.alarmlock.permission.C2D_MESSAGE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_ACCOUNTS', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.SYSTEM_OVERLAY_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_OVERLAY_WINDOW']",
}