{
"name" : "TokenPocket Wallet. EOS, Bitcoin, Ethereum, TRON",
"url" : "https://play.google.com/store/apps/details?id=vip.mytokenpocket",
"package" : "vip.mytokenpocket",
"category" : "Tools",
"description" : "TokenPocket is a trusted multi-chain wallet that supports multi coins. You can store, send and receive your Bitcoin (BTC), Ethereum (ETH), EOS, TRON (TRX), IOST, Cosmos and Biance (BNB) easily.   With its powerful Web3 browser, you can interact with Decentralized Applications (DApp) and trade your ERC20 tokens, BTC and EOS in decentralized exchanges (DEX), play blockchain games directly inside the wallet.   You can also get free airdrop, get your staking reward through some (PoS) mining pools and join the Decentralized Finance (DeFi) like MakerDAO.  Features of the Multi-Crypto Wallet 1. An open-sourced decentralized wallet, keep your cryptocurrencies safe  It is an open-sourced and non-custodial decentralized wallet that stores your private keys on users device, you can store, send and receive all your tokens within the wallet.  With the Observation Mode of TokenPocket, you can access any cold storage wallet - Trezor, Ledger, Yubikey, etc without exposing your private key. You can track all the transactions of your digital assets in a safe and secure method.  We use advanced biotechnology to ensure the safety of your assets, we can still provide you with secondary protection even if your phone is unlocked.  2. A trust wallet recognized by Block One, the official developer of EOSIO  As the largest EOS wallet, TokenPocket is recommended by the EOSIO Labs  The awesome tools developed by TokenPocket are listed on the developer center of BlockOne.   3. Not only a crypto wallet but also the largest DApp Store   The built-in Web3 browser supports more than 2200 Decentralized Apps perfectly that based on BTCETH EOS, TRON and IOST. You can access and play the latest and hottest dapps in the wallet directly.  Trading your tokens in the largest decentralized exchange platforms of EOS and Ethereum on Newdex and IDEX without leaving the wallet.  4. Latest blockchain news and live token price, trading right now  Check the in-time token price from CoinMarketCap and browse the latest/hottest blockchain articles on TokenPocket  By using our token swap service, you can easily exchange one token to another withe best-in-class exchange rates, such as exchange Bitcoin to Ethereum in several minutes.   5. Powerful but simple, easy to use with multi-language supported  Create Bitcoin, Ethereum, Cosmos, TRON, and other blockchain wallets for free  Send and receive Bitcoin, Ethereum, and other tokens anytime anywhere and get notifications, access the full transaction history  Use 6-digit-pin, fingerprint, Face ID authentication or whitelist functions to simplify the operation  Provide free CPU & NET resources for EOS users  Supports 5 languages: English, Chinese, Korean, Japanese and Spanish.   TokenPocket offers the cryptocurrencies management service for users from 140 countries and regions worldwide.  List of Supported Crypto Coins: Bitcoin(BTC), Ethereum(ETH), IOST(IOST), Cosmos(ATOM), TRON(TRX), Binance Coin (BNB), Bitfinex LEO Token (LEO), ChainLink Token (LINK), HuobiToken (HT), Maker (MKR), USD Coin (USDC), Crypto.com Coin (CRO), VeChain (VEN), Ino Coin (INO), BAT (BAT), Paxos Standard (PAX), Synthetix Network Token (SNX), TrueUSD (TUSD), ZRX (ZRX), HoloToken (HOT), Reputation (REP), OmiseGO (OMG), SeeleToken (Seele), Mixin (XIN), Bytom (BTM), EnjinCoin (ENJ), Zilliqa (ZIL), OKB (OKB), KyberNetwork (KNC), Tether(USDT), WINK(WIN)  List of Supported Crypto Wallet Capabilities:  Bitcoin Wallet (BTC), EOS Wallet (EOS), Ethereum Wallet (ETH), TRON Wallet (TRX), Binance Wallet (BNB), Cosmos Wallet (ATOM), IOST Wallet (IOST), BOS Wallet (BOS), MOAC Wallet (MOAC), Jingtum Wallet (SWTC)  With this app, you can enter and explore the blockchain world by importing or create a wallet easily in the TokenPocket. If you have any questions, please contact us via service@tokenpocket.pro  Website: https://www.tokenpocket.pro/ Twitter: https://twitter.com/TokenPocket_TP Telegram: https://t.me/tokenPocket_en Email: service@tokenpocket.pro ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'vip.mytokenpocket.permission.RECEIVE_MSG', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS', 'android.permission.GET_TOP_ACTIVITY_INFO', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_USER_PRESENT', 'android.permission.USE_FINGERPRINT', 'vip.mytokenpocket.permission.JPUSH_MESSAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.FLASHLIGHT', 'android.permission.READ_LOGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.REORDER_TASKS']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_FINE_LOCATION', 'vip.mytokenpocket.permission.RECEIVE_MSG', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_LOGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_LOCATION_EXTRA_COMMANDS', 'android.permission.GET_TOP_ACTIVITY_INFO', 'android.permission.CAMERA', 'android.permission.RECEIVE_USER_PRESENT', 'android.permission.REORDER_TASKS', 'vip.mytokenpocket.permission.JPUSH_MESSAGE']",
}