{
"name" : "USA VPN - Get free USA IP",
"url" : "https://play.google.com/store/apps/details?id=vpn.usa_tap2free",
"package" : "vpn.usa_tap2free",
"category" : "Tools",
"description" : "Get a USA IP address with single-click ease via fast and free USA Vpn service or use it for unlocking access to blocked websites. OpenVPN connection technology featuring a 1024-bit key generated with OpenSSL provides a secure and confidential connection to open Wi-Fi networks.  Youll need a VPN in the following instances: 1. Changing your IP address to the VPN servers IP address. 2. Visiting websites and launching apps blocked by your Internet Service Provider. 3. Willing to conceal from your Internet Service Provider a fact of visiting certain websites. VPN provides anonymous access to websites and apps - your Internet Service Provider is only notified of you being connected to a VPN - all the web-traffic is encrypted with a 1024-bit key. 5. Connecting to open Wi-Fi networks (password-less). All the data in these networks is transmitted in the clear (without encryption). If a website doesnt feature an SSL, then all the information that you submit on this website may be intercepted by ill-intentioned persons. VPN encrypts traffic and prevents it from being read even in case of open Wi-Fi networks.  USA VPN Features.  # Free, Unlimited and Multifunctional. + 100% free VPN service, forever. + VPN without registration. + No traffic limits. + Compatibility with any connections type.  # Blocked Content Unlocking + Bypassing lockdowns introduced by your Internet Service Provider. + Bypassing regional restrictions introduced by firewalls at school, offices, etc. + Getting access to the following blocked websites. + Unlocking VoIP networks and video calls. + Bypassing firewall at school. + Unlocking torrent.  # Protecting Your Privacy + Provides anonymous access to websites and apps. + Can be used for torrent downloading. + Changes IP address. + Doesnt keep a log or save any info about you.  # Intuitive Controls and Convenience + For your convenience, we introduced two separate connection buttons. The first connects to a selected VPN in the list. The second connects directly to a USA VPN. Its that simple. + Easy to control, one click connection. + Searches the nearest server for maximum speed. + Searches a server with minimum neighbors. + Constantly growing pool of servers around the globe.  Our Servers. Since theres no Internet censorship in Finland, Netherlands, Germany, France, Luxembourg and the US, connecting to one of these VPN servers opens access to the majority of websites;  VPN Servers PRO. Reliable servers with minimum clients: currently, less than three clients are connected to our servers. We monitor servers and, in case client number exceeds ten, we activate an extra server.  Free VPN Servers. Free services always enjoy huge popularity, and our servers are no different. As a rule, free servers audience is 10-to-30 times larger than in case of PRO servers. If this number increases, we add an extra server. These servers operate smoothly, but sometimes a free server becomes overloaded - in this case you need to connect to some other free server or try PRO for 7 days for free.  Our Russian VPN server is subject to all the restrictions imposed by Roskomnadzor, meaning that after connecting to this server you will not be able to get access to all the websites blocked by Roskomnadzor.  Our Ukrainian VPN server is subject to all the restrictions imposed by in Ukraine, meaning that after connecting to this server you will not be able to get access to all the websites blocked by Ukrainian Internet providers.  If a PRO server in a specific country is required, please inform us by sending an email at altcoinapps@gmail.com.  Terms of Use: By downloading and / or using this product, you acknowledge and agree to our Privacy Policy: http://tap2free.net/privacy/united-states/Privacy-Policy-of-USA-VPN-by-tap2free.html  Enjoy! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.REORDER_TASKS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REORDER_TASKS', 'com.android.vending.BILLING']",
}