{
"name" : "Browser - Smart and Fast Explorer",
"url" : "https://play.google.com/store/apps/details?id=web.fast.explore.browser",
"package" : "web.fast.explore.browser",
"category" : "Tools",
"description" : "This web browser is designed for all users. With its stable, fast and secure features, the browser is the best browsing app to explore anything. Its multi-functional functions enable you to add bookmarks, switch to night mode, block ads and select your interface skin, etc.  The interface of Browser - Smart and Fast Explorer is simple but does its best indeed. With the search bar, you can change the search engine just by clicking the icon on the bar. Whats more, some useful and frequently used apps are showed bu default in the recommended list. Also, you can manually add the link or app in this place.  Main Features: - Personalized search Quickly and easily switch search engine with Google, Bing, StartPage, DuckDuckGo, Baidu, Searx, Qwant. - Incognito Browser - Smart and Fast Explorer provides you with secure and private browsing which will not leave any searching or browsing history on it. - Ad Block With this function, you will block any advertisements for banners, pop-outs, etc. - Skin Choose different colors to personalize your user interface in the browser and explorer. - Tool Display in full screen, text mode, save page and print or change pages into PDF format. - History/BM Display bookmarks, history ad and offline. - Share Anything opened on the browser can be shared with social media, your friends and your file storage. Easily achieve information sharing.   Come and download this Browser for free. It is a helpful tool that guarantees fast surfing. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}