{
"name" : "Word Counter - Count Words, Sentences & Paragraphs",
"url" : "https://play.google.com/store/apps/details?id=wordtextcounter.details.main",
"package" : "wordtextcounter.details.main",
"category" : "Tools",
"description" : "Word Counter is a free and easy to use android application for counting words, sentences, paragraphs and characters in your text as you type. This text tool is designed to boost your productivity and make your life easier. The app can be extremely useful when posting or submitting to platforms which have limits imposed on number of characters, words or size.  Top Features Count as you type Count number of characters, sentences, words and paragraphs of the given text as you type.  Access to advanced Stats Generate following advanced stats for the text   Time Stats(Reading time, Speaking time, Writing time)  Unique words  Average word length, Average sentence length  Shortest sentence length, Longest sentence length  More control to you Control how the stats are calculated from settings screen  Never lose your typed text Automatically save notes when you accidentally leave the apps. Access these texts in future under Drafts section. Edit or delete these drafts as you want. Drafts will also have history when you change any exisiting drafts  Save important notes Save current text with their stats. Always have your important text and notes one click away!  Keep notes up to date Edit saved notes as and when data and content of those notes change. You can easily edit your saved notes to keep the notes up to date!  Folders for notes Organize your write ups and stories by storing them in custom folders!  Backup & Restore data Export your data manually wherever you want anytime and restore it later so that you never lose your data  Open directly from another app Now quickly access Word counter from other apps while sharing text.  Directly paste copied text The app will prompt you to paste recently copied text from clipboard  Premium Features Benefits of Premium Plan Buy our premium plan and get :- Automatic backup of your data on Google drive and Dropbox Automatic backup of your data everyday on Google drive and Dropbox so that your data is always safe. You can restore the data anytime you want from settings Frequency counter Get most frequent words along with frequency of text/word/pattern entered by you Export as PDF Export notes and all its stats as PDF file Four more themes  Four extra beautiful themes (Green Dark, Oceanic Light, Oceanic Dark, Grey dark)    The word counting app now works with multiple languages such as Arabic, Czech, German, Spanish, French, Indonesian, Italian, Polish, Portuguese, Romanian, Russian and Vietnamese. ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'wordtextcounter.details.main.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}