{
"name" : "Status Tracker for USCIS Case",
"url" : "https://play.google.com/store/apps/details?id=xiaohui.usciscasechecker",
"package" : "xiaohui.usciscasechecker",
"category" : "Tools",
"description" : "Did you have the experience to wait for your case? Some cases take a long time to get approved. Even if you check your case status from USCIS everyday, you still cannot know how long time it will be taken.  This app can help you to check your USCIS case status automatically. You dont need to go to the website of USCIS everyday to check the case status. This USCIS case status tracker App helps you to monitor the similar case near your case. To see if people near your case has been approved.  Through the similar cases status history, you can easy estimate the processing time of your case. This app also provides the visa bulletin. You can easy to find how many days you need to wait for the approval.  The Major functions: 1. Case look up. The batch queries the cases in front of your case. 2. Case following. 3. Auto refresh of all the cases status, refresh case status 4 times a day. Also you can refresh your case list manually. 4. Notification when case status change. 5. Case status history. Estimate the handling time through case status history. 6. Barcode scan or type your case number. 7. Especially to check I-797, H1B case, I-130, I-140, I-485, Green Card case history. Work for all USCIS cases. 8. Monitor USCIS visa bulletin updates. Easy to know how many days your case should go.   Disclaimer: This product is not affiliated with USCIS. We develop this tool to help you to check your case. The app just send the query to USCIS official website to get the results.  We do not claim the accuracy of information and this information can not be used in any legal case.  We have the right to change this disclaimer at any time. Dont do a batch queries(over 50 numbers) too much. The USCIS website will block the IP address for a couple days if users do the high frequently batch queries. We take no responsibility or liability for using this app. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}