{
"name" : "HTTP Custom - SSH & VPN Client with Custom Header",
"url" : "https://play.google.com/store/apps/details?id=xyz.easypro.httpcustom",
"package" : "xyz.easypro.httpcustom",
"category" : "Tools",
"description" : "HTTP Custom is a SSH client and VPN client with custom HTTP request header to secure surfing   PLEASE READ BEFORE YOU DOWNLOAD  Note: - Cant disconnect vpn when it connecting, try use on/off data to force stop vpn.  Feature:  Secure surfing using SSH and VPN  Custom request header  Free VPN server  DNS Changer  Share your SSH/VPN connection (Hotspot or USB Tethering)  Export config  No root needed  Easy tool to modify requests and access blocked websites behind firewall with SSH and VPN. Get free unlimited vpn server without username, password, registration, and bandwidth limitation.  Why HTTP Custom:  User friendly  Free unlimited vpn server  Custom HTTP request header  2 in 1 (SSH and VPN Client)  SSH & VPN support SNI (Server Name Indication)  Permission:  Permission access photos, media and files Give permission HTTP Custom read & write config  Permission make and manage phone cells Give permission HTTP Custom to generate hwid and read isp card info  Permission access this devices location Give permission HTTP Custom to read ssid, only for OS >= 8 (Oreo)  How to share connection tethering:  Start SSH or VPN client until connected  Switch on hotspot/usb tethering  Check log it will show info tethering ip:port server as proxy, if not show default proxy for Hotspot 192.168.43.1 and USB Tether 192.168.42.129 port 7071  Client connect to hotstpot and set proxy client like log info from HTTP Custom (you can see image on top how to setup proxy from android, if you use desktop please use proxifier then set type proxy as HTTPS in proxifier) ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION']",
}