{
"name" : "Codelyf - Learn Programming",
"url" : "https://play.google.com/store/apps/details?id=ab.codelyf",
"package" : "ab.codelyf",
"category" : "Education",
"description" : "Does programming Sound boring? Not anymore!!  ----------------------------------- Special Features: 1. Learning becomes Fun with our gamified learning method 2. Chapter wise complete tutorials and quiz. 3. Programs with comments and output. 4. Write & Execute code in compiler anywhere, anytime 5. Important Questions with solutions for interviews and exams 6. Bookmark important tutorials, programs and Questions for future reference 7. Quiz for all languages to test your knowledge. 8. Simple and clean user interface. -----------------------------------  ------------------------- PLEASE NOTE ------------------------- Instead of giving us a lower rating, please mail us your queries, issues or suggestions. I will be happy to solve them for you :)  What you can do with Codelyf?  Learn C, C++ , Java & Python Programming in the easiest possible way for free with numerous tutorials, Programs, Question-Answers & quizzes etc.  Now you can write & execute your code right from app anytime, anywhere.  No need to carry those extremely heavy books or notes because all these are just one click away on your smart phones. prepare for interviews at a go in our special section important questions  Test your programming knowledge with some interesting quizzes. Participate in competitions to reach the top of the leader board .  Codelyf enables you to carry basic programming tutorials on your android phone.  It contains questions along with solutions to get better conceptual understanding.  What you can learn with Codelyf ?  C Programming C Programming is general-purpose, imperative computer programming language. A very good choice to start with if you are new to the programming world. It is used in all extents of the software development.  C++ C++ comprises a combination of both high-level and low-level language features. C++ is used in hundreds of thousands of systems programming, numerical and scientific computing, writing compilers, console games, desktop applications and so on.  Java Java is a simple and yet powerful object-oriented programming language and it is in many respects similar to C++. Java is wildly used for software programs, Games, Android applications, Big Data Technologies and add-ons.  Python Python is a powerful high-level, object-oriented programming language. It has simple easy-to-use syntax, making it the perfect language for someone trying to learn computer programming for the first time.  Happy Learning :) ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}