{
"name" : "Superbook Kids Bible, Videos & Games (Free App)",
"url" : "https://play.google.com/store/apps/details?id=air.cbn.superbook.bible.app.android",
"package" : "air.cbn.superbook.bible.app.android",
"category" : "Education",
"description" : "This FREE Kids Bible App brings the Bible to life for the entire family with an easy to understand Bible, videos and fun engaging Bible games. Featuring 26 full-length, free episodes from the Emmy nominated Superbook animation series that includes David and Goliath, Daniel in the Lions Den, the Miracles of Jesus, The First Christmas, He Is Risen and more!  The Kids Bible app is available for FREE and features include:  FULL KIDS BIBLE WITH AUDIO  Easy to understand Bible  Multiple versions and audio Bible  FUN BIBLE GAMES  Play more than 20 fun games  Trivia Games, Word Games and Action Games  FREE SUPERBOOK EPISODES  Watch 26 full-length, free episodes from the Emmy-nominated animation series - Superbook  Now downloadable so you can watch full episodes offline  DAILY VERSE FOR KIDS  Encouraging daily verse   Learn while playing fun games  ANSWERS TO QUESTIONS  Answers to common questions that kids ask about God, Jesus, Heaven and many other topics  What does God look like? How do you get Jesus in your heart? What is heaven like?  And hundreds more questions and answers  DISCOVER HOW TO KNOW GOD  Experience a life-changing, kid-friendly Gospel message and discover how to begin a friendship with God  PEOPLE, PLACES AND ARTIFACTS  Hundreds of profiles of people, places and artifacts with engaging images and detailed biographies  DYNAMIC CONTENT  Verses have related questions and answers, profiles, games, video clips, images and more  PERSONALIZED KIDS BIBLE  Favorite/bookmark verses that you like  Highlight passages with multiple color choices  Take notes and attach them to verses  Add your own photos so that you can make a personal connection with a verse  Your notes, favorite verses and personal photos can be accessed from the My Stuff area of the app  FULL SUPERBOOK EPISODES / BIBLE STORIES INCLUDE:  Creation and Adam and Eve  Noahs Ark  Abraham and Isaac  Jacob and Esau  Joseph and Pharaohs Dream  Moses, the burning bush and the plagues of Egypt  The Ten Commandments  Rahab and the Walls of Jericho  Gideon  David and Goliath  Elijah and the prophets of Baal  Daniel and the fiery furnace  Daniel in the lions den  Esther  Job  Jonah and the big fish  John the Baptist  The First Christmas and the birth of Jesus  Miracles of Jesus - Jesus heals a paralyzed man   Miracles of Jesus - Jesus calms the storm  The parable of the sower  The prodigal son  The Last Supper  The resurrection of Jesus  Paul and the road to Damascus  Paul and the shipwreck  Revelation  DAILY INTERACTIVE ENGAGEMENT  Take Daily Quests  game challenges that feature an encouraging verse of the day  Find Biblical answers to questions that are important to kids  questions about God, Jesus, life and heaven  Choose the right answer in an engaging trivia game  important questions with Biblical answers  Try to find all of the hidden words in a challenging Word Search game  Decode verses before time runs out in the exciting Verse Scramble game  OTHER FEATURES OF THE KIDS BIBLE APP  Search the verses or the interactive content  Email your friends your favorite verses, notes, or personal photos with related verses  The Kids Bible app is available in English, Spanish, Arabic, Chinese, Farsi, Portuguese, Romanian and Russian with full Superbook episodes available in many more languages!  The Kids Bible App is a wonderful Bible experience for the whole family. Download the Superbook Kids Bible App today and begin the adventure of a lifetime! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'air.cbn.superbook.bible.app.android.permission.C2D_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BLUETOOTH_ADMIN', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}