{
"name" : "Sites in VR",
"url" : "https://play.google.com/store/apps/details?id=air.com.ercangigi.sitesin3d",
"package" : "air.com.ercangigi.sitesin3d",
"category" : "Education",
"description" : "Virtual tours of landmarks from Turkey, Egypt, Saudi Arabia, Syria, Morocco, Kuwait, Yemen, Macedonia, Holland, Belgium, France, Italy, Greece and Space. Examine the marvels of Islamic architecture, visit mosques, tombs, palaces of sultans, museums, inns, baths, castles, towers, old houses, squares, parks, nature, religious sites, ancient cities, space and other places with more than a thousand 360 degree panoramic images in high quality. Go up the Eiffel tower, go inside the Egyptian Pyramids and even visit Mars! You will feel as if you are there...  No gyroscope or compass needed!  BONUS: You can now use this app to setup your viewer for all other VR apps too! It has an integrated QR code scanner and even corrects for wrong screen-size issues. Normally, people will use Googles Cardboard app to setup their viewer. But if your phone does not have a gyroscope, Cardboard app cant be installed. In that case this app is the only alternative you have to setup your viewer!  Even if you dont have a QR code, you can setup your viewer by using one of the many viewer presets. Viewer presets are available for these viewers: Google Cardboard & Daydream View (version 1 and 2), Gear VR, VRIZZMO Revolt, DCSVR (I Am Cardboard), Homido (mini), Ant VR, Go4D C1-Glass, Small Mojing, VR fold, Wearality Sky, Durovis Dive 5, VR BOX, Baofeng Storm II, ColorCross VR, Nibiru/Soyan/..., Geeach and Ritech 3D.  If there is no preset for your viewer, or you simply want to improve the perceived quality, you can use the unique VR settings option. You can make corrections on the eye separation, vertical center, screen to lens distance, barrel distortion, chromatic aberration and field of view.  3D Panoramas: Normal panoramas are projected on a distant sphere. This makes them easier for the eyes to watch. On the other hand, stereoscopic panoramas are much more realistic. If watching a stereoscopic panorama makes you feel dizzy, you can turn off stereoscopic mode form the settings.   No stitching errors: Utmost care is given to produce panoramas without stitching errors. Even when you look to the ground, where normally the tripod stand, you will not see any errors. This is also true for the many stereoscopic (3D) panoramas. Many will not know this but producing an error-free stereoscopic panorama of a real-life scene (not rendered), that feels right when you look at it... is very hard! Countless hours are put into making these.  Note on Gear VR: You have to pull up the USB connector and clamp the phone underneath. Dont connect the USB port as that would automatically switch the phone to the Oculus menu.  Tips:  - Move your mobile device around and see the environment as if you were holding a camera. - You can use your fingers to pan around or zoom in- and out. - Tap the screen to see the hotspots (if any). Tapping the hotspots will move you to that location. - To prevent screen rotation keep your finger on the screen while turning the device. - When in VR mode in a place, look down to exit. - When in VR mode, if the scene is turning by itself, leave the device on the table for about 30 seconds. This will trigger auto-calibration of the gyroscope sensor. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}