{
"name" : "L-Lingo Learn Thai",
"url" : "https://play.google.com/store/apps/details?id=air.com.llingo.tha_l65_trl",
"package" : "air.com.llingo.tha_l65_trl",
"category" : "Education",
"description" : "Learn Thai fast and effectively with L-Lingo Thai. Contains thousands of images with native speaker audio and Thai grammar notes. You have the option to learn in Thai script, or in the Latin characters familiar from Western European countries.   L-Lingo is designed to be easy to use. It exploits multimedia channels - words, recordings of native speech, and pictures - to enable you to grasp Thai words and phrases useful on the road, when mingling with Thai speakers, in day-to-day or family life, and when working.  - Thousands of words and sentences -all visualized with images - Full native speaker pronunciation - Grammar notes to explain you the structure of the Thai language - Clear and easy to understand design of the program - Switch between Thai Script or the more easy to read Phonetic Script  See a pineapple in a supermarket, and the correct Thai word pops into your head! Thanks to L-Lingo, you have learned the word visually, as well as by listening and reading. Our Thai lessons make you learn Thai words and phrases quickly. Before you know it, you can easily utter Thai words and Thai sentences!  L-Lingo immerses you in the sights and sounds of the Thai language, rather than just the written word. The multi-channel Thai learning approach achieves results much quicker than traditional textbook approaches.  Our Thai 65 lessons (available in full version) cover the following: - Introductions & Greetings - At Home - At the Airport - At the Hotel - Colors - Food - At the Office - Professions - Numbers - Clothes - Telling the Time in Thai - Animals - Meals and Cooking - Asking Questions in Thai - Buying and Selling - Landscapes and Nature - Weather - Sports - Family and Relationships - Countries and Continents - Seasons - Shopping - Days, Weeks, Months etc. - Quantities and Shapes - Present, Past and Future tenses  *** Any problems or have feedback on how to improve the App, email us before negative comment. We will reply quickly.   http://l-lingo.com/helpdesk *** ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING']",
}