{
"name" : "Code de la route 2020",
"url" : "https://play.google.com/store/apps/details?id=air.com.permisecole.peandrophone",
"package" : "air.com.permisecole.peandrophone",
"category" : "Education",
"description" : "Avec PermisEcole, vous bnficiez dune application mobile de qualit avec des contenus gratuits et dautres que vous pourrez activer, comprenant jusqu 70 tests dont 8 gratuits.   Vous ne payez que les tests supplmentaires, le reste de lapplication est totalement gratuite : le cours de code, les panneaux et les statistiques...   Apprendre, sentraner et russir le code de la route grce  une pdagogie qui a fait ses preuves en auto-cole, pour tre prt le jour de lexamen.   Lapplication est utilisable en mode portrait ou paysage pour une meilleure visualisation des situations.  Les photos peuvent tres agrandies par zoom.  Les questions et les corrections sont lues par une voix-off  Toutes les corrections sont animes par une mise en vidence des lments importants.   Pour les personnes malentendantes, une fonction permet dafficher le texte du commentaire de correction.   Lapplication contient :  - jusqu 2400 questions sous forme de QCM avec corrections illustres audiovisuelles, comme  lauto-cole  - Cours de Code multimdia pour apprendre les rgles de base du code de la route  - 40 tests Sries de 40 questions pour vous entraner  volont, dont 5 gratuits  - 12 tests Piges de lExamen pour djouer les situations alambiques de lpreuve, dont 1 gratuit  - Examen blanc  tirage alatoire dans les conditions de lexamen officiel  - Tests thmatiques de 20 questions rparties en 10 familles, pour rviser un sujet prcis du code de la route  - 10 tests Vrifications intrieures et extrieures pour savoir rpondre aux questions que linspecteur posera le jour de lpreuve pratique, dont 1 gratuit  - 3 tests Recyclage de 40 questions, pour ceux qui ont dj le permis, dont 1 gratuit  - Dfinition de tous les Panneaux du code de la route  - Suivi statistique avec graphes, conseils et historique des tests effectus permettant de revoir ses erreurs  - Dossier personnel avec cration de comptes utilisateurs pour partager lapplication   Ralisation pdagogique et mises  jour  Tous les contenus ont t raliss par des moniteurs diplms, encadrs par un titulaire du BAFM (Brevet dAptitude  la Formation des Moniteurs).  Les programmes pdagogiques sont par ailleurs mis  jour en fonction des changements de rglementation en vigueur.  La rpartition thmatique est celle de lexamen ; elle comprend les 10 familles officielles. With PermisEcole, you get a mobile application quality with free content and others that you can activate with up to 70 tests, including 8 free.  You pay only the additional tests, the rest of the application is completely free: the course code, signs and statistics ...  Learn, practice and pass the highway code through a pedagogy that has proven itself in driving school, to be ready on the day of the exam.  The application is usable in portrait or landscape mode for better viewing situations. Photos can beings magnified by zoom. Questions and corrections are read by a voice-over All corrections are animated by highlighting important.  For the hearing impaired, a function to display the text of the correction comment.  The application contains: - up to 2,400 questions in multiple choice questions with audiovisual illustrated corrections, as in the driving school - Courses multimedia code to learn the basic rules of the Highway Code - Series 40 tests of 40 questions to practice at will, including 5 free - Traps 12 tests of the Review to thwart convoluted situations of trial, 1 free - Mock exam in random drawing under the conditions of the official examination - Thematic Reviews of 20 questions divided into 10 families, to review a specific topic of the highway code - 10 tests internal and external audits to find answer questions that the inspector will ask the day of the driving test, 1 free - 3 tests Recycling 40 questions for those who already have licenses, 1 free - Definition of all panels of the highway code - Follow up with statistical graphs, advice and history tests done to see his errors - Personal Folder with creating user accounts to share the application  educational attainment and updates All contents were conducted by qualified instructors, supervised by a BAFM holder (Patent of Aptitude Monitors Training). The educational programs are also updated according to changes in regulations in force. The thematic distribution is that of the review; it includes the 10 official families. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}