{
"name" : "Learn Hindi Phrasebook",
"url" : "https://play.google.com/store/apps/details?id=air.com.phrasepack.pp_hin",
"package" : "air.com.phrasepack.pp_hin",
"category" : "Education",
"description" : "Over 3500 Hindi Words and Phrases. One of the most comprehensive phrasebooks available.  Are you planning a trip to India? Are you living in the country?  PhrasePack Hindi has been designed to help you interact with the locals.  From ordering food in a restaurant, asking for directions or to be in an emergency, this app helps you to be understood by the locals in many situations.  HIGHLIGHTS + FREE Version already contains more than 1000 phrases! + Upgrade to access 3500+ Hindi phrases + High quality recordings from native speakers + Choose between male and female voices + Switch between formal and informal language + Add commonly used phrases to your favorites + Search for specific words + No Internet Connection required  PhrasePacks specially designed sentence builder allows you to construct your own sentences without the need to look up for additional words.  You need a plane ticket to New Delhi?  Select the base sentence and the location and PhrasePack will build and speak the complete sentence automatically.  Are you ready for a quiz?  Try PhrasePacks Hindi Language Quiz and learn some essential phrases in a fun way!   CATEGORIES All phrases and words are easily accessible within our categories or you can use the simple search function.  PEOPLE - Conversations - Hobbies & Sports - Communication - Romance - Weather  TRAVEL - Getting around & Cities - Border & Airport - Countries & Languages - Directions & Places - Accommodation  FOOD & DRINKS - Food and Local Dishes - Drinks - Restaurant - Spices  SIGHTS & SHOPS - Tourist Attractions - Shopping - Purchase & Bargaining - Colors  HEALTH - Emergencies - Pharmacy and Hospital  TIME & NUMBERS - Days & Months - Time & Appointments - Numbers   PhrasePack is developed by a team of language learning experts with ten years of experience in developing language learning software.  GET IN TOUCH PhrasePack is continuously being developed and we love hearing from you. Please send us your feedback, suggestions and comments tosupport@phrasepack.com. If you like this app, please give us a rating! ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
}