{
"name" : "Baby Bella Crazy Holiday",
"url" : "https://play.google.com/store/apps/details?id=air.com.winkypinky.BabyBellaCrazyHoliday",
"package" : "air.com.winkypinky.BabyBellaCrazyHoliday",
"category" : "Education",
"description" : "Join this amazing experience where you will be assigned to take care of Bellas needs where is in terms of feeding, having a good general statement, having a fashion outfit or anything else that will make possible the best holiday for this cute little girl. This game provides more games in one and will make you feel a responsible person by taking care of all requirements. The desired destination is Tenerife and we all heard that there are a lot of cool things to do around there. Prepare Bella for a great day and make sure you fulfill her needs like having a full stomach so her body could procure the necessary energy. You could buy new food items from the shop with the money youve earned in the playroom. A girl needs her best outfit to be able to go into the world, so check the store and equip her with crazy accessories and why not with a whole new look. Check the shoe item and choose the ones you like then get a suitable swimsuit for her so she could rock her look with a pair of sunglasses. Select a hairstyle that will combine perfectly with the final aspect. Youve got these wonderful mini-games where you could gain money if you succeed to accomplish whatever the games ask. The bigger the score the greater the money, so try all of the games. The water slide from the resort is a lovely trip in a tub on top of the lifebuoy. Next, youve got the navigation on the lifebuoy where you have to keep Bella safe and protected from the other lifebuoys. There is a crazy game where you need to fit same bubbles of fish so they will burst together bringing you more money. After all this playing our girl needs to rest before she can conquer more territories in the water world. A quick nap is the best idea now and after you give her a shower, she will be able to get a good and revitalizing sleep. Look after her needs and if you have to go to the feeding part again, or any other phase that will make her requirements bars go full. There are a lot of surprising features that await to be discovered in this baby game. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}