{
"name" : "Animal Match-Up: Game for Kids",
"url" : "https://play.google.com/store/apps/details?id=air.bftv.flipbook.animals",
"package" : "air.bftv.flipbook.animals",
"category" : "Education",
"description" : "From the hit TV station BabyFirst comes another playful interactive kids app, Animal Match Up! Introduce your little one to animals with this amusing and adorable matching game for tots!  Your toddler can flip through the heads, bodies, and tails of several animals and try to complete a perfect match. Created specifically for young and growing minds, Animal Match Up challenges toddlers with the concept of matching while providing an introduction to animals.  Features:  * Introduces animals and the concept of matching * Explore hand-eye coordination * Bright colors and cheerful sounds keep young ones smiling * Tested by babies and toddlers  * Brought to you by the leading global TV network for babies and parents * Inspires development of reasoning skills   Animal Match Up provides visual and mental stimulation for babies and toddlers to hold their attention and nurture their developing minds. Watch your little ones giggle and play as they interact with fun animals in this engaging preschool app!  About BabyFirst:  BabyFirst is a global TV network made just for babies, toddlers and parents. Developed by educational experts, all BabyFirst content is designed to introduce babies to basic building blocks from numbers and language to music and art. Look for BabyFirst in the U.S. on Comcast, DIRECTV, Dish Network, AT&T U-verse, and more. www.babyfirsttv.com  To find more trusted applications from the BabyFirst family of apps, search BF123 in the Google Play Store. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.iddiction.XplodeSDKUnity.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.iddiction.XplodeSDKUnity.permission.C2D_MESSAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}