{
"name" : "Schools Athletics",
"url" : "https://play.google.com/store/apps/details?id=air.com.yudu.ReaderAIR6735234",
"package" : "air.com.yudu.ReaderAIR6735234",
"category" : "Education",
"description" : "An exciting new interactive App for school teachers and those delivering Physical Education and Sport in schools, wishing to deliver high quality athletics in curricular and extra-curricular time.  The App contains high quality interactive teaching resources for both Primary and Secondary schools, along with useful information on how to organise and deliver fun, engaging Awards programmes and athletics competition.  Both the Primary and Secondary teaching resources are packed full of useful information including Schemes of Work, Lesson Plans, Activity Cards and Teaching Support Cards to help teachers and those working in schools to maximise the delivery of athletics.  The Schools Athletics App is a must have for those delivering Physical Education, Sport and Athletics in the schools environment.  *Please note in App purchases are required for certain resources  The App is Split into three sections:  Teaching Primary Schools Athletics  The Teaching Primary Schools Athletics section of this App has been designed to place running, jumping and throwing at the heart of school physical education and to support teachers in delivering athletics activities in an inclusive, exciting and engaging manner.  Teaching Primary Schools Athletics embraces a childs natural desire to move. The resource focuses upon running, jumping and throwing, the building blocks of athletics, which in turn underpin nearly all other sports and physical activities.  Within this resource teaches will find three Teaching Sections covering the main stages of development: Ages 5 - 7; Ages 7 - 9 and Ages 9 - 12.  Within each of the three Teaching Sections teachers will find:   Examples of Schemes of Work   Blocks of six-week Lesson Plans   Over 20 Activity Cards covering progressions of running, jumping and throwing activities.  In addition, teachers will find information on How to Measure a pupils progression and improvement and a series of Support Cards (including Pupil Cards, Top Tip Inclusion Cards, Team Relays and Timed Runs information cards). The Teaching Primary Schools Athletics resource is written to conform to the curriculum requirements in England, Northern Ireland, Scotland and Wales.  Teaching Secondary Schools Athletics  The Secondary Schools teaching resource builds on the key underpinning movement skills of running, jumping and throwing, meaning this resource can complement the teaching of physical education and many other sports.  This section of the App contains information on developing Schemes of Work and Lesson Plans for secondary schools, providing progressive teaching for all athletics events; delivering fun inclusive lessons and activities, and enabling students to measure and record their progress.  The Teaching Secondary Schools Athletic Section covers:   Running (Sprints, Sprint starts, Hurdles, Relays, Endurance Running & Race Walking)   Jumping (Long Jump, Triple Jump, High Jump and Pole Vault)   Throwing (Shot Put, Javelin, Discus and Hammer)  Many Activity Cards are linked to an online library of video clips (requires wifi connection) which provide further support.  Schools Awards and Competitions  This section contains Awards Programmes and Competition formats designed with the school environment in mind. Awards Programmes and supporting resources can be accessed to help measure a student progression. Short form, exciting competition formats and the appropriate supporting resources to deliver these, can be accessed via the app to help with the delivery of inter and intra school competitions. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'air.com.yudu.ReaderAIR6735234.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}