{
"name" : "Breathe, Think, Do with Sesame",
"url" : "https://play.google.com/store/apps/details?id=air.com.sesameworkshop.ResilienceThinkBreathDo",
"package" : "air.com.sesameworkshop.ResilienceThinkBreathDo",
"category" : "Education",
"description" : "Laugh and learn as you help a Sesame Street monster friend calm down and solve everyday challenges. This bilingual (English and Spanish), research-based app helps your child learn Sesames Breathe, Think, Do strategy for problem-solving. Tap and touch to help the monster friend take deep breaths, think of plans, and try them out! Your child will enjoy silly animations and playful interactions as she is exposed to important emotional vocabulary, a calm breathing technique, personalized encouragements, and more!  Features:  Explore five interactive activities with a unique, everyday challenge  Tap, pop bubbles, and more to help the monster breathe, think, and do to solve problems and feel better  Personalize encouraging phrases that your child will hear as they help the monster think of a plan*  Breathe with the Monster activity to help children practice taking deep breaths to calm down   Robust Parent Section with great resources for navigating everyday challenges with your young child  *Were sorry, but if youre using any device without a built in microphone, this feature will not be supported.  Breathe, Think, Do with Sesame is intended for parents and caregivers to use with their young children (ages 2-5).  PLEASE NOTE: Breathe, Think, Do with Sesame is a very robust app and requires a strong wifi connection to ensure a complete download process.  If youre having download issues, please ensure you have a strong wifi connection and try rebooting your device. If the download does not resume, delete the app or end the download process and start again.  If youre having installation issues or the app is stuck on the loading screen, delete the app and reinstall while connected to a strong wifi signal.  If you continue to have trouble, we encourage you to reach out to us. We want to ensure our tools are working and your family has an opportunity to enjoy Breathe, Think, Do with Sesame.  Curriculum: This app aims to teach Sesames Breathe, Think, Do strategy for problem-solving. The app is part of Sesame Streets Little Children, Big Challenges initiative, which aims to provide tools to help children build skills for resilience, and overcome everyday challenges and more stressful situations and transitions. You can access other Sesame Street resilience materials online, at sesamestreet.org/challenges ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.CHECK_LICENSE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.CHECK_LICENSE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
}