{
"name" : "L-Lingo Learn Malay",
"url" : "https://play.google.com/store/apps/details?id=air.com.llingo.mly_l65_trl",
"package" : "air.com.llingo.mly_l65_trl",
"category" : "Education",
"description" : "Learn Malay fast and effectively with L-Lingo Malay. Contains thousands of images and native speaker audio.  L-Lingo is designed to be easy to use. It exploits multimedia channels - words, recordings of native speech, and pictures - to enable you to grasp Malay words and phrases useful on the road, when mingling with Malay speakers, in day-to-day or family life, and when working.  - Thousands of words and sentences -all visualized with images - Full native speaker pronunciation - Fun Quizzes - Clear and easy to understand design of the program  See a pineapple in a supermarket, and the correct Malay word pops into your head! Thanks to L-Lingo, you have learned the word visually, as well as by listening and reading. Our Malay lessons make you learn Malay words and phrases quickly. Before you know it, you can easily utter Malay words and Malay sentences!  L-Lingo immerses you in the sights and sounds of the Malay language, rather than just the written word. The multi-channel Malay learning approach achieves results much quicker than traditional textbook approaches.  Our Malay 65 lessons (available in full version) cover the following: - Introductions & Greetings - At Home - At the Airport - At the Hotel - Colors - Food - At the Office - Professions - Numbers - Clothes - Telling the Time in Malay - Animals - Meals and Cooking - Asking Questions in Malay - Buying and Selling - Landscapes and Nature - Weather - Sports - Family and Relationships - Countries and Continents - Seasons - Shopping - Days, Weeks, Months etc. - Quantities and Shapes - Present, Past and Future tenses  *** Any problems or have feedback on how to improve the App, email us before negative comment. We will reply quickly.   http://smartlanguageapps.com/helpdesk/ *** ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['com.android.vending.BILLING']",
}