{
"name" : "English for kids - Pili Pop",
"url" : "https://play.google.com/store/apps/details?id=air.com.swasa.PiliPopEnglish",
"package" : "air.com.swasa.PiliPopEnglish",
"category" : "Education",
"description" : "Pili Pop helps your child become bilingual by practicing their English oral skills every day! Winner of the Parents Choice Awards. Pili Pop is an innovative English-learning adventure for kids aged 5-10, designed by language experts. During the FREE TRIAL, enjoy our various activities 40 times for free!  Pili Pop has one goal: to motivate your child to practice their oral English in everyday life. Your child learns to recognize and pronounce everyday words through fun and challenging activities.   BENEFITS FOR YOUR CHILD: - Practicing their English skills every day - Learning by playing - Improving their pronunciation - Being comfortable with oral English skills at an early age - Learning new words every month  INNOVATIVE FEATURES: - New activities EVERY MONTH! - Unique voice recognition technology to help children improve their pronunciation - Increasing difficulty: go from words to sentences - Audiovisual dictionary to make practicing easy - PILI REPORT: monthly report of your childs progress  IN-APP PURCHASES:  During the FREE TRIAL, enjoy our various activities 40 times for free! After this period, subscribe directly from the application for unlimited access to our content and get new activities regularly. There are three different subscription offers:  - 1 month for $9.99, automatically renewed until canceled. - 6 months for $39.99, automatically renewed until canceled. - 12 months for $59.99, automatically renewed until canceled.  Your subscription will automatically renew and you will automatically be charged the same price every 1/6/12 month(s) depending on the selected offer. All offers are without commitment, you can cancel at any time through your account in the Google Play Store. Auto-renew must be turned off at least 24 hours before the end of the current payment period. When a subscription is canceled, access to our content will expire at the end of the current payment period.  PILI POP IS COMMITTED TO: - NO THIRD-PARTY ADVERTISEMENTS - PROTECTED EXTERNAL HYPERLINKS - PROTECTED IN-APP PURCHASES For more information, please read our privacy policy: http://www.pilipop.com/privacypolicy/  ABOUT PILI POP LABS: Pili Pop Labs specializes in language learning for children. Our mission is to help children around the world become bilingual by helping them discover the pleasure of speaking a foreign language. ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BROADCAST_STICKY', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}