{
"name" : "Kids Educational Games: Preschool and Kindergarten",
"url" : "https://play.google.com/store/apps/details?id=air.com.shubi.LearnCNLW.english",
"package" : "air.com.shubi.LearnCNLW.english",
"category" : "Educational",
"description" : "Let your kids improve the learning ability with the collection of best Educational games designed for toddlers, preschool kids, Kindergarten and primary school in this unique multiage app   Educational Games has a collection of best Educational games, logical games, memory games, education games, logic games to improve the learning ability on all ages. If youre a kids parent and want to help your kid improve his/her learning ability or test their Educational, you can choose the game to suit your family learning needs. Whether you your kindergarten or preschool kid to play math games, English games or games in any other subject, you can always find games in this collection of family games.   ******************************************* FAMILY EDUCATIONAL GYM- FUN GAMES FOR ALL THE FAMILY  HIGHLIGHTS ******************************************* - Built from the ground-up for the all family- from kindergarten or preschool kids to parents easy to use interface and suitable for lone play - Professionally illustrated graphics & voice prompts for an immersive learning environment - 32 free learning games for all ages to improve cognitive ability in all areas - Build a strong foundation of basic English, Math, Logic & More - Help your child improve their Educational exercises, performance and productivity at school, help yourself productivity at work.  *********************** KINDERGARTEN EDUCATIONAL GAMES *********************** Below is the list of the Educational games that are available free on the app:  Toddlers Games  PRESCHOOL and KINDERGARTEN  *****************  Learn colors for toddlers  Learning Basic Numbers  Learn numbers from 1-9  Shapes for toddlers  Toddlers coloring book  Sorting game for toddlers education  Mix & Match for babies  Ballons game  Imagination for Toddlers  Fun coloring for kindergarten kids- 10 different paints for kids to color and have fun painting and coloring while hearing the name of the color.  preschool Games *******************  ABC Letters  Learning the alphabet made fun, preschool learning.  ABC Sounds  Develop phonics and learn the phonemes of the alphabet before first grade.  Writing Words  get ready for school  Connect the dots- connect the dots to create an image.  Whats Missing?  A challenging game to improve reasoning and intuition in preschool  Counting  An interactive game to improve basic math  FUN EDUCATIONAL GAMES FOR KIDS ******************************  Story  develop your social skills  Matrix- expand your logic ability  Series- what is the logical sequence.  Auditory memory- develop your memory for listening.  Attention game-Improve your attention for details.  EDUCATIONAL GAMES FOR PARENTS **************************** Hanoi towers- solve the hanoi quiz. Slide puzzle- improve your logic and predicting. 2048- Improve Math and solving problem ability. Peg solitiare- Solve this Educational puzzle.  GAMES FOR THE FAMILY *************************   getting ready in the morning with timer and happy songs for every action- brushing teeth, get dressed, morning exercise.   Snakes and Ladders- for kids and parents to play together.  Emotions Detector- emoji game for kids and parents quality time.  concentration game for the all family * Tic-Tac-Toe  *Puzzle games- quiz & puzzle learning   Education can be fun with these unique learning based games that help in family education. Download this collection of Educational games for free now.  *********************** SAY HELLO *********************** We are working very hard to improve this Educational game for kids. . If you have liked the any game in Shubi Educational Games, do rate us on play store.   All the games were created by Shubi Educational games. at Shubi Educational games kids are always on the first place.  we have build a lot of games for kids, we always check the games at our Shubi Educational games kindergarten. with over 400,000 kids who enjoy playing all of our Shubi Educational games. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'air.com.shubi.LearnCNLW.english.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}