{
"name" : "USA Learns English App 4",
"url" : "https://play.google.com/store/apps/details?id=air.net.scoe.USALearnsEnglishApp4",
"package" : "air.net.scoe.USALearnsEnglishApp4",
"category" : "Education",
"description" : "Whether you are learning English at the popular USA Learns Web site (www.usalearns.org) or trying to learn English on your own, you will want this app! The four USA Learns English Apps are your on the go learning tools for when you cannot sit in class or be at home using a computer.   This fourth app, USA Learns English 4, has many new and exciting learning tools that teach beginning English vocabulary words to adults. The app includes videos, photos, audio, voice recording, vocabulary words, and more! Internet access is necessary in order to use the app.  The USA Learns English App 4 includes these five units:  Unit 16: Doctors and Medicine  Unit 17: Finding a New Home  Unit 18: Furniture and Appliances  Unit 19: Transportation  Unit 20: Recreation and Weather  Additional USA Learns units are available for purchase separately.   To watch a video about the apps, please visit http://usalearns.org/apps.  WHY YOU WILL LOVE THIS APP   Watch videos of adults in classrooms learning English.  Record your voice to practice speaking English - instantly compare your voice with a native English speaker!  Practice listening with a new multiple choice activity.  Learn many important vocabulary words!  Star a word, like a flashcard, so you can practice it more.  See a photo of each word and hear its pronunciation.  Check your learning by keeping track of your scores.  Play the matching game.  Share your success on Facebook!  WHAT DO YOU NEED?   An Internet connection while downloading.  An Internet connection when using the app. You must be connected to the Internet in order to use the app.  WHAT IF YOU WANT MORE ENGLISH PRACTICE?   Download the other USA Learns English Apps for more practice. Each app contains five units:  USA Learns English App 1: First English Class, In the Classroom, Numbers, Around the Clock, and the Calendar  USA Learns English App 2: Places to Go, Countries and Nationalities, Celebrations, Family and School   USA Learns English App 3: Clothes and Colors, Money and Shopping, Places in the Neighborhood, Food, and the Body  Visit the free USA Learns Web site (www.usalearns.org) for many more learning activities, including videos, reading, listening, spelling, writing and speaking practice. The site is not recommended for phones or tablets.  Get even more English practice on our Facebook page at www.facebook.com/usalearns!  WHO CAN LEARN WITH THIS APP?   Any speakers of languages other than English, learners of English as a Second Language (ESL), or anyone who wants to improve their English reading, writing and speaking skills can learn with this app.   HAVE QUESTIONS OR NEED HELP?   Please feel free to email questions and support issues to usalearnsapp@gmail.com. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.vibrate', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}