{
"name" : "Kindergarten Math & Reading - Preschool Education",
"url" : "https://play.google.com/store/apps/details?id=air.mobi.kidsacademy.gp.container5.free",
"package" : "air.mobi.kidsacademy.gp.container5.free",
"category" : "Education",
"description" : "+++++ Featured by The Guardian +++++  Over 20,000,000 kids around the world get fun playing Kids Academy apps!  Based on tried-and-true approaches to preschool education, Kids Academys Early Learning Center is the best educational app for kids from 1 to 5. It develops reading, writing and math skills through fascinating games!     - Best educational TV shows - Complete learning plan - Classic childrens books - New content added regularly  COMPLETE LEARNING PLAN FOR EVERY LEVEL ***designed by experts in early education   Toddlers (ages 1-3)  Preschool (ages 2-4)  Kindergarten (ages 3-5)  Each stage of our carefully developed step-by-step curriculum is tailored towards a specific age group ensuring a natural learning curve. The learning process is based on proven methods approved by early childhood educators.  PLENTY OF LEARNING MATERIALS ***Over 500 preschool activities  Kids Academy features various types of content focusing on different memory types (visual, audio, muscle, etc.) ensuring deeper understanding of the learning material.   Games  Interactive books & songs  Videos and educational shows  New content added regularly  STRONG AND COMPREHENSIVE EDUCATIONAL FOUNDATION  Kids Academy learning plan covers all aspects of preschool education ensuring that our young students have comprehensive knowledge, deep understanding and a set of skills that will help them excel in their further education. Kindergarten Math will helo your little learner to better understand materials in preschool or Kindergarten.  - Alphabet - Reading (including sight words) - Letters (tracing and capitalization) - Numbers  - Math (counting, skip counting, addition, ordinal numbers)  KIDS ACADEMY TV  A vast collection of the best educational videos for kids of all ages and interests. We have videos covering almost everything, from nursery rhymes to the history of dinosaurs and the structure of the universe. For the youngest students we have prepared lots of sing along videos with cartoon characters.  - Educational videos - Most valuable & popular shows - Age-appropriate content only - Never ending stream of learning fun  SAFE ENVIRONMENT  You can have peace of mind knowing your kids are safe while playing. Proven parental control and child protection tools ensure 100% safety for your kids. - COPPA and FERPA compliant - Age-appropriate content only - 100% safe with parental control - No third-party ads - Strictly editorial control  MOTIVATIONAL AND ENCOURAGING  Kids Academy features a consistent motivational system that promotes and encourages learning. Theres no achievement too insignificant and no gain too small. Every step is encouraged and every little victory is proudly celebrated.  - Consistent encouragement - Achievements - Cups and awards    ---------------  Subscription details:  * While the app is free to download some of the content is only available as part of subscription-based membership. * There are several subscription options: Monthly ($7.99/month) and Yearly ($79.99/year) each coming with a free trial period. * You can read our Privacy Policy here: https://www.kidsacademy.mobi/privacy/ * You can read our Terms of Use here: https://www.kidsacademy.mobi/terms/ * If you have any questions regarding your subscription, dont hesitate to contact us at info@kidsacademy.mobi ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.CHECK_LICENSE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'com.android.vending.CHECK_LICENSE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE']",
}