{
"name" : "Hangman for kids School work Hang Man  FREE word",
"url" : "https://play.google.com/store/apps/details?id=air.com.aceedutainmentapps.spellingbughangmanlite",
"package" : "air.com.aceedutainmentapps.spellingbughangmanlite",
"category" : "Educational",
"description" : "The app version of Hangman is a spin of the popular hangman game everybody knows from school.  Guess the given words before the gallows are built and save the little guy/ before the caterpillar chomps off the vine and the butterfly falls!  The popular Hangman app has a beautiful design, great performance, more words, new animations, achievements and much much more ...  # LISTS #   Casual  Most commonly used words for graders  Grade 1  Grade 2  Phonics based lists  Unlimited Add your own  # MULTIPLAYER #   Play against your friends in the multiplayer mode.  The word game is designed for English-speaking people or for those who want to learn the English language. PLUS you can add your own words in any language! The Hangman app is completely suitable for children and adults. The game also includes a multiplayer mode. Players can have fun when guessing terms. Learning by playing is a great method and therefore the App is perfect to learn English and to train the brain. Through daily brain training, you can increase your strengths and weaknesses in spelling and word fluency.  The app is designed for children, teens and adults to ensure learning or refreshing their own spelling skills.  Hangman is, therefore, a mixture of word salad and language game where you must not have a bad conscience that youre wasting your time because you train your brain. Play with your friends at school, on the playground, during the school holidays or on the commute. Have fun with your friends at school. With Hangman you are not only playing a game, but youll also learn for the school and your future career. Many forget that education is the key to fighting poverty and misery! Make the world a smarter place!  # HOW-TO #  You have each letter of the alphabet to guess a word. Click on a letter and see whether it is part of the searched word. Guess correctly and see the butterfly grow!  # SUPPORT #  Dont hesitate and write a mail if you got a suggestion, problem or new words to add: support@aceedutainmentapps.com  Have fun with the word game for children and adults. ",
"desc_perms" : "['android.permission.WRITE_CONTACTS', 'android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}