{
"name" : "Sejong Korean Grammar - Basic",
"url" : "https://play.google.com/store/apps/details?id=air.org.kingsejong.grammarbasic",
"package" : "air.org.kingsejong.grammarbasic",
"category" : "Education",
"description" : "This Sejong Korean grammar study app, was designed with beginning Korean learners in mind, and is recommended for use by anyone who has an interest in acquiring a basic knowledge of the Korean language. This app is provided free of charge by the Sejong Hakdan Foundation.   Using the Sejong Hakdang Grammar book as the basis for its content, this app comprises a total of 120 grammatical patterns with explanations.  Now you can study in an entertaining and imformative way every day with the Sejong Hakdang Korean grammar practice app.   Introduction of content:  Design your character. Before you even start learning, youll have the opportunity to design a character that represents you.   Study the Grammar:  this app will allow you to study all of the grammatical patterns that are set forth in the Sejong Hakdang Korean Grammar book.   Practice the Grammar:  By doing quizes in the app, you will be able to check the progress you have made and confirm your abilities.   Play the Games:  Try learning Korean grammar through fun and informative games.   Please give us your feedback!  If youre enjoying this app, please leave us a rating and review in the app store.   Your suggestions and input will help to improve this app and help us to improve our app development in the future.   Please send email correspondence to learnteachkorean@gmail.com   Contact the Sejong Hakdang:  website: www.sejonghakdang.org Facebook page: https://www.facebook.com/Sejonghakdang.org.   We hope you enjoy your studies! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}