{
"name" : "L-Lingo Learn Portuguese",
"url" : "https://play.google.com/store/apps/details?id=air.com.llingo.por_l65_trl",
"package" : "air.com.llingo.por_l65_trl",
"category" : "Education",
"description" : "Learn Portuguese fast and effectively with L-Lingo Portuguese. Contains thousands of images and native speaker audio.  L-Lingo is designed to be easy to use. It exploits multimedia channels - words, recordings of native speech, and pictures - to enable you to grasp Portuguese words and phrases useful on the road, when mingling with Portuguese speakers, in day-to-day or family life, and when working.  - Thousands of words and sentences -all visualized with images - Full native speaker pronunciation - Grammar notes to explain you the structure of the Portuguese language - Clear and easy to understand design of the program  See a pineapple in a supermarket, and the correct Portuguese word pops into your head! Thanks to L-Lingo, you have learned the word visually, as well as by listening and reading. Our Portuguese lessons make you learn Portuguese words and phrases quickly. Before you know it, you can easily utter Portuguese words and Portuguese sentences!  L-Lingo immerses you in the sights and sounds of the Portuguese language, rather than just the written word. The multi-channel Portuguese learning approach achieves results much quicker than traditional textbook approaches.  Our Portuguese 65 lessons (available in full version) cover the following: - Introductions & Greetings - At Home - At the Airport  - At the Hotel - Colors - Food - At the Office - Professions - Numbers - Clothes - Telling the Time in Portuguese  - Animals - Meals and Cooking - Asking Questions in Portuguese - Buying and Selling - Landscapes and Nature - Weather - Sports - Family and Relationships - Countries and Continents - Seasons - Shopping - Days, Weeks, Months etc. - Quantities and Shapes - Present, Past and Future tenses  *** Any problems or have feedback on how to improve the App, email us before negative comment. We will reply quickly.   http://smartlanguageapps.com/helpdesk/open.php *** ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING']",
}