{
"name" : "Learn Chinese Mandarin",
"url" : "https://play.google.com/store/apps/details?id=air.com.llingo.cma_l65_trl",
"package" : "air.com.llingo.cma_l65_trl",
"category" : "Education",
"description" : "You dont have to know anything about Chinese Mandarin to use L-Lingo Chinese Mandarin to equip yourself to converse in Chinese. In our lessons, you have the option to learn in the Chinese script, or in the Latin characters familiar from Western European countries (using pinyin phonetic script).   L-Lingo is designed to be easy to use. It exploits multimedia channels - words, recordings of native speech, and pictures - to enable you to grasp Chinese Mandarin words and phrases useful on the road, when mingling with Mandarin speakers, in day-to-day or family life, and when working.  - Thousands of words and sentences -all visualized with images - Full native speaker pronunciation - Clear and easy to understand design of the program - Switch between Chinese Script or the more easy to read Phonetic Script (pinyin)  See a pineapple in a supermarket, and the correct Chinese word pops into your head! Thanks to L-Lingo, you have learned the word visually, as well as by listening and reading. Our Chinese Mandarin lessons make you learn Chinese Mandarin words and phrases quickly. Before you know it, you can easily utter Chinese Mandarin words and Chinese Mandarin sentences!  L-Lingo immerses you in the sights and sounds of the Chinese Mandarin language, rather than just the written word. The multi-channel learning approach achieves results much quicker than traditional textbook approaches.  Our Chinese Mandarin 65 lessons cover the following: - Introductions & Greetings - At Home - At the Airport - At the Hotel - Colors - Food - At the Office - Professions - Numbers - Clothes - Telling the Time in Chinese Mandarin  - Animals - Meals and Cooking - Asking Questions in Chinese Mandarin - Buying and Selling - Landscapes and Nature - Weather - Sports - Family and Relationships - Countries and Continents - Seasons - Shopping - Days, Weeks, Months etc. - Quantities and Shapes - Present, Past and Future tenses  *** Any problems or have feedback on how to improve the App, email us before negative comment. We will reply quickly.   http://l-lingo.com/helpdesk *** ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING']",
}