{
"name" : "Tee and Mo Play Time Free",
"url" : "https://play.google.com/store/apps/details?id=air.net.pluginmedia.teeandmoplaytime",
"package" : "air.net.pluginmedia.teeandmoplaytime",
"category" : "Educational",
"description" : "Join Tee and Mo for Play Time in 6 different mini games for kids. The latest Tee and Mo app features 6 different games, each is available for your child to play on their own or with a grown-up. The games are developed from the BAFTA-nominated content on the CBeebies website - now available for the first time on mobile.  Tee and Mo Play Time sees your favourite monkeys from CBeebies have fun together as they make sandwiches, plant seeds, pick flowers, collect fruit for dinner, visit the jungle supermarket and paint Mr Sloths house. All Tee and Mo games look at the touching and funny relationship between parent and child, and arevoiced by Radio 6 DJ, Lauren Laverne.  Tee and Mo is seen on CBeebies and is:  A 2016 Prix Jeunesse winner  A 2014 BAFTA nominee A 2013 Winner of Childnet Internationals Positive Content Competition.   Tee and Mo is perfect for co-play - enjoy some you-and-me-time together!   FEATURES: - Interact with your favourite CBeebies characters across six entertaining mini games. - Safe video area to watch Tee and Mo animations and sing along with our popular songs, with no access to the wider internet. - 3 games available in free version, unlock a further 3 via 1-time, in-app purchase. - Beautiful artwork and original music ensures a fun experience for kids and grown-ups too. - Easy to use with no hard-to-learn rules or difficult gameplay. - Gated Parents area ensures peace of mind for grown-ups, with tips on how to use Tee and Mo Play Time as a springboard for real-world physical play and conversation with your little one. - No third-party advertising.  Games  Sandwich Stacker Tee and Mo take it in turns to make each other a Super Stacker Sandwich, watch their funny reactions at the different combinations you make.  Bungee Vine  Tee and Mo ride on bouncy jungle vines in order to apply paint to Mr Sloths house! House painting has never been so much fun - or so messy!  Squirrel Flyer Tee and his friend, Fly are flying through the jungle trees to knock down the fruit for Mo to catch in her basket. Watch out for the branches!  In-App Purchase to unlock the following three games:  Musical Gardening Gardening is much more fun when you do it to music. Dig the holes, plant the seeds and add water to watch the musical flowers spring up. How many flowers can you plant before the music stops?   Grabs-a-Daisy Tee wants to pick Mo some jungle daisies from the pond. Use Mos fishing rod to lower Tee down to collect the flowers. How many can you gather?   Shopping Trolley Help Tee and Mo to steer the shopping trolley through the jungle supermarket, to gather delicious groceries. Watch out for the bushes and the rocks!  ABOUT TEE AND MO  Tee and Mo follows the daily adventures of a funny and precocious little monkey, Tee, and his clever and unstoppable mum, Mo. Stories, songs, and games explore everyday situations through the viewpoint of child and parent.   While Tee and Mo may want to do different things, theres always plenty of fun to have by negotiating the challenges of daily life TOGETHER. Their light-hearted approach to problem-solving and teamwork inspire imaginative play and lead to care-giver and child bonding both on and off screen.  Find out more about Tee and Mo at teeandmo.com  ABOUT PLUG-IN MEDIA  Plug-in Media is a BAFTA-winning digital production company, creating both interactive and linear TV content for the children and families audience.  Our digital first strategy led to Tee and Mo - a co-viewing and co-playing brand for pre-schoolers. Launching initially as web games and apps; our animated music videos have now attracted over many millions of Youtube views and our 50-episode TV series is available across the globe. We also make award-winning games and apps for some of the worlds best loved childrens entertainment brands including Peppa Pig, Octonauts, Paw Patrol, and Sesame Street. See more at: www.pluginmedia.net ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}