{
"name" : "Arithmetica",
"url" : "https://play.google.com/store/apps/details?id=air.com.multimaths.arithmetica",
"package" : "air.com.multimaths.arithmetica",
"category" : "Education",
"description" : "PRSENTATION :  Type : Activits/Boite  outils/Exerciseur  Cycles concerns : cycle 4, Lyce  Description : Arithmetica est une application compagnon pour lenseignement de larithmtique au collge et au Lyce. Certains outils peuvent tre utiliss ds le cycle 3, dautres peuvent servir en classe de terminale  Arithmetica est dcoupe en trois parties principales :  I. Activits :  Le quizz de dmarrage permet au professeur de tester les connaissances pralables des lves : Vocabulaire de la division, diviseurs et multiples, critres de divisibilit. Un bilan individuel peut tre rcupr grce  lapplication scanScores.  Le crible dratosthne permet une premire manipulation de la notion de nombre premier.  Lactivit Engrenages et roues permet  llve de se familiariser avec la notion dengrenage ( deux puis 3 roues), den dcouvrir le fonctionnement sur un cas simple et dappliquer ses connaissances sur un cas plus compliqu.  Lactivit les irrductibles permet  llve de se familiariser avec la simplification de fractions  laide de la dcomposition en produist de facteurs premiers. Un exerciseur permet ensuite de sentraner.  Lactivit Du ct de Syracuse porte sur la conjecture de Syracuse : Enonc de la conjecture sous la forme dun programme de calcul, calculs de suites de termes, notion de dure de vol et daltitude, etc.   II. Boite  Outils :  Diviseurs dun nombre entier permet davoir un rappel de cours (dfinition et critres), et de dterminer la liste des diviseurs dun entier (jusqu 9 000 000 000 000 000), le nombre et la somme des diviseurs  Nombres Premiers permet deffectuer un test de primalit sur un entier (possibilit dafficher la liste des diviseurs si non premier) et de consulter le tableau des entiers premiers infrieurs  10 000.  Dcomposition permet de dcomposer un entier en un produit de facteurs premiers, avec ou sans puissances.  Avec deux nombres entiers permet de dterminer, entre autres, si deux nombres sont premiers entre eux ou non. Il est galement possible dafficher la liste des diviseurs communs, et le PGCD, le PPCM des deux nombres, ainsi que les coefficients u et v de bzout.   III. Jeux Srieux :  Divisibox est un jeu centr sur la notion de diviseurs, avec les tables de multiplication ou les critres de divisibilit.  Prime Game est un jeu de rapidit dans lequel il faut indiquer si le nombre affich est premier ou non (possibilit de paramtrer le temps de jeu et la taille des nombres).  Juniper Green est une adaptation du clbre jeu ponyme. Possibilit de jouer seul (plus longue suite) ou  deux. Possibilit de paramtrer la taille de la grille. PRESENTATION :  Type: Activities / Toolbox / Exerciser  concerned Cycles: Cycle 4, High School  Description: Arithmetica is a companion app for teaching arithmetic in middle and high school. Some tools can be used from cycle 3, others can serve terminally class  Arithmetica is divided into three main parts:  I. Activities:  The start quiz allows teachers to test students prior knowledge: Vocabulary of the division, dividers and multiple, divisibility criteria. An individual assessment can be recovered through the scanScores application.  The Sieve of Eratosthenes allows a first manipulation of the concept of prime number.  The gears and wheels activity allows students to become familiar with the concept of gear (two and three wheels), to discover how a simple case and apply knowledge of a more complicated case.  The activity irreducible allows students to become familiar with simplifying fractions with decomposition produist of prime factors. An exerciser then used to train.  The business side of Syracuse covers the Collatz conjecture: Statement of conjecture in the form of a computer program, sequences of calculations of terms, notion of flight duration and altitude, etc.   II. Toolbox :  Divisors of an integer allows a refresher course (definition and criteria), and to determine the list of divisors of a number (up to 9 000 000 000 000 000), the number and sum of divisors  Prime Numbers allows a primality test on a full (ability to display the list of dividers if not the first) and a table of prime numbers less than 10,000.  Decomposition allows to decompose an integer into a product of prime factors, with or without powers.  Two integers to determine, inter alia, if two numbers are prime to each other or not. It is also possible to display the list of common divisors, and the GCF, LCM of two numbers and the coefficients u and v Bzout.   III. Serious Games:  Divisibox is a game centered on the notion of dividers with the multiplication tables or criteria of divisibility.  Game Prime is a game of speed in which to indicate whether the displayed number is prime or not (possibility to set the playing time and the size of the numbers).  Juniper Green is an adaptation of the famous eponymous play. Possibility to play alone (longer on) or both. Ability to set the size of the grid. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}