{
"name" : "Learn Korean Flashcards",
"url" : "https://play.google.com/store/apps/details?id=air.com.voclab.voclabv2kor",
"package" : "air.com.voclab.voclabv2kor",
"category" : "Education",
"description" : "Voclab helps you to learn more than 5000 Korean words in no time.   Our scientific proven algorithm reminds you at the exact time to review words so that you will never forget them. This ensures that you maximize your language learning impact with your precious time used as efficiently as possible.  Voclab will gradually increase the difficulty of words to ensure that you gain first a solid foundation of basic words before learning more complex ones. This enables you to quickly gain a good understanding of the language.  Voclab gives you the following advantages: + Over 5,000 Words with high quality native speaker Audio (>250 words in free version) + All words have been carefully selected to cover the most important Korean words + Special algorithm that considers your personal learning character to speed up your memorization + Fun Multiple Choice Quiz to test your knowledge + Follow your learning progress with our Statistics and ongoing Feedback + Get additional information for each word (e.g. word form and word category)  If you need to prepare for a specific exam or topic, you can also focus on specific word categories or level of difficulties. You can choose words from more than 50 word categories and four levels of difficulties.  Our word categories cover all important Korean words, ranging from essential categories like colors, days of the week to more advanced categories of e.g. Economics and sciences.   The VocLab algorithm takes care that you always learn words appropriate to your proficiency level.  Voclab is developed by a team of language learning experts with ten years of experience in developing language learning software.  If you like to learn more about our method, please visit our website at www.voclab.com.  Any problems or have feedback on how to improve the App, email us before negative comment. We will reply quickly. support@voclab.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}