{
"name" : "Learn English for kids 👸🤴 1st Class English",
"url" : "https://play.google.com/store/apps/details?id=air.FirstGradeEnglish",
"package" : "air.FirstGradeEnglish",
"category" : "Education",
"description" : "This app provides several wonderful lessons for kids to help them learn English language with the support of spoken English (in basic English level).  Kids need funny and interactive ways to English for kids hence we designed this App to show English lessons in an interactive way.  We think that the proposed lessons in this App best fit for first class English. 1st Class English level may vary from country to country, but in general, these lessons are generally used.  We supported spoken English by spelling all educational materials in App lesson games.  The student will learn a set of English vocabulary in this App. British council kids can use 1st Class English App also.  To help make this App learn English kids should have access to smartphones or tablets twice every week. Chosen lessons    Features of Learn English App:  Interactive lessons about greetings to teach kids suitable greetings in the morning, evening, at night, and at any time.  Interactive lessons teach kids to ask about name and answer.  Teaching kids how to number from (1) to (10) with showing fruits images.  Helping kid to know the names of some familiar animals with their images in an interesting way.  Showing a set of body parts with large images and voice spelling.  Kids can learn what and who is there inside the classroom.  The learner can learn different drinks and how to ask about them and how to express about drinking or liking one of them.  You can learn family members and how to ask about their names or numbers. This lesson helps to learn English speaking.  Quiz to test gotten skills in the past lessons to support English for kids with an assessment technique.  App can work without internet, but there are some media we load from our website http://flash-toons.com to support learn English online.  This App is at the level of English for beginners. English language learning in basic level is important to be innovative and motivating. Note: Kids of KG1 or KG2 can use this App (Its subject to country English level)  In addition, this App connects kids to the interesting and educational FlashToons YouTube channel through this URL https://www.youtube.com/channel/UCuej8xnt7OORnhVlT8vzbGA?sub_confirmation=1 ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}