{
"name" : "Learn and Write the Arabic Alphabet",
"url" : "https://play.google.com/store/apps/details?id=al.trigonom.writelettersAE",
"package" : "al.trigonom.writelettersAE",
"category" : "Education",
"description" : "This educational app brings the Arabic alphabet to life, with the ability to draw the letters out by hand using the colors your children want to use.  For many kids, simply reading and writing isnt enough to help them learn. They need to develop a love for learning, understanding that it can be fun, engaging, and downright entertaining. With this new educational app, they wont even realize theyre learning! Theyll just be having fun, which is what every kid should be doing today.  Should I download Write the Alphabet? Here are some of our key features.   Colors: Your kids can choose from 4 different colors as they draw the arabic alphabet. They can use just one color, up to all 4, per singular letter, helping them to find fun and engagement in learning, writing, and reading.   Eraser: Dont worry  if your child messes up and wants to start again, our arabic alphabet app includes an eraser! They can easily erase their mess and try a second time, helping to boost their self confidence.   Engagement: For many children today, simply reading and writing isnt compatible with their personal learning abilities. Kids need visual and interactive fun, which is exactly what they will get with this arabic alphabet app for kids.   Fun: Most importantly: kids just want to have fun. If you can show them that learning is fun, that is something they will take with them throughout their schooling. It will lay the groundwork for a successful educational career.  FUN FOR THE WHOLE FAMILY You can sit with your kids and watch their faces light up with smiles as they explore every letter of our alphabet. Try new letters and colors as your kids master the alphabetic essentials, providing a fun and engaging family-friendly activity for everyone at night. Sit back after a long day of work, open the mobile device, and watch your children LOVE to learn.  Is there anything better than that?  With over 3,000,000+ installs already, this is an app that is parent supported and kid approved.   Try it today with your family. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}