{
"name" : "Learn Android App Development - Android Tutorials",
"url" : "https://play.google.com/store/apps/details?id=androidapp.learn.development.programming.coding.learnandroid.appdevelopment.androiddevelopment",
"package" : "androidapp.learn.development.programming.coding.learnandroid.appdevelopment.androiddevelopment",
"category" : "Education",
"description" : "Do you want to become an android app developer? Want to learn how to build android apps?  Build your Android skills on the go with this amazing free Android App Development learning app to learn Android Programming. Become an Android programming expert by learning the Android coding language.   Learn Android App Development - Android Tutorials is a must have app for all coding learners or computer science students to learn Android programming whenever they want and wherever they want.  Whether you want to learn Android with Java programming or Android with Kotlin programming, you will find the best learning content on this Android Learning app for free.  Whether youre preparing for an Android interview or any exam that requires Android programming knowledge, you can find amazing tutorials or lessons on this android learning app.  This amazing Android Programming Learning app has amazing content such as Android Programming Tutorials, Android Programming Lessons, App Examples, Questions & Answers and all that you need to either learn Android programming basics or to become a Android Expert Developer.  With an amazing collection of Android Programs (code examples) with comments, multiple questions and answers, all your programming learning needs are bundled in a single code learning app.   ************************** APP FEATURES ************************** Learn Android App Development - Android Tutorials app makes your code learning fun whether youre looking to learn basics or become an expert android app developer. Here are the features that would make us your single choice to learn Android app development -  Best collection of Android Tutorials 100+ Android Programs with proper comments for better understanding Learn Android Basics - Java & Kotlin for beginners Questions & Answers in different categories Important Exam & Interview Questions for Android Interviews Share the Tutorials & Programs with other friends Tutorials for beginner programmers or those whore looking to learn advanced programming  Learn Android App Development - Android Tutorials app has a really simple and intuitive user interface. It is the best app to let you learn the Android programming language for free. So, what are you waiting for? Download the app now to become an Android Programming Pro.  If you have any feedback for us, please write us an email and we will be happy to help you out. If you have liked any feature of this app, feel free to rate us on play store and share with other friends. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.REQUEST_DELETE_PACKAGES', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.REQUEST_DELETE_PACKAGES']",
}