{
"name" : "ALL Hebrew Verbs FREE - Dictionary Tables",
"url" : "https://play.google.com/store/apps/details?id=app.all.hebrew.verbs.free",
"package" : "app.all.hebrew.verbs.free",
"category" : "Education",
"description" : "ALL Hebrew Verbs is the universal dictionary with huge amount of Hebrew verbs, detailed Hebrew verb form tables and advanced self-study guide. It is useful for both beginners in learning Hebrew and for experienced people who have spoken Hebrew for many years.  Regardless of your current Hebrew level, with help of extensive Hebrew verbs database presented in simple and intuitive application ALL Hebrew Verbs, learning Hebrew verbs will be easy and enjoyable for you. The dictionary will help any English-speaking person to deal with unknown words in Hebrew, and the built-in training simulator - to quickly learn them.  Application features:   More, than 3500 Hebrew verbs. For each verb there is a translation into English, verb root and various forms: infinitive, present, past and future tense forms, imperative mood and forms of all persons, both singular and plural, masculine and feminine.   There are verbs of all binyans: PAAL, PIEL, HIFIL, HITPAEL. Including passive voice ones: binyans NIFAL, PUAL and HUFAL.   For each Hebrew verb form, not only Hebrew word with vocalizations (nekudot) is noted, but also translated pronunciation - English-written transcription with correct emphasis. In some cases, even differences in academic and colloquial Hebrew are noted.   Application works completely offline (no Internet connection required).  Application abilities:   Request translations from English into Hebrew, from Hebrew into English, search words by Hebrew word roots and by pronunciations (English-written transliterations). Here you are more than 3500 different verbs - from the most common to the rarest.   Add verbs you are learning to Favorites List. This will help you always have them in front of your eyes (learn forms of different time tenses, persons, genera and numbers) and use helpful simulator designed for easy word memorization.  Notes:   When searching for a translation from Hebrew to English, it does not matter whether you use final forms of letters or not. Letters   , letters   , letters   , letters   , letters    are pairwise equivalent.   When searching for a translation from English into Hebrew, you should always write English infinitive form, for example, love or to love. When searching for a translation from Hebrew into English and when searching by transcription, you can use any Hebrew form of a word or any part of any form: all occurrences of the specified letter combinations will be found. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}