{
"name" : "Despertar Sabiendo",
"url" : "https://play.google.com/store/apps/details?id=arc_projects.despertarsabiendo",
"package" : "arc_projects.despertarsabiendo",
"category" : "Education",
"description" : "Datos curiosos, interesantes y divertidos todos los das! Llena tus das con la frescura del saber y s el protagonista en una conversacin.  Disfruta de diferentes artculos cortos, pero precisos de lunes a viernes, te dejarn un buen sabor de boca y con ganas de ver an ms.   No te lmites con lo que ya sabes! Siempre se puede saber ms.  Cada dato curioso es interesante y si no lo es, al menos es divertido!  Quisimos disear un sistema cmodo para que el usuario se sienta a gusto con la aplicacin y sea parte de ella, es por eso que incluimos:   Una nueva interfaz Variadas secciones entre las cuales se puede navegar de forma sencilla e intuitiva. Un diseo totalmente renovado haciendo su apariencia ms atractiva.   Un sistema de encuestas Porque s, nos interesa saber mucho lo que piensa la gente que utiliza nuestra App y adems queremos hacer algo que la gente quiera ver. stas no tienen fines de lucro, son simplemente para que la App sea ms de la comunidad.   Perfil con logros Para aadir ms dinamismo a la App quisimos aadir logros cada vez que completas ciertos objetivos.   Colaborar Quieres que algn tema est en la aplicacin? Pues puedes enviarlo y nosotros lo publicaremos dndote los crditos!   Descarga los artculos Si no tienes internet mvil puedes descargar los artculos para poder verlos donde vayas.   Modo nocturno No dejes que la oscuridad atrofie tu visin y activa el modo nocturno para leer con toda la comodidad que te mereces.   Likes Ahora es posible darle un corazn (un me gusta) a los artculos. Esto ser utilizado ms adelante para mostrar contenido de su agrado.  Y an tenemos muchas ideas ms para implementar! Pero para ello antes buscaremos la aprobacin de ustedes :) Curious, interesting and fun facts every day! Fill your days with the freshness of knowledge and be the protagonist in a conversation.  Enjoy different short articles, but accurate from Monday to Friday, they will leave you with a good taste and want to see even more.  Dont limit yourself with what you already know! You can always know more.  Every curious fact is interesting and if it isnt, at least its fun!  We wanted to design a comfortable system so that the user feels comfortable with the application and is part of it, that is why we include:   A new interface Various sections between which you can navigate simply and intuitively. A completely renovated design making its appearance more attractive.   A survey system Because yes, we are interested in knowing a lot about what people who use our App think and we also want to do something that people want to see. These are not for profit, they are simply for the App to be more of the community.   Profile with achievements To add more dynamism to the App we wanted to add achievements every time you complete certain objectives.   To collaborate Do you want any theme to be in the application? Well, you can send it and well publish it by giving you the credits!   Download the articles If you do not have mobile internet you can download the articles to see them wherever you go.   Night mode Do not let the darkness stunt your vision and activate the night mode to read with all the comfort you deserve.   Likes Now it is possible to give a heart (a like) to the articles. This will be used later to display content you like.  And we still have many more ideas to implement! But for that before we will seek your approval :) ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['arc_projects.despertarsabiendo.permission.PROCESS_PUSH_MSG', 'arc_projects.despertarsabiendo.permission.PUSH_PROVIDER', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permissserviceion.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.appmarket.service.commondata.permission.GET_COMMON_DATA', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['arc_projects.despertarsabiendo.permission.PROCESS_PUSH_MSG', 'arc_projects.despertarsabiendo.permission.PUSH_PROVIDER', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permissserviceion.RECEIVE_BOOT_COMPLETED', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'com.huawei.appmarket.service.commondata.permission.GET_COMMON_DATA', 'android.permission.ACCESS_WIFI_STATE']",
}