{
"name" : "Akbar Birbal Stories in Hindi",
"url" : "https://play.google.com/store/apps/details?id=arena.akbarbirbal.stories",
"package" : "arena.akbarbirbal.stories",
"category" : "Education",
"description" : "Here we have listed top 101 stories of Akbar and Birbal which will definitely entertain you. We hope you will like our collection. We welcome your feedback to improve this app.  Birbal, was a Hindu Brahmin advisor in the court of the Mughal Emperor Akbar. Birbal is mostly known for the folk tales which focus on his wit. Birbal was one of the nine jewels in Akbar darbar.  Some features of Akbar Birbal Kahaniyan Hindi android app.   100+ best stories of Akbar and Birbal.  Simple app. Works offline. No internet connection needed!  Professionally designed, user-friendly and intuitive interface.  This app is in easy Hindi Language.  Hindi font for better reading.   Easy to use.  Font can be re-sizable for you best view.  HD Graphics  Add stories as to your favorites list.  Swipe stories  Share stories with your friends. - No need of Internet Connection - Purely Hindi Application Birbal, was a Hindu Brahmin advisor in the court of the Mughal Emperor Akbar. Birbal is mostly known for the folk tales which focus on his wit. Birbal was one of the nine jewels in Akbar darbar.  Akbar birbal in hindi akbar birbal hindi              -  10    This app is under the following categories: Akbar birbal story in hindi, akbar birbal stories in hindi with pictures, Raja Ki Kahani In Hindi,Prerak kahaniyan, motivational stories,akbar birbal ke kisse, moral stories, hindi kahaniyan, rochak kahaniyan, dadi ma ki kahaniyan, best old stories, majedar kahaniyan, poranik katha hindi, gyanvardhak kahaniya, children stories  There was a Mogul Emperor in India, Akbar The Great (1542-1605). His full name was Jalaludden Mohammed Akbar Padshah Ghazi and he ruled India from 1560 to 1605. He himself was illiterate, but he invited several learned people in his court. Among these people, nine were very famous and were called Nav Ratna (nine jewels of the Mogul Crown) of his court. Among these nine jewels, five people were more famous - Tansen, Todarmal, Abul Fazal, Maan Singh and Birbal. Birbal, was a Hindu Brahmin advisor in the court of the Mughal Emperor Akbar. Birbal is mostly known for the folk tales which focus on his wit. Birbal was one of the nine jewels in Akbar darbar. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'arena.akbarbirbal.stories.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}