{
"name" : "The Math Arena - Mathematics for Higher-level",
"url" : "https://play.google.com/store/apps/details?id=at.math.arena",
"package" : "at.math.arena",
"category" : "Education",
"description" : "The Math Arena is your chance to work on your math skills when youre on the go- that means anywhere and anytime you feel like it! Prepare yourself for the A-Levels or any kind of higher-level math tests in a fun way by using our multiple-choice mode where your learning progress will also be summarized and the difficulty of questions will automatically adjust to your ability. The explanation at the bottom of every question will help you with anything unclear, or you can simply contact us using the Feedback-Function where you will get additional help or a personal answer from our Math Arena team.  Whether you just want to have some fun practicing math or you want to prepare for a specific test, the Math Arena offers you the perfect platform to do both. With it, you can improve your skills in each topic area bit by bit and even compare your score with your friends. You may even be able to get through new topics entirely on your own!  Mode of Operation  Entertaining quiz format that adapts to your current level.  Single-choice und multiple-choice questions from 20 different math topics. The difficulty of questions adapts to your ability- you will always begin with the easiest level.   Continuously growing number of questions with over 1000 examples.   Mini games as a challenge under time pressure- how many can you complete in 50 seconds?   Free test version for anyone whos interested. For the price of one tutor session you can get the full scope of questions for a whole year!   The Math Arena is perfect when preparing for the A-Levels or any higher-level math test. Its also ideal for practicing examples from each year of math that youve learned and it helps you test your math knowledge from the entire upper forms. You can use the arena as an addition to your current math lessons, as an alternative to tutoring, or even just as a fun way to improve your math skills!  All examples have been developed by trained math teachers and the questions cover all the basic skill areas of math. They have also been created to be the same level of difficulty used for standardised tests. For these reasons, the Math Arena is a great way to prepare for the A-Levels or any written higher-level math test.  Features  Explanations  For a better understanding, there is a detailed explanation available for each question.   Feedback  With the help of the Feedback-Function, its possible to get direct feedback from math experts.   Learning by Playing  The points and awards system increases your motivation to play. In addition, mini games provide variety and help keep things interesting.  Content  The contents of the app are continually improved and expanded upon. With your feedback, you help us meet your particular needs better.  The following math topics are covered: b>   Algebraic Expressions  Complex Numbers  Differential Calculus  Equations  Exponential & Logarithmic Functions  Financial Maths  Functions  Geometry  Inequalities  Integral Calculus  Linear Functions  Numbers  Power Functions & Polynomials  Powers & Roots  Probability  Sets & Statements  Statistics  Systems of Equations  Trigonometry  Vectors  More questions coming soon! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}