{
"name" : "KnowledgeFox",
"url" : "https://play.google.com/store/apps/details?id=at.researchstudio.knowledgepulse",
"package" : "at.researchstudio.knowledgepulse",
"category" : "Education",
"description" : "This is how companies learn in the 21st century. Experience the most effective training with the KnowledgeFox app! Experience what really makes learning fun and how content is truly memorized.  Heres how: download the free app, conveniently sign in with your Facebook account or quickly register a new account. In a few seconds, the following free demo courses will be at your disposal:  Chemistry G10  Mixtures and Separation  U.S. History Advanced  Several other courses on business related topics such as Compliance and Project Management (PMI, IPMA) are available on request.  Subscribe to a course and decide between Start match and Start course. In KnowledgeMatch mode, you can invite others via e-mail or Facebook and play against them. In course mode, you learn alone, but whenever and wherever you want.   Learn with interactive multimedia knowledge cards that contain questions and answers instead of mere statements.  Images, audio files as well as YouTube or Vimeo videos provide variety and appeal to all senses.  An algorithm manages your learning progress so that its always personalized.  Using smart repetition, content is truly stored in your memory.  Push notifications (optional setting) remind you to learn during your next break. KnowledgeFox is a revolutionary learning technology with unique benefits:  Guaranteed, lasting learning success  an implementation of the research of Nobel Laureate Eric Kandel  Patented MicroLearning solution since 2004  our company is the worldwide pioneer of MicroLearning  Programmed with Sebastian Leitners learning algorithm (see international bestseller and standard reference work So lernt man Lernen. Der Weg zum Erfolg. / Learning how to learn. The path to success.)  Implemented with the 4 x 4 Bruck formula for memory optimization. Four types of knowledge cards with four variants of activation (feedback, create new card, search, index)  Quality-assured by the copywriters of the KnowledgeFox Content Factory: we have hundreds of courses with thousands of knowledge cards on our servers  Our learning solution has received numerous awards at international competitions and is successfully in use by more than 50 corporate customers with thousands of users in 23 countries around the world.  Contact us if you wish to use KnowledgeFox in your company: sales@knowledgefox.net  If you like our app, write a review here in the store!  If you dont like something, let us know: support@knowledgefox.net  Visit us online: http://www.knowledgefox.net ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}