{
"name" : "Kids ABC and Counting Puzzles",
"url" : "https://play.google.com/store/apps/details?id=au.com.espace.puzzle.alphaNum",
"package" : "au.com.espace.puzzle.alphaNum",
"category" : "Educational",
"description" : "Complete jigsaw puzzles of cute cartoon pictures while learning the English alphabet and counting. Build memory skills with the pair matching games and learn addition and subtraction for numbers from 1 to 20.  Now with bonus find the pairs memory training game, added letter puzzles and flashcard maths games from the award winning educational game developer.  This educational and fun App helps young children learn the letters of the alphabet and preschool mathematics while teaching matching skills and hand eye coordination.  ABC and Counting Jigsaw Puzzles has:  high quality images set against colourful scenes that look great on High Definition (HD) and retina displays of both tablets and smart phones  fun sound effects for every object  shows written name, pronunciation and letter phonics for every object (English only)  teaches the letters of the alphabet from A to Z and addition and subtraction from 1 to 20  puzzles that can be replayed again after solving and a star is awarded for each completion  bonus find the pairs memory training game and flash card arithmetic games included  increasing difficulty as your child progresses through the letter and number puzzles  no advertising  a great way for non-english speakers to learn the English alphabet and numbers  ABC and Counting Jigsaw Puzzles comes with a selection of free puzzles that can be easily upgraded through a single low cost in-app purchase to enable all puzzles. By upgrading from the Free App to the full version youll also be entitled to all features added in future releases.  Jigsaw puzzle games have traditionally been a fun and early education learning tool for tots, toddlers, preschoolers, kindergarten, and early school age children and are a stimulating game for girls and an exciting game for boys.  2 year old and 3 year old children can practice their hand eye coordination and matching skills as they progress through the puzzles on each level and enjoy the sounds on completion of each puzzle  4 year old and 5 year old kids can learn to read, write and pronounce the words.  We hope you and your children enjoy playing what we believe is one of our best early education games for toddlers and preschoolers.  Please check out our other puzzle games and acclaimed kids educational apps at http://espacepublishing.com or follow us on Facebook for the scoop on new app releases and free giveaways at http://facebook.com/espacepublishing. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
}