{
"name" : "ABC Preschool Sight Words",
"url" : "https://play.google.com/store/apps/details?id=au.com.espace.place.alphaObj",
"package" : "au.com.espace.place.alphaObj",
"category" : "Education",
"description" : "Helps toddlers and preschool children to learn the English alphabet and over 100 easy words in a fun and interactive puzzle themed environment. Kids will learn the name of each letter as well the phonetic sound that it makes then interactively play with objects that start with that letter.  Now with bonus memory building and math flashcard games. From the award winning developer of children`s fun and educational early learning software.   There are 130 English words to learn and each word is pronounced by a native speaker. Each word is presented as a cute cartoon style picture that needs to be placed in the matching shaped hole on the board to reveal its sound.   This App helps very young children to develop their hand eye coordination, shape recognition and puzzle solving skills in a fun and interactive environment. It`s a unique early learning game with realistic sounds and high resolution quality cartoon style pictures which toddlers, preschoolers, and kindergarten age children will enjoy.  ABC Preschool Sight Word Puzzle Shapes is different to other early learning educational apps because it has:  high quality cartoon style images that look great on modern High Definition (HD) and retina displays of both tablets and smart phones  authentic and funny sound effects for every word being learnt  written name and clear pronunciation of each word from a native English speaker  intuitive drag and drop interface that`s easy for little fingers to master  covers all the letters in the English alphabet from A to Z, their phonetic sound and 130 example words for practise   increasing difficulty as your child progresses from simple dragging of a shape in the easy level to multi-shape drag and drop in the hard level  no advertising  a great introduction to the English alphabet and simple English words for non-English speakers.   bonus find the pairs memory builder and maths games that teach addition and subtraction of numbers from 1 to 20.  The buttons and controls can be configured to support any of the following languages: English, German, French, Chinese, Japanese, Korean, Portuguese, Spanish, Arabic, Russian, Italian, Persian, Turkish, Polish, Indonesian, Vietnamese, Romanian, Swedish, Thai, Norwegian, Malay, Greek, Finnish, Dutch and Danish. (Note: Word and letter pronunciation is only available in English)  ABC Preschool Sight Word Puzzle Shapes comes with a selection of free letters that can be easily upgraded through a single low cost in-app purchase to enable all letter puzzles. By upgrading from the free app to the full version youll also be entitled to all additional words and features added in future releases.  Puzzle games have traditionally been a fun and early education learning tool for tots, toddlers, preschoolers, kindergarten, and early school age children and are a stimulating game for girls and an exciting game for boys.  2 year old and 3 year old children can practice their hand eye coordination and shape matching skills as they progress through the letters on each level as well as exploring the word sounds  4 year old and 5 year old kids can learn to read, write and pronounce the word names on completion of every puzzle (NB: English language only)  We hope you and your children enjoy playing what we believe is one of best early education games for toddlers and preschoolers.  Please also check out our other puzzle games and acclaimed kids educational apps at http://espacepublishing.com or follow us on Facebook for the scoop on new app releases and free giveaways at http://facebook.com/espacepublishing. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}