{
"name" : "Kids dinosaur puzzle games",
"url" : "https://play.google.com/store/apps/details?id=au.com.espace.combo.dinosaur",
"package" : "au.com.espace.combo.dinosaur",
"category" : "Educational",
"description" : "A variety of educational and fun puzzle style games for Dinosaur lovers that teach young children the alphabet, counting and all about dinosaurs in a fun and intuitive way. The games vary in difficulty and include jigsaw puzzle, connect the dots as well as slide puzzle, maze escape and memory training games enhanced for interactivity to keep young minds engaged and learning.  From the award winning educational game developer.  Kids will quickly and intuitively pick up the alphabet and numbers while enjoying the interactivity and sound effects associated with each game challenge. The games also help young children learn shape recognition and matching skills as well as hand eye coordination.  Kids dinosaur puzzles and number games has:  a variety of different challenges including jigsaw puzzles, connect the dots, find the pairs memory, maze escape and traditional slide puzzles  high quality images set against colourful scenes that look great on High Definition (HD) and retina displays  roars and fun sound effects for every dinosaur  covers lots of your favorite dinosaurs including the Tyrannosaurus Rex (T Rex), Brachiosaurus, Stegosaurus, Triceratops, Dilophosaurus, Diplodocus, Gigantoraptor. Also covers some lesser known ones like the Utahraptor, Zuniceratops and many others.  shows written name and pronunciation for every prehistoric creature in the set (English language only)  customisation options to adapt the games to your childs ability level  teaches the order of letters of the alphabet from a to z and numbers 1 to 26  increasing difficulty as your child progresses through the letter and number puzzles  no advertising  Kids dinosaur puzzles and number games comes with a selection of free puzzles of each type that can be easily upgraded through a single low cost in-app purchase to enable all puzzles. By upgrading from the Free App to the full version youll also be entitled to all features added in future releases.  Puzzle games have traditionally been a fun and educational early education learning tool for tots, toddlers, preschoolers, kindergarten, and early school age children and are a stimulating game for girls and an exciting game for boys.  2 year old and 3 year old children can practice their hand eye coordination and matching skills as they progress through the puzzles on each level and enjoy the sounds on completion of each puzzle  4 year old and 5 year old kids can learn to read, write and pronounce the words.  We hope you and your children enjoy playing what we believe is one of our best early education games for toddlers and preschoolers.  Please also check out our other puzzle games and acclaimed kids educational apps at http://espacepublishing.com or follow us on Facebook for the scoop on new app releases and free giveaways at http://facebook.com/espacepublishing. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
}