{
"name" : "Kids Animal Jigsaw Puzzles",
"url" : "https://play.google.com/store/apps/details?id=au.com.espace.puzzle.animal",
"package" : "au.com.espace.puzzle.animal",
"category" : "Educational",
"description" : "Complete jigsaw puzzles while learning about wild animals, farm animals and identifying the sounds they make.  *** Now includes the maze escape game and the find the pairs memory training game ***  This educational and fun App helps young children learn animals and the sounds that each one makes while developing their hand eye coordination and puzzle solving skills. It`s a unique early learning game with realistic sounds and photo quality pictures which toddlers, preschoolers, and kindergarten age children will enjoy.  Children`s Animal Jigsaw Puzzles is different to other puzzle Apps because it has:  high quality images set against photographic scenes that look stunning on High Definition (HD) and retina displays of both tablets and smart phones  realistic sound effects for every animal  covers most common wild animals that children love as well as some lesser known ones. For example cow, cheetah, sea lion, cat, horse, tiger, crocodile, lion, chimpanzee, hippopotamus, sheep and many others.  puzzles that can be replayed again after solving  increasing difficulty as your child progresses through the games in three distinct levels  no advertising  includes the maze escape game and the find the pairs memory training game  supports the following languages: English, German, French, Chinese, Japanese, Korean, Portuguese, Spanish, Arabic, Russian, Italian, Persian, Turkish, Polish, Indonesian, Vietnamese, Romanian, Swedish, Thai, Norwegian, Malay, Greek, Finnish, Dutch and Danish.  Children`s Animal Jigsaw Puzzles comes with a selection of free games that can be easily upgraded through a single low cost in-app purchase to enable all puzzles. By upgrading from the Free App to the full version youll also be entitled to all additional puzzles and features added in future releases.  Jigsaw puzzle games have traditionally been a fun and early education learning tool for tots, toddlers, preschoolers, kindergarten, and early school age children and are a stimulating game for girls and an exciting game for boys.  2 year old and 3 year old children can practice their hand eye coordination and matching skills as they progress through the puzzles on each level as well as exploring the animal sounds  4 year old and 5 year old kids can learn to read, write and pronounce the animal names on completion of every puzzle  We hope you enjoy playing what we believe is one of best early education games for toddlers and preschoolers.  Check out our other puzzle games and acclaimed kids educational apps at http://espacepublishing.com or follow us on Facebook for the scoop on new app releases and free giveaways at http://facebook.com/espacepublishing. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}