{
"name" : "Kids ABC and Counting",
"url" : "https://play.google.com/store/apps/details?id=au.com.espace.dots.alphaNum",
"package" : "au.com.espace.dots.alphaNum",
"category" : "Educational",
"description" : "Complete connect the dot puzzles of cute cartoon pictures while learning the English alphabet, counting numbers and simple addition and subtraction maths from 1 to 20.  Now with bonus letter shape jigsaw puzzles, find the pairs memory training games and flashcard maths.  This educational and fun App helps young children learn the phonic letter sounds and simple words while teaching matching skills, memory skills and hand eye coordination.  ABC and Counting Dot-to-Dot Puzzles has:  high quality images set against colourful scenes that look great on High Definition (HD) and retina displays of both tablets and smart phones  fun sound effects for every object  select from lowercase abc... uppercase ABC... or numbers 123... in each of the dot puzzles  teaches the order of letters of the alphabet from A to Z and the numbers 1 to 26  teaches letter names and phonics as well as written name and pronunciation for every object  puzzles that can be replayed again after solving and a star is awarded for each completion  increasing difficulty as your child progresses through the letter and number puzzles  teaches addition and subtraction of numbers from 1 to 20  a great way for non-English speakers to learn the English alphabet and numbers  bonus memory skills builder, alphabet shape puzzles and flashcard maths  ABC and Counting Dot-to-Dot Puzzles comes with a selection of free puzzles that can be easily upgraded through a single low cost in-app purchase to enable the full set of over 70 puzzles. With the full version youll also be entitled to all features added in future releases.  Join the Dot style puzzle games have traditionally been a fun and early education learning tool for tots, toddlers, preschoolers, kindergarten, and early school age children and are a stimulating game for girls and an exciting game for boys.  2 year old and 3 year old children can practice their hand eye coordination and matching skills as they progress through the puzzles on each level and enjoy the sounds on completion of each puzzle  4 year old and 5 year old kids can learn to read, write and pronounce the words.  We hope you and your children enjoy playing what we believe is one of our best early education games for toddlers and preschoolers.  Please also check out our other puzzle games and acclaimed kids educational apps at http://espacepublishing.com or follow us on Facebook for the scoop on new app releases and free giveaways at http://facebook.com/espacepublishing. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}