{
"name" : "ABC Zoo Animal Connect Dots",
"url" : "https://play.google.com/store/apps/details?id=au.com.espace.dots.zoo",
"package" : "au.com.espace.dots.zoo",
"category" : "Education",
"description" : "Learn counting and the alphabet while finding out about wild animals that you might find in the zoo and identifying the sounds they make in this puzzling and fun game. Now with bonus find the pairs memory games and escape the maze logic puzzles.  Preschool ABC Zoo Animal Connect the Dot Puzzles is the top new puzzle game for kids from the award winning early learning educational app developer recommended for young developing brains.  This educational and fun app helps young children learn about animals and the sounds that each one makes while developing their hand eye coordination and dexterity, stimulating their puzzle solving skills and developing shape matching technique. It`s a unique early learning game with realistic sounds and cartoon style pictures which toddlers, preschoolers, and kindergarten age children will all enjoy.  The great thing about this educational game is that it intelligently develops a lot of skills at the same time. Young ones will start to develop their cognitive skills, visual spatial skills and shape recognition of different objects.  Game Features:  high quality cartoon style images set against engaging scenes that look great on modern High Definition (HD) and retina displays of both tablets and smart phones  authentic sound effects for every animal  pronunciation of each animal name (English language version only)  intuative drag and drop interface that`s easy for little fingers to master  covers most common wild animals that children love as well as some lesser known ones. For example cow, cheetah, sea lion, cat, dog, panda, tiger, crocodile, lion, monkey, hippopotamus, sheep, yak, deer and many others.  puzzles that can be replayed again after solving and kids are rewarded with a star on completion of a puzzle  increasing difficulty as your child progresses through the games in three distinct levels  no advertising  supports the following languages: English, German, French, Chinese, Japanese, Korean, Portuguese, Spanish, Arabic, Russian, Italian, Persian, Turkish, Polish, Indonesian, Vietnamese, Romanian, Swedish, Thai, Norwegian, Malay, Greek, Finnish, Dutch and Danish. (Note: Pronunciation of animal name is only available in English)  Preschool ABC Zoo Animal Connect the Dot Puzzles comes with a selection of free games that can be easily upgraded through a single low cost in-app purchase to enable all puzzles. By upgrading from the Free App to the full version youll also be entitled to all additional puzzles and features added in future releases.  We hope you and your children enjoy playing what we believe is one of best early education games for toddlers and preschoolers.   This toddler game / preschool game is suitable for girls and boys, nursery school, infant school, preschoolers and kindergarten age kids. Ages 2, 3, 4 and 5.  Please check out our other puzzle games and acclaimed kids educational apps at http://espacepublishing.com or follow us on Facebook for the scoop on new app releases and free giveaways at http://facebook.com/espacepublishing. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING']",
}