{
"name" : "TAYO Playhouse",
"url" : "https://play.google.com/store/apps/details?id=bluepin_app.cont.tv",
"package" : "bluepin_app.cont.tv",
"category" : "Education",
"description" : " Tayo Playhouse is all about Tayo and Tayos friends! Tayo Playhouse includes Tayos latest seasons (Season 4 & 5) and interactive includes Tayo friends Musical interactive and puzzles. Tayo Playhouse includes collections of Tayos most popular nursery songs are all in one place.  Tayo Playhouse includes puzzle of Tayo and Tayos friends.  Full package purchaser can enjoy future updated contents for free!  Tayo Music (Interaction)  Create your own rhythm and play the instruments Collections of the most popular nursery songs from Youtube   Childrens very first DJ experience with Tayo, Rogi, Gani, Rani, Cito, and strong heavy vehicles, Bulldozer, dump truck!   Music Playlist1. Tayo Song2. London Bridge is Falling Down3. Wheels On The Bus4. Baby Bumble Bee5. Six Little Ducks6. Humpty Dumpty7. Pat-a-Cake8. The Finger Band Features of Musical Interactive game1. Play Piano- Play piano feely and you can put on auto mode to play like a pianist2. Touch Touch- Touch the characters and listen to various sounds3. Tayo Band- Create your own rhythm with Tayo and Friends4. DJ TayoBecome a DJ with Tayo the little bus!5. Mini-game-Follow the stars to play the music   Tayo Puzzle (Interaction)  No more same styles of puzzles! Various puzzles of characters that our children love! Put the puzzle of Tayo, Rogi, Gani, Rani, Citu and many more ride friends! Stimulate childrens creativity and imagination by playing jigsaw, vertical puzzles It is more than a Puzzle App! Pick various accessories to customize Tayo and ride friends!   You may use already purchased contents on different android devices by login to the same Google account. After the login, please go to the payment page and Restore to retrieve paid user status.    Contact MailIf you have any problems or have questions, please send your inquiry to help@kakaokids.com. All other business inquiry to info@kakaokids.com.   Please note that it is difficult to check individuals problem/inquiry from App Review, therefore we highly recommend to send us an email to help@kakaokids.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}