{
"name" : "Instant Replay Me! Record And Watch Your Actions",
"url" : "https://play.google.com/store/apps/details?id=borama.co.instantreplay",
"package" : "borama.co.instantreplay",
"category" : "Education",
"description" : "Learn faster and more effectively - record a video during the exercise and watch it right away! No need to press the play button! Instant Replay Me! lets you play a video automatically after the recording completes.   You learn to play a musical instrument and need to focus on your performance? Darken the screen while recording to avoid distracting by the image.   Record and replay the video or open an existing movie and loop it. It will be your background music for guitar lessons or singing practice.   Dreaming of an acting career, practicing for the school play or preparing a public speech? Learn acting skills and get on-camera experience with Instant Replay Me! Watch the playback, perfect your performance and improve body language.   Training outdoor, when you cant check your pose in the mirror? Simply use the Instant Replay app and watch your actions!   There are 3 ways to use this app:   FULL MANUAL - set video length using start and stop buttons.   MANUAL START - set video length using a clock button. Press start button to start recording - it will stop after the selected time.   AUTO START - set video length using clock button - recording will start automatically and stop after selected time. The record and the replay are triggered until you cancel.   To pause the replay video touch the screen.   Use front or back camera, depending on your training needs.   Instant Replay Me! can be very useful for educational purposes: piano or guitar lessons,  singing lessons,  training magic tricks,  practicing dance choreography,  acting exercises, drama lessons,  practicing public speaking, improving body language,  sport training.   * Please let me know @ boramaapps@gmail.com if some functions dont work well on your device, I will try to fix it. Thanks! ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.RECORD_VIDEO', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_VIDEO', 'android.permission.ACCESS_FINE_LOCATION']",
}