{
"name" : "offline arabic courses",
"url" : "https://play.google.com/store/apps/details?id=boudour.mohamed.arabicalphabetic",
"package" : "boudour.mohamed.arabicalphabetic",
"category" : "Education",
"description" : "Offline Arabic Courses is the perfect Arabic language learning app for non-Arabic speakers. You can learn Arabic language without needing Internet connection! This app does its best to educate the speaker by using various multimedia interactions such as pictures, audio for phrases, commonly used sentences and alphabets. You can easily understand the Arabic language as the app is rich with pictures, enabling you to understand what the sentences mean by looking at the pictures. Offline Arabic Courses has helped many speakers who wished to learn Arabic language in a very little time.   Now, you can learn Arabic language easily with various features in Offline Arabic Courses. Listen to the audios, take quiz and learn Quran completely offline from the app! The app hosts quite a number of features for fast Arabic learning:  Features     Words with Images and Voice  Easily recognize the commonly used Arabic words along with their images and listen to the audio voice at the same time to know how to pronounce them. Available offline   Phrases and Sentences with Images and Voice  Learn Arabic sentences and phrases used commonly and remember them easily by comparing with interactive images and listening to voice of native Arabic speaker.Available offline   Alphabets with Voice  Make yourself familiar with the Arabic alphabets with all pronunciations played in audio by voice of a native Arabic language speaker. Available offline    Learn Quran with Voice  Learn offline Quran with voice and easy categorizations of Quran chapters.   Game Exercise and Quiz  Improve your Arabic language skills by playing interactive word image exercises.  - Match Arabic voice audio and image with correct spellings of words - Match Arabic voice audio with correct spellings    Practice Arabic Writing  Write Arabic on your screen with guides on how to write the words. You can easily mark your improvements and corrections by choosing different colors for your writing. You can also listen to the audio of the words said by a native Arabic speaker.   Learn How to Say the time in Arabic language Get to know the pronunciation of any time in hour, minutes and day time in the voice of a native Arabic speaker.   Regularly updated Arabic texts with audio  Receive new Arabic text and audios to learn and practice via Internet connection.  Please rate Offline Arabic Courses five stars if its useful to you and help share it with your friends so that they can also learn Arabic language faster and easier! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_INTERNAL', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_INTERNAL', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_INTERNAL', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_INTERNAL', 'android.permission.ACCESS_FINE_LOCATION']",
}