{
"name" : "TOPIK ONE",
"url" : "https://play.google.com/store/apps/details?id=br.com.hd1.graziani",
"package" : "br.com.hd1.graziani",
"category" : "Education",
"description" : "TOPIK ONE is the best way to study for the Test of Proficiency in Korean in your Android phone! It simulates the real test and contains previous TOPIK exams. You can easily access the Korean-English dictionary by clicking on the word. The interface was optimized to be visualized on small screens like mobile phones. Perfect to improve your Korean while taking the subway or waiting your turn on the barber shop. Version 1.0 brings you the TOPIK 23 for Beginner, Intermediate and Advanced levels. Version 2.0 includes TOPIK 24 for Beginner and Intermediate levels. It has a very simple layout, designed specially to keep the focus on what is important: study and learn.  Contents: * 200 Questions in Beginner level (Vocabulary, Writing, Listening and Reading). * 200 Questions in Intermediate level (Vocabulary, Writing, Listening and Reading). * 100 Questions in Advanced level (Vocabulary, Writing, Listening and Reading). * Easy access to the audio of Listening parts.  Main Features: * TOPIK ONE allows you to answer and compute the result just as the real TOPIK exam. * Feedback to check if you answered correctly or not. * Fast Korean/English dictionary to see the meaning of words, by clicking on the word you would like to know the meaning. * Auto-save each answer you check. * Supports landscape view. * Download audio files  Restrictions: * Only alternative questions * Downloading audio files requires a lot of data (WIFI is recommended)  More tests: * Check the other TOPIK ONE apps from angrasoft ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'br.com.hd1.graziani.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}