{
"name" : "English Idioms and Phrases",
"url" : "https://play.google.com/store/apps/details?id=br.omb.pvidiom",
"package" : "br.omb.pvidiom",
"category" : "Education",
"description" : "FREE!!!! English idioms, phrases, expressions, sayings and words with phrases along with their meanings. Learn idioms and phrases help you improve English sentences for your conversations Idioms is a phrase wherein the words when used together, have a meaning different from the dictionary definitions of individual words. The group of words in idiomatic expressions do not mean what they appear to mean. This english grammar book app lists the English idioms and Phrases, idiomatic expression, proverbs and sayings with their meaning and examples. Phrasal verbs are verbs, not idiomatic curiosities. There is no logic to classifying take over with take the bull by the horns. Phrasal verbs are an essential part of spoken and written English at all levels, and no student who hopes to master the language can afford to overlook them.  Example: Idiom : Apple of ones eye > Meaning : Favorite  Learn some great phrases & vocabulary from this idioms and phrases app to improve your fluency during public speaking. These phrases can also be the best conversation starters.  App Highlight & Features: + English Idioms Dictionary + English Phrasal verb Dictionary + Phrasal Verb Quizzes + SPECIALLY, We added Dictionary support you in translating for 26 common languages includes:  - English - Spanish  - Arabic - Chinese - Czech - Danish - Dutch - Finnish - French - German - Greek - Hindi - Hungarian - Indonesian - Italian - Japanese - Korean - Norwegian - Polish - Portuguese - Romanian - Russian - Swedish - Swahili - Turkish - Esperanto - Vietnamese  Idioms & phrasal verbs in phrases and sayings are an ultimate challenge for language learners and so requires advanced explanations. Words with phrases in this app helps you improve your English proficiency. Its easy composition, illustrations in use and vocabulary are perfectly suitable for English grammar practice for kids, homework as well as for spoken English. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}