{
"name" : "Chemistry in Hindi",
"url" : "https://play.google.com/store/apps/details?id=chemistry.chemistry.chemistry",
"package" : "chemistry.chemistry.chemistry",
"category" : "Education",
"description" : "Chemistry Objective (Multiple Choice) General Knowledge Questions & Answers for SSC-CGL, UPPSC, UPSC, NDA, CDS and UPSC Civil Services. In this Chemistry app, quiz multiple choice questions are helpful for competitive exams SSC, PSC, IAS, IPS, ... Chemistry objective questions and answers in hindi for competitive exams.   Comprehensive up-to-date notes & study material on Chemistry for various Competitive Exams. Chemistry General Knowledge | General Science questions asked in many competitive exams and also chemistry GK is important for SSC and Banking exams.  It covers all you need to know to understand chemistry concepts. The chemistry practical exposes you to periodic table and dilution calculation. Complete chemistry offers a quiz section for evaluating your knowledge and areas you need to improve on chemistry.  This Chemistry testing app has been designed in the best possible manner so that the user can constantly improve his/her knowledge about the subject. This Chemistry testing application suits for all lower, intermediate and higher levels as this application carries a combination of questions for testing the user from the basic level to the highest level. The questions in each level will be displayed randomly.  Chemistry is the best chemistry app available on android in hindi. This app provides free chemistry topics, definitions and periodic table in your pocket. It helps you to refresh your knowledge, prepare on exams, and increase your knowledge. In this App we tried to consolidate all chemistry Formula , equation and reaction mechanism required For Intermediate Student.  The Chemistry app covers all the aspects of Physical Chemistry, Inorganic Chemistry, and Organic Chemistry or general science in hindi. This App is Extremely Useful for the students studying in Class 11 and 12 also for those who preparing for the competitive exam like JEE main , JEE Advance , BITSAT ,MHTCET , EAMCET , KCET , UPTU (UPSEE), WBJEE , VITEEE , CBSE PMT , AIIMS , AFMC ,CPMT and all other Engineering and Medical Entrance Exam.  Content Includes:  Chemistry Oneliner GK In Hindi  Chemistry Quiz In Hindi  chemistry quiz in hindi  chemistry Notes with proper defination and formulas.  chemistry practice set in hindi.  chemistry mcq with answer for competitive exams in hindi  Chemistry Objective & Practice Questions or practice set in hindi  general science one liner notes in hindi.  please rate and share this app. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}