{
"name" : "Educación Al Día App",
"url" : "https://play.google.com/store/apps/details?id=cl.connectic.educaciondia",
"package" : "cl.connectic.educaciondia",
"category" : "Education",
"description" : "Educacin al Da (EAD) monitorea activamente el ecosistema educacional nacional e internacional, selecciona la informacin educativa y recursos pedaggicos ms valiosos y los clasifica en categoras que hacen sentido a los educadores. Recibe los contenidos en la app, en el portal web y en la seleccin semanal personalizada que enviaremos a tu correo electrnico. Para qu sirve EAD? Permite a los educadores estar informados y actualizados, accediendo a una gran variedad de recursos del mundo educativo de manera fcil, rpida y econmica. Nuestro objetivo es impactar en el sector educativo al convertirnos en la principal plataforma educativa personalizada. El acceso constante a recursos de calidad empodera a los educadores y les permite mejorar continuamente su desempeo profesional, promoviendo la creacin de comunidades de aprendizaje y afectando positivamente la enseanza. EAD es contratado por colegios, universidades, fundaciones y todas aquellas personas que trabajan en el sector educativo. Desde hace un ao, ya contamos con ms de 8.000 usuarios hispanohablantes. En sntesis, Educacin al Da colabora de los siguientes modos: 1. Ahorra tiempo a los educadores en la bsqueda de recursos, capacitacin e informacin educativa. 2. Amplia la informacin y las fuentes educativas que manejan los profesores en las 15 categoras de EAD. 3. Promueve la innovacin educativa mediante el conocimiento de prcticas que den resultados en el aprendizaje de los estudiantes. 4. Es un puente entre el mundo acadmico educativo y los centros escolares. 5. Conecta a los educadores con las capacitaciones, seminarios y charlas que se realizan en educacin en cada pas. 6. Promueve el dilogo educativo y la generacin de comunidades de aprendizaje. Cmo lo hacemos? A travs de una plataforma y de un equipo especialista en materias de educacin, se monitorean ms de 300 fuentes educativas, se seleccionan los recursos ms valiosos, se realiza un proceso de curacin de contenido (resumen de 2 lneas, de 10 lneas y el acceso a la fuente original) y se categorizan en:  - Aprendizaje Colaborativo - Innovacin Educativa - Convivencia Escolar - Liderazgo Educativo - Tendencias Educativas Internacionales - Evaluacin de Aprendizajes - Educacin Popular - Trabajo con Familias - Educacin Inclusiva - Psicologa del Desarrollo - Tendencia de Nios y Jvenes - Gestin Escolar - Procesos de Enseanza y Aprendizaje - TICS - Polticas Pblicas  Esta informacin es actualizada diariamente y puedes revisar todo en el sitio web y en la app. Adems, recibes una vez a la semana un correo personalizado con los mejores recursos, herramientas e informacin de tus 5 categoras favoritas.  Cul ha sido la recepcin del servicio? Un 94% de nuestros usuarios considera que los recursos son de muy buena o buena calidad, un 92% seala que su experiencia en EAD haba sido muy buena y un 76% indica que ha utilizado exitosamente recursos de EAD en la sala de clases, impactando en el aprendizaje de los estudiantes. Finalmente, un 96% recomendara Educacin al Da a otros profesores.  Te esperamos en Educacin al Da!! Para mayor informacin puedes ingresar a www.educacionaldia.cl o escribir a contacto@educacionaldia.cl Education Day (EAD) actively monitors national and international educational ecosystem, selects the most valuable educational information and educational resources and classifies them into categories that make sense to educators. Get those contained in the app, on the web portal and the personalized weekly selection send to your email. What is EAD? It allows educators to be informed and updated by accessing a variety of resources in the education world easily, quickly and economically. Our goal is to impact on the education sector to become the main personalized educational platform. Constant access to quality resources empowers educators and enables them to continuously improve their professional performance, promoting the creation of learning communities and positively affecting teaching. EAD is hired by colleges, universities, foundations and all those working in the educational sector. A year ago, we already have more than 8,000 Spanish-speaking users. In short, Education Day collaborates in the following ways: 1. Save time educators in search of resources, training and educational information. 2. Extensive information and educational resources that teachers handle in the 15 categories of EAD. 3. Promotes educational innovation through knowledge of practices that give results in student learning. 4. It is a bridge between academia and educational schools. 5. Connect educators seminars with talks taking place in education in each country training, and. 6. Promotes educational dialogue and creating learning communities. How do we do it? Through a platform and a specialist in matters of education equipment, more than 300 educational sources are monitored, the most valuable resources are selected, a healing process content (summary of 2 lines, 10 lines and access is made to the original source) and categorized in:  - Collaborative learning - Educational Innovation - School life - Educational Leadership - International Educational Trends - Evaluation of Learning - Popular Education - Work with Families - Inclusive education - Developmental Psychology - Trend of Children and Youth - School Management - Teaching and Learning Processes - TICS - Public politics  This information is updated daily and can review everything on the website and the app. In addition, you receive once a week a personalized email with the best resources, tools and information for your 5 favorite categories.  What has been the reception of the service? 94% of our users consider that resources are very good or good quality, 92% said that their experience in distance learning had been very good and 76% indicates that it has successfully used resources EAD in the classroom, impacting in student learning. Finally, 96% Education Day recommend other teachers.  I hope in Education Day !! For more information you can enter www.educacionaldia.cl or write to contacto@educacionaldia.cl ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'cl.connectic.educaciondia.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}