{
"name" : "Read With Akili - So Many Different Places!",
"url" : "https://play.google.com/store/apps/details?id=co.akiliandme.curiousreader.differentplaces",
"package" : "co.akiliandme.curiousreader.differentplaces",
"category" : "Education",
"description" : "SO MANY DIFFERENT PLACES  Join Akili on an adventure through night and day, as she visits different places and finds that the world is full of wonderful things!   Where will Akili go next? The forest? The ocean? Back home? With this interactive book, its YOUR decision. And dont forget to make the birds flap, the monkeys play and the boats race along the way!  From the fluffy clouds up above to the shimmering ocean down below, explore the world with this uplifting story. You can even choose to read in English or Kiswahili!   KEY FEATURES  * READ from a choice of three levels of difficulty * EXPLORE words, pictures, and ideas through different interactive features  * LISTEN to the full story as well as individual words * CHOOSE where Akili goes next-- make the story your own * AKILI narrates the whole story herself * HAVE FUN learning to read   FREE TO DOWNLOAD, NO ADS, NO IN-APP PURCHASES! All content is 100% free, created by nonprofits Curious Learning and Ubongo.    THE TV SHOW - AKILI AND ME  Akili and Me is an edutainment cartoon from Ubongo, creators of Ubongo Kids and Akili and Me - great learning programs made in Africa, for Africa. Akili is a curious 4-year-old who lives with her family at the foot of Mt. Kilimanjaro, in Tanzania. She has a secret: every night when she falls asleep, she enters the magical world of Lala Land, where she and her animal friends learn all about language, letters, numbers, and art while developing kindness and coming to grips with their emotions and rapidly changing toddler lives! With broadcast in 5 countries and a massive international online following, kids from around the world love going on magical learning adventures with Akili!  Watch videos of Akili and Me online and check the website www.ubongo.org to see if the show airs in your country.   ABOUT UBONGO  Ubongo is a social enterprise that creates interactive edutainment for kids in Africa, using the technologies they already have. We entertain kids to LEARN & LOVE LEARNING!  We leverage the power of entertainment, the reach of mass media, and the connectivity provided by mobile devices to deliver high-quality, localized edutainment and educational    ABOUT CURIOUS LEARNING  Curious Learning is a non-profit dedicated to promoting access to effective literacy content for everyone who needs it. Were a team of researchers, developers, and educators dedicated to giving children everywhere literacy education in their native language based on evidence and data.  ABOUT THE APP  Read With Akili - So Many Different Places! was created using the Curious Reader platform developed by Curious Learning for making engaging, interactive reading experiences. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}