{
"name" : "Cupcakes cooking and baking games for kids",
"url" : "https://play.google.com/store/apps/details?id=co.pazugames.com.cupcakeshop",
"package" : "co.pazugames.com.cupcakeshop",
"category" : "Educational",
"description" : "Cupcakes cooking games introduces the colorful world of cooking, baking and cupcake decorating.  Enjoy the entire cooking and baking process of cupcakes by adding the ingredients, stirring the mixture, and choosing flavours. When the cupcakes are out of the oven its time to get creative with a variety of toppings, candies and decorations.  The game is designed for kindergarten and preschool children, providing an educational experience for kids to play and learn. The game is suitable for young boys and girls to be able to play on their own, without the support of adults. Cupcakes cooking games is brought to you by Pazu Games Ltd, the publisher of popular kids games like Girls Hair Salon, Makeup Girls, Animal Doctor and others, that are trusted by millions of parents worldwide. The game provides an opportunity for your kids to express their creativity, spark their imagination, improve their motor skills and enjoy the many accessories and props available.  Pazu games for toddlers are designed especially for boys and girls under the age of 5. It offers fun learning games for toddlers to enjoy, with educational benefits that parents like. We invite you to try out Pazu games for kids and toddlers for free and discover a wonderful brand for kids games, with a large arsenal of educational and learning games for both boys and girls. Our games offer a variety of game mechanics adapted to the kids age and capabilities. Pazu games have no ads so the kids have no distractions while playing, no accidental ad clicks and no external interferences.  For more information, visit our website: https://www.pazugames.com/ ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}