{
"name" : "Yask - A new way to practice languages",
"url" : "https://play.google.com/store/apps/details?id=co.yaskapp",
"package" : "co.yaskapp",
"category" : "Education",
"description" : "Improve your writing and pronunciation skills with Yask! Practice your favorite language with fun and challenging exercises that automatically adapt to your language level and are reviewed by native speakers. Do you want to write or say out loud any other sentence you have in mind? You can do it too!   In Yask, you have thousands of friends from all over the world who help you improve your language skills :) You can use your native language to help them back, while you have fun and get rewarded for it!  But thats not all: Practicing with Yask is not only fun, but also efficient. Yask applies the latest language technologies to personalize everything you see, taking into account your level in each language. Our Machine Learning algorithms evaluate every answer you receive and pick the best one for you. Awesome, right?! And the best of all, its totally free ;)  You can currently practice English, Spanish, French, German, Russian, Portuguese, Italian, Haitian Creole, Dutch, Swedish, Norwegian, Danish and Finnish. Many more languages are coming soon.   What are some of the best things about Yask?  - Personalized writing exercises Find hundreds of thousands of real-world sentences automatically adapted to your language level and learn how to write correctly with the help of native speakers.  - Check your pronunciation with native speakers Record your own voice and then native speakers will record their own pronunciation of the same sentence for you to listen, compare and learn :)  - Sentence corrections and translations verified in real-time Get instant automatic answers which are checked straight away by native speakers around the world. Its the best combination!  - Intelligent sentence evaluation Yask intelligently evaluates and selects the best sentences, so you can always get reliable answers. Easy and practical!  - Interact with friends from around the world You can chat with other users to ask for explanations or to comment about any sentence. Write in your native language and others will see your messages in their own language. In this way, you can chat with anyone even without having languages in common!  - Power-ups and privileges for helping others While you help other users, you level up and gain access to additional fun and useful features. You can also acquire power-ups that boost and enhance your own requests. Everything depends only on your participation, its 100% free.   Download it now and let us know your thoughts! If you just want to say hello, well also be happy to receive your message. Contact us at hello@yask.ai   Visit us at: https://www.yask.ai/ Facebook - https://www.facebook.com/yaskapp/ Twitter - https://twitter.com/yaskapp ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.sec.android.provider.badge.permission.WRITE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.RECORD_AUDIO', 'com.htc.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE']",
}