{
"name" : "Algorhyme - Algorithms and Data Structures",
"url" : "https://play.google.com/store/apps/details?id=com.globalsoftwaresupport.algorithmsapp",
"package" : "com.globalsoftwaresupport.algorithmsapp",
"category" : "Education",
"description" : "This Algorhyme - Algorithms and Data Structures app is for visualizing core algorithms and data structures.  In this application we focus on 4 main topics:  1.) SEARCH ALGORITHMS  Well cover the theory as well as the implementation of the most relevant search algorithms!   linear search  binary search  Search algorithms are used on a daily basis in applications and softwares. This is why it is crucial to know how they work exactly!  2.) SORTING ALGORITHMS  Sorting is another fundamental topic in computer science and software engineering. Lets consider what approaches you can learn:   bogo sort  bubble sort  cocktail sort  selection sort  insertion sort  shell sort  merge sort  quicksort  These are the fundamental sorting algorithms! You can check the algorithms on few items as well as on a huge datasets!  3.) DATA STRUCTURES  Bad programmers worry about the code. Good programmers worry about data structures and their relationships. This is why it is crucial to learn about data structures: how to store data efficiently and how to access it as fast as possible.   binary search trees  tree rotations in AVL trees  AVL tree animations  red-black tree animation  4.) GRAPH ALGORITHMS  The final topic is graph algorithms - the most common and most important approaches when dealing with graphs!   breadth-first search (BFS)  depth-first search (DFS)  Dijkstras shortest path algorithm  spanning tree algorithm (Kruskals method)  You can visualize and test maze solving as well. How to use BFS, DFS or A* search to get out of a user generated maze? Check it out!  This app will help you to understand sorting algorithms, search algorithm, data structures and graph algorithms (without the need of internet).  Algorhyme is brought to you by www.globalsoftwaresupport.com. At Global Software Support, we help you with programming, algorithms, data structures, quantitative finance and artificial intelligence, so you feel confident putting your best foot forward in the professional world.  Enjoy the app! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}