{
"name" : "Montessori Preschool",
"url" : "https://play.google.com/store/apps/details?id=com.edokicademy.montessoriacademy",
"package" : "com.edokicademy.montessoriacademy",
"category" : "Education",
"description" : "Looking for an app that covers phonics, numbers, colours, shapes, nursery rhymes, colouring and even coding?   Designed by certified Montessori teachers with years of classroom experience, it is a fun child-centred app, perfect for children from 3 to 7.  Math Our math curriculum covers learning to count, recognize numbers, trace them from zero to 1 million. Introduction to addition and subtraction using Montessori materials are also available.  Early Literacy From sounds to phonics to reading. In a Montessori classroom, early literacy starts before learning to read. Children are exposed to sounds and train their ear to identify them before putting a name on a letter. In the Early Literacy class, children can start with fun sound games like I spy and move all the way to reading comprehension.   Logic and coding The app also offer a pre-coding and reasoning games.  Nursery Rhymes Younger children love our latest additions: Wheels on the bus and Head, shoulders, knees & toes sing alongs.  Shapes & Colours A key element of preschool; learn the names of all the shapes and colours but in a fun, interactive way!  3D Children can play with the schools hamster and rabbit in 3D.  Arts & creativity Our Arts class includes an introduction to colours (primary and secondary) as well as many drawing/colouring options and 4 games to learn the basics of music.   Practical Life Because children this age love to reproduce everyday activities done by adults, Maria Montessori included a range of activities like dusting, taking care of plants, cleaning a mirror or washing clothes. Montessori Preschool welcomes users in a digital school with lockers, a corridor full of daily responsibilities or discoveries.   Chinese Our cute Chinese classroom offers numbers, songs and a few words in Chinese.  Other languages available: Spanish, Chinese, French and German  FEATURES: - A comprehensive Montessori 3-7 years old environment to learn by doing  - Regular updates and new content to make the app forever captivating!  - An enchanting digital classroom to make learning fun and simple for children at every stage - 4 broad areas of learning grounded in the fundamentals of Montessori: self-correction, autonomy, self-confidence and adaptability  - A fun reward system for increased motivation - Parents/teachers benefit from a tailor-made dashboard that tracks each childs progress and suggests the next activity.  Whether you are a newcomer to the world of Montessori, or a seasoned student, Montessori Preschool is sure to take each learner on an enthralling journey!   Subscription automatically renews unless cancelled at least 24-hours before the end of the current period. Subscriptions may be managed by the user.  ABOUT US  Edoki Academys mission is to provide children with enjoyable early-learning activities using the latest technologies. Our team members, many of whom are young parents or teachers, strive to produce tools that motivate and inspire children to learn, play, and progress.  PRIVACY Read our Privacy Policies: https://www.edokiacademy.com/en/privacy-policy & our Terms of Use: https://www.edokiacademy.com/en/terms.  Contact us: support@edokiacademy.com ",
"desc_perms" : "['android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.appmarket.service.commondata.permission.GET_COMMON_DATA', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.appmarket.service.commondata.permission.GET_COMMON_DATA', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}