{
"name" : "Arabic French Offline Dictionary &  Translator",
"url" : "https://play.google.com/store/apps/details?id=com.dragoma.arfr",
"package" : "com.dragoma.arfr",
"category" : "Education",
"description" : "Burn the words like a dragon with Dragoma!  The free        &  application. Internet connection is not required! If you want to learn French or Arabic the most effective way, theres no better choice than Dragoma! Dragoma shows the definition/meaning of French or Arabic words as pop up without opening dictionary app ever. No hassle of switching between apps. You can look up word definitions while reading PDFs/e-books while browsing the internet and even while playing games. Just copy the word, Dragoma dictionary will show you the meaning/translation.   Welcome to download the        &  / hors ligne Arabe Franais Dictionnaire & Traducteur  Features:   Super Search with pop-up button/hover button/floating button.  Example sentences translation.  Voice recognition on Dictionary and Translator.  Audio pronunciations.  native speakers pronunciations with videos.  Flashcards - Memorise basic vocabulary effectively!  Favorites  Notes. Take notes about the words.  Random words.  Tests.  Search option is working on both French - Arabic and Arabic - French directions.  Super Search: 1. Select and hold the word you would like to get the definition for. 2. Click on the copy option from the Options Menu. 3. Meaning (translation) and a pop-up button will be shown right there on the screen.   Required Permissions:  INTERNET  if text-to-speech (TTS) is not available, app needs to be online. Example translations, Videos for native speakers pronunciation and online machine translator also needs to be online. And to show the ads to support the free version. SYSTEM_ALERT_WINDOW  app needs this permission to show the floating icon on other screens with super search option. RECEIVE_BOOT_COMPLETED  required to start the super search on system restart so that users do not need to start super search feature manually every time they restart the system.  ABOUT Dragoma  Web site:  http://www.dragoma.com   Facebook:  http://www.facebook.com/dragomacom  Twitter:  http://twitter.com/dragomacom  Instagram: http://www.instagram.com/dragomacom/  Email:  app@dragoma.com  DISCLAIMER: The text-to-speech (TTS) technology may not be available in some devices. To check if your phone is able of speech synthesis: Menu -> Settings -> Voice input & output -> Text-to-speech settings. If not installed, your device may ask you to install the TTS engine. An internet connection may be required. We recommend installing it before traveling as roaming data tariffs may be very expensive. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}