{
"name" : "COME ON Phonics",
"url" : "https://play.google.com/store/apps/details?id=com.ne.comeonphonics.studentbook.kor.android",
"package" : "com.ne.comeonphonics.studentbook.kor.android",
"category" : "Education",
"description" : "Come On Phonics is a five-level phonics series designed to teach phonics through an easy and child centered approach.   Features A child-centered and easy-to-follow approach allows students to quickly understand each lesson and activity. Fun chants and stories help learners to remember the sounds and meanings of words. A variety of activities give students the opportunity to use what they have learned. Poster-sized board games provide a review of several units together. A DVD-ROM includes animations, games, and audio material to allow in-class or at-home practice.   Come On, Phonics ?  -                  . -         . -      . - Flashcards, Audio Track     . -          .  [  ]  Come On, Phonics1 - The Alphabet Come On, Phonics2 - Short Vowels Come On, Phonics3 - Long Vowels Come On, Phonics4 - Consonant Blends Come On, Phonics5 - Vowel Teams Come On Phonics is a five-level phonics series designed to teach phonics through an easy and child centered approach.   Features  A child-centered and easy-to-follow approach that allows students to quickly understand each lesson and activity.  Fun chants and stories help learners to remember the sounds and meanings of words. A variety of activities give students the opportunity to use what they have learned. Poster-sized board games provide a review of several units together. A DVD-ROM includes animations, games, and audio material to allow in-class or at-home practice.   Come On, Phonics?  - Since the learning stage is structured systematically according to the cognitive abilities of the learner, such as herbal medicine, learners who are familiar with phonics for the first time can easily learn. - You can learn phonics fun with interesting chant and story. - A variety of activities are available, including group activities. - Multimedia learning materials such as Flashcards and Audio Track are provided. - Animation and games are provided for funny review of learned phonics.  [Organization of each volume]  Come On, Phonics1 - The Alphabet Come On, Phonics2 - Short Vowels Come On, Phonics3 - Long Vowels Come On, Phonics4 - Consonant Blends Come On, Phonics5 - Vowel Teams ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}