{
"name" : "Easy Spanish Full - Fast Offline Language Learning",
"url" : "https://play.google.com/store/apps/details?id=com.apptomotion.easyspanishfull",
"package" : "com.apptomotion.easyspanishfull",
"category" : "Education",
"description" : "The full version of the Easy Spanish series, Easy Spanish Full - Fast Offline Language Learning, is just what you need!  Easy Spanish Full - Fast Offline Language Learning, is the best and ultimate pocket course app to master your Spanish skills and take them to the next level, designed specially to cover the basics and also complex issues of the Spanish language, which contains the best lessons set very well explained and distributed strategically in several units, specifically designed for you to learn quickly and have a good command of Spanish in a record time, it doesnt matter if you are starting your study from scratch, and the best of all.. totally offline and for free!  With this app-course, you will get:  - Over 100 lessons (9 units) with the neccesary theory, grammar content and tips on Spanish to understand the structure of the language and learn how to speak fluently: Verb Ser-Estar and Gustar, Verbal Tenses, Nouns, Adjectives, Adverbs, Prepositions, and much more! - Every lesson has a quiz at the end that will let you test your knowledge, take it as many times as you need. - All the necessary vocabulary classified in different items to form effective sentences that make sense. - A pronunciation module with the entire set of the 51 existing sounds in Spanish (including real native audios) to listen and repeat: Vowels, Consontants, Diphthongs, Intonation and Linking. - A reading option where you will find a very fun weekly story to read; and dont forget to take its quiz! - Last but not least, a chat section to finally practice your learned skills and chat with other users or with a talking bot!  So, what are you waiting for? Lets go Spanish now, Vamos a aprender full Espaol!!! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}