{
"name" : "AMUCDE",
"url" : "https://play.google.com/store/apps/details?id=com.lurningo.amu",
"package" : "com.lurningo.amu",
"category" : "Education",
"description" : "AMUCDE is the learning platform of Aligarh Muslim University. The platform also offers several employment-linked skill development programs that the students can pursue alongside their degree and diploma programs.   Class Room in your Pockets AMUCDE has revolutionized the distance learning by effective use of curated audio-visual content. The app has the ability to deliver the courses in multiple languages. The students can access the audio-visual content on their smartphones, attempt self-assessment tests, upload assignments, get calendar alerts, pay fees online and raise a trouble ticket using the app.  The best hybrid learning app AMUCDE has been built to ensure that the app still works even when the students do not have connectivity to the Internet. Toggle yourself to the offline mode and access your content using the Lurnaid facility. However, this offline feature only works for students who have the Lurnaid card on their phones.   Key Highlights  AMUCDE has been architected keeping the following in mind:   Online education can deliver a very high quality program  Helps the student remain connected with the University  Helps the University provide very high level of student services  Helps student take additional skill development programs alongside  Provides internship and scholarship opportunities  Provides placement assistance for some of the Employment Linked Skilling Programs  Learn Better! Get Skilled! Get placed! Download the App Now! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CALENDAR', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.USE_CREDENTIALS', 'android.permission.WRITE_CALENDAR', 'com.google.android.c2dm.permission.RECEIVE', 'com.lurningo.amu.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_CALENDAR', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}