{
"name" : "Chinese Audio Trainer Free",
"url" : "https://play.google.com/store/apps/details?id=com.molatra.chineselistenerlite",
"package" : "com.molatra.chineselistenerlite",
"category" : "Education",
"description" : "Chinese Audio Trainer is a complete Chinese audio course on your Android device. Hear native Chinese audio recordings and clear spoken English for words from thousands of themed vocabulary lists including HSK, TOCFL, lists by situation, Chinese level, frequency of use and so much more. Learn business Chinese, travel Chinese, how to bargain, argue, make friends...   This free version features more than 500 words to learn in sixteen word lists. The complete app contains 60,000 words spread across more than 1,000 lists, and you can find it here: http://play.google.com/store/apps/details?id=com.molatra.chineselistener.   Download only the words that you want to learn - and save them on your device or SD card.   Its even better than an audio course - you can control the order and number of Chinese and English repetitions, and make words appear more or less frequently depending on how interested you are in them.   Words are taken from the extensive trainchinese database, the same one used in our popular Dictionary and Flash cards app. That means well-organised and comprehensive coverage of modern spoken Mandarin Chinese.   Pinyin transliterations are shown as each word plays.   You can also download word lists from your personal trainchinese account and receive words for audio training from the trainchinese Dictionary and Flash cards application for Android.   Curious about the permissions this app requests when you install? Theyre just to help us detect when youre receiving a phone call (but not anything about the call) - so the audio can be paused while you chat! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_INTERNAL_STORAGE', 'com.android.vending.CHECK_LICENSE']",
}