{
"name" : "Innovative 101: Learn Spanish, English, & 32 more",
"url" : "https://play.google.com/store/apps/details?id=com.innovativelanguage.innovativelanguage101",
"package" : "com.innovativelanguage.innovativelanguage101",
"category" : "Education",
"description" : "Want to learn a new language in minutes a day? And start speaking? With Innovative Language 101, you get 3-15 minute audio/video lessons that teach you languages the fast, fun and easy way.  Learn Spanish, English, French, German, Italian, Japanese, Chinese, Korean, Russian, Hebrew, Cantonese, Thai, Arabic, Portuguese, Dutch, Greek, Hindi, Polish, Swedish, Vietnamese, Indonesian, Filipino, Turkish, Persian, Norwegian, Finnish, Hungarian, Bulgarian, Swahili, Czech, Danish, Afrikaans, Romanian, and Urdu.   Learn 34 languages the fast, fun, and easy way with Innovative Language 101.  Start now and access hundreds of audio and video lessons by real teachers, lesson notes, study tools and more. With 500+ million downloads and 10 years of experience, youre learning with a time-tested, proven system. Choose a language and learn anywhere, anytime. You can:  -Access a 7-Day Free Premium Trial of Any of Our Language Courses (Free)  -Get New Audio & Video Lessons EVERY Week for LIFE (Free) -Learn Offline by Downloading Lessons to My Library (Free) -Get Daily Vocab Lessons Delivered to Your Email (Free) -Switch Between All of Your Devices & Computer Without Losing Progress (Free) -Use Multiple Playback Options: Stream from the App or the Lock-Screen, Skip Ahead & Control the Speed of Your Lessons (Free) -Access the Largest Library of Audio & Video Lessons (Basic Users & Above) -Access In-Depth Lesson Notes & Read with Every Lesson (Basic Users & Above) -Track Your Learning Progress with Progress Bars (Basic Users & Above) -Fully Master Conversations with Line-by-Line Audio (Premium Users & Above) -Create Personal Word Lists with the Word Bank (Premium Users & Above) -Enjoy 1-on-1 Learning with Your Own Teacher (Premium PLUS only) -Get a Personalized Learning Program & Guidance (Premium PLUS Only)  Download the App right now and sign up for your Free Lifetime Account. You get a 7-day Trial of our entire Learning System  both the mobile app and the desktop version! Only want mobile access? Easily upgrade in-app with exclusive Mobile Only subscriptions. Want to add Basic or Premium and learn on your device and computer? Theres an option for that, too.   *Please note that subscriptions made using the in-app purchases will auto-renew at the end of the subscription period and be charged to your Google Play account at confirmation of purchase unless you turn off auto-renew at least 24 hours before the end of your current subscription period. Subscriptions made through in-app purchases cannot be cancelled during active subscription period. Please see this article for managing your in-app subscriptions and auto-renewal: https://support.google.com/googleplay/answer/2476088  Monthly Premium PLUS Access: $46.99/month per language Monthly Premium Access: $24.99/month per language Monthly Basic Access: $7.99/month per language Monthly Mobile Only Access: $9.99/month per language  *all amounts are in US dollars  At Innovative Language Learning, we take your privacy very seriously. You can view our privacy policy here: http://www.innovativelanguage.com/privacy ",
"desc_perms" : "['', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BLUETOOTH', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION']",
}