{
"name" : "Bewise Classes - NEET Chemistry",
"url" : "https://play.google.com/store/apps/details?id=com.spayee.bewisekota.reader",
"package" : "com.spayee.bewisekota.reader",
"category" : "Education",
"description" : "NEET Toppers First Choice, Bewise Classes - NEET Chemistry App is the most recommended app for learning class 11th and class 12th chemistry, according to the NCERT syllabus for NEET exam preparation.  BeWise Classes is an online/offline institute located at Kota which provides coaching for Chemistry to pre-medical aspirants. Sunil Nain Sir (Coached 10,000+ Selected Students, famous Chemistry Teacher, Author of AIIMS book published by mtg publication) founded BeWise Classes in 2015. Since then, BeWise Classes has produced many toppers in NEET/AIIMS exam (AIR 25  VV ANIRUDH, AIR 33  Aman Tilak, AIR 64  Karthik Ajith & AIR 94  Kushagra Jain & many more).  Now Join the league of toppers just by downloading BeWise Mobile App.  To help students, BeWise Classes has launched a mobile app, using this many Pre-Medical Students are scoring 160+ in NEET Chemistry Exam. All NEET Aspirants can use Top-Rated Kota Coaching Chemistry Video Lectures & Online Test Series with Free Handwritten Kota Classroom PDF Notes for their NEET 2020 Preparation.  We Teach ONLY CHEMISTRY, and we do it best. LEARN Anywhere! LEARN Anytime!   Why BeWise Classes? Learn from Top Rated Most Loved Chemistry Teacher Proven Track Record | Helped 10,000+ Pre-Medical Selected Students Across India World-class pedagogy of Learn-Practice-Test 15000+ Positive Reviews and Happy Pre-Medical Students All courses based on NCERT, CBSE, NEET, AIIMS, JIPMER, etc. examinations.  Features:  STEP BY STEP GUIDANCE for NEET exam preparation Complete NEET Chemistry Notes + Video Lecture + Online Tests Series 24x7 Doubt Solving Forum monitored by Sunil Nain Sir Track, monitor, and evaluate your performance for your NEET 2020 Instant test evaluation & result. Access to test solution just after the submission of test Practice from Pre-Medical Entrance Exam based 3000+ Chemistry MCQs You can do self-study at home for all medical college entrance exams without any hassle.  You can access courses on Mobile, Tablet and Computers and Laptop.  Courses Available- NEET Chemistry Online Test series with Detailed Video Solution - 60+ Chapter-wise Tests & 10 Full Syllabus Tests NEET Crash Course for CHEMISTRY NCERT based Class 11 Chemistry Notes - Download free PDF NCERT based Class 12 Chemistry Notes - Download free PDF Free Chemistry Quiz - 30+ Chapter-wise tests (Each Consist of 10 questions) Free Chemistry Video Lecture  Class 11 Chemistry Test Series    Complete NEET Chemistry Syllabus Covered as Mentioned:  Topics covered as per NCERT 11th Chemistry for NEET Exam  Physical Chemistry 1.Some Basics of Chemistry 2. Structure of Atom 3. States of Matter 4.Thermodynamics 5. Chemical Equilibrium 6. Ionic Equilibrium 7. Redox Reactions   Inorganic Chemistry 1. Periodicity and Classification of Elements 2. Chemical Bonding and its Molecular Structure 3. Hydrogen 4. The s-Block Elements 5. The p-Block Elements - Boron & Carbon Family  Organic chemistry 1.Organic Chemistry  Some Basic Principles and Techniques 2. Hydrocarbon 3. Environmental Chemistry  Topics covered as per NCERT 12th Chemistry for NEET Exam  Physical Chemistry  1. Solid State 2. Solutions 3. Electrochemistry 4. Chemical Kinetics 5. Surface chemistry  Inorganic Chemistry 1. The p-Block Elements 2. The d-and f-block Elements 3. Coordination Compounds 4. General Principles and Processes of Isolation of Elements  Organic chemistry 1. Haloalkanes and Haloarenes 2. Alcohols, Phenols, and Ethers 3. Aldehydes, Ketones and Carboxylic acids 4. Amines 5. Biomolecules 6. Polymer 7. Chemistry in Everyday Life  Many students who are preparing for NEET Exam chose Top-Rated Chemistry Courses by SUNIL Nain Sir to improve their score. They found it the most helpful app to learn Neet Chemistry according to NCERT Class 11th and Class 12th Chemistry Syllabus.  You can download this NEET Preparation App to complete Class 11th & Class 12th Chemistry step by step with Free PDF Notes.  Contact: Email bewiseclasses690@gmail.com Call us - 07340250100 ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'com.spayee.bewisekota.reader.permission.C2D_MESSAGE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.MICROPHONE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.MICROPHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
}