{
"name" : "Speed Learning",
"url" : "https://play.google.com/store/apps/details?id=com.speed.speedlearning",
"package" : "com.speed.speedlearning",
"category" : "Education",
"description" : "Speed Learning app covers the entire syllabus of the test with engaging video lessons, chapter wise tests, detailed analysis, adaptive learning, personalized feedback and continuous mentoring.  The fastest way to prepare for NEET.  Speed Learning app is an awesome learning tool for students preparing for the NEET-UG. The app covers the entire syllabus of the test with engaging video lessons, chapter wise tests, detailed analysis, adaptive learning, personalized feedback and continuous mentoring.  Speed Learning provides a convenient and simple way for students to prepare for the NEET-UG exams any where, any time and in any device. The app provides the full and end to end course details of the NEET-UG basic course.  Major Features: 1. Course Videos : Delivered by Indias experienced teachers and produced by industry experts with the best use of animations and graphics to easily help students to understand the concepts quickly.  2. Course Books : Perfect study guides for the NEET course with detailed course content and an easy to ready format. Prepared and edited by experienced teachers.  3. Course Tests : Exhaustive tests on each of the areas of the study with instant results and results comparison. All India ranking and personalized guidance to areas of improvements.  4. Personal Mentors : Instant access to experienced mentors for the courses from within the app. Get questions or clarifications answered by personal mentors.  The app also provides options to select other advanced courses with more detailed course contents. All contents in Speed learning app are created by experienced teachers and curated by industry experts to provide the maximum knowledge to students in the shortest time possible. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.STORAGE', 'android.permission.CAMERA', 'com.speed.speedlearning.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}