{
"name" : "Chocolate Candy Bar - Flavored Candy Sweet Maker",
"url" : "https://play.google.com/store/apps/details?id=com.funpop.android_candy",
"package" : "com.funpop.android_candy",
"category" : "Education",
"description" : "You can bake some chocolate candy and ice candy in this candy bar and chocolate bar. Candy maker in this candy games for girls can make round lolly and chocolate in different yummy flavor. Just come to our chocolate farm of the sweet games to learn how to become a little loliipop maker and buy flavored chocolate in candy shop!  Chocolate candy bar and candy store game features: 1.Collect chocolate in candy bar and chocolate farm, and add some cotton candy and round lolly. You can experience candy fun and become a candy maker in this candy makeover game! 2.Oh my, Ive got the candy fever! I want candy from candy shop and delicious candies of candy store. To experience the happy candy fantasy in chocolate factory with candy maker is so fun! 3.I have a sweet tooth and I love ice candy and hocolate so much! Id like to stay at chocolate farm or chocolate bar for a whole day to enjoy the candy fun and sweet games. I will be a sweet candy maker in the chocolate games! 4.Time to take candy challenge! Little lollipop maker, make some colorful candies and flavored bonbon to attend the food festival, I bet youll have a sweet sale of your kitchen candy! 5.Candy girl, join this happy candy making game now! You will know how to cook delicious candies and sweet tarts. You will be a professional food maker after you experienced the fun candy world. Start your candy story now! 6.Wow, theres a lot of bonbon and easter candy in the sugar factory! I love bonbon candies & sweeties! Colorful candies and gummy candy can make pop maker happy, I will cook plenty of yammy candy for this happy candy world. 7.Little lollipop maker has different flavored bonbon candies in the sugar factory, which flavors are your favorite? I like soda flavor and chocolate berries best. But only the pop maker can make this yammy candy. Candy maker, will you take the candy challenge to make the ice lolli or gummy bear? I bet you will win the sweet medals! 8.My cotton candy is running out! I want candy at once! Little candy maker, please buy me some sweets and candy sweet from the treat shop, I want soda flavor! 9.Little ice lolly maker, time to make sweet & delicious candies. Add toffee, pearl and nut in hot chocolate. These are games for shaking as well, just shake it then put it into ice candy bars to cool it, and the sweet candy is done! 10.I know youre a fair food maker of this candyland, but youre always sugary cause you own a fun factory and ice candy bars. I believe we will have a perfect candy story together!  Join the games for free for girls right now, therere lots of sweets in candy store, and those colorful candies can make you have happy sweet bones and sweet tooth. I cant wait to eat those delicious candies, just download the candy games for girls now!  ABOUT FunPop FunPop are specialize in kids games on mobile platform. We are aiming to provide innovative & educational game for the whole family. We help them to learn the basic life skills and good habits through our games.  Visit us: http://www.funpop.com.cn  Watch us: https://www.youtube.com/c/FunPopMedia  CONTACT US  Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@funpop.com.cn ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.funpop.android_candy.permission.C2D_MESSAGE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.GET_TASKS', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_PHONE_STATE']",
}