{
"name" : "Chemistry and Physics 12 Class notes",
"url" : "https://play.google.com/store/apps/details?id=com.e.chemistrynotes12class",
"package" : "com.e.chemistrynotes12class",
"category" : "Education",
"description" : "In this age of data networks and internet it is very important to have best way to study 12th class Chemistry and Physics notes.  - Easy load and quick open - Chemistry and Physics of 12 Class notes - Help you to learn and understand the 12 class notes of Chemistry and Physics  - You may find this easy to learn and understand - Chemistry and Physics of 12 Class notes - This may help you to revise the 12th class - Chemistry and Physics of 12 Class notes - Huge collection of Chemistry and Physics of 12 Class notes - Chemistry and Physics of 12 Class notes - Easy explanation of various 12th class concepts - Chemistry and Physics of 12 Class notes - Share Chemistry and Physics of 12 Class notes concepts with your friends on social media networks. - Chemistry and Physics of 12 Class notes - Save the Chemistry and Physics of 12 Class concepts to your mobile. - Chemistry and Physics of 12 Class notes  Top Topics - Chemistry and Physics 12 Class notes  Chemistry (Chemistry of 12 Class notes)  The Solid State Solutions ElectroChemistry Chemical Kinetics Surface Chemistry General Principles and Processes of elements The p-Block Elements The d and f-Block Elements Coordination Compounds Haloalkanes and Haloarenes Alcohols,Phenols and Ethers Aldehydes,Ketones and Carboxylic Acids Amines Chemistry in Everyday Life  Physics (Physics of 12 Class notes)  Electric Charges and Fields Electrostatic Potential and Capacitance Current Electricity Moving Charges and Magnetism Magnetism and Matter Electromagnetic Induction Alternating Current Ray Optics and Optical Instruments Wave Optics Dual Nature of Radiation and Matter Atoms Nuclei Communication Systems  We highly appreciate feedback from our users. We hope that you will like our app. If you have used our app and like it please give rating to the app. Also give us your valuable feedback. Enjoy!!!  12 Class notes of Chemistry and Physics ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}