{
"name" : "Flute Master - Learn Recorder",
"url" : "https://play.google.com/store/apps/details?id=com.classplash.flutemaster",
"package" : "com.classplash.flutemaster",
"category" : "Educational",
"description" : "A fun and colourful game where you will learn how to play a real instrument: the recorder! Great for teachers: use a projector or interactive whiteboard and engage your classroom like never before!  NOTE: If you are a school or a teacher looking to buy in bulk (volume purchase), please search the store for Flute Master for Schools instead. The version you are looking at right now unlocks via an in-app purchase and so does not support volume purchase.  Please note: (!) Trial is free but limited. You can purchase the complete version inside the game. (!) Flute Master requires a real soprano recorder! (!) Use headphones if you can. This helps the game listen only to your recorder.  Help the dragon Cornelius protect his tower of strawberries from the greedy bats. Yes, in the World of Music, bats love strawberries!  Youll play a lot of unique music tracks that gradually teach you each note on your recorder. By the time you finish the game, youll be able to play great recorder tunes! ;)  Try to score as high as you can and... scare away those bats!  Features:   Game-based learning to introduce you to the soprano recorder.  30 original music tracks (+ extra albums) composed with a background in music education.  Sheet music play along for each track.  Real-time sound detection of the instrument, using your microphone.  Innovative learning system for recorder fingering and sheet music reading.  Notes associated with colours for easier sight-reading.  Support for German and Baroque recorders.  A scoring system that encourages self-improvement.  Ready for classroom use. Used in classrooms worldwide.  Part of the World of Music series.  Awards:  Educators Choice at Microsoft Partners in Learning VIP Best App by Microsoft App of the Year by Innteach 5 Stars by TopBestAppsForKids.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING']",
}