{
"name" : "Daily current affairs and Gk in Bengali",
"url" : "https://play.google.com/store/apps/details?id=com.KnowledgeAccount.knowledgeaccount",
"package" : "com.KnowledgeAccount.knowledgeaccount",
"category" : "Education",
"description" : "Daily current affairs and Gk in Bengali app Provides Daily Current Affairs in Bengali and GK update for Govt. Job Exams like SSC CHSL, SSC CGL,RRC group D, RRB NTPC, LIC, SBI, CTET, WBPTET, WBPSC, WBCS, WB police etc.  Knowledge Account App is a FREE Govt. exam preparation App, which helps and guides you to prepare for Government Jobs Examination like -  Railway Recruitment Board (RRB) Jobs: RRB ALP, RRB JE, RRB NTPC, RRB Group D, etc.  Bank Jobs: RBI Assistant, IBPS PO, IBPS Clerk, IBPS SO, SBI PO, SBI Clerk, SBI Specialist Officers, IBPS RRBs, RBI Grade B, LIC Assistant  Staff Selection Commission (SSC) Jobs: SSC CGL, SSC CPO, SSC CHSL, SSC MTS etc.  Teaching Jobs: CTET & WB PTET.  Defence Jobs: WB Police SI, NDA, CDS, CRPF, CAPF   Public Service Commission (PSC) Jobs : West Bengal Civil Services (WBCS) WBPSC Clerkship, WBPSC Miscellaneous,  Other Jobs : all other Government jobs in India & individual states of India, specially West Bengal Government jobs.  Daily Current Affairs update in Bengali is the best feature of this app.  Main Features of this app :  - Daily Current Affairs Update   - Daily Mock Test on  Current Affairs  General Knowledge (Gk)  General Awareness  - Bengali E-Books, Free Bengali pdf.  - Free Previous years questions  - General Knowledge :   - English for all competitive exams.  - All the study material is available in Bengali and English.  - Exam Notification , Govt. Job Alerts and Exam Important Updates.   Important Sections:  1.Daily Current Affairs Update: Current affairs is the most important part of any government job. Knowledge of Current updated gk i.e. Current Affairs, always make a government job exam aspirant to go ahead one step than others.  2.General Knowledge : All subjects according to Syllabus of all type of Government jobs in India as well as West Bengal Government jobs are covered.   MOST EASY TO USE: Knowledge Account is made keeping Government job aspirants in mind. This app is easy to use - All study material is provided in Bengali and English.   Please give your feedback on the App. We obviously will try our best to make Knowledge Account better and more useful and helpful to you as per your feedback.  bbmknowledge@gmail.com ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}