{
"name" : "Chinese Writer",
"url" : "https://play.google.com/store/apps/details?id=com.molatra.chinesewriterlite",
"package" : "com.molatra.chinesewriterlite",
"category" : "Education",
"description" : "Learn how to write thousands of Chinese characters - its educational, entertaining and addictive!  -- This free version lets you play with and learn 800 traditional and simplified characters. We think thats a lot, but if youre really serious about mastering  the full version contains more than 5,000, spanning HSK and beyond... ---   Its easy to play.   Characters fall from the top of the screen - you have to tap them and draw them correctly to score points. Just dont let them reach the bottom, or - kaboom! Let five of them drop and the game is finished! But the learning continues; you can review everything that you saw, complete with stroke order diagrams and testing at your own pace. Characters you made the most mistakes on are highlighted at the top of the list.   Its more than a game.    trainchinese Chinese Writer can test you on 5,200 Simplified and Traditional Chinese characters, and features stroke-order diagrams, English explanations and high quality audio recordings for every possible pronunciation of each one.   The app remembers which characters youve had trouble writing and prioritises them in future games, as well as highlighting them in the character pack browsing screen.   Its suitable for everyone.    Characters are divided into packs by difficulty according to the official HSK standard. Hundreds are included in this free download.   Create your own packs by searching for characters by Pinyin. You can even mix Pinyin, English and Chinese characters in one search to find as many results as possible, and one tap adds them all to your custom pack.   Your kids can play. Your grandmother can too. Now everyone can enjoy the pleasure of learning this beautiful system of writing.   Whatever your writing level, youll improve with trainchinese Chinese Writer. Beginners can start with simpler characters and at a slower pace, while experienced students will blaze their way through those HSK 4 hanzi!   Its connected.    Create your own character packs and share them with friends by email.   Feeling proud of yourself? Share your high score with your friends via Twitter and Facebook.   Already a trainchinese user? Download the characters youre learning into trainchinese Chinese Writer for free!    Learn to write Chinese characters with trainchinese Chinese Writer. Its educational, entertaining - and addictive!    Wed love to hear what you think about Chinese Writer - Contact us at cs@trainchinese.com! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'com.android.vending.CHECK_LICENSE']",
}