{
"name" : "Miga Town: My Fire Station",
"url" : "https://play.google.com/store/apps/details?id=com.miga.myfirestation",
"package" : "com.miga.myfirestation",
"category" : "Education",
"description" : "Help people in their hour of need within the city; Rush into the burning buildings, and remove obstacles with the right tools and then put out the fire;  Stay ready and follow your command  Check over the citys surveillance system at the fire station and turn yourself into a brave firefighter when needed;  Exploring Dormitories: firefighters rest in these places, but also stay alert to any emergency at any time.  Training ground: firefighters undergo training here together, in order to better complete tasks, or train dogs to provide assistance while on a rescue mission.  Command Center: firefighters observe the latest situation in the city here and give commands when necessary.  The top floor: there are four rooms here, featuring various lifestyles, and you can put all your ideas into them.  Main street: you will enjoy yourself in the main street, and drinking coffee or buying flowers in flower shops will be a great idea; remove obstacles yourself or notify firemen that they have something to do somewhere in the street.  Features -Role-play in 6 different locations  -Role-play firefighters or doctors, or even people in other professions  -Clear the fallen obstacles and put out the fire  -More hidden secrets to be discovered  -Unlimited mode, triggering your imagination  --Give full play to childrens creativity --Tens of billions of customized modes --No third-party advertising --No time limit or score ranking list  contact ussupport@xihegame.com ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
}