{
"name" : "Learn English",
"url" : "https://play.google.com/store/apps/details?id=com.quizlearning.vocabularygames.englishquiz",
"package" : "com.quizlearning.vocabularygames.englishquiz",
"category" : "Education",
"description" : "Learn English Vocabulary is back with a new look and a new name  Learn English. With the upgraded version, we offer learners new features which make learners vocabulary learning become more interesting and effective. Download Learn English now to discover and experience these fascinating features !  English is a necessary part in modern world and vocabulary plays an important role in deciding whether you can be good at English or not. According to the recent research, only about 1000 - 2000 common vocabulary you can communicate well with native speakers.   Therefore, we launched Quiz Vocabulary app with the desire to change the traditional method of learning English, and to make your English learning and easier more effective. We have received a lot of positive feedback for Quiz Vocabulary and we would like to express our sincere thanks to all of you for supporting us. In response to users sentiment, we worked hard to improve our app day by day and to develop new features for it so that the app becomes the best possible. Hope all of you enjoy it   With Learn English 2.0, learners can learn English vocabulary through delightful pictures and amazing videos. Moreover, you can add vocabulary that you want and create your own topics so as to self-study and play vocabulary quizzes. Vocabularys pronunciation is completely based on Oxford standard so your pronunciation skills will be improved.  Remember that after learning vocabulary with pictures and videos, you will have the chance to play a small game  a quiz to remember words you have learned. Note that time to answer quiz is limited! Highlights: Learn with flash card  More than 1000 words with 20 different topics such as: color, action, vehicle, place, fruits, music, etc.  Illustrating images for vocabulary  50 levels to learn and play  3 different levels of difficulty: easy, medium and hard  2 ways to play quizzes: Find Words and Find Picture  Limited time to answer quiz  Learn with videos  20 videos of science, society, animation, speeches, etc. from Ted and English Speeches  More than 500 vocabulary words from basic to specialized  Learn English collocations and idioms  Subtitles for each videos in many different languages  2 ways to play quizzes: Find Words and Find Meanings  Limited time to answer quiz  My vocabulary  Add words to play quiz  Create your own topics  Unlimited vocabulary for each topic  2 ways to play quizzes: Find Words and Find Meanings   Limited time to answer quiz  Additional features:  Provide how to use for each sections by tap to the question mark icon  Support varieties of languages: Vietnamese, Chinese, English, French, etc.  Beautiful and creative interface  Easy-to-use for all ages  Unlock new levels and track your progress.  Free to install  Learning English becomes more simple, exciting and effective than ever with Learn English. Enjoy it!  Once again, thanks all users for your support. Continue to support us by using Learn English, rating it, leaving your feedbacks and share it with your friends.  Contact us if you have any further problems with Learn English   Facebook: https://www.facebook.com/vocabularyquiz/  Website: https://lenavin.com/  Twitter: https://lenavin.com/twitter  Email: hoanglv@lenavin.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}