{
"name" : "World Explorer",
"url" : "https://play.google.com/store/apps/details?id=com.bubblethoughts.worldexplorer",
"package" : "com.bubblethoughts.worldexplorer",
"category" : "Educational",
"description" : "Your tiny tots one stop app to explore the world. This application uses interactive puzzles and interesting games to help your kids learn about countries and continents using bright, colourful images and vibrant sounds. Boost their general knowledge by getting to know the capitals, currencies and languages spoken in all the countries around the world.  Features:   Learn & Identify the location of more than 60 countries  Drag the countries and drop them in the correct positions  Discover fascinating facts about each country  Get to know their capital, currency and language  Recognise the national animals and birds of several countries  Master the flags of 200+ countries  Bookmark flags to learn later  Spot the monuments and animals in each continent  Improve hand-eye co-ordination  Get quick with their observing skills  Lively Animations create a delightful experience  Lots of Games to make learning enjoyable  Perfect blend of education, fun and entertainment  Best suited for primary, kindergarteners, preschoolers and toddlers  Games:   Trivia Quiz Identify Flags, Animals and Monuments  Drag n Drop Position the countries in their right positions  The children get a clearer picture about the 7 continents. They can easily identify all the continents Asia, Africa, North America, South America, Europe, Australia and Antarctica. They can also recognise the countries in each continent and get to know the flags, capitals, currency and language. They become aware of 25 significant monuments and gather information about them. Simple general knowledge questions enhance their curiosity and boost their iq. A complete fun zone for the kids. Wonderful games packed into a single app.  Monuments * Empire State Building * Statue of Liberty * Golden Gate Bridge * Chichen Itza * Christ the Redeemer * Eiffel Tower * Leaning Tower of Pisa * Parthenon * Roman Colosseum * Notre Dame * London Bridge * Arc De Triomphe * Molen De Valk * Stonehenge * Big Ben * Egyptian Pyramids * Taj Mahal * Victory Monument * Mount Fuji * Great Wall of China * Torii Gates * Petronas Twin Towers * St.Basils Cathedral * Burj Al Khalifa * Sydney Opera House  Animals * Reindeer * Orca * Walrus * Polar Bear * Bison * Bald Eagle * Brown Bear * Racoon * Alligator * Anaconda * Piranha * Llama * Cockatoo * Toucan * Shark * Whale * Jellyfish * Cheetah * Lion * Hippopotamus * Rhinoceros * Deer * Elephant * Ostrich * Giraffe * Zebra * Dolphin * Tiger * Peacock * Panda * Fox * Arctic Fox * Camel * Yak * Koala * Kangaroo * Emu * Crocodile * Turtle * Stingray * Frog  Common... Lets begin our incredible journey and trot the globe.  3...2...1...GO!  Wed love to hear your ideas and feedback on the improvements to be made. Kindly leave a comment below or send us a mail.  Hope your little one finds our app enjoyable and interesting in the journey of learning!!! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.bubblethoughts.worldexplorer.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}