{
"name" : "KingDraw Chemical Structure Editor",
"url" : "https://play.google.com/store/apps/details?id=com.kingagroot.kingdraw",
"package" : "com.kingagroot.kingdraw",
"category" : "Education",
"description" : "KingDraw App is a free chemical drawing editor that allows users to sketch molecules and reactions as well as organic chemistry objects and pathways. Users can also use it to predict compound property. convert chemical structures to IUPAC names, view 3D structures, etc. KingDrawas will provide strong software support for chemical research, more chemical related functions and new structure drawing modes to connect Android&Ios device and PC, realizing rapid transforming from KingDraw to Office, ChemDraw and picture. And finally you will build an all-platform chemical structure system through your KingDraw cloud account. A good idea can change the world. KingDraw will record all your inspirations. Just enjoy creation. KingDraw, professional structural formula tool, creates a special work station for chemists! Get free windows PC version on websitehttp://www.kingdraw.cn/en/download.html Main Features Top-speed drawing Many powerful functions, like AI image identification, real time 3D modeling, conversion between IUPAC names and chemical structures, structural formula searching, chemical property analysis, intelligent gesture drawing, intelligent beautifying, etc.  Multi-terminal synchronization Get and share your files from your Android device, PC, or any other device you use. No matter where you are, use the KingDraw mobile app to keep you productive and work together. KingDraw Cloud makes it easy to handle your files when youre out.  Multi-format compatibility Easily saved as several file formats commonly used in chemical drawing softwares, for example cdx., mol., SMILES, etc. It also supports drawing standards like ACS 1996.  Always free All functions in the mobile, Pad and PC versions are free of charge forever Just spray your chemical inspirations.  If you need support, please contact us via: Twitter: @KingDraw_chem E-mail: qyngapp@gmail.com  More Information: Web: http://www.kingdraw.cn/ FacebookKingDraw @KingDrawCSE Youtube:KingDraw ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.kingagroot.kingdraw.permission.JPUSH_MESSAGE', 'android.permission.VIBRATE', 'android.permission.CAMERA', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.CHANGE_CONFIGURATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECEIVE_USER_PRESENT', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.kingagroot.kingdraw.permission.JPUSH_MESSAGE', 'android.permission.CAMERA', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.CHANGE_CONFIGURATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECEIVE_USER_PRESENT', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW']",
}