{
"name" : "AdoreDieu",
"url" : "https://play.google.com/store/apps/details?id=com.adoredieu.mobility",
"package" : "com.adoredieu.mobility",
"category" : "Education",
"description" : "Lisez la bible dans la traduction que vous prfrez. Faites des recherches dans la bible comme avec une vraie concordance, et mme plus grce au mode Strong (mots Hbreux et Grecs). Suivez un plan de lecture biblique quotidien. Soyez encourag chaque jour par une pense, un verset, une citation biblique, un enseignement et plein dautres surprises  dcouvrir.   Dcouvrez toutes les fonctionnalits de notre application :  - La bible en mode offline (internet nest pas requis pour lire la bible) - Un outil de recherche puissant, type concordance biblique (offline, internet non requis) - Les codes Strong (mots Hbreux et Grecs) avec leurs dfinitions (offline, internet non requis) - La possibilit de surligner des versets de la bible et de synchroniser vos surlignages entre vos appareils (connectez-vous avec votre compte AdoreDieu dans le menu pour cela) - La possibilit de partager des versets, des penses avec vos amis - Plusieurs plan de lectures biblique disponibles (chronologique, canonique, etc...) - Un verset quotidien - Une pense quotidienne - Des citations bibliques en image - Des enseignements - Un lecteur de musique avec la playlist de louange AdoreDieu - Notre chane YouTube directement accessible au sein de lapplication - Et plus  venir....  Cette application est entirement gratuite, partagez l !  Si vous avez des ides, des suggestions nhsitez pas  nous les communiquer par mail !  Sil savrait que lapplication plantait merci de nous le communiquer par mail, avec le plus dinformation possible pour que nous reproduisions le problme. Cela nous aidera grandement  amliorer la qualit de cette application.  Aucune donne vous concernant nest collecte par lapplication. Toute notre quipe est bnvole pour AdoreDieu et ce site nexiste que grce aux dons. Si vous souhaitez nous soutenir : https://www.adoredieu.com/faire-un-don/  Cette application demande des permissions, voici  quoi elles servent : - Stockage : Cela nous permet de stocker la base de donnes de la bible, qui vous permet de la lire sans internet. - Rseau : Cela nous permet de tlcharger les contenus du site AdoreDieu. - Sexcuter au dmarrage : Cela nous permet de vous envoyer la notification quotidienne avec le verset, la pense et autres. - Excuter un service au premier plan : Cela nous permet de lire la playlist audio mme lorsque votre tlphone est verrouill.  Application : 2020 Matthieu FEREYRE, Content : 2020 RevImpact. All rights reserved. Read the Bible in the translation you prefer. Search the bible as if it were a real match, and even more with Strong mode (Hebrew and Greek words). Follow a daily Bible reading plan. Be encouraged every day with a thought, a verse, a Bible quote, a teaching, and many other surprises to discover.  Discover all the features of our application: - The bible in offline mode (internet is not required to read the bible) - A powerful research tool, biblical concordance type (offline, internet not required) - Strong codes (Hebrew and Greek words) with their definitions (offline, internet not required) - The possibility of highlighting verses from the bible and synchronizing your highlights between your devices (log in with your AdoreDieu account in the menu for this) - The ability to share verses, thoughts with your friends - Several biblical reading plans available (chronological, canonical, etc.) - A daily verse - A daily thought - Biblical quotes in pictures - Lessons - A music player with the AdoreDieu praise playlist - Our YouTube channel directly accessible within the application - And more to come ....  This application is completely free, share it!  If you have ideas or suggestions, dont hesitate to send them to us by email!  If it turns out that the application crashes, please send it to us by email, with as much information as possible so that we can reproduce the problem. This will greatly help us to improve the quality of this application.  No data about you is collected by the application. Our entire team is a volunteer for AdoreDieu and this site only exists thanks to donations. If you want to support us: https://www.adoredieu.com/faire-un-don/  This application requires permissions, here is what they are used for: - Storage: This allows us to store the bible database, which allows you to read it without internet. - Network: This allows us to download the contents of the AdoreDieu site. - Run at startup: This allows us to send you the daily notification with the verse, thought and others. - Run a service in the foreground: This allows us to play the audio playlist even when your phone is locked.  Application:  2020 Matthieu FEREYRE, Content:  2020 RevImpact. All rights reserved. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.google.android.vending.CHECK_LICENSE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['com.google.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}