{
"name" : "Zowi App",
"url" : "https://play.google.com/store/apps/details?id=com.bq.zowi",
"package" : "com.bq.zowi",
"category" : "Education",
"description" : "Zowi has one purpose: enabling you to discover technology while having fun. And it wants you to teach it new things! Get to know this friendly robot in its app, where youll find fun games and activities. New functions will be unlocked as you play. Discover them all!   Zowi mini-games:  -GamePad: Convert your device into a remote and take control of Zowis every move. Make it walk, dance, balance on tiptoes, make different mouth gestures and much, much more. -3, 2, 1... Action!: Program Zowi to perform different actions in the order and at the speed that you want. Press Play and watch it perform them all one by one. -Repeat with Zowi: Can you remember all the moves that Zowi makes? Put your memory to the test! The more movements you get right, the more points youll win in order to the enter the ranking! - Draw the mouth: Quick! You only have a few seconds to memorise and draw the shape that was displayed on Zowis face. Get it right and move up a level!  And dont forget to update the app to make sure you get the latest games!  Play and discover:  Your robot also learns new things the more you play with it. We set you enjoyable challenges to get you interacting with Zowi and learning more about how it works.  With every challenge overcome, new actions and mini-games will appear! Unlock animations, dance steps or fun movements. Set yourself science, music or dance challenges that will teach you more about robotics and the world that surrounds us at the same time.  Get to know Bitbloq!  The Zowi App will also bring you closer to the world of Bitbloq, a simple and intuitive programming tool which you can use to teach Zowi new skills.  Got any queries about Zowi?  Visit zowi.bq.com. On the website, youll find all the latest news and updates, projects, tutorials and downloadables you need to get the best out of your robot.  And dont forget: the app is designed to interact with Zowi. You can get it athttps://store.bq.com/es/robot-juguete-zowior via our usual distributors. More information athttp://www.bq.com/uk/zowi ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}