{
"name" : "Cisco Packet Tracer Mobile",
"url" : "https://play.google.com/store/apps/details?id=com.netacad.PacketTracerM",
"package" : "com.netacad.PacketTracerM",
"category" : "Education",
"description" : "Cisco Packet Tracer Mobile is an innovative network simulation and visualization tool for use with the Cisco Networking Academy. Use Packet Tracer on your mobile device to:   - prepare for a certification exam - practice what you learn in networking courses - sharpen your networking skills for a job interview - and build Internet of Things simulations.   This version is currently compatible with Cisco Packet Tracer 7.0 and earlier.   For full access to the app, go to Cisco Networking Academy ( https://www.netacad.com/campaign/ptmb-1 ) and sign up for Packet Tracer Mobile 101 (English), a 1.5-hour self-paced tutorial. Your NetAcad login can be used to sign in to Packet Tracer Mobile.   Packet Tracer Mobile requires Android 4.2 or later on ARMv7 CPU tablets and is optimized for screens with a minimum size of 7 inches. Some devices with x86 CPUs contain binary translation which will allow this application to run at a reduced speed. Not recommended for smaller screen devices, although it will run, your usability will vary.  Cisco Networking Academy is an IT skills and career building program for learning institutions and individuals worldwide. Millions of people have joined the Networking Academy and become a force for change in the global economy since 1997.  For support inquiries, email packettracersupport@external.cisco.com.  Known issues and workarounds:  Android 8.0 is not compatible due to software limitations. Integration with Canvas prevents successful login. Due to the size of your device, the Accept button is hidden from view. Use a larger screen device. Files created in a newer version of Cisco Packet Tracer on a Desktop is not compatible with this version. This version is compatible with files up to version 7.0 of the Desktop edition. Multiuser features are not enabled in this application. PTSA exams are not enabled in this application. Native onscreen keyboards are not compatible with the CLI due to the use of Unicode in the keyboard while the CLI uses Ascii only. Use a hardware keyboard or the included Ascii keyboard. Physical workspace is not available in this application. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_INTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_INTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}