{
"name" : "Speech Therapy Articulation App 1 (UK)",
"url" : "https://play.google.com/store/apps/details?id=com.pmqsoftware.speech.therapy.uk1",
"package" : "com.pmqsoftware.speech.therapy.uk1",
"category" : "Education",
"description" : "www.speech-therapy-apps.co.uk  YouTube video https://www.youtube.com/channel/UCtsTBfKOs_sgzu06K9CceFg  This App is designed for children and adults with speech sound difficulties who are receiving Speech and Language Therapy. It is a great way to practice sounds which have been targeted by the Speech Therapist. The app is full of engaging pictures, fun exercises and games. This encourages practice and results in better progress with speech. https://www.facebook.com/pg/speech.therapy.apps/photos/   The Speech Therapy app was developed in collaboration with Kate Biss, Speech and Language Therapist. (http://katebiss-speechtherapist.co.uk)   Speech therapy articulation app 1 - contains 7 sounds ( b,d,f,g,h,ch, j) - 485 words - price for all sounds is 5.49 GBP   Speech therapy articulation app 2 https://play.google.com/store/apps/details?id=com.pmqsoftware.speech.therapy.uk2  - contains 7 speech sounds (k, l, m, n, ng, p, r) - 545 words - price for all sounds is 5.49 GBP   Speech therapy articulation app 3 https://play.google.com/store/apps/details?id=com.pmqsoftware.speech.therapy.uk3  - contains 10 speech sounds (s, sh, t, th, the, v, w, y, z, zh) - 478 words - price for all sounds is 5.49 GBP   Speech therapy app for children: articulation and pronunciation exercises. The App can also be used with adults to work on articulation, speech and memory.  Speech and Language Therapists will find a selection of vocabulary which progresses in levels of complexity. The target words are carefully selected to represent differences in word position, sound complexity and word structure. The app also features a useful repeat and record facility.  The App contains interesting photographs and illustrations across a variety of topics. The pictures include common objects, nouns, action words and describing words. These are an excellent resource to support vocabulary development.  Remarks: - These exercises cannot replace therapy sessions with a Speech Therapist. Using the app helps with daily home practice, making practice fun and motivating. It is important for a family member to be present and support the child with their practice.  - Before starting these exercises, clients must be able to produce the sound in isolation and in simple syllables. The exercises and games will help to develop the use of the sound in more complicated words.  - If you are not sure what to do, check with your Speech Therapist. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
}