{
"name" : "In 24 Hours Learn Chinese Mandarin",
"url" : "https://play.google.com/store/apps/details?id=com.ventures.softwareapp.englishlearnmandarin",
"package" : "com.ventures.softwareapp.englishlearnmandarin",
"category" : "Education",
"description" : "This is the newest and perhaps the most effective app for you to learn how to speak Chinese in 24 hours! This app provides students, tourists, explorers or businessmen with an audiovisual learning experience on how to speak Chinas national language, which is Mandarin.  Doing business or want to do business with the Chinese? You can definitely get the best deals if you can understand and speak their language! Perhaps you are an explorer travelling in China and found yourself lost in Chinese translation? Fret no more, you can now conquer the language barrier between you and a Chinese with this app.   Too busy to enrol on a proper Chinese language course? Tell you what, youre not the only one and we now have a solution. This is designed to work with your active lifestyle! With the audio feature of this app, you can always learn while on the go. Whether you are driving, on the bus or train, jogging in the park or perhaps relaxing in bed, just plug in your earphones and start learning! This app gives you the easiest and most hassle free way to learn Chinese!  Whether you are an academic student, tourist, explorer, adventurer or businessman, this app will make sure you speak Chinese in 24 hours!   This app contains thousands of words in phrases to make sure you learn the easiest way!   Thanks! ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}