{
"name" : "Ifa Oma",
"url" : "https://play.google.com/store/apps/details?id=com.movotech.ifaomademo",
"package" : "com.movotech.ifaomademo",
"category" : "Education",
"description" : "La informacin presentada proviene de miles de volmenes pertenecientes a la biblioteca personal del grupo de babalawos cubanos autores de esta idea. Con la cual pretenden hacer llegar una especie de gua para el estudio de If, de esta manera digital, ms adaptada al estilo de vida actual.  Esta App contiene:  - Descripcin y todo lo relacionado con los 256 oddus.  - Pasos para realizar las distintas ceremonias de If, obras y ebb.  - Utilizacin, tirada y lectura del Okpele para lograr describir la situacin que est dando If (Adivinacin).  - Cargas de los distintos Eshus.   - Todo sobre dems deidades de If.  Tambin, a modo de plus, agregamos una funcionalidad para que el usuario pueda establecer la imagen de su signo como fondo de pantalla del telfono. The information presented comes from thousands of volumes belonging to the personal library of the group of Cuban babalawos authors of this idea. With which they intend to send a kind of guide for the study of If, in this digital way, more adapted to the current lifestyle.  This App contains:  - Description and everything related to the 256 oddus.  - Steps to carry out the different If ceremonies, works and ebb.  - Use, throw and read the Okpele to describe the situation that If is giving (Divination).  - Loads of the different Eshus.  - All about other deities of If.  Also, as a bonus, we added functionality so that the user can set the image of their sign as the phones wallpaper. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.SET_WALLPAPER_HINTS', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.SET_WALLPAPER', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
}