{
"name" : "Matific Galaxy - Maths Games for 3rd Graders",
"url" : "https://play.google.com/store/apps/details?id=com.matific.MatificGalaxyG3",
"package" : "com.matific.MatificGalaxyG3",
"category" : "Educational",
"description" : "Turn Screen time into learning time with Matific Galaxy Maths Adventure! Take advantage of our special introductory offer and receive all the Matific Galaxy Grade 3 content at a great discounted rate.  **Welcome to the wonderful world that is Matific Galaxy, where maths is fun and engaging!** Matific is an award-winning maths program that has proven to help improve students maths test scores by 34%. The program is designed to teach children core math skills in a fun, educational and interactive way.   Matific activities are curriculum aligned and promote self-discovery. There are hundreds of adaptive and intuitive maths activities that focus on core maths skills such as addition, subtraction, multiplication and much more.  Matific activities are currently being used by millions of kids in classrooms around the world.   Splash out on our special discount offer and give your child the opportunity to increase their test scores and boost their maths confidence today!  Features: * Activities designed to develop core maths skills * Promotes self-discovery * Inbuilt support to assist students learning  * Curriculum aligned  * Rewards children with a fun and interactive game component * Teaches maths in a progressive, spiral learning system  Maths topics your child will encounter while playing Matific Galaxy:  * Advanced Counting * Addition and Subtraction * Multiplication and Division * Fractions * Geometry and so much more!   Matific Galaxy is the perfect educational experience, combining fun and learning. So put on your spacesuit and join your child on an extraordinary adventure that will delight and leave them more excited about mathematics than you ever thought possible!  Start your 7 day free trial today. Cancel anytime.  Matific offers specific maths games for kids K-6. Looking for a different grade? Check our other apps! Matific Galaxy - Maths Games for Kindergarten Matific Galaxy - Maths Games for 1st Graders Matific Galaxy - Maths Games for 2nd Graders Matific Galaxy - Maths Games for 4th Graders Matific Galaxy - Maths Games for 5th Graders Matific Galaxy - Maths Games for 6th Graders ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}