{
"name" : "Coins of U.S. – New & Old Coins of United States",
"url" : "https://play.google.com/store/apps/details?id=com.craftfive.coinsofus",
"package" : "com.craftfive.coinsofus",
"category" : "Education",
"description" : "The United States biggest mobile price guide to the U.S. coins of 1792-2018. Coins of U.S. provide the most comprehensive price guides, for the coins of The United States. Whether you collect coins, or are just curious about them, Coins of U.S. will be the only mobile app you ever need when it comes to valuing your old coins. Coins of U.S. mobile app is the ultimate reference of choice for beginners, serious collectors, researchers, and coin dealers specializing in U.S. coins.  Coin Price Guide: -  - Complete Coin Prices List of Half-Cents - Complete Coin Prices List of Pennies - Complete Coin Prices List of Two Cents - Complete Coin Prices List of Three Cents - Complete Coin Prices List of Nickels - Complete Coin Prices List of Half-Dimes - Complete Coin Prices List of Dimes - Complete Coin Prices List of Quarters - Complete Coin Prices List of Half Dollars - Complete Coin Prices List of Dollars - Complete Coin Prices List of Gold Coins - Complete Coin Prices List of Gold $2.50 Quarter Eagles Coins - Complete Coin Prices List of Gold $3 Coins - Complete Coin Prices List of Gold $4 Coins - Complete Coin Prices List of Gold $5 Half Eagles Coins - Complete Coin Prices List of Gold $10 Eagles Coins - Complete Coin Prices List of Gold $20 Double Eagles Coins  Coins of U.S. numismatics app offers an extensive Coins catalogue to choose from, allowing you to quickly begin valuing your Half-Cents, Penny, Two Cents, Three Cents, Nickels, Half-Dimes, Dimes, Quarters, Half Dollars, Dollars, Gold Coins, Commemorative and Bullion Coins with the app.   Add on features: -  - Allows you to keep track of your personal coin collections - Allows you to Manage Your Coin Collection - Allows you to Track Your Coin Collection - Allows you to Explore Your Coins Collection - Allows you to Identify Missing Coins In Your Collection - History of U.S. Mints  - List of different mint marks on U.S. Coins - Complete PCGS Grading Scale - Rarity Scale - Strike Types of U.S. Coins  Whether youre a beginner, serious collector, researcher or advanced numismatist - collecting Coins of United States the Coins of U.S. mobile app will prove indispensable at coin shows, coin shops, flea markets or anywhere you might encounter a coin for sale.  Improve your coin collecting experience with an extensive feature list: -  - High resolution images of obverse and reverse sides of US Coins - Accurate details of metal, weight, diameter, mint mark and shape of US Coins - Year wise mintage details of US Coins - Approximate coin prices of US Coins - Complete numismatic specifications of US Coins - Does not require an active internet connection to operate works 100% Offline  Buy and Sell coins tab helps you to sell U.S. Coins to numerous people through trusted websites, interact directly with buyer for buying and selling respectively.  - Buy Old US Coins - Sell Old US Coins - Buy Proof US Coins - Buy UNC US Coins  Launching Soon:-  - Complete Coin Prices List of Commemorative Coins - Complete Coin Prices List of Bullion Coins  Note:-  - All US coin prices are valued in Dollars. - All US coin prices shown in the Numismatics app should only be considered as estimates  - Coins of U.S. app coin prices might not be same as the coin prices of shops or auctioning portals - Market value of a coin depends on the rarity and availability of the coin ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
}