{
"name" : "Learning Colors - Interactive Educational Game",
"url" : "https://play.google.com/store/apps/details?id=com.gokids.colorsrevenge",
"package" : "com.gokids.colorsrevenge",
"category" : "Educational",
"description" : "The animated game Learning Colors is designed to get acquainted with the main colors and study their names in different languages. Exciting game tasks and merry characters will help remember information better, and also consolidate and check the received knowledge about colors. Learn colors easily and with fun! The main features and advantages of this preschool game: 1) Colors for kids learn - blue, white, orange, brown, pink, gray, yellow, purple, black, green. 2) Color study is available not only in English, but also in Spanish and other languages. The educational games are voiced by native speakers with perfect pronunciation and clear diction. The knowledge of foreign words will be helpful during language study in the kindergarten and/or at school in the future. 3) The child will not only get to know name of basic colours, but also build his or her vocabulary and learn new words as the game is full of various objects of everyday life. 4) This kindergarten game is suitable for 2 years old, 3 years old, 4 years and 5 years old, for both little girls and boys. 5) The game provides comprehensive development of babies - trains fine motor skills, memory, attention, curiosity, perseverance in achieving aims and intelligence.  6) All our interactive games can be downloaded for free, and this colour game is not an exclusion.  7) A simple and clear interface which is easy for any baby to figure it out how to play.  And now lets have a look at the game tasks for toddlers, and how to play them. First of all, there are two modes that can be chosen in kid education - a cyclic mode, when one game task is automatically replaced by the next one, and a mode where each mini game can be played individually, you just need return to the main screen and choose the desired game. In the first mini game (with the image of a frog), three doors and an animal of a certain color, for example, a gray mouse, appear before the baby. The child should help the mouse unlock the right door. To do this, there is an item of a certain color on each door, and the baby needs click that door, the object on which is the same color as the mouse (gray). Its a match, and the door opens, the mouse jumps with joy. Thanks, baby! The second game is a kind of puzzle but not a simple one. Children see nine holes, from which fireflies of different colors appear in turn. In the lower right corner there is an animal, for example, a purple octopus, and the child should help him collect purple fireflies in the jar. This game for preschoolers perfectly trains intelligence and reaction speed, as well as fine motor skills. When the jar is full of the fireflies, the octopus will thank kindergarteners with a cheerful animation and run away, and the place will be taken by, for example, a bright red ladybird, and now its turn of ladybird to collect the red fireflies. In the third game the task is as follows. In the middle of the screen there is a mosaic, but all the elements are closed. In the left part of the screen we see little animals of a certain color, for example, a green frog. And automatically the first element opens also green. The kid should open all the green elements, so that they make a path for the frog. In order to make the animal walk along the path, the baby is ought to trace it with a finger. Your childs reward is an amazing animation. The fourth mini-game is the so-called coloring with a wizard. The magician has prepared magic painting. Will we help him decorate himself with bright colors? Let the magician drink the bottles with colouring paint one by one, and the baby will see how he changes. A real miracle! In the fifth game, babies will have a interesting challenge - to select the right key to the lock of a certain color, for example, orange. The kid is offered four differently colored keys, and he or she should pick up the key of the same color as the lock. When the right key is picked up the child hears the name of the color in the chosen language! ",
"desc_perms" : "['android.permission.READ_CALL_LOG', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}