{
"name" : "Montessori Monster Math Lab",
"url" : "https://play.google.com/store/apps/details?id=com.edokiacademy.mathMonsters",
"package" : "com.edokiacademy.mathMonsters",
"category" : "Education",
"description" : "Want to build a solid math foundation for your children?  Montessori Monster Math Lab is a clear and simple approach to first operations that will change the way children see math forever, whether they use it in class or at home.  This app, allying a 100 year old proven pedagogy with the best of 21st Century technology and fun monsters, introduces 4 very important concepts through Montessori material (addition, subtraction, doubles/halves, odd/even).   Weve implemented a dynamic progression algorithm that follows each users progress and adapts the games according to their level.  If youre tired of your children learning by heart instead of understanding concepts, Montessori Monster Math Lab is the app youve been looking for!  Recommended ages: 5 to 8  If you have questions or comments on our app, please email us at: support@edokiacademy.com.  Key Features: - Play with Montessori materials: number rods and counters - Learn Math on an interactive app with charming graphics! - Master on addition and subtraction through a natural progression with numbers from 1 to 99! - Get into multiplication and division using the concepts of double and half! - Lots of games! - Great fun with the Monster lab, creating your own monster ! - Designed by teachers.  Download Montessori Monster Math Lab now, and be ready to become unbeatable at math! If you like Montessori Monster Math Lab, you will also like our other educational apps: http://edokiacademy.com.  ***Please note that while this app is free, it contains an In-App purchase that is accessible in the Parental Gate. This content costs real money and can be purchased by users to enhance play experience. Your children will not be exposed to any advertisements while playing the app. ***   ABOUT US  Edoki Academys mission is to provide children with enjoyable early-learning activities using the latest technologies. Our team members, many of whom are young parents or teachers, strive to produce tools that motivate and inspire children to learn, play, and progress.   PRIVACY  We take your childs privacy very seriously, for this reason, we are proud to offer a product that is certified COPPA compliant by PRIVO.   CONNECT WITH US!  If you have any support requests, comments, or questions do not hesitate to contact us at support@edokiacademy.com or visit the Edoki Academy Online Community at edokiacademy.com. Wed love to hear from you! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}