{
"name" : "Coloring Games : PreSchool Coloring Book for kids",
"url" : "https://play.google.com/store/apps/details?id=com.gamesforkids.coloring.games.preschool",
"package" : "com.gamesforkids.coloring.games.preschool",
"category" : "Educational",
"description" : " Educational Coloring book for toddlers   Introducing creative fun Coloring Book for kids & Coloring game of Doodling, painting, & drawing app for children with free coloring pages on Android! In this kids drawing book there are 250+ coloring pages where children learn Alphabets ABC, Numbers 123, Farm Animals, Forest Animals, Fruits, Vegetables, Shapes, Colors, Transport Vehicles, Toys, Connecting dots, Maze, Tracing, Glow Coloring for fun & Pixel art kids games. Lets gather every one in your family to play with our fun coloring games for children to color & learn  This free Coloring game will develop your childs creativity, imagination & draw skills. Colouring apps for children is fun learning & helps to draw shapes, color and draw animals in glow doodle with colorful brushes, crayons, stickers, glitters & patterns. Our painting Game for kids is loaded with fun coloring pages & is an early learning app that can keep your kid busy for hours & make them learn English language.  PreSchool Coloring games for toddlers: Features  - A great drawing book for kids & toddlers with 12 unique categories - More than 250 Coloring pages for kids is a fun learning - A drawing book for kids which has coloring pencil, crayons, brushes - Use zoom to paint every tiny detail in coloring page - Drawing popular vegetables & fruits for kids - Alphabets (ABC) colorable pictures in Coloring games for child  - Numbers (123) with Coloring, painting & drawing pages - Car games for boys & Vehicles drawing game for children - Animals painting & doodling for girls & boys - Maze for kids to enhance logic skills - Connecting dots for children to learn numbers - 25+ Preschool Worksheets for toddlers 2-5 yrs to learn - Childrens friendly environment & free learning games for toddlers - Color offline, no internet connection required in fun games - Doodle your own drawings & share your best coloring pages with family and friends of Facebook, Instagram & on other social apps - Girls would like to paint & sketch on it. Lets draw! - Simple & easy auto-fill coloring for preschoolers from 3 to 4 years old - Specially designed Preschool and kindergarten games for kids up to 5 years old - Kids Doodle game art that helps coloring & learning - Trace the lines & draw glow doodle drawings - Create awesome colorful pixel art and save paintings in gallery - Enhance kids creativity in baby coloring pages  This free Colouring book for kid is designed for toddlers coloring & perfect for babies coloring. Fun drawing & learning Games keep your child calm while they paint & draw on phone or tablet.   If you like this game, then please try our other coloring & learning games for free on Android. Were continuously improving the drawing, doodling & painting games in all Android devices.  Happy Coloring! ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}