{
"name" : "Learn Korean - Language & Grammar Learning",
"url" : "https://play.google.com/store/apps/details?id=com.silvermoonapps.learnkoreanquicklite",
"package" : "com.silvermoonapps.learnkoreanquicklite",
"category" : "Education",
"description" : "Learn Korean with LuvLingua  Begin the learning experience already enjoyed by over 2 million language learners.  LuvLingua education apps teach you to speak and read through fun games, and a beginner & intermediate level course. This Korean learning app is fun for ALL ages.  Understand and speak Korean to communicate more effectively!   COURSE DESIGNED BY LANGUAGE TEACHERS Study essential words and phrases to build a strong foundation of Korean Gain confidence and level up your language ability with the beginner course. 200+ lessons that systematically teach and review new vocabulary, as well as help you build sentences and questions. Designed for students to train and improve fundamental language skills & knowledge. Recommended for anyone who wants to learn Korean including kids, students, travellers, and business people.  GAMES WITH DIFFERENT LEARNING STYLES Games and quizzes that support you to learn Korean by catering to different learning styles.  Visual (Picture Quiz, Memory Game)  Auditory (Listening Quiz)  Read-Write (Writing /Multichoice Quiz, Word Guess)  Kinesthetic (Animation Game)  LuvLingua promotes learning through games to remember new words in a FAST & FUN way.   PHRASEBOOK FULL OF USEFUL CATEGORIES  Everyday conversation along with many core words and phrases sorted into helpful categories. Phrasebook sets include: greetings, numbers, hobbies, accommodation, adjectives, animals, body, colors, clothing, countries, directions, emergencies, food, religion, school, shopping, transportation, travel, verbs, weather and work. Study a new set every day and practice it in the Games Section. This phrasebook is convenient for travel.  HIGH QUALITY AUDIO BY NATIVE SPEAKERS Listen to high quality authentic audio of native speakers with clear pronunciation. Test your listening and speaking ability.   CAREFULLY TRANSLATED INTO 30+ LANGUAGES All language is carefully translated by bilingual native speakers and NOT by computers/online translators. Translated into English, Spanish, French, German, Russian, Italian, Portuguese, Swedish, Czech, Dutch, Polish, Danish, Finnish, Romanian, Korean, Japanese, Mandarin Chinese (simplified and traditional characters), Thai, Vietnamese, Turkish, Indonesian, Malay, Farsi/Persian, Arabic, Khmer, Hindi, & Nepali.   SEARCH, FAVORITES & SETTINGS SECTIONS Quickly and easily lookup a word or phrase in the Search section. Save words and phrases to the Favorites section for later study. Change user language and turn off the daily word notification in the Settings section. Option to hide/show romanisation.  GET CONFIDENT WITH HANGUL CHARACTERS (ALPHABET) You can learn to recognise and read Korean Hangul characters, and pronunciation in the Alphabet Section of this app.   Read about traditional food and famous places. Study conversation tips and grammar in the Grammar Section.    Learn Korean for travel in South Korea, work, school, fun, or to talk to your friends.   This is an offline Korean learning app. Created by a team of language teachers, native speakers and mobile developers and is updated regularly to improve content and features. Many free sets and games. Upgrade to the premium version to unlock all the content.   Bugs, feedback or support => luvlingua@gmail.com   Love Learning Languages LuvLingua ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}