{
"name" : "NEET/AIPMT Exam Papers & Solutions",
"url" : "https://play.google.com/store/apps/details?id=com.kopykitab.aipmt",
"package" : "com.kopykitab.aipmt",
"category" : "Education",
"description" : "*** FREE NEET/AIPMT Exam Preparation 2020 App with Previous Year Papers and solution for NEET/AIPMT 2020 & Study Materials in Hindi and English***  In NEET/AIPMT Exam Papers & Solutions 2020 App, you will find the complete collection NEET Study Materials for All subjects to boost NEET 2020 Exam preparation. The experts have created study materials following the latest NEET/AIPMT syllabus and exam pattern based on the official NEET Notification.  Here you will find Special NEET notes 2020 and NEET Study Materials in Hindi and English Subjects along with  - NEET / AIPMT Questions & Practice papers with Solutions from previous years. - More than 10000 NEET exam questions for the last 10 years with solutions - More than 5000 NEET Practice Tests & MCQs - NEET Book in Hindi & English based on Latest NEET Syllabus - Subject-wise Solution with detailed explanation - 247 Easily Accessible Online and offline usable App  You will get,  * NEET/AIPMT Question Papers with solutions for years 2005 to 2019 * NEET Test Preparation of Physics, Chemistry. * Latest Syllabus of NEET Exam 2020. * NEET Study Materials for Physics, Chemistry & Biology (PCB) * Topic-wise Objective Type Questions with Answers for all subjects - Physics, Chemistry & Biology (PCB) * DC Pandey physics solution for NEET 2020 * IE Irodov Solutions Of Problems In General Physics for NEET 2020 * NEET 2020 Study Material For NEET & BITSAT - Learning Tools In Physics * NEET 2020 Revision Notes for all subjects - Physics, Chemistry & Biology (PCB) * NEET 2020 Practice sets and MCQs * NEET 2020 Topic-wise questions papers with solutions * Bio/ Medical: Biology Test Preparation (Medical): Part 1 For FREE practice * NEET Medical Entrance Exam Solved Question Papers * NEET Physics Previous Years Question Papers, NEET Physics Books 2020, NEET Physics Study Materials 2020, NEET Physics Notes 2020, NEET Physics Topic-Wise Solution 2020 * NEET Chemistry Previous Years Question Papers, NEET Chemistry Books 2020, NEET Chemistry Study Materials 2020, NEET Chemistry Notes 2020, NEET Chemistry Topic-Wise Solution 2020 *NEET Biology Previous Years Question Papers, NEET Biology Books 2020, NEET Biology Study Materials 2020, NEET Biology Notes 2020, NEET Biology Topic-Wise Solution 2020 * The Content is Prepared and regularly updated by the most experienced doctors from leading medical institutes.  Key Features of NEET/AIPMT Exam Papers & Solutions App:  - NEET/AIPMT Practice Tests and Previous year papers - 247 Online Access - NEET/AIPMT Practice Tests as per the latest pattern; Section-wise test papers- Physics, Chemistry & Biology - Download content and read it without Internet Connection - You can download the books for FREE! and read it offline on your mobile/tablet. About NEET/AIPMT Exam 2020: The NEET (Earlier AIPMT) is a qualifying entrance exam for students who wish to study any undergraduate medical course (MBBS), dental course (BDS), or postgraduate courses (MD / MS) in government or private medical colleges in India.  The National Eligibility cum Entrance Test or NEET is an entrance examination in India, for students who wish to study any graduate medical course, dental course or postgraduate course in government or private medical colleges.  For more FREE online access, please visit https://www.kopykitab.com/NEET. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.kopykitab.aipmt.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}