{
"name" : "Coding Games For Kids - Learn To Code With Play",
"url" : "https://play.google.com/store/apps/details?id=com.internetdesignzone.kidlolandcoding",
"package" : "com.internetdesignzone.kidlolandcoding",
"category" : "Educational",
"description" : "***Awarded as Most Innovative Game: Best Of 2017 by Google Play***  Kidlo Coding for Kids is a fun coding game to teach kids the basics of programming, a very essentialskill in todays world. It teaches coding with creative games involving firefighting and being a dentist. Kidlo Coding helps kids improve their problem-solving skills, boosts memory and increases logicalthinking skills.  Kidlo Coding is a winner of:  2018 Academics Choice Smart Media Award  Tillywig Brain Child Award  Moms Choice Gold Award  Through Kidlo Coding, kids will learn the basics of programming like sequencing, loops and functionswith coding games. In this app, you will find 50+ coding games for kids with 1000+ challenging levels.  Take a look at some of the intuitive coding games you can play in Kidlo Coding:  Little Firefighter - Kids can learn the fundamentals of sequences, functions and loops with firetrucks & cute firefighter games.   Monster Dentist - Learning good habits is super easy with Dentist coding games. Little ones willlearn how to take care of their teeth while learning to code at the same time!   Chomp The Fruit - Find the right path to reach the yummy fruits and feed the hungry chompingmonsters.   Garbage Truck - Help the little Kidlo Star to collect all of the garbage with your code. Do your part tokeep your city clean.   Pop The Balloons - Popping balloons is always so much fun! But this game is not your ordinaryballoon pop game. Here, you have to train your brain and use your code to pop the balloons.   Ice Cream Time - Memorize what the little monster wants and write the code to feed it. If yourelooking for educational memory games for kids, this is the game you are looking for.   Smoothie Maker - Learn colors and make colorful smoothies with these coding games.   Track Builder - Build the track correctly so that the train can reach its destination!   Connect The Dots - Every childs all-time favorite game gets a new twist as a coding game. Thatsright - now you can use your code to connect the dots! Play the game if you are up for the challenge.   Build Your House - Who knew that you could build houses with code? You c a n in these codinggames! Simply write your code and be an architect of brand new houses.   Dress Up Occupations - Did you know that you could use code to dress up characters? Its a ton offun. Be ready to use your thinking skills in this game about different professions.  There are 1000+ interesting levels in all, which can be solved by using concepts such as sequences,loops and functions.  How does this app teach kids the basic programming concepts? Heres how.  Sequences - Learn Sequences With Coding Games Sequences form the most important part of coding. Here, the command is executed exactly in thesame order of events given by the coder.  Loops - Learn Loops With Coding Games When you use a Loop, you can repeat a set of commands!  Functions - Learn Functions With Coding Games Functions are a set of commands which can be used anytime as per the coders wish or requirement.  What will kids learn with these coding games?  Recognizing and creating patterns  Ordering actions in a proper sequence  Thinking out of the box  Learning to keep trying until the answer is found  Implementing a logical strategy to solve problems  Subscription Details: - Subscribe to get access to full content. - Cancel subscription renewal anytime via Google Play. - Account will be charged for renewal within 24-hours prior to the end of the current period. - Use the subscription in any Android Phone/Tablet registered with your Google account.  Kids can easily learn to code with educational games. Download Kidlo Coding App For Kids to helptrain their brain in a fun and easy way! ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}