{
"name" : "Girls Car Wash Salon For Kids",
"url" : "https://play.google.com/store/apps/details?id=com.mp.girls.car.wash.salon.service.garage",
"package" : "com.mp.girls.car.wash.salon.service.garage",
"category" : "Educational",
"description" : "Girls its time to become the little mechanic in your own auto workshop. Lets perform many exciting tasks of kids car cleaning. You will love this because many interesting tools of the car wash salon will give you lots of joy in using them.  Learn the procedure of vehicle cleaning through these exciting girls car wash games. Lets wear girls mechanic suits, gloves and start cleaning up many dirty cars. After a long day of travel, the vehicle needs a perfect car clean up in your amazing kids car service garage. Become the expert and try to give the proper repair maintenance.  Perform your duty in kids car wash games with lots of fun. Use all your skills of girls car cleaning and become the best repairman of the auto service workshop in town.   This kids car wash salon has a bundle of fun activities. Remove the mud, leaves, branches by using many amazing tools. Give the complete repairing services in your car workshop garage and fix the problems. Girls lets have an extra dose of enjoyment by test driving the clean vehicles. Fuel up and lets go.   So girls its time to show your girl power by running your own service workshop station. Play these interesting auto wash games and dont stop cleaning the vehicles. Enjoy... ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
}