{
"name" : "Endless Reader",
"url" : "https://play.google.com/store/apps/details?id=com.originatorkids.EndlessReader",
"package" : "com.originatorkids.EndlessReader",
"category" : "Education",
"description" : "As a follow-up to Endless Alphabet, set the stage for early reading success with Endless Reader! This app introduces sight words, the most commonly used words in school, library, and childrens books. Kids need to recognize these words by sight in order to achieve reading fluency. Recognizing sight words is advantageous for beginning readers because many of these words have unusual spelling, cannot be sounded out using phonics knowledge, and often cannot be represented using pictures.   Kids will have a blast learning sight words and their context and usage with the adorable Endless monsters. Each word features an interactive word puzzle with letters that come alive, and then a sentence puzzle with words that become what they describe. See the word dog as a barking dog, and the word up reach for the sky!   ** NOTE: You must be online and have sufficient disk space while running the app to get all words you purchase in the app. **   Features:  - 6 words free to try with additional word packs available for purchase. - Delightful animations reinforce sight recognition of words in a fun and interactive way.  - Word puzzles reinforce spelling using lower-case letters and the sentence puzzles teach definition and usage (in addition to sight recognition).  - Endless Reader was designed with your children in mind. There are no high scores, failures, limits or stress. Your children can interact with the app at their own pace. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}