{
"name" : "Fantasy - Coloring Book & Games for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.orange.kids.game.coloring",
"package" : "com.orange.kids.game.coloring",
"category" : "Educational",
"description" : "Fun game that develops and stimulates the creativity of children of all ages through different activities:   Color and Paint hundreds of pages in the same way you would on paper.  Decorate your creations with beautiful stickers.  Paint by Pixels (Pixel Art) and improve eye-hand coordination.  Challenge your memory with the classic game of finding couples.  Explore sounds and create fun combinations.  Create a fireworks show with your own fingers.  Learn the Colors with a nice game.  Create a beautiful sea world using the imagination.  More than 150 fun pages waiting to give them color, with motifs of charming creatures and monsters that do not scare anyone!  Free mode: you can draw and color freely and give free rein to your imagination.  You can paint with your own fingers and choose from a variety of colors. Save your drawings and share them on Facebook, Twitter, Instagram, WhatsApp, email or your favorite social network. Its hilarious!  The whole family, parents and kids will have hours of fun together!  It is an excellent way to spend time with your children while you share beautiful moments creating and playing.  The little ones will be able to doodle, decorate and color freely without worrying about the prolixity while the older ones, and even the adults, will be able to challenge themselves to color within the limits of each drawing.  *** FEATURES ***   All content is 100% FREE.  Promotes the development of imagination, the arts, and increases childrens ability to concentrate and fine motor skills.  The game is very fun and educational for both girls and boys of all ages and interests, including infants, kindergarten kids, toddlers and preschoolers.  Works perfectly in both Tablets and Telephones.  A simple and very intuitive design.  Different strokes and colors.  More than 100 stamps to decorate your drawings.  Flashing colors. It has dynamic random colors for endless bright colors and achieve beautiful effects.  Delete Rubber function.  Function undo the strokes you do not like, and erase everything.  Save drawings in the album to edit them or share them later.  **** Do you like our free game? **** Help us and take a few moments to write your opinion on Google Play. Your contribution allows us to improve and develop new applications for free!  This application contains Icons made by Freepik from www.flaticon.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}