{
"name" : "Peter Rabbit: Let's Go! (Free)",
"url" : "https://play.google.com/store/apps/details?id=com.NoYetisAllowed.PeterRabbitFree",
"package" : "com.NoYetisAllowed.PeterRabbitFree",
"category" : "Educational",
"description" : "Join Peter, Benjamin and Lily in the magical world of Peter Rabbit in Peter Rabbit: Lets Go! From the creators of smash hit Pocket Shrek (6.5 million downloads), Peter Rabbit: Lets Go! brings the much-loved characters from the popular animated TV series to life on mobile and tablet.   Peter Rabbit: Lets Go! is a delightful way for parents and children to spend time together with Peter and his friends on their adventures. Find items to fill Peters dads journal, play fun and educational mini-games and explore iconic locations from the incredible world of Peter Rabbit.   STUNNING VISUALS Incredible 3D graphics bring the world of Peter Rabbit and his friends to life on your phone like never before.  FUN MINI-GAMES Spelling games, number challenges and musical games give children hours of endless fun! Games include:  - Vegetable raids in Mr McGregors garden - Pinecone bowling at the Squirrel Camp - Ladybird hunting (watch out for the bees!) - Strawberry raids at Mr Tods house - Shape-matching games outside Peters home - Jeremy Fishers musical game - Lift, bounce and throw blocks around Peters home - Balloon bouncing and bursting fun up in the secret treehouse - Have fun with a toy train in Peters bedroom  UNIQUE ANIMATIONS AND DIALOGUE  Play with Peter, Lily and Benjamin, each with their own personality and dialogue using the original voice talent. Tap them and tickle them to trigger funny animations and speech and feed them when they are hungry.  ICONIC LANDMARKS AND LOCATIONS Explore Mr. McGregors Garden, Mr.Tods house, Peters home and other incredible locations from the Peter Rabbit universe.  TREASURE HUNTING GAMEPLAY Search every inch of the Peter Rabbit universe to help fill Peters dads journal. Unlock new pages and stickers that can be colored in by players!   Lots of additional content is planned post-launch including additional mini-games, such as Mr Bouncers target practice.  See how to play the game at: http://noyetisallowed.com/howtoplaypeterrabbit  Lets Go!   Copyright Frederick Warne & Co. Limited and Silvergate PPL Limited, 2018. Based on the works of Beatrix Potter. PETER RABBIT and BEATRIX POTTER are trademarks of Frederick Warne & Co, a Penguin Group Company. All rights reserved ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.CHECK_LICENSE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}