{
"name" : "Tommy the Robot, Learn to Code",
"url" : "https://play.google.com/store/apps/details?id=com.Zyrobotics.TommyRobot",
"package" : "com.Zyrobotics.TommyRobot",
"category" : "Educational",
"description" : "Help young kids learn the basics of coding with Tommy the Robot! Its the perfect, super-fun and highly beneficial kids coding app that makes learning programming fun and easy. Connect with Tommy the Robot to move your robot in the real world.   FUN AND EASY TO PLAY, YET HIGHLY USEFUL With an accessible interface, kids of all ages and abilities can use commands, sequences, and loops to make Tommy the Robot move, dance, and sing on screen. In challenge mode, kids can test their coding abilities by solving the Tommy the Robot challenges with his friends. This coding app is designed to expose young kids to early programming concepts. Teachers can even use this app as an hour of code lesson for their classroom. The ultimate coding for children app so kids can learn to code in a fun way!  INTUITIVE  We made this programming for kids app very easy to use. No need for instruction or help, your kids will be able to open the game, play and learn to code without assistance!  EXTREMELY BENEFICIAL FOR KIDS Learning to code from an early age helps children develop problem solving skills and prepares them for the future. More so, they will understand the basics of programming giving them better perspective in their future education. It makes them think logically, solve problems faster, all while having fun with an interesting computer coding for kids app!  WHY YOUR KIDS WILL ADORE Tommy the Robot, Learn to Code? 1. Learn the basics of coding with simple commands, sequences, and loops. 2. Combines audio, visual, and touch inputs to enhance multi-sensory learning 3. One-touch input for help in improving hand-eye coordination and fine motor skills for children 4. Switch-accessible for children with motor limitations who use an external switch (connected through a Bluetooth switch interface such as TabAccess or Zumo) 5. There are no in-app purchases or advertisements in this coding for kids and hour of code app.  NOT LEARNING, KIDS ARE PLAYING GAMES Lets face it, the problem of making kids to learn pertains even in 2018. However, our kids coding app turns learning to code into a game. A programming game that children actually want to play. Why? Because with an easy-to-use interface, kids interact with fun animated characters and, using various basic programming commands, they learn how sequences and even loops work. They have fun doing it and perceive the coding kids app as a game rather than a traditional learning venue.  In-depth description of features: Coding for kids. This game teaches programming basics by exposing kids to the basics of coding with simple commands, sequences and even loops. It relies on visual learning as a cute robot does actions based on their input.  Challenge mode. Kids can play the game in challenge mode, where other friendly characters tell Tommy what to do. Once a challenge is completed, they advance to the next.  Tutorial & Free to play. A quick tutorial shows first time users how to interact with Tommy and have it perform actions. The free play mode allows any kind of commands without any limitations.  Voice guidance. As this is targeted for kids, a friendly voice accompanies any task in the game. This makes it easier for kids to understand what they need to do in a friendly teaching environment.  3D graphics. All cute animal characters in this game are animated and feature full 3D characteristics. This makes the game appealing and acts as a animated tutor that teaches kids through playing.  **Curriculum Coverage** Learning to code prepares children for the world we live in today. Learning to code helps children develop problem solving and computational thinking skills. Even preschool and kindergarten age children can learn the foundations of coding.   The best coding practice for young children of all abilities. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.Zyrobotics.TommyRobot.permission.C2D_MESSAGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}