{
"name" : "Badanamu: Zoo Party ESL",
"url" : "https://play.google.com/store/apps/details?id=com.calmid.storytime1.esl",
"package" : "com.calmid.storytime1.esl",
"category" : "Education",
"description" : "Young learners can learn phonics with Badanamu: Zoo Party ESL through unique interactive environments.  Captivating animations provide exposure to key phonemes and keywords with the assistance of the adorable Nemies.   FEATURES:  Explore 10 progressive stories that focus on different phonemes and keywords. Develop introductory-level phonics skills.  Build reading confidence. Learn keywords and sight words with interactive activities. Learn to decode words up to three sounds (CVC). Access Badanamu: Zoo Party ESL at home or in the classroom.  Badanamu: Zoo Party ESL is perfect for learners:  that are 3 years old and above.  that are starting to learn how to read.  that enjoy narrative activities.  that love interactive adventures.  With Badanamu: Zoo Party ESL, you can be sure of the following:  The learning content is aligned to a structured, standards-based ESL curriculum.   The apps are designed specifically for young learners with a kid-friendly interface.  Young learners will access high-quality English lessons in an ad-free environment.  Parental Control & Child-Lock:  The child-lock function will prevent your child from making accidental purchases.  Badanamu recommends up to 30 minutes of daily study with Badanamu: Zoo Party ESL and no more than 60 minutes of total screen time per day for young learners.  In-App Purchase Information:  This app is free to download but does contain in-app purchases.  To access progress analytics and for a better experience restoring access to content youve purchased across all apps and devices, we recommend that users create an account and sign-in when using our apps.   You may use your Badanamu Learning Pass Premium to begin your learners educational journey with Badanamu: Zoo Party ESL and other Badanamu ESL applications.   Follow Us:  Homepage: https://www.kidsloop.net  YouTube: https://www.youtube.com/badanamu  Instagram: https://www.instagram.com/badanamu/  Facebook: https://www.facebook.com/Badanamu1  Questions and Customer Support:  support@calmid.com  Terms and Conditions and Privacy Policy:  Terms and Conditions: https://badanamu.com/terms-and-conditions/  Privacy Policy: https://www.kidsloop.net/en/policies/privacy-notice/   Badanamu - Learn and Play Together ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}