{
"name" : "LEAD School Application for Parents",
"url" : "https://play.google.com/store/apps/details?id=com.leadschool.parentapp",
"package" : "com.leadschool.parentapp",
"category" : "Education",
"description" : "LEAD School is currently offering LEAD School@Home for all its partner schools parents. Do continue to get your child to attend daily live classes. If you are not part of a LEAD partner school and want your child to attend LEAD School@Home, use school code LS-1102-L-400093 to register & start learning for your child.  The LEAD School parent application allows parents of partner schools to track the progress of their child in school by keeping them updated on: - Unit Progress: Know which units are completed and what your kid has learned. - Attendance: Check your kids attendance in school for every day. - Assessments: View reports on the student grade and scores by the student in different assessments.  We at Lead School define excellence as education that empowers students to be capable adults, responsible citizens and empathetic human beings. This is captured by our education mantra: LEARN. THINK. DO. BE.  EXCELLENT EDUCATION. * Every child has the right to education that empowers her to become a capable adult, a responsible citizen and an empathetic human being. * We keep standards and expectation high at our pre-schools and schools from our curriculum team, teachers and students. * We promise a standard set of learning and development outcomes for each student and strive our best to deliver on them.  ACCESSIBLE. * LEAD schools and pre-schools are aimed at students who have the ability to pay a moderate school fee but do not have high quality schools in their vicinity. * We target village, taluka or small towns. In cities, we prefer to partner with education entrepreneurs or work through Public Private Partnerships.  AFFORDABLE. * Excellence can become expensive. At LEAD school we are fanatic about keeping non-learning costs low so that we can keep our school fee affordable while providing excellent education. * We leverage technology extensively to minimize administrative and logistic costs so that more and more students can afford an excellent education at LEAD schools. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}