{
"name" : "EngVoice: Learn English with Videos for TED",
"url" : "https://play.google.com/store/apps/details?id=com.learnenglish.videos.engvideos",
"package" : "com.learnenglish.videos.engvideos",
"category" : "Education",
"description" : "Study English efficiently by listening Popular TED talks Videos! With EngVoice we can study English funnier easier with multi-subtitles without any textbooks. English videos are an excellent way to learn English quickly. You can listen to TED talks anytime anywhere  at your desk or while youre on the move. What better way to pass the time during a long commute than by immersing yourself in an entertaining talk? With a little dedication EngVoice will help you quickly improve your listening skills and proficiency. One perk (benefit) is that all talks have transcripts multi - subtitles (a written version of the audio). This means that you can listen and read at the same time or look at a transcript if one part of a talk confuses you. EngVoice has hundreds of English TED talks videos available right now and each video has great subtitles to make learning easier.  Key functions 1. You can see TED Talks in each language. 2. Download favorite and Talk videos 3. At the same time you can open multi-subtitle (English and your native language) 4. Instance translate English words to your language 5. Show both subtitles when watching TED talks 6. Change the speaker speed that helps you to easier to understand the talks 7. Quick search support  NOTE: TED does not endorse or sponsor this app in any way. All TED Talks subject to the creative commons license found at ted.com ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.BIND_NOTIFICATION_LISTENER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.BIND_NOTIFICATION_LISTENER_SERVICE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}