{
"name" : "Learn Chinese - Business Chinese",
"url" : "https://play.google.com/store/apps/details?id=com.tech.buzen.businesschinese",
"package" : "com.tech.buzen.businesschinese",
"category" : "Education",
"description" : "Access your Business Chinese lessons online or offline  just download the lesson listening files you want to study offline.   1600+ business vocabulary  1500+ business phrases  40+ BUSINESS IDIOMS  90 + business Chinese lessons  Business Chinese dictionary  High quality audio -Native Speaker accent  Practice tests to improve your memorization  The Business Chinese App is a powerful app packed with real business Chinese for real business people. We have put together a full business Chinese course for serious Chinese language learners around the world who are ready to go beyond HSK and get a full immersion of practical advanced Chinese.  Our business Chinese lessons use an effective format that helps you remember what you learn and improve your business Chinese speaking and listening skills. In the practice session, you get the chance to use and test the language you learned.   As Chinese language experts, we are aware that learning chinese language is more efficient while learning full sentences not single words or characters. We are aware that your aim is to articulate yourself not in single words but instead in understandable chains of them - namely grammatical sentences.   The only way to use sentences and to be able to understand them is to learn them. This is the reason why we have structured single words, phrases and quiz. We are aware of the 3 blocks of language learning which are ; vocabulary, pronunciation, and grammar.   We shall first build a strong foundation of your vocabulary and your grammar and pronunciation will be improved overtime until you are able to express yourself in a business environment fluently. You will not only learn the words but you will learn to use them to build the phrases that join into a language. This is a best app for every aspiring business interpreter.  **Categories** Greetings and introductions, Etiquette, Appointments, Office titles, Work and careers, Reservations, Office, Office supplies, Telephoning, Down to business, At work, At the factory, Construction site, Company departments, Job interview, Meeting, Sales, Bargaining, Email, Employment, Customers complaint, Purchases, Business deal, Advertising, Business leadership, Product packaging, Placing orders, Presentation, Employment, Banking, Money and exchange, Finance, Business transactions, Business success, Service business, Business motivation, Transportation, Marketing, Professional business, Investing, Economy, International business, Taxes, insurance, Business idioms, Fluency.  Follow us on Instagram: https://instagram.com/business_chinese_app  Like us on Facebook https://m.facebook.com/Business-Chinese-APP-2348815555352854  Other Recommended Apps: MEDICAL CHINESE APP http://bit.ly/medicalchineseapp  LEGAL CHINESE APP http://bit.ly/legalchineseapps  Email Us: verselingoapps@gmail.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}