{
"name" : "Speechify(Beta) Text To Speech PDF Reader Dyslexia",
"url" : "https://play.google.com/store/apps/details?id=com.cliffweitzman.speechify",
"package" : "com.cliffweitzman.speechify",
"category" : "Education",
"description" : "Designed to help people with Dyslexia, ADD, Concussions, Second Language Learners, Auditory Learners, Super Learners and Productivity Fanatics.  Copy some text, open the app, and Speechify will read it to you with a human sounding voice. Turn your work/homework into a podcast.  Listen at up to 600 words per minute.  RETAIN MORE: Academic research shows that listening and reading at the same time results in significantly higher levels of comprehension AND an improvement in the listeners reading speed even when not listening.   Listen while driving, walking, cooking, eating, working out, etc.   Story  Ive been dyslexic my whole life.  Reading that sentence takes me the same amount of time and brain energy as most people take when solving a 4 digit long division math equation in their head.  I would pretend to read in elementary school.  Through hard work (and convincing a lot teachers to give me exceptions) I got accepted to Brown University.  One problem....I couldnt read my summer reading book - there was no audiobook for this book.  I had no other choice, I hacked an old text to speech computer system to read the remaining portion of the book over night into my iPhone and then listen to it on the plane.  Today, hundreds of thousands of people have been able to function in school and society because of Speechify.  Remember, that above all else, your mission is to be who you needed most when you were growing up.  Much love <3, Cliff Weitzman, Simeon Kostadinov and the rest of the Speechify Team  Go get the Mac App or Chrome Extension here: https://getspeechify.com/  We dont allow new people to pay us right now. Want to pay us? Tell your friends about Speechify instead <3 ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
}