{
"name" : "Learn to Draw - Paint by Art Coloring Book",
"url" : "https://play.google.com/store/apps/details?id=com.freekidspainting.glowcoloringapp",
"package" : "com.freekidspainting.glowcoloringapp",
"category" : "Educational",
"description" : "This is app view for Kids Learning educational new things for painting,coloring,thinking puzzle and more. Dont need any experience and skills, teach you step by step Learn to draw with How to Draw! Like a personal art teacher, it will teach you how to draw dozens of different objects and create amazing pictures Teach to kids for drawing app. -> Choose from a variety of super fun images,Poly,glow cartoon, paint just by following the numbers and watch them come to life color by number app!  -> Learn to draw Rediscover the joy of painting for education app. -> puzzle type game for coloring book with glitter effect on picture for Kids, -> Tap color on picture and think your artist color learning puzzle game -> Pants the colors page, Make happy bady in dlower drawing poster. -> maker the awesome painted gaacha life poster. use the pop colors forr page coloring.  -> animal for kids, users only need to fill in the color according to the predefined art for a perfect work. -> kids Easy Lessons Lets steps for how to draw flower number coloring Digital Painting Christmas coloring book with Kids Music ,Magic Paint,puzzle,Comics Draw Relaxing Game. -> Enjoy theo jams color book painters. The True coloring book. -> Paint doremon book my show easy picure easy game. -> Easy paiaiting picture game to play, release your imagination in wall painting, make it your hobby with real oil painting color in wall.  Main Features of the App  List of Categories  1)How to Draw ANIMAL - Draw Cat,hourse,camel,lion,tiger etc. 2)How to Draw BIRDS - Color by Parrot, Peacock, peahen, Kangaroo etc. 3)Learn ABCD - Learn preschool abcd with drawing. 4)How to Draw FLOWER - kids rose, sunflower,lotus etc. 5)Funny CARTOON - Princess cartoon,prince cartoon,emoji cartoon,christmas cartoon etc 6) INSECT - Butterfly, Bee, Snake etc 7) FISH - Shrimp fish, catfish,goldfish,bluetang etc 8) FRUIT - Banana, Apple, Cake etc 9) Others - Car,Tree,Balloon,Cap etc   STEP WISE DRAW  - Change Opacity - Music for kids with app - Stroke editor - Animation speed for kids learning paint.   EXPERT LEVEL DRAWING FOR KIDS  - puzzle type thinking - Color for pencil - Paint eraser   FILL COLOR PAINT  - Tap to color in picture - Lots of coloring pattern   Custom Drawing  - Stylish drawing for kids - Homework for kids app - draw my face with colorpen   Pattern of Design & Glow Flower Effects  - Modern Art Effects for kids - Mahendi design for girls - fill color on cool effects - education for kids task - colorful flower ornaments - redu & undo graphics for paint editor - chaplet flower effect - Doodle effects - Draw Glow Comics   Why Should Installs  - Free Kids educational App - Learn to kids during free. - Teach ABCD and Lessons offline. - Learn while play game. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_APP_BADGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}