{
"name" : "Udemy - Online Courses",
"url" : "https://play.google.com/store/apps/details?id=com.udemy.android",
"package" : "com.udemy.android",
"category" : "Education",
"description" : "Udemy is an online learning platform featuring 130,000+ video courses taught by expert instructors. Take courses in anything from programming languages like Python, and Java to personal development classes like design, drawing, writing and yoga. Join the more than 40 million students who are mastering new skills, advancing their careers, and exploring new hobbies on Udemy.  LEARN ANYTHING: Discover courses in over 2,000 topics - from coding and data science to marketing, Photoshop, yoga, and more. New courses, on cutting-edge topics like machine learning, artificial intelligence, and blockchain, are continuously refreshed.   LEARN AFFORDABLY: Udemy has both free and paid courses within your budget. Once youve enrolled in a course, youll have lifetime access to the content.   LEARN FROM EXPERTS: Be inspired by 50,000+ expert instructors teaching in 60+ different languages.  LEARN ANYWHERE: Download courses to learn offline. On the go? Listen to courses in audio-only mode.   LEARN AT YOUR OWN PACE: Ask both students and instructors questions. Personalize your learning experience with speed controls and closed captioning.   Free and paid courses available in: - Development: web development, programming languages (Python, Java, JavaScript, Ruby, Swift, C# & more), game development, coding basics, coding bootcamps, etc.  - Business: Finance, financial analysis, entrepreneurship, public speaking, presentation skills, writing, etc. Plus, data & analytics (SQL, machine learning, deep learning, data science & more).   - IT & Software: IT certification, network & security, cyber security, CCNA, etc.  - Office Productivity: Microsoft, Apple, Google, SAP, Oracle, etc.  - Personal Development: productivity, leadership, personal finance, career development, study skills, etc.  - Design: drawing, web design, graphic design, design tools (Photoshop, Adobe Illustrator & more), UX design, UI design, design thinking, etc.  - Marketing: Search Engine Marketing (SEM), Search Engine Optimization(SEO), social media marketing, marketing fundamentals, mobile marketing, content marketing, product marketing, etc.  - Lifestyle: arts & crafts, travel, gaming, dog training, etc.  - Photography: digital photography, photography tools, commercial photography, video design, etc.  - Health & Fitness: yoga, nutrition, meditation, self-defense, etc.  - Teacher Training: online course creation, presentation skills, instructional design, etc.  - Music: instruments (guitar, piano & more), music fundamentals, music techniques, music software, etc.  - Languages: English, Spanish, Portuguese, Chinese, etc. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}