{
"name" : "Ellucian GO",
"url" : "https://play.google.com/store/apps/details?id=com.ellucian.elluciango",
"package" : "com.ellucian.elluciango",
"category" : "Education",
"description" : "Ellucian Mobile helps you stay connected to your college or university like never before. Youll have access to great features that make your campus experience more effective, more efficient, and more fun.  * Enabled features may vary by institution; not all features/functionality will be available for all institutions. Please contact your institutions Information Technology staff to obtain your login credentials or for assistance with login related questions.  Key features of Ellucian Mobile include:  Courses  Manage your courses on the go by accessing your course schedule and links to helpful course resources including class assignments  Assignments  Available in the app or as a widget.  Registration  Search and register for your planned courses wherever you are.  Grades  Check your midterm and final grades on the go.  Account Balance  Check your account balance and make a payment.  Notifications  Stay informed with personalized announcements delivered right to your device.  Library  Dig into the resources at your institutions library.  Bookstore  Find the books you need for the courses youre taking.  Important numbers  Easily find all the numbers, websites, and addresses you need.  Maps  Know your campus like the back of your hand.  Directory  Find the faculty, staff, or student you need and call them right from the app.  News  Dial in to everything happening in the world, both on campus and off.  Events  Never miss another important event.  Media  View videos or listen to audio.  Social Media  Tie your school experience right into your social network.  * Please contact your institutions IT staff for assistance with login. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.USE_BIOMETRIC', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}