{
"name" : "Learn 33 languages with Mondly Free games for kids",
"url" : "https://play.google.com/store/apps/details?id=com.atistudios.mondly.kids.languages",
"package" : "com.atistudios.mondly.kids.languages",
"category" : "Education",
"description" : "Are you looking for a fun and free educational app to help your kid learn a new language in record time? Look no further! Mondly for Kids is the free educational game that teaches toddlers & kids in kindergarten, preschool or the first years of school 33 different languages in a fun and engaging way.   Download the language app today so your kid can learn English, Spanish, French, German, Italian for FREE.  In no time, your brilliant kid embarks on a language journey to remember. They play, explore and discover the amazing world around them. The unique language lessons take your kid on an adventure where boys and girls learn about:   Animals  Nature  Fruits & Food  Parts of the body  Colors & Numbers  Mondly for Kids features fun & intuitive reading, writing, listening and speaking exercises using flashcards for kids that will help stimulate the imagination and bring out the creativity in your kid. Join the fun and experience the amazing benefits the app brings for your gifted children:   Pick up new vocabulary through flashcards for kids and by playing fun word games  Learn to speak new phrases by playing around to form basic sentences  Take part in interactive conversations with native speakers  Nail flawless pronunciation by listening to professional voice actors  Our family-friendly & kid-friendly courses have powerful features to help preschool, kindergarten and school boys and girls learn the ABCs:   Amazing kid-friendly illustrations to keep you kid focused  Awesome sound effects to grab childrens attention  Beautiful animations to make the language journey more fun  Innovative verb conjugator to make learning grammar a breeze  Mondly for Kids is more than a child-friendly educational game and flashcards app. It is designed to involve parents as well. Start by choosing the language you want your kids to learn to speak, then select the preschool or school language level and youre ready to go. While boys & girls stay focused and have fun learning the ABCs, the alphabet, new words and phrases, parents can track their language journey. The specially designed statistics section for moms and dads, give you a glimpse into your childs fast progress. Each lesson brings your clever child one step closer to fluency by awarding them points to keep them engaged and leveling them up to acknowledge their proficiency. At the end of the day, your kid will amaze you with their newly acquired language skills making you feel proud.  Being able to learn 33 languages, your gifted kid can become a language superhero. Here are the top 5 languages your kid can study with Mondly for Kids:   English for kids  Spanish for kids  French for kids  German for kids  Italian for kids  In no time, our kid-friendly ABC game will help your kid learn the alphabet and absorb hundreds of new words & phrases, faster than regular classes. Its like having a private teacher in your pocket 24/7. Explore the world of languages with Mondly for Kids:   11 categories  77 premium lessons  400 words with illustrations & audio  75 new phrases to learn  Free daily lessons  Fun weekly quiz  Ad-free, just pure educational fun  Download Mondly for Kids now and help your child learn a new language in a fun and engaging way. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.android.vending.BILLING', 'com.atistudios.mondly.kids.languages.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SEND_SMS', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING']",
}