{
"name" : "Word of the Day: Learn Daily English, Lexicon Quiz",
"url" : "https://play.google.com/store/apps/details?id=com.wordofday",
"package" : "com.wordofday",
"category" : "Education",
"description" : "Do you want to improve vocabulary daily? Are you looking for ways to enhance your lexicon or test vocabulary knowledge? You need Word of the Day! This learn words vocabulary knowledge app is a mix of a word daily learning & vocabulary trivia all aimed to improve your word education and ease your word learning. Meaning you can increase your vocabulary knowledge, and do vocabulary test = either way, you are having fun and learning new words!   WORD OF THE DAY Explore our Word of the Day section and learn new words daily. All the words youve passed and learned are kept in your Learned section. If you love a specific word and meaning you can also make it your favorite and use for your projects or in your day to day communication. By learning daily, you will be able to improve your lexicon and becomemore eloquent in speaking and messaging. VOCABULARY QUIZ The word education can get boring. Thats why to increase your vocabulary quiz and to put little vocabulary test to your skills, we also added a word knowledge quiz. The word knowledge questions are always the meaning of the word and you just need to guess the correct word. Sounds easy? Try it now word of the day!  You also have the option to remind you every day that you have a new word to learn and expand your knowledge!   VOCABULARY HANGMAN To make our lexicon quiz more fun, we added a hangman vocabulary knowledge test & learning which requires you to guess the word by yourself, letter by letter. Try this hard, yet fun word meaning test!   WORD LEARNING REMINDER Get daily reminders with your English words learned and smartly enhance your knowledge and intelligence with word by day.  So whether you are up to learn new words daily i.e word by day or test your knowledge in a word quiz game  Word of the Day is your #1 app! Download now Word by Day to train your brain and have a much wider vocabulary full of rare, unusual and funny words! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}