{
"name" : "FunnyFood Kindergarten learning games for toddlers",
"url" : "https://play.google.com/store/apps/details?id=com.arrowstar.FunnyFoodsLite",
"package" : "com.arrowstar.FunnyFoodsLite",
"category" : "Educational",
"description" : "Learn colors and shapes in educational games for toddlers 3 year with kids logic games! Funny Food for develop fine motor skills!  Toddler games free for 2 year olds has endless possibilities to keep your children busy with very useful and engaging games   Welcome to the world of 17 various childrens games free 3 years old. This geometric shapes app addresses various topics such as: logic, sizes, colors etc. It also has puzzle for toddlers!  FunnyFood Kindergarten learning games for toddlers INCLUDED kids logic games: SORTING. Sort all of the food into different trucks.  SILHOUETTES. Wash all the fruits and vegetables and put on the platter. (Fruit learning for creative thinking and imagination) SHAPES. Bake geometrical cookies and feed them to little animals (Introduces to geometric shapes app) UNITS as PARTS and as a WHOLE. Cut the fruits and veggies into smaller parts by tracing the lines and feed the animals. (Learning game, that teaches a concept of fractions.) MATCHING games kids. Funny food are hiding in the dark refrigerator. Find the pairs in matching games kids. (memory games for toddlers 3 years ol) SIZES. Sort the goods into matching boats. (Learn colors and shapes) COLORS. Catch all the food in the kitchen and sort it into pots. (kindergarten learning free apps introduces to learn colors toddler free)  PUZZLES for toddlers. Put a puzzle together. (Toddler games free for 2 year olds for creative thinking and imagination) FIND and TAP. Find and tap the food which you may put into jars. (Fun game, that develops attention) CONTOURS. Wash the food and sort it into places. (Smart kids games for creativity and cognitive thinking) LOGIC. Select a passenger and put him on the train. (Logic game, that introduces to a concept of consistency and continuity) SHAPES and SIZES. Bake cookies of different shapes for toddlers and sizes and feed them to the animals. (Fun educational game, that introduces to learning colors for toddlers free)  FEATURES OF FunnyFood Kindergarten learning games for toddlers - EDUCATION FOR KIDS: 17 educational games for kids kindergarten(fruit learning, etc) 10 educational concepts of education for kids and geometric shapes and color games for kids 50 sorts of food and learn colors toddler free (2 year old games free boys) Amusing characters with lots of animation and interaction  Comfortable and simple interface for preschoolers from 3 and up Fine motor skills & basic skills: logic, attention, memory games for toddlers and thinking, puzzles for toddlers free, learn color and shapes  Fun sound effects and amazing graphics for children from 2 to 5 years old No Internet needed in free learning games for toddlers and 2 year old games free boys  Funny Food will become a great helper for parents and kids. Playing these fun games for children free will help your kids to become independent and creative thinkers! Baby learning colors for toddlers free in childrens games free 3 years old with kids logic games to develop fine motor skills in toddler games free for 2 year olds.  About MAGE: We develop educational apps for toddlers, interactive books and nursery rhymes for young children and toddlers .  Our educational apps for toddlers with smart games for kids are distinguished by high quality content with particular attention to design. The simple and user-friendly interfaces of our free learning games for toddlers 3 years ol have been especially created for little ones. With our apps kids learn the alphabet, letters, numbers and phonics. Our apps contain no third party advertising and comply with the standards of Designed For Family.  There is only a part of the content available in the free version of the application. To gain access to the full version, you will need to make a built-in purchase. ",
"desc_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_LOGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_LOGS', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}