{
"name" : "Assam GK Practice - Best exam preparation app",
"url" : "https://play.google.com/store/apps/details?id=com.assam.gk",
"package" : "com.assam.gk",
"category" : "Education",
"description" : "A simple app for your exam preparation.   Assam GK Practice is a quiz based MCQ app which will help you to practice for your exam preparation.   It has Eight Question Sets.  Each set will give you 25 questions to practice.  Each set has 7 minutes time limit to keep you in track with your TIME MANAGEMENT.  At the end of each set, your scorecard will be displayed.  Assam GK Practice app is very useful for Assam-government exam preparation.  Assam GK Practice app covers all the sections for you study. Assam History, Assam Culture, Modern Assam History, Important peoples of Assam, Important Places of Assam etc. all are covered in the app, which will immensely help you in your exam preparation.  Assam GK Practice - Best exam preparation app will help you to improve your General Knowledge for Competitive exam preparation and Interview. There are currently eight question sets which has 25 questions each about ASSAM. General Knowledge of Assam for candidates who are preparing for TET Assam, Competitive examinations and Interview can use this app.   Assam GK Practice app is helpful for all competitive exams like ASSAM TET exam, any Assam Govt exam, IAS, Bank PO, SSC CGL, RAS, CDS, UPSC exams and all state-related exam.  This app is for Assamese people, from Assam, North-East India. Here Assam TET Questions, Assam Gk questions are found for Assam Govt exam.   General Knowledge on Assam, Assam History, Assam Constitution, and Assam Organizations, cultural communicate etc. for competitive examinations in India.  This app contains Study material as well as Practice Tests for TET Assam, Assam Govt. Exam 2019-20 exam preparation. The questions provided in practice tests are based on the basis of previous question paper of all Govt. Exam, Exam held in Assam. This app provides the unique approach towards exam which helps students get the selection in exam. Students are advised to practice a lot of questions for giving best in competitive exam.   Assam GK Practice app is very important for any competitive exam like Railway Group D, APSC, Panchayat, Assam Police, SSC, Bank etc.   Assam GK app shall be beneficial to students preparing for below examinations - APSC (Assam Public Service Commission) - ASSC (Assam Staff Selection Commission) - Assam Banking, Assam Railway, UGC NET, - Teacher Recruitment, Teacher Eligibility Test, - Indian Army, Indian Navy, Paramilitary Force, - Jobs in public sector units of Bihar. - A.A.H.O - APSC Assistant commissioner - Assam Judicial Services - APO Preliminary exams  We guarantee SUCCESS if you could practice all question-answers given in this app !  Hope this app is helpful. If it is, then kindly give your valuable feedback.  All the best... ",
"desc_perms" : "[]",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'io.kodular.lakhibaruah117.Assam.permission.C2D_MESSAGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.SEND_SMS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'io.kodular.lakhibaruah117.Assam.permission.C2D_MESSAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}