{
"name" : "Magic Counting 4 Toddlers Writing Numbers for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.arrowstar.BabyWizardLite",
"package" : "com.arrowstar.BabyWizardLite",
"category" : "Educational",
"description" : "Amazing way to learn to write numbers for toddlers and counting for kids! Kids learn to count with Little Wizard!    Unbelievable adventures are waiting for you in the enchanted castle of ghosts, in the magic swamp of trolls, in the mysterious laboratory of numbers! Your children accompanied by the Little Wizard will take their first steps in math: learning numbers, counting for toddlers etc  In Magic Counting 4 Toddlers Writing Numbers for Kids you will find :    GET ACQUAINTED WITH THE NUMBERS FOR TODDLERS. Castle of Ghosts! - help the Little Wizard catch and lock all the prankish ghosts into the chest. Counting for kids   LEARN TO COUNT TO 10. Hide and seek with the merry trolls! - help the Little Wizard capture all the naughty wee trolls!   LEARN TO WRITE NUMBERS LEARNING FOR KIDS FREE.  Mysterious Laboratory of Numbers! - kid number games for kindergarten, grow bewitched plants with the magical potion! Helps to learn writing numbers for kids and improve number writing practice   COUNTING OBJECTS. Feed the little dragon! - kids learning apps for age 4 free, feed the hungry little dragon as much as he needs! (Counting for toddlers)   CORRELATION BETWEEN NUMBERS AND QUANTITIES. Singing Mountains! - kids logic games, along with the Little Wizard find enchanted singing birds. counting numbers for nursery kids learn to sort.  FEATURES OF THIS WRITE NUMBERS APP:   Funny and entertaining learning numbers game!  Fun education for kids!  Merry music and sound effects!  Improve number writing practice!  Magical atmosphere in games for toddlers 3 years ol!  Amazing graphics  No Internet needed  We are sure that Magic Counting 4 Toddlers Writing Numbers for Kids will become your childs favorite games for children 3 4 yrs free! You will get 4 levels of learning games for kids 1st grade free! You should download the full version of kids logic games to enjoy all unlocked.  About MAGE:  A lot of apps for kids have been created by MAGE, a software company which develops educational apps, kids learning apps for age 4 free, interactive books and nursery rhymes for young children and toddlers.   Our games for toddlers 3 years ol are distinguished by high quality content with particular attention to design. The purpose of all our baby games for children 3 4 yrs free is aimed for your childs all-round development.  Children will write numbers learning for kids free, count to 10, phonics, numbers, counting numbers for nursery kids learn to sort. The write numbers app help preschoolers to develop memory, attention span, vocabulary and speech, as well as other basic skills. Children are exposed to writing and counting through building puzzles and doing simple math.  As a company we strive to make our apps for kids and kid number games for kindergarten practical, instilling a desire for knowledge. Our learning games for kids 1st grade free contain no third party advertising.  There is only a part of the content available in the free version of the application. To gain access to the full version, you will need to make a purchase. ",
"desc_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}