{
"name" : "GOLDWELL EDUCATION PLUS",
"url" : "https://play.google.com/store/apps/details?id=com.motim.goldwell",
"package" : "com.motim.goldwell",
"category" : "Education",
"description" : "Develop your skills further as a hairdresser, stylist or colorist and refine your techniques with Goldwell Education. Take advantage of useful tools like the Goldwell Hair Color Card or Color Sketcher from the world of ELUMEN, which provides you as a professional hairdresser, stylist or colorist everything you need in the palm of your hand.  The Goldwell Education Plus App for professional hairdressers, stylists and colorists allows you to:   Boost your career with our hairdresser, stylist and colorist education seminars  learn everything you need to know about the Goldwell education offering, including times and dates in your region, and start a booking request directly from the app*   Explore the world of ELUMEN and ELUMEN PLAY with the Color Sketcher and digital Hair Color Card! Create and try out your own ELUMEN recipes, or browse our collection of mixing recommendations in the ELUMEN Cook Book!   Discover Hairstyle & Color Trends in 2020. Get inspired, meet the team, and learn the looks using our interactive 3D step-by-step tools   Enter the world of @Pure Pigments with the Color Multiplier: mix your own formulations as a virtual colorist and share them via social media   Dive deeper into the world of Goldwell Education Plus with a convenient link to our new global YouTube platform, featuring educational content by hairstylists, for hairstylists.  *Only available in select countries.  Connect with Goldwell via our YouTube Channel and our website:  GoldwellEducation.plus Goldwell.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}