{
"name" : "Learn Norwegian Free",
"url" : "https://play.google.com/store/apps/details?id=com.atistudios.italk.nb",
"package" : "com.atistudios.italk.nb",
"category" : "Education",
"description" : "Learn Norwegian with free lessons daily. Let Mondly teach you the Norwegian language quickly and effectively. In just minutes youll start memorizing core Norwegian words, form sentences, learn to speak Norwegian phrases and take part in conversations. Fun Norwegian lessons improve your vocabulary, grammar and pronunciation like no other language learning method. Beginner or advanced learner, traveler or business professional with a tight schedule? The app works great and dynamically adjusts to your needs.  Explore language exercises for reading, listening, writing and speaking enhanced with a dictionary, verb conjugator and state-of-the-art speech recognition technology - youll feel like having your own Norwegian language tutor in your pocket. Download the language learning pill today and enjoy the benefits of learning a new language for life.  The secret path to language learning Remember the Norwegian language classes in school? You started with hundreds of basic words and expressions, continued with tons of Norwegian grammar lessons and at the end of a full semesters language course you could barely translate a sentence or say Hello! to a foreigner. Thats the traditional way to learn a language. Mondly has a different approach, thats opposite to the average language course.  This is how the future of language courses looks like The App gets you started with a basic conversation between two people. You quickly start memorizing core words, use them to build sentences and phrases, and at the end of a 45-minutes module you are able to reconstruct that conversation with your own voice. Its an effective way to learn Norwegian phrases. State-of-the-art Natural Speech Recognition and Spaced Repetition Algorithms make the app effective for learning languages.  Here are the key features that make Mondly a great tutor for you:  Crystal-clear audio and professional voice actors. Learn the right Norwegian pronunciation from conversations between native speakers.  State-of-the-art Speech Recognition. Mondly knows exactly how to listen to your Norwegian words and phrases. You will only get a positive feedback if you speak Norwegian clearly and correctly. This will improve your pronunciation.  Useful phrases for real situations. Memorizing hundreds of isolated words is not the way to go when it comes to learning Norwegian. Mondly teaches you Norwegian vocabulary by offering you core words and phrases. The app breaks the learning process down into short lessons and puts them into themed packs.  Learn conversational Norwegian. Conversation is the main reason to take this free course. It will help you build a core Norwegian vocabulary with widely-used nouns and verbs, and speak Norwegian clearly.  Verb conjugations. If you want to learn more during this course, just tap the Norwegian verbs and get the full conjugation on the screen, including the translation. Its faster and better than a dictionary.  Advanced Statistics. The App uses intelligent reporting, so you can always follow your progress. Build your vocabulary step by step and become better daily.  The Leaderboard. See how your friends are doing and compete with people from all over the world to become the best learner in the Mondly community family. Take the Weekly Quiz to become even better.  Adaptive Learning. Learning Norwegian is different from person to person. So we taught the app to learn from your way of learning. After little time spent together, Mondly will understand what suits you best and it will become your own guide and customized teacher. Kids will love it as well.  Before you know it, at the end of these Norwegian lessons, you will master the most useful 5000 words and phrases and you will be on the fast lane to learning a new language. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.amazon.device.messaging.permission.RECEIVE', 'com.android.vending.BILLING', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.READ_APP_BADGE', 'android.permission.BLUETOOTH', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.ACCESS_WIFI_STATE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.atistudios.italk.nb.permission.C2D_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.USE_CREDENTIALS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.RECORD_AUDIO', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.google.android.c2dm.permission.RECEIVE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.sec.android.provider.badge.permission.WRITE', 'com.oppo.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.ACCESS_NETWORK_STATE', 'com.atistudios.mondly.languages.permission.RECEIVE_ADM_MESSAGE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.atistudios.mondly.languages.permission.RECEIVE_ADM_MESSAGE']",
}