{
"name" : "Princess Libby's Carnival",
"url" : "https://play.google.com/store/apps/details?id=com.libii.libbycarnival",
"package" : "com.libii.libbycarnival",
"category" : "Educational",
"description" : "Loud cheers come from the castle, where it turns out Princess Libbys Fantasy Carnival starts with excitement and joy filling the air.  What kind of style would work out for a carnival? Spark your inspiration for giving the royal friends a different look that turns heads. For foodies, this is definitely a paradise serving with mouth-watering food like panini, hot chocolate, skewer and ice cream. And tons of amazingly fun activities, such as toy claw machine, whack-a-mole and jelly connect, are prepared to perk up your day!   Features: - A great many dresses to make Libby stunning With so many trendy styles to choose from, you can dress up Libby any way you wish - All princes and princesses get dressed from head to toe The royal friends are drawn to the first-ever carnival where sweet memories are to be made - 12 fun-filled mini games to brighten up your day Cooking, float decoration, mask designjust indulge yourself in those fun activities  - Spin the wheel and win the daily bonus Log in everyday to try your luck and get the nice accessories or stars  About Libii Game: With over 600 million downloads and growing, Libii is committed to creating innovative games for kids. Well keep working on establishing a good relationship with both parents and their children and bringing a healthy, happy atmosphere for them. Visit us: http://www.libii.com/ Like us: http://www.facebook.com/LibiiGame Contact us: Got any ideas? Suggestions? Need technical support? Please feel free to contact us 24/7 at WeCare@libii.com  Need You Know: This app is totally free to download and play, some basic items are also free to use, but some additional items need you to purchase and pay to unlock. Therefore, if you do not want to use these items, please turn off the in-app purchase in your settings. Thanks. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}