{
"name" : "Baby Panda’s Handmade Crafts",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.greening",
"package" : "com.sinyee.babybus.greening",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Are you looking for ideas about handmade crafts? Ever wanted to be a craftsman? Baby panda has a lot of references for you!   Baby Pandas Handmade Crafts shows how to recycle waste like paper plate, chopsticks... and turn them into beautiful handmade crafts. Do not throw away old things! Discover new uses for them! You can make attractive accessories and unique gifts for all holidays and special events. Get inspired by these amazing designs of Baby Pandas Handmade Crafts and learn how you can recycle old things for handmade crafts at home! The fun, and magic, never end!  Features:  Handmade Creations: Make kites, flowers, necklaces and more!   Recycling Materials: Paper plate, chopsticks and more!   Mystical Magic: Move your wand and watch the magic happens!   Colorful Tools: Scissors, rubber, glue, colored crayons and much, much more!  Eco-friendly Robot: Make the panda town greener!  Badges: Complete green quests to earn badges!  You will learn: 1. Environmental awareness in daily life. 2. Utilizing your creativity to make awesome trinkets. 3. Improve hand-eye coordination and learn to be conscious of the environment.  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}