{
"name" : "Skritter: Write Japanese",
"url" : "https://play.google.com/store/apps/details?id=com.inkren.skritter.japanese",
"package" : "com.inkren.skritter.japanese",
"category" : "Education",
"description" : "Practice Japanese writing with Skritter whether you have a strong grasp of written Japanese and want to remember the characters better or are a beginner who doesnt know where to start.  Skritter has existed for more than 10 years, and for a good reason: our learners are amazing! They help us with feedback, which allows us to create what we think is the best Japanese writing app out there!  Japanese writing uses three different scripts; Hiragana, Katakana, and Kanji. Skritter offers all three and you can learn them through our decks (similar to a card deck) based on topics and difficulty.  Deck examples: - Survival Japanese (for traveling in Japan) - Food and drinks (learn to understand the menus at your favorite Japanese restaurant with delicious sushi, ramen, and other dishes) - Cultural topics like Samurai Japanese - More advanced topics like foreign policy - And many more  First, you learn a characters meaning, then practice writing it, and before you know it, youll want to learn thousands of characters. Try our app and see for yourself why thousands of people use it every day.  Have questions, problems, or feedback? We would love to hear from you. Reach out to us at team@skritter.com  ----------------------------------------- Guest accounts enjoy free access to select decks forever! Unlock Review mode, and study anything you want with a premium subscription, which is available for purchase in the app. Big savings offered on 12-month subscriptions!   One month subscription (automatically renewed until canceled)   12-month subscription (automatically renewed until canceled)  Recurring billing, cancel anytime. Within 24 hours before the subscription period ends, you will be charged through your Google Play account. Manage your subscription from your Google Play account settings where you can turn off auto-renewal at any time. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.  Privacy Policy: http://www.skritter.com/legal Terms of Use: http://docs.skritter.com/article/133-terms-of-use ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}