{
"name" : "Online Classes for CAT, TISS, IPMAT Preparation",
"url" : "https://play.google.com/store/apps/details?id=com.careeranna.careeranna",
"package" : "com.careeranna.careeranna",
"category" : "Education",
"description" : "Online CAT Coaching, MBA Coaching, Past Year Solved Papers, Mock Tests - CAT, SNAP, NMAT, IIFT, XAT, IPMAT, TISSNET & CMAT - Now Practice Free GK Tests on Career Anna - Free GK Tests on Current Affairs, Polity, History, Geography, Social and Economic Issues and many more topics. With over 17,000 students sent to top MBA Colleges in just 4 years, Career Anna is the best Online CAT Coaching and Online MBA Preparation Platform. It is the best app and platform to prepare for MBA Entrance exams like CAT, XAT, IIFT, SNAP, NMAT, TISSNET, CMAT and MHCET. It also helps students to prepare for IPMAT, Integrated Programme in Management courses by IIM Indore and IIM Rohtak.   Free Career Anna Courses and paid MBA Courses of Career Anna for Online CAT Coaching, XAT Decision Making, NMAT Coaching, SNAP Coaching, TISSNET Coaching, IIFT GK, TISSNET GK, WAT GD PI Preparation etc. are the best way to prepare for exams and score high to get into top MBA Colleges.  Career Anna App provides Free Videos and Free Courses on Vocabulary Development, Maths, English and LRDI Question Solving for CAT, XAT, TISSNET, IIFT and other MBA Entrance exams. You also get exam specific free GK Study Material, GK Videos and GK Tests for SNAP, IIFT, TISSNET and CMAT. You also get free CAT Mock Test, free NMAT Mock Test, free IIFT Mock Test, free SNAP Mock Test, free TISSNET Mock test and free mock test for other MBA Entrance exams.   Career Anna App is the best way to prepare online for CAT and other MBA Exams. It is the must use app for all serious MBA Aspirants who wish to get into top MBA Colleges.   All courses on Career Anna are created and delivered by alumni of top MBA Colleges as mentors and teachers - from IIM Ahmedabad, IIM Lucknow, IIM Shillong, XLRI, FMS, MDI and NITIE.   Check out website at: https://www.careeranna.com/courses ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}