{
"name" : "Badanamu: Bada Genius Nature",
"url" : "https://play.google.com/store/apps/details?id=com.calmid.learnandplay.badagenius2nature",
"package" : "com.calmid.learnandplay.badagenius2nature",
"category" : "Education",
"description" : "Reinforce foundational skills and develop understanding of nature with this extended Genius program! Learn seasons, forests, deserts, life cycles and new vocabulary with Bada Genius Nature.  Your child will love learning with Bada and his friends. Fun activities, books, songs, and interactive quizzes enable your child to learn in an exciting new way and also motivate your child to discover and remember new nature related topics.   The Bada Genius Nature curriculum includes the following:  3 storybooks, 9 songs, and 20 learning activities.  Seasons including summer, fall, winter, and spring and related concepts.  The Forest including tree, butterfly, and bird life cycles and associated vocabulary.  The Desert including the habitat, life, and fun in the desert related content.  With Bada Genius STEM you can be sure:  Material is safe and appropriate for children, with no ads or improper content.   Your child will not be spending time playing addictive games.  Included activities are structured, yet interesting and dynamic.  Real learning transfer and retention will be provided.  Bada Genius STEM is perfect for:  Children from 4-8 years of age.  Daily interaction and microlearning.  Diverse learning content and engagement.   Preparing children to meet common core standards.  Follow us on one of our social media accounts to hear the latest about our products and animations! Homepage: https://www.kidsloop.net YouTube: https://www.youtube.com/badanamu Instagram: https://www.instagram.com/badanamu/ Facebook: https://www.facebook.com/Badanamu1 Badanamu: Lets learn and play together!  **Permission required to access your devices storage for saving and loading photos ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}