{
"name" : "Physics Pro 2020 - Notes, Dictionary & Calculator",
"url" : "https://play.google.com/store/apps/details?id=com.alpha.physics",
"package" : "com.alpha.physics",
"category" : "Education",
"description" : "Alpha Physics is the best physics app available on android. This app provides free physics topics, definitions, formulas and a beautiful formula calculator in your pocket. It helps you to refresh your knowledge, prepare for exams, solves your physics homework and increase your knowledge.   This education application is formatted for all levels of physics from primary school to university. Its material design with clean interface allows students to focus on particular areas in the subject.  Features:   Over 25 vital physics Concepts  All Constants that you need to study physics  A glance of basic Maths for revise  Physics Dictionary with over 500 definitions  An elegant Formula Calculator  Solve your homework instantly  Know about great Physicists who made physics  Dark theme for late night sessions  Search anything in physics  All Physics Topics Contains over 25 most vital and basic physics concepts. Every topic is going through a brief introduction to the concept and visualized with a beautiful icon. And we include basic Maths for revise and as a reference. Each unit contains formula, equations and detailed description which are formatted for all level of physics from primary school to university.  Constants that matters A datasheet for all the constants that matters most and needy. This is a useful tool which you can quickly look to the physical constants to solve your homework or revise your memory.  Quick reference Definitions Physics dictionary which contains over 500 physics definitions or terms. All definitions are briefly explained with simple language and equipped with a reference to Wikipedia. User can switch between all and basic definitions for ease.  A beautiful Formula Calculator Solves any problem or formula instantly and accurately. Formulas are classified into 5 sections with over 100 formulas. A quick look to any equation you want with detailed description and helps you to revise key formulas and solve your homework.  Know about great Physicists Know more about people who contributed to physics to study different aspects of nature. Contains more than 60 Scientist describing their inventions and awards they achieved.  Search, get results now Search anything you want to know and explore the physics world. Users can search topics, definitions, formulas and physicists to get results instantly.  Dark theme for late night sections Alpha Physics is built for students who are studying at night too. Dark theme with material design helps students to study physics without any stress.  This app covers following topics: Vector operations Kinematics Linear motion  Uniform acceleration Projectile motion Uniform circular motion Force Rigid body Work, Energy, Power Rotary motion Harmonic motion Gravity Lateral and longitudinal waves Sound waves Electrostatics Magnetic field Direct current Alternating current Wave optics Electromagnetic waves Geometrical optics Modern Physics Hydrogen atom Thermodynamics  The formulas are classified into 5 sections: Mechanics Thermal Physics Waves & Optics Electricity & Magnetism Modern Physics  Upcoming features: Quiz Section  Data and Tables Physics facts Unit converter Languages including Hindi, Telugu, Bengali   The app is continuously updated with new features and content. So, stay up to date for new app releases.  MADE WITH  IN INDIA ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}