{
"name" : "Baby Panda's Train",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.trainII",
"package" : "com.sinyee.babybus.trainII",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Good morning, Train captain! Are you ready to drive your train together with Baby Panda and begin your adventure? Sound the air horns and lets set off!   Build a little train Pick a red locomotive and connect the silver passenger cars. Lastly, dont forget to connect the brown freight cars. Wow! Your little train looks cool. Embark on an adventure in your very own train!   Transport passengers Check your passengers tickets and help your passengers remove prohibited items from their suitcases. Carry passengers on your train across grasslands and begin an exciting adventure!   Transport goods You have arrived at the freight warehouse! Control the crane and use the giant hook to load the goods onto the train and send them to the destinations.   Remove obstructions Theres a break in the track. What should you do? Fix the track with sleepers and rails! A barrier is blocking the train. Control the mechanism to raise the barrier! Some sheep are on the tracks. Give them a nudge and they will baa-ck off from the tracks! Think how you can overcome the challenges and send your passengers and the goods on their way to the destinations!   Congratulations! You have completed all your tasks. Baby Panda has a train piece for you! Check it out now!   Features:  - 18 types of train pieces. Unlock a piece for free when you complete a task.  - 4 map themes: Grasslands, Desert, City, and Tunnels.  - Learn what to take note of when riding a train, and find out which items are prohibited!  - Your child can experience driving a train!  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}