{
"name" : "Effective Learner",
"url" : "https://play.google.com/store/apps/details?id=com.neurosky.hafiz",
"package" : "com.neurosky.hafiz",
"category" : "Education",
"description" : "Study less and retain more by knowing your learning effectiveness!  Effective Learner is an app that is used with NeuroSky MindWave headset to monitor the effectiveness of your learning through measuring the focus level.  The Effective Learner app uses a NeuroSkys brainwave-sensing headset to detect your learning effectiveness. The app has two modes of use; Effectiveness tracker, and the EDAFIN Study Trainer. The Effectiveness Tracker shows your current focus level and effectiveness as 6 different color-coded levels, and provides a session report, which includes a time plot of your effectiveness for the duration of study and a pie chart of different color percentage. The Session reports can be saved with a note into a searchable journal for future reference and analysis. Study trainer combines the Pomodoro timing method with customized learning rhythms based on your brain activity. The system allows you to compare your learning results to the effectiveness shown by your brain activity. It also provides study tips to help you plan your study sessions effectively.  How it Works  When you are effective, you can absorb more and retain more. If you are not effective, try changing your learning method, switching to a different task, or taking a rest. The Effective Learner app uses a NeuroSkys brainwave sensing headset to detect your learning effectiveness and show it as 6 different color coded levels, so you can gauge your effectiveness with a quick glance.  Our brains are made up of billions of tiny brain cells, called neurons. When we learn something new, some of the neurons fire together. New wiring will grow between them so they become connected together. The next time when one of the neurons fires, all the other connected neurons will also fire. This is how you learn to speak a new language, dribble a basketball, and everything else. You must pay high attention during learning so the right neurons fire at the same time and get wired together. The strength of this new wiring depends on how deep an impression the learning experience left you with. Even a deep negative impression can create strong wiring. Weak impression leads to weak wiring, which is easily overwritten and forgotten. In that case, you will have to strengthen the wiring with repetition to retain the learning.  With the Effective Learner, you will study less and play more!  More details about the Effective Learner: * Feedback on your learning effectiveness in 6 colors from most to least effective: blue, green, yellow-green, yellow, orange and red * The effectiveness display updates every 10 seconds * Session report includes a time plot of your effectiveness for the duration of study and a pie chart of different color percentages * Session reports can be saved with a note into a searchable journal for future reference and analysis  EDAFIN Study Trainer (Within Effective Learner App)  Combines the simple yet powerful Pomodoro timing method with customized learning rhythms based on your unique brain waves.  * Optimal work and rest time guidance based on your moment to moment Learning Efficiency. * Review effects of study behavior on your Learning Efficiency. * Train yourself to work longer and learn more deeply. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.neurosky.hafiz.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.DISABLE_KEYGUARD', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.DISABLE_KEYGUARD', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}