{
"name" : "3D Museum Viewer for MERGE Cube",
"url" : "https://play.google.com/store/apps/details?id=com.MergeCube.MuseumViewer",
"package" : "com.MergeCube.MuseumViewer",
"category" : "Education",
"description" : "PLEASE NOTE: This app requires a MERGE Cube and a smartphone or a tablet to play. To find out how to get a MERGE Cube and learn more, visit our website at: https://www.MergeCube.com.     3D Museum Viewer brings ancient artifacts and famous sculptures from museums right into your home or classroom! You can hold a 3D statue of the Ram of Amun, explore a granite carving of Ramses II from every angle, and get a close-up look at the bust of Marcus Aureliusall from the palm of your hand. 3D Museum viewer also lets you place each of the life-size artifacts into the real world, with the ability to physically walk around each statue in full 360. You can even record video. 3D Museum Viewer brings the British Museum and Louvre Museum to you!   As seen on VentureBeat, Wired, Wareable, Android Central, Huffington Post, and more.  The Merge Cube is a compelling little device packed with a tremendous amount of instructional potential. - Mary Howard, International Society of Technology in Education  The coolest surprise from CES. - Russell Holly, Android Central  The [MERGE Cube] stole my heart at Toy Fair. - Dan Nessell, Huffington Post  HOW TO PLAY IN PHONE MODE (Without VR/AR Goggles) -Launch the app -Be sure to allow camera and photo access -Enter your activation code (found inside the cube packaging) -Enter an adults email address to create an account -Select Phone Mode  -Make sure the cube is in your device camera view at all times   HOW TO PLAY IN VR MODE -Launch the app -Be sure to allow camera and photo access -Enter your activation code (found inside the cube packaging) -Enter an adults email address to create an account -Select VR Mode -Place your smartphone in your VR/AR goggles  -Make sure the cube is in your device camera view at all times -Rotate the cube and select the work of art youd like to see  If you have any questions or suggestions, we would love to hear from you! Contact us at any time at support@MergeVR.com.  Are you a developer interested in creating experiences for the MERGE Cube? Apply for a dev kit here: https://dev.mergevr.com/cube  ABOUT MERGE Were virtual and augmented reality specialists that push the boundaries of imagination, merging the physical and digital worlds to build toys, games, and universes that are fun, accessible and appropriate for everyone, ages 8+. Learn more at www.MergeVR.com/about ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO']",
}