{
"name" : "Connect the Dots - Ocean",
"url" : "https://play.google.com/store/apps/details?id=com.kedronic.dotsoceanfree",
"package" : "com.kedronic.dotsoceanfree",
"category" : "Education",
"description" : "The underwater world is diverse and beautiful. It hides many things that are waiting to be discovered! It would be quite interesting to be able to explore the waters of the world ocean and observe its inhabitants. Huge whales and small seahorses, toothy sharks and friendly clownfish, funny dolphins and lovely angelfish: there are so many of them, and they are all so different! Playful and clumsy, slow and fast, colorful and monochrome. However, each inhabitant of the sea is unique! We invite you to join us on a fascinating journey through the depths of the sea and get to know the most famous members of the underwater world!   Features:   Connect points by numbers or letters   When points are connected, you will see the silhouette of a hidden picture   Once all the points have been connected, you can color the picture   Choosing a wrong symbol three times in a row will bring up a tip   Blue, orange, green or pink stars make the game even more exciting   Easy-to-use palette that allows you to put together your own unique set of colors   Colored pictures automatically saved on closing the program  Connect points is a learning puzzle for small children. It helps develop thinking, improve memory and attention. The application has three game modes: by numbers, letters and coloring. Game modes with letters and numbers will be useful for kindergarten and pre-K kids.  Connecting by numbers will help to easily memorize the order of numbers and learn to count. To do this, you need to consecutively connect circles with numbers starting from 1. As you connect circles in the right order, the silhouette of a hidden picture will become more and more visible. If three points are chosen incorrectly, a tip will pop up. Once all the points are fully connected, the picture will become fully visible and youll be able to color it. Those studying the alphabet can choose to connect points by letters. It is important that children know letters as early as possible, since it is essential for learning to read and write. But knowing the order of letters in the alphabet is also very important! This can be achieved by connecting circles with letters in the right sequence. The coloring mode will be especially appreciated by young artists. In this mode, you can proceed to coloring pictures without connecting points. To make the process even more exciting, you can change any predefined color. To do this, press and hold the paint bucket and choose the necessary color from the palette. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION']",
}