{
"name" : "Learn Japanese - Listening and Speaking",
"url" : "https://play.google.com/store/apps/details?id=com.porolingo.jconversation",
"package" : "com.porolingo.jconversation",
"category" : "Education",
"description" : "LETS START LEARNING TO SPEAK JAPANESE LIKE A NATIVE SPEAKER!   Learn Japanese - Listening And Speaking is one of POROs ongoing apps for self-learners who want to speak Japanese easily and effectively. With 750 daily dialogs, a list of lessons with various topics from greeting, introduction, shopping, business conversation, family talks, etc. Its suitable for all Japanese learners from beginner to intermediate and advanced learners to practice speaking English.  While listening to the conversation of the native speaker, try to imitate full sentences with the same intonation, pronunciation like the native speaker. By POROs app, you can not only learn the speaking style, pronunciation, the way to break and intonation of native speakers and improve listening skill but also learn groups of vocabularies and useful phrases to communicate in daily talking.   Main features of POROs App:   Common conversations. - More than 750 lessons about Japanese common conversation in daily life with audio files of native speakers. - Various topics from greeting, introduction, small talk to business conversations  - Consist of the audio script for learner to follow.    Show/ Hide transcript, translation. - Understand and remember the native speakers reading way by customizing the show/ hide transcript mode. - Understand the meaning of new vocabulary and the meaning of the full sentence in each situation by customizing the translation mode   Sentences are highlighted following the audio.  - The mode that sentences are highlighted following the audio will help you to follow the conversation directly.  - You can click on the sentence to listen/ practice that phrase again   Playlist mode. Enjoy practicing Japanese while driving or traveling, you just need to turn on the app and click on playlist mode.    Practice game. By playing completing sentences game, you would know if you have already remembered the full sentence and its structure or not.   Learn Japanese through news. Not only can you improve your listening skill and vocabulary but also can enrich your knowledge and update world news.   Learn Japanese through stories. Learning Japanese becomes more interesting because PORO has added a new function called Learning Japanese through stories. You can enlarge your vocabulary, and learn how to express yourself in particular situations!   The App Learn Japanese - Listening And Speaking is suitable for:   False-beginners and who want to improve Japanese communication.  Those who self-study Japanese at home.  Learners who want to practice for JLPT, NAT tests.   Those who love communicating in Japanese and practicing Japanese by shadowing method.  Those who like to challenge your level.   Learn Japanese - Listening And Speaking App is still in the developing process, so we hope to receive your contributed comment to make it better. We are a team that loves Japan and its culture and always try to share our love with the community, so if you like this app then please take a moment to rate 5 stars for it! You can also contact us by commenting or clicking the feedback button on the options screen.    Please kindly contact:  - Email: support@porostudio.com   Thank you very much and good luck to you! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}