{
"name" : "Doa Harian Anak dengan Suara",
"url" : "https://play.google.com/store/apps/details?id=com.bercodingstudio.doaharianislam",
"package" : "com.bercodingstudio.doaharianislam",
"category" : "Education",
"description" : "Aplikasi Doa Harian Anak dengan Suara ini adalah aplikasi yang berisi kumpulan doa sehari-hari Islam, Ayat Kursi dan suratan pendek yang diambil menurut Alquran. didalam Al-Quran semua umat manusia diperintahkan untuk selalu berdoa kepada Allah agar mendapatkan rezeki, kesehatan dan panjang umur.   Sebagai manusia kita wajib menjalankan perintahnya dan menjauhi segala larangannya. Doa Harian Islam ini sangat direkomendasikan untuk dipelajari anak Muslim dalam menghafal Doa Sehari-Hari dan Suaratan Pendek.  Aplikasi Doa Harian Anak dengan Suara ini sudah dilengkapi dengan Bacaan Arab, Lafadz, terjemahan dan Audio Offline. Sehingga Aplikasi Doa Harian Anak dengan Suara ini memudahkan pengguna khususnya anak-anak / remaja dan orangtua yang ingin mengajari anaknya untuk mempelajari dan hafalan doa anak sehari-hari ataupun Suratan Pendek.   Fitur Aplikasi Doa Harian Anak Muslim ini yaitu : - Doa Harian anak muslim sehari-hari Suara. - Suratan Pendek dilengkapi dengan Suara - Tampilan yang mudah dipahami - Doa dan Suratan Pendek Dilengkapi bacaan Arab, Lafadz, dan Terjemahannya. - Audio offline, lebih praktis tidak terganggu dengan kualitas jaringan internet.  Adapun daftar Doa-Doa Harian didalam Aplikasi Doa Harian Anak dengan Suara ini adalah  - Doa Sebelum Tidur - Doa Sesudah Tidur - Doa Masuk Kamar Mandi - Doa Ketika Akan Mandi - Doa Keluar Kamar Mandi - Doa Ketika Memakai Pakaian Baru - Doa Ketika Memakai Pakaian Biasa - Doa Ketika Bercermin (Dandan atau Berhias) - Doa Sebelum Makan - Doa Sesudah Makan - Doa Setelah Minum - Doa Ketika Masuk Rumah - Doa Ketika Masuk Rumah Kosong - Doa Keluar Rumah - Doa Ketika Masuk Masjid - Doa Ketika Keluar Masjid - Doa Ketika Akan Wudhu - Doa Setelah Selesai Wudhu - Doa Ketika Akan Membaca Al-Quran - Doa Sebelum Belajar - Doa Sebelum Belajar Mengaji - Doa Sesudah Belajar Mengaji - Doa Ketika Hujan - Doa Setelah Selesai Hujan - Doa Ketika Melihat Kilat Petir - Doa Ketika Mendengar Suara Petir - Doa Ketika Ada Angin Kencang - Doa Ketika Menengok Orang Sakit - Doa Ketika Menengok Orang Sakit Panas - Doa Untuk Orang Sakit - Doa Ketika Minum Obat - Doa Ketika Bersin - Doa Ketika Mendengar Orang Bersin - Doa Ketika Pagi Hari Datang - Doa Ketika Sore Hari Datang - Doa Agar Mendapat Mimpi Baik - Doa Ketika Mimpi Baik - Doa Ketika Mimpi Buruk - Doa Mohon Keselamatan Dunia Akhirat   Kumpulan Surat-Suratan Pendek Menurut Al-Quran Meliputi   - Surat Al-Fatihah - Surat Al-Jumuah - Surat Asy-Syams - Surat Ad-Dhuha - Surat AT-Tin - Surat AL-Bayyinah - Surat AL-Zalzalah - Surat AL-Adiyat - Surat AT-Takaatsur - Surat AL-Ashr - Surat AL-Humazah - Surat AL-Fiil - Surat AL-Quraisy - Surat AL-Maaun - Surat AL-Kautsar - Surat AL-Kafirun - Surat AL-Qadar - Surat Al-Insyirah - Surat AL-ikhlas - Surat AL-Falaq - Surat An-Naas  Aplikasi Doa Harian Anak dengan Suara ini akan terus di perbaharui, apabila ada kesalahan penulisan ayat ataupun terjemahan yang kami tulis mohon segera hubungi kami secepatnya di kontak yang sudah kami sediakan. Dukungan anda sangat berarti buat kami untuk membangun Aplikasi Doa Harian Anak dengan Suara ini menjadi lebih baik.   Facebook Bercoding Studio : https://www.facebook.com/bercodingstudio This Childrens Daily Prayer application with Voice is an application that contains a collection of daily Islamic prayers, Ayat Kursi and short letters taken according to the Koran. in the Koran all humanity is commanded to always pray to God for sustenance, health and longevity.  As human beings, we must carry out their orders and stay away from all prohibitions. This Islamic Daily Prayer is highly recommended for Muslim children to learn in memorizing Daily Prayers and Suaratan Pendek.  This Childrens Daily Prayer Application with Sound is equipped with Arabic Reading, Lafadz, Translation and Offline Audio. So that the Childrens Daily Prayer Application with Voice makes it easy for users, especially children / teenagers and parents who want to teach their children to learn and memorize daily childrens prayers or Short Suratan.   Features of this Muslim Childrens Daily Prayer Application are: - Daily Prayers for Muslim children Daily Sounds. - Suratan Pendek equipped with Sound - Display that is easy to understand - Prayers and Short Suras Equipped with Arabic reading, Lafadz, and Translation. - Offline audio, more practically not disturbed by the quality of the internet network.  The list of Daily Prayers in the Childrens Daily Prayer Application with this Voice is  - Prayer Before Sleep - Prayer After Sleep - Prayers enter the bathroom - Prayer When Will Take a Shower - Prayer Out of the Bathroom - Prayer When Wearing New Clothes - Prayer When Wearing Ordinary Clothing - Prayer When Reflecting (Grooming or Decorating) - Prayer Before Eating - Prayer After Eating - Prayer After Drinking - Prayer When Entering Home - Prayer When Entering an Empty House - Prayer Out of the House - Prayer when entering the mosque - Prayer When Exiting the Mosque - Prayer When Will Ablution - Prayer After Completion of Ablution - Prayer When Will Read Al-Quran - Prayer Before Learning - Prayers before learning to recite - Prayer After Learning to Recite - Prayer When It Rains - Prayer After Its Rainy - Prayer When Seeing Lightning Lightning - Prayer When Hearing Lightning Sounds - Prayer When There Is Strong Wind - Prayers when looking at sick people - Prayer When Looking at the Sick Heat - Prayers for Sick People - Prayers when taking medicine - Prayer When Sneezing - Prayer When Hearing People Sneeze - Prayer When Morning Comes - Prayer When Afternoon Day Comes - Prayers to Get Good Dreams - Prayer When Good Dreams - Prayer When Nightmares - Prayers for the Hereafter World Safety   Collection of Short Suras According to the Quran Includes  - Surat Al-Fatihah - Surat Al-Jumuah - Ash-Shams Letter - Ad-Dhuha letter - Letter AT-Tin - Surat AL-Bayyinah - AL-Zalzalah letter - Surat Al-Adiyat - AT-Takaatsur letter - Surat AL-Ashr - AL-Humazah letter - AL-Fiil Letter - AL-Quraysh letter - AL-Maaun letter - AL-Kautsar Letter - AL-Kafirun letter - AL-Qadar letter - Surat Al-Insyirah - AL-ikhlas letter - AL-Falaq letter - An-Naas letter  This Childrens Daily Prayer Application with Voice will continue to be updated, if there is a verse writing error or the translation we wrote please immediately contact us as soon as possible in the contact we have provided. Your support means a lot to us to build a Childrens Daily Prayer Application with this Voice for the better.   Facebook coding studio: https://www.facebook.com/bercodingstudio ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}