{
"name" : "Masha and the Bear. Educational Games",
"url" : "https://play.google.com/store/apps/details?id=com.edujoy.masha.games",
"package" : "com.edujoy.masha.games",
"category" : "Educational",
"description" : "Discover the fantastic world of Masha and the bear through these 30 educational games. You will love it! The educational games of Masha and the bear are aimed at children up to 6 years old.  This game is based on the characters of the popular serie that deals with the adventures of Masha, a girl who is cared for by a bear and her friends, animals like the tiger, wolf, penguin, squirrel, hare...  Masha and the Bear Educational Games is composed of 6 different categories of games for children to have fun:  - Paint and color: the most fun drawings to paint with colors. - Word Search: learn words in different languages - Memorize objects and silhouettes: They will help improve visual perception and memory. - Solve puzzles: with pieces of different sizes and shapes. - Music and instruments: play the xylophone, the piano or the drums. - Simple numbers and operations: learn the numbers from 1 to 10.  A series of games featuring the characters of the childrens favorite TV series with which they will learn while having fun playing alone, with friends or with parents.  Your kids will love playing with the educational games of Masha and the bear with which they will enjoy hours of entertainment and assured fun.  The Masha and the Bear series has become a family hit worldwide because it is a smart and fun entertainment designed to educate both children and parents. Masha and The Bear educates children about true friendship in a fun and intelligent way.  THANK YOU FOR SUPPORTING US!  Edujoy has more than 60 games for children of all ages; from kindergarten to teens. Thank you very much for playing Edujoy games. We love creating educational and fun games for you. If you have any suggestions or questions, feel free to send us feedback or leave a comment. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}