{
"name" : "Kanji of the Day",
"url" : "https://play.google.com/store/apps/details?id=com.radiantkit.kanjiotd",
"package" : "com.radiantkit.kanjiotd",
"category" : "Education",
"description" : "Kanji of the Day is your best companion to learn, test and improve your skills with all the 2136 kanjis of the jy list, starting with grade 1 until the secundary school.  This list is the guide to kanji characters and their readings, announced officially by the Japanese Ministry of Education.  Check some features that will help you with this challenge!  *** Learn a New Kanji ***  - Get a random kanji of any level and reveal their meaning with simple and objective cards;  - Share your kanji with your friends on WhatsApp, Gmail, Hungouts or SMS;  - Need more information? On each kanji you can go directly to the Wiktionary to find more definitions;  *** Jy Dictionary ***  - Browse between grades 1, 2, 3, 4, 5, 6 and S of Jy list,or JLPT levels 5, 4, 3, 2 and 1;  - Find any kanji by meaning or grade;  - Discover aditional details selecting a kanji from the list;  - Find references to the best dictionaries for each kanji;  - Learn how to draw every kanji in the app dictionary;  *** Grade Tests ***  - Create your tests by JLPT or grade for educational kanjis (kyiku kanji - ) or for secondary school;  - Set the amount of kanji elements before starting a new test;  - Discover your performance and general stats after finishing each test;  - Make reinforcement tests for wrong or right results;  - Share your results;  *** Radicals List ***  - Browse between 201/214 main/kangxi radicals for each kanji in the list and discover who is associated!  *** Kanas and numbers list ***  - Use the same tools that help you with kanjis to learn the Hiragana and Katakana alphabet!  Suggestions? Please let your comments and rate my app! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}