{
"name" : "Gummies Playground",
"url" : "https://play.google.com/store/apps/details?id=com.squinkgames.gummiesPlayground",
"package" : "com.squinkgames.gummiesPlayground",
"category" : "Educational",
"description" : "Gummies Playground - a teacher-approved, preschool curriculum-based collection of 9 great educational games for your preschooler (ages 2 - 5). With three levels of difficulty you can set the game to match your childs abilities.  Gummies Playground is free with ONE in-app purchase to unlock unlimited play - although you can still set a limit on your childs playtime from the parents menu!  Features: * Teaches basic numbers, letters, shapes, colors, animals, foods, matching, detecting differences, and more * Adorable Gummies make great mentors, guiding your child through more than 25 different minigames * Addresses basic cognitive and physical milestones needed by every child * Fully narrated gameplay to ensure your child understands each task * Musical reward screen helps provide sense of progress and encourage creative play  Educators! Please contact us at info@squinkgames.com for information on bulk purchases for your classrooms!  Gummies Playground Disclosure Statements: * Ads: Does NOT have in-app advertisements of any kind. * Social: Does NOT integrate with any social media networks such as Facebook or Twitter. * Location: Does NOT track a users location. * Web: Has ONE hyperlink to allow connection to the Google Play store. * Purchase: Has ONE in-app purchase to unlock full gameplay. As a member of MOMs with Apps, the App Trust Project, and supporters of the The Childrens App Manifesto, Squink Games takes your privacy and your childs safety seriously. We strictly follow the Know Whats Inside best practices. For more information: http://www.squinkgames.com/squink-games/gummies-playground/  Like us on Facebook or Twitter for updates and news!  www.facebook.com/squinkgames https://twitter.com/SquinkGames www.squinkgames.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}