{
"name" : "USMLE Pharmacology Flashcards",
"url" : "https://play.google.com/store/apps/details?id=com.gwhizmobile.langemedicalflashcards.pharmacology",
"package" : "com.gwhizmobile.langemedicalflashcards.pharmacology",
"category" : "Education",
"description" : "With these Pharmacology Flashcards in your toolkit, preparing for the USMLE or pharmacology boards will be a breeze! As life rushes by, optimize your preparation time by using this powerful resource anywhere, anytime. Great for last-minute studying on clinical rotations, this is the perfect tool to have at your fingertips.   Organized into 11 major topics, each flashcard provides a rigorous review of key pharmacological concepts. Within each category there is a selection of clinical vignettes requiring the application of textbook knowledge to real-life scenarios. Each vignette covers a specific disease or drug with high-yield facts in italics.   Install the free version today and jump start your studying!   We have provided a limited free version of the app that you can try before deciding to upgrade. This version includes a limited amount of practice questions and basic progress metrics.  Subscribe today and get access to:   Anti-Bacterial Agents  Adrenergic Agents  Cholinergic Agents  Central Nervous System Agents  Cardiovascular Agents  Hematologic Agents  Endocrine and Metabolic Agents  Gastrointestinal Agents  Anti-Neoplastic Agents  Anti-Inflammatory Agents  General Pharmacology Principles   Written by medical students at Yale University, the information included in this resource are not only relevant, but presented in a clear and concise manner. With each prototypic drug introduced by a clinical vignette, you will be forced to think in terms of patient care instead of relying upon rote memorization. Overall, Pharmacology Flashcards by LANGE offers an intense, streamlined review in the days and weeks before your exam.   About the Authors: Suzanne J Baron, is a medical student at Yale University in New Haven, Connecticut. Christoph Lee, is a medical student at Yale University in New Haven, Connecticut.  Get access to all questions when you subscribe:  1 Month: one auto-renewing payment of $9.99  12 Months: one auto-renewing payment of $39.99   This app offers two auto-renewing subscription options to help you pass your exam.  -Payment will be charged to your Google Play Account at confirmation of purchase -Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period -Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal -Subscriptions may be managed by the user and auto-renewal may be turned off by going to the users Account Settings after purchase -Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable  These prices are for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.   Our Customer Success Team is available from 9am to 5pm, Monday - Friday (except on major holidays). Call us at 319-246-5271 and email us at support@hltcorp.com with any questions.  Privacy Policy - http://builtbyhlt.com/privacy Terms of Conditions - http://builtbyhlt.com/EULA ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.vending.BILLING', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'com.android.vending.BILLING', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.READ_SYNC_STATS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
}