{
"name" : "English to Urdu Dictionary Offline - Lite",
"url" : "https://play.google.com/store/apps/details?id=com.dictionary.englishurdu.lite",
"package" : "com.dictionary.englishurdu.lite",
"category" : "Education",
"description" : "English to Urdu dictionary Offline. Translate English words to Urdu without internet.   It has embedded Urdu font which doesnt require any additional Urdu feature on your device. Its just smooth and pain-less. Improve English vocabulary with this educational app and learn English in Urdu. Learn tenses and learn English grammar in Urdu .        /     You can search any word and then click on it to read its meanings in Urdu language. Meanings are displayed in real Urdu language not romanized.  ***100% DATA FOR FREE***  Although this App does not provide word definitions, word synonyms or any examples, but mechanism is easy to understand the meanings.  Features of top dictionary App are: > Layout - is very simple and is user friendly. > History - every word you ever viewed is stored in history. > Favorites / Bookmarks - you are able to add words to favorites list by clicking the star icon. > Managing History and Favorites lists - you are able edit those lists or clear them. > Various Settings - you may change applications font and theme (choose one of several color themes). > Word spelling, using voice Speech module (No Internet Connection required). > Maximum data is used - up-to-date vocabulary.  With its clear definitions and carefully chosen up-to-date vocabulary from all areas of life the Urdu - English - Urdu dictionary will meet your everyday language needs and will make your trips more comfortable and fun. Its the best Urdu dictionary for travelers, business mans, players, students, children, teachers, learners, boys and girls.  Improve English, , Urdu to Urdu, Urdu font.  Try our other Apps; Urdu to English Dictionary, English to Urdu Dictionary .  Thanks for feedback and ratings. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}