{
"name" : "BRAINYOO: Flashcard And Index Cards For Students",
"url" : "https://play.google.com/store/apps/details?id=com.brainyoo.brainyoo2",
"package" : "com.brainyoo.brainyoo2",
"category" : "Education",
"description" : "BRAINYOO is the flashcard app you can use to quickly and easily quiz yourself on large amounts of educational content. It helps you memorize vocabulary and study for classes like medicine, law, history biology and many more.  BRAINYOO is perfect as an app for your classes in school, to help you prepare for your finals or to prep you for exams in your college classes.   Do you want the opportunity to learn more effectively, faster and better? You can create your own flash cards to go along with your school or college classes. Our index card app quizzes you using special algorithms perfectly adjusted to your own memorization speed, saving you a lot of time in the process.   Shortly before a test, you study with your flash cards using BRAINYOOs specially developed power mode to help you pass the test with confidence. The index card app shows you your individual progress, so you always know how far you are from your goal. After the test, you switch to Leitners long-term memory mode, which saves the latest knowledge in your memory for your high school or college final exams.  BRAINYOO is one of the best learning apps for schools, because teachers can also use the flashcard app to create and share their own flash cards with their students in study groups. Teachers can also access their students learning statistics and even administer tests such as vocabulary tests in the learning app.  With BRAINYOO, you can work on virtually any subject  all languages, including English, French, Spanish and Italian, as well as math and science:  Use the flashcard app to prepare for your tests in all school and college subjects  all languages, including English, French, Spanish and Italian, plus math and science too:  Study and practice English, French, Spanish, Italian and many other foreign languages with our special vocabulary, cloze and matching flash cards   Study for biology and history   Study for math and use our LaTeX formulas to create your own flashcards   Share index cards with your fellow classmates or fellow students  Study and practice English and other foreign languages  Study offline when you are on-the-go, for instance on public transportation, no internet necessary  Use the learning app for homeschooling   Study for college classes in law, medicine, business administration, history and many other subjects  Easily create multiple-choice index cards, cloze texts, matching exercises and flashcards with open-ended questions using our flashcard software for Win/Mac software and synchronize them in the flashcard app  Incorporate pictures, eBooks, videos, audio, LaTeX formulas and links into your flashcards and format the flashcards however you choose.  The premium version of the learning app enables you to use our app a lot more effectively:   Create study groups, share your own content with them and track the learning statistics of your school or college students or employees  Simulate tests and evaluate the results right there in the flashcard software  When learning languages, you can take a picture of a book page with the flashcard app and automatically create index cards with any words you dont know  Use the dictionary function to learn the vocabulary  At school, you can easily convert the vocabulary pages of your textbook into flash cards by taking pictures of them, and then use them to study  More memory and unlimited creation of flashcards  Export your index cards as XML  Tell your learning coach which index cards you need to have in your brain for the test and by which date, indicate when you will have time to study and your learning coach will completely organize your studying for you.  Or you can get the inexpensively priced Premium-Light upgrade, so you can study without seeing advertising. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.permission.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.CHECK_LICENSE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.permission.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}