{
"name" : "Halloween Makeup Me",
"url" : "https://play.google.com/store/apps/details?id=com.libiitech.halloweenmakeup",
"package" : "com.libiitech.halloweenmakeup",
"category" : "Educational",
"description" : "Its gorgeous! Its ghostly! HERE COMES THE TREAT OR TRICK TIME AGAIN! My girls, welcome to Make-Up Me: Halloween to start a marvelous journey.  Come and give your girl an incomparable beauty. Here, countless festival themes are offered on purpose, such as beautiful monsters, lovely witches and bloody vampires. Hurry to show us your sense of unique style!   After completing your great creative work, it will be a brilliant idea to take photos. No matter you share your happiness of success with friends, or send your pictures to us, you cant miss the contest Best Makeup Designs of the Week!  Come on! Timewaits for noone! Enjoy yourself with the scary fun!  How to play Choose a beautiful skin tone for your girl to start off, then use the tinted BB cream on her face and neck. If you are tired of having a dull hair color, wed like to give you our bran-new hair highlighting, which will absolutely lighten the young lady with bright and vivid colors. By clicking the hair dye, you can also add some bold, warm highlights, even 2 or 3 colors can be used at the same time. For example, try tomix pale pink with a brighter fuchsia or copper reds in darkbrunette hair, you can have so much fun here. And you will definitely be amazed by the Halloween-themed cosmetics, these eye shadows, mascaras and lipsticks will help your little girl to achieve a magical look. Of course, surprise will never end, drawing tattoos and adding accessories like rhinestones and earrings are also essential for your monster girl to make difference. Now its time to check out which awesome spooky girl will win her designer the first prize!   Features: - Hair highlighting brings out most attractive shades for your hair - Various peculiarly tattoos are free to choose - Hundreds of Halloween-themed makeover are available - You can have countless magnificent style for crazy ghostly night - You are very welcome to challenge the Best Makeup Designs of the Week  About Libii Game: With over 200 million downloads and growing, Libii is committed to creating innovative games for girls. Well keep working on establishing a good relationship with both parents and their children and bringing a healthy, happy atmosphere for them. Visit us: http://www.libii.com/ Like us: http://www.facebook.com/LibiiGame Contact us: Got any ideas? Suggestions? Need technical support? Please feel free to contact us 24/7 at WeCare@libii.com  Need You Know: This app is totally free to download and play, some basic items are also free to use, but some additional items need you to purchase and pay to unlock. Therefore, if you do not want to use these items, please turn off the in-app purchase in your settings. Thanks. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.asus.msa.SupplementaryDID.ACCESS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.asus.msa.SupplementaryDID.ACCESS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}