{
"name" : "MPSC Online Exam",
"url" : "https://play.google.com/store/apps/details?id=com.softlinklabs.mpsconlineexam",
"package" : "com.softlinklabs.mpsconlineexam",
"category" : "Education",
"description" : "  ,           .             .            .                 .  *   * MPSC Academy                 .           .    PSI / STI / ASO       .        .        .         .            .        MPSC Academy   Facebook    .  *   *        .      .           .       .          .       .        ! !   Hello Friends, MPSC Academy Brought This New Featured Android Application for MPSC Aspirants of Maharashtra. WIth the Help of This MPSC Online Exam Android Application Student Can Prepare for Any Competitive Exam in Marathi. All the Exams in This Application are As Per Pattern of Maharashtra Public Service Commission Exams.  We Conduct Weekly Exam & Regular Practice Test Through This App.  * Weekly Exam * MPSC Academy is Conducting Weekly Practice Exam Regularly Since 8 October 2017. We Conduct Weekly Exam Every Sunday. All Practice Exam in This App are Totally Free of Cost.  Most of The Weekly Exams are Based on PSI STI ASO Preliminary Exam. Each Weekly Exam Will Remain Available for Entire Week to Solve. After One Week We Remove One Exam & Upload Another new Weekly Exam. We Publish List Of Toppers of Previous Week on Every Saturday. Moral Boosting is the Sole Purpose of Publishing Toppers List.   * Subjectwise Practice Exam * Apart from Weekly Exam We Also Upload Subjectwise Practice Exam for Each Subject. These Exam Consists 20 Questions for 20 Marks in Each Test. Students Can Solve These Exams Any Time. We Never Remove These Exams. We Also Add Subjectwise Practice Test Regularly. With The Help Of These Exam Student Could Understood Their Performance in Particular Subject.  All The Best for Your Future.   The MPSC Academy is Platform that provides complete solution for Maharashtra State Services preparation, with a huge set of questions and tests on wide range of subjects,  set by professionals of respective fields. With our explanations and precise results, you can analyze yourself, this helps you to find out sections where you need to focus more and  balance sectional cut-off of all subjects.  MPSC Online Exam app is for practicing online test of MPSC, Rajyaseva, Police Sub Inspector, Sales Tax Inspector, Assistant Section Officer, Banking SBI Clerk, IBPS Clerk PO, RRB, SSC CGL CHSL & other competitive exams in Marathi.  This app provides high quality Online tests based on latest exam pattern.  This App Will Serve As : mpsc online test in marathi app mpsc online test mpsc online exam app mpsc online app mpsc question paper and answer app mpsc quiz app in marathi mpsc test series mpsc test app mpsc exam preparation app MPSC App in Marathi MPSC PSI ASO STI Talathi Study App in Marathi MPSC PSI STI ASO Exam book in Marathi MPSC STI PSI ASO Talathi Question Paper and Answer Spardha Pariksha App in Marathi ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}