{
"name" : "Arabic English Translator, Dictionary & Learning",
"url" : "https://play.google.com/store/apps/details?id=com.officail.BritannicaArFreeDict",
"package" : "com.officail.BritannicaArFreeDict",
"category" : "Education",
"description" : "Britannica English Free Arabic English Dictionary, Translator, and English Learning app by Encyclopaedia Britannica.  Learn English anytime anywhere with this free dictionary translation and English language learning app from Encyclopedia Britannica! This interactive app features a comprehensive Arabic English and English Arabic dictionary, word and sentence translation, grammar and common errors quizzes and vocabulary learning through games & flashcards. This app also includes a personal area where you can create personal word lists and quizzes, for ongoing practice. English dictionary entries include synonyms, example sentences, related phrases, and audio pronunciations by native speakers.  Key features include:  Comprehensive Arabic English dictionary with over 200,000 English example sentences  Full text translation in Arabic and English   Easy to use  just type a word or phrase in Arabic or English to get its English or Arabic translation  no need to choose a language  Translate anywhere: Highlight words on any other application; share them with Britannica English and get instant translation  Voice search - translate any term by voice dictionary search  Autocomplete  when you start typing an English word, the app will complete it automatically  Spelling corrections  Reverse translation  tap any English word within the search results to get its Arabic translation  Includes all English and Arabic forms and inflections and Full Arabic Tashkeel (vowel signs)  Human voice audio pronunciations in English  Word of the Day  learn new words and phrases every day  Vocabulary games and flashcards  expand your English vocabulary and track your progress by playing quizzes in various topics such as Banking, Food, Health Care, Cinema and more. Learn Words section is now available offline  Improve your English skills with quick quizzes in different topics such as Grammar, common errors and Jargon quizzes  Save favorite words to personal lists for ongoing practice through quizzes and flashcards  Save recent dictionary look-up history and quiz errors to your personal word list  Share translation of interesting words and your games results with friends  Constant updating  The dictionary is constantly updated with new terms, buzzwords, slang expressions, and idioms. Words lists and quizzes are also updated regularly  Helps you prepare for important tests such as TOEFL, SAT, and GMAT  Choose your user interface (Arabic / English)  NEW! Upgrade options - remove ads and increasing the personal word list quota  This new free version is currently available to Android 4.0 users and up. Earlier Android versions can keep using the previous Britannica English version.  Please try this new version and send us your feedback through the Contact Us option. We value your input! You can also practice English through our website at: www.britannicaenglish.com/arabic ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}