{
"name" : "Omar & Hana: On Duty",
"url" : "https://play.google.com/store/apps/details?id=com.coolcode.omarhana",
"package" : "com.coolcode.omarhana",
"category" : "Educational",
"description" : "Learning sounds boring without playing right?   Omar & Hana: On Duty is an educational game that consists of 7 mini games based on the Omar & Hana Islamic songs for kids. Each game have an interesting concept that delivers a different approach to play and learn. What are you waiting for kids? Lets play and learn with Omar & Hana!  Fridge Sort Drag and drop the food and drinks according to their categories in the fridge. Recognize which categories the food and drinks belongs to.  Hijaiyah Alphabets Learn how to write Hijaiyah alphabets by tracing the alphabets pattern and listen how to pronounce it. Learn Hijaiyah by each level and test your learning progress at the random alphabet level.  Cupcakes Yummy! Make your own fancy and delicious cupcakes by choosing your preferred ingredients and toppings.   Room Cleaning Oh no! Look at all the mess. Lets help Omar & Hana clean their room. Click on the scattered objects to put them back to their rightful places.  Wudhu Learn the 7 steps of taking wudhu by choosing the correct picture. Each step will have an explanation on how to perform them.  Plant Crops Wow! Plant and watch your favourite fruits grow! Choose, drag, and drop according to the picture to the soil and plants of your favourite fruits. Follow the steps starting from planting the seeds, fertilizing, watering the plants, and wait until it grows!  Fruit Catch Help Omar catch the falling fruits by controlling Omar to the left and right. Collect as many fruits as possible within the time given. Catch the bonus fruits to gain extra points, and catch the clock to gain extra time. Watch out! Avoid from catching the falling beehive as you will be paused temporarily from the game. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}