{
"name" : "Cuestudent",
"url" : "https://play.google.com/store/apps/details?id=com.cuelearn.cuestudent",
"package" : "com.cuelearn.cuestudent",
"category" : "Education",
"description" : "This is an app used by students in a Cuemath classroom. Visit https://www.cuemath.com to find a Cuemath centre near your house.   Cuemath aims at creating a wholesome understanding of mathematics, unlike in schools where only a subset of the subject is covered because of which most children become indifferent to math, or even averse to it. And the lack of a strong math learning foundation means that they lose out on achieving their full potential later in life.  The Cuemath Program focuses on true math learning, making kids fall in love with the subject through an engaging, multi-format learning system, and a learn-by-doing approach.  === Concepts The math of concepts focusses on mathematical concepts, fundamentals, and ideas typically covered in school syllabus. Our specifically designed workbooks, used with Math box as a manipulative aid, introduce the child to this domain of math.   These workbooks employ the active learning methodology in which the child learns by doing and exploring. Each workbook consists two to three modules that focus on specific topics and objectives.   Once the child completes a module, the teacher enables a module assessment for the child. This assessment is built to gauge the childs understanding of the concept covered in the module.  Aptitude The math of aptitude is designed to build mathematical thinking in a child by improving his/her verbal, non-verbal, logical, and calculation skills. The skills are designed to enhance a childs problem-solving aptitude with focus on both speed and accuracy.  This part of math is structured as a series of game-like tab based exercises that the child has to master. Mastering each skill requires increasing level of proficiency.  In every Cuemath session, the child gets approximately 10 minutes on a tab to practice these skills. The skills have 3 distinct categories:  Arithmetic Geometric Logical Reasoning The math of reasoning develops out-of-the-box thinking through mathematical puzzles. These puzzles also help the child in building connections between different domains of math & real-life.  At the end of each Cuemath session, a puzzle card is assigned to the child. He/she is encouraged to work on it collaboratively with friends, parents, and siblings.  Depending on the solution presented by the child in the next session, his/her attempt is marked by the teacher. The child then receives the next assigned puzzle card.  ===  If this sounds exciting, the next steps are simple. Find a Cuemath center near you, and take your child there for a free test, called the Cuemath Diagnostic Test (CDT). The CDT will assess your childs current ability, and place your child appropriately on one of the programs levels. From then onward, Cuemath will ensure that your child progresses towards a mastery of math! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}