{
"name" : "Commerce Class 11, Class 12 Accounts BST Economics",
"url" : "https://play.google.com/store/apps/details?id=com.edurev.commerce",
"package" : "com.edurev.commerce",
"category" : "Education",
"description" : "CBSE Class 11 & Class 12 Commerce Study App is an exclusive learning app for commerce students of Class 11 & Class 12 which provides - NCERT Textbook, notes, question bank (MCQ & objective type questions as well), NCERT Solutions for Class 11 & Class 12 Economics, Accounts, BST, English & Mathematics (also helpful for competitive exam). The variety of important questions make it a set exam app for commerce. The Class 11th & Class 12th commerce students also get access to online lectures by best teachers.  Commerce App is derived from EduRev App, EduRev is the most loved educational platform with more than 300 Million visits on its apps and website in the last 2 years. EduRev is also one of the fastest growing EdTech platforms with more than 2 Million users joining EduRev in the last 10 months.   Even Google has awarded EduRev app as the best app on Playstore (education) for 2017! Also Facebook, IBM, and Amazon have recognized EduRev for the quality of education being delivered.  App Highlights: Connect & Discuss Doubts with Students from all over India  In-Depth Analysis Discover your strength and weaknesses and get guidance to improve on them  Trending Learning App Also, App learns about you while you learn from the app & tracks study pattern to give content/tests as per your need Best Teachers Nationwide The best teachers from all over India are sharing content & teaching subjects of expertise. Best Teaching App available Other features of the Commerce App by EduRev:  Complete video adaptive learning cycle boosts your brain to learn & retain lessons  Best Educational basics builder app to learn about any educational domain on the go  Competition with nationwide students  Detailed test analysis  Revise lessons effectively & improve your concepts  Discuss your doubts with other students & expert teachers anywhere, anytime & about anything  Home Learning App: Learn independently at Home  Helps with Homework  Best place to revise before your exams  This EduRev free app includes PPTs, notes, test, Model test papers by ICAI, Practice test papers, & past year papers.  Content provided in the app: Class 12(XII) Economics - CBSE & NCERT Curriculum, Class 12(XII) Economics - CBSE Class 12 Board Examination, Business study (BST) - CBSE Board Examination, Chapter-wise Scanner (Last 10 Year Questions), Accountancy for Class 12 - CBSE & NCERT Curriculum, Class 12 Accountancy - Important Questions & Past Year & Sample Papers, Class 12 English Vistas (NCERT & CBSE Curriculum), Mathematics Class 12 - Notes, Questions, Videos & MCQs  Economics: Intro to Micro Economics, Theory of Dem& & Supply, Theory of Production & Cost, Price Determination in Different Markets, Indian Economy - A profile, Select Aspects of Indian Economy, Economic Reforms in India, Money & Banking Fundamentals of Accounting, Basic Accounting Procedures  Journal Entries, Accounting Introduction, Accounting Process, Bank Reconciliation Statement, Inventories,   Business Studies: Nature & Purpose of Business, Forms of Business Organisation, Public, Private & Global Enterprises, Business Services, Emerging Modes of Business, Social Responsibilities of Business & Business Ethics, Sources of Business Finance, Small Business, Internal Trade, International Business. Nature & Significance of Management Accountancy:Accounting for Share Capital, Issue & Redemption of Debentures, Financial Statements of a Company, Analysis of Financial Statements, Accounting Ratios, Cash Flow Statements, Accounting for Partnerships : Basic Concepts, Reconstitution of a Partnership Firm : Admission of a Partner, Reconstitution of a Partnership Firm : Retirement/Death of a Partner, Dissolution of a Partnership Firm  If you have any queries, issues or suggestions, please mail us at support@edurev.in . We will be happy to solve them for you :)   Never Study Alone, Download the Free App now. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REORDER_TASKS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REORDER_TASKS']",
}