{
"name" : "Fairy Tales ~ Children’s Books, Stories and Games",
"url" : "https://play.google.com/store/apps/details?id=com.amayasoft.bookstorem4.en",
"package" : "com.amayasoft.bookstorem4.en",
"category" : "Educational",
"description" : "Fairy Tales is a kid reading app with interactive mini games and fairy tales for children which makes reading more fun and entertaining!  Fairy Tales is a marvelous collection of story books for kids that includes such bedtime stories for kids as:  - Puss in Boots - for FREE - The Beauty and the Beast - Cinderella - Sleeping Beauty - The Three Little Pigs - The Snow Queen - Little Red Riding Hood - The Princess and the Pea - Gingerbread man - Goldilocks and the three bears - The Tinderbox - Ugly Duckling - Rumpelstiltskin - The Three Spinners - The Wolf and seven little kids - The Enormous Turnip - Mother Snow - Aesops Fables - Nortons New House by Arpad Olbey - The Realm of Sweet Dreams by Asa Guves  Collect DAILY BONUS to open interactive books and read kids stories for FREE! Let your kids library grow with interactive books and stories for kids!  FEATURES: - Read to Me, Read it Myself modes - Interactive scenes with fully narrated and animated characters - Offline reading - download a book once and read it anytime, anywhere. These reading chapter books for kids are useful for long trips, doctors appointments and restaurants - Designed for children interface - Lots of games for kids under 5 years - Safe and kid-friendly - protection from unintentional purchases  Read books and play educational games with your favorite characters! Best for toddlers and preschoolers.  The professional narrator will read along bedtime stories. It makes a daily go-to-sleep ritual easier!  Each fairy tale contains pop-up games to make reading books more entertaining and educative. Find following learning games for kids in these storybooks: labyrinth, cards matching, jigsaw puzzles, hidden objects.  This app is a great collection of the high-quality short story for kids with childrens stories and learning games for toddlers and preschoolers.  Magic moments with vivid illustrations, professional voice narration, interactive activities, amazing animations, colorful pictures and beloved fairytales will delight kids and parents. Feel the magic of a kids story by the perfect storytelling!  Best preschool learning app with interactive educational books for prepare boys and girls for kindergarten and first grade.  Your feedback is important to us. Please SHARE YOUR REVIEW below!  For any technical issues, please email us at info@amayasoft.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}