{
"name" : "mozaik3D - Animations, Quizzes and Games",
"url" : "https://play.google.com/store/apps/details?id=com.rendernet.mozaik3dviewer",
"package" : "com.rendernet.mozaik3dviewer",
"category" : "Education",
"description" : "Lets make learning fun!  If you liked our previous educational 3D applications, you will love this one! Download the mozaik3D educational application to explore more than 1200 educational 3D scenes on your smartphone or tablet.   Please note that this educational application requires a continuous Internet connection.  Our 3D scenes have been designed mainly for students between 8 and 18 years of age. They provide a unique help for learning at home in a playful and enjoyable manner. The interactive educational scenes related to history, technology, physics, mathematics, biology, chemistry, geography and visual arts will turn learning into an adventure.  Available languages: American English (1228 - 3D) English, Deutsch, Franais, Espaol, , , Magyar, , , Portugus, Portugus (Br), Italiano, Trke, Svenska, Nederlands, Norsk, Suomi, Dansk, Romn, Polski, esky, Slovenina, Hrvatski, , Slovenina, , , Lietuvi, , ,   You can try our application without registering and open the demo scenes, marked with a gift box icon. If you like our demo scenes, you may want to register a free user account so that you can open 5 educational 3D scenes each week free of charge. By purchasing a mozaWeb PREMIUM subscription, you will gain unlimited access to the 3Ds. In addition, you will also have full access to all the items in the media library of mozaweb.com (more than 1200 3D scenes, hundreds of educational videos, interactive exercises etc.) and you can use our educational tools and games as well.  How to use the mozaik3D application  You can still use the app to open 3D scenes while browsing mozaweb.com.  When the installation is complete, open the application. You can try our demo scenes without registering, but if you register a free user account, you can open 5 educational 3D scenes each week free of charge. By purchasing a mozaWeb PREMIUM subscription, you will gain unlimited access to the 3Ds.  On the applications main page, you can filter 3Ds by topic or use the search field to find a particular 3D scene. You can open the scenes by tapping the play button. In the sidebar menu, you can change the language, buy a mozaWeb PREMIUM subscription, send feedback and rate the app.  Our fully interactive 3D scenes can be rotated, enlarged or viewed from pre-set angles. With the predefined views, you can easily navigate through the complex scenes. Some of the 3D scenes contain a Walk mode, enabling you to explore the scene yourself. Most of our 3Ds include narrations and built-in animations. They also contain captions, entertaining animated quizzes, and other visual elements. The 3D scenes are available in several languages, which also offers an excellent opportunity to learn and practice foreign languages.   Explore the 3D scenes as if you were there  Activate VR mode by pressing the VR headset icon in the bottom right corner. Then place your phone in your VR headset and walk in ancient Athens, the Globe Theatre or on the surface of the Moon. (Please note: For a full VR experience, use a device that has a gyroscope.)  How to use the 3D scenes  Rotate the scene by dragging your finger.  Zoom the scene in or out by pinching with your fingers.  Shift the view by dragging the scene with three fingers.  Tap the buttons at the bottom to switch between predefined views.  If available in a specific view, use the virtual joystick to walk around.  You can change the language and set other functions in the internal menu. The internal menu can be accessed by touching the bottom corners.  Activate VR mode by pressing the VR headset icon in the bottom right corner. In VR mode, tilt your head to the right or left to display the navigation panel. Look down to turn movement on or off during Walk. ",
"desc_perms" : "['android.permission.INTERNET', 'android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}