{
"name" : "FP connect",
"url" : "https://play.google.com/store/apps/details?id=com.esemtia.fpconnect",
"package" : "com.esemtia.fpconnect",
"category" : "Education",
"description" : "FP connect est pensada para usuarios de esemtia que quieran tener toda la informacin de sus ciclos formativos en la palma de su mano.  Principales funcionalidad de FP connect:  - Consulta tus porcentajes de asistencia a clase. - Accede a tu horario de cada da. - Consulta tu expediente acadmico. - Mantente informado de tus calificaciones en tiempo real. - Comunicacin directa entre personal docente y alumno a travs de su mensajera interna. - Recibe notificaciones push de cualquier evento que el centro desee comunicar. - Multidioma  IMPORTANTE: Para poder utilizar esta aplicacin mvil es necesario que su centro escolar utilice esemtia como plataforma de gestin escolar.  Ya utiliza esemtia en su gestin diaria?  S, soy usuario de esemtia. En este caso, puede acceder a la aplicacin FP connect a travs de las claves de usuario y la contrasea que le han sido facilitadas a travs de su centro.  NO soy usuario de esemtia school. Si su centro escolar no utiliza todava esemtia como plataforma para la gestin escolar, puede solicitarla ponindose en contacto con nosotros a travs del siguiente mail info@esemtia.com o bien visitando la pgina del desarrollador www.esemtia.com. FP is designed to connect esemtia users who want to have all the information of their training courses in the palm of your hand.  Main functionality FP connect:  - Consult your attendance rates. - Access your daily schedule. - Check your transcript. - Keep informed about your grades in real time. - Direct communication between teachers and students through its internal mail. - Receive push notifications of any event that the center wishes to communicate. - Multilanguage  IMPORTANT: To use this mobile application is necessary for your school use esemtia as school management platform.  Do you already use in their daily management esemtia?  YES, Im using esemtia. In this case, you can access the application via FP connect key user and password that have been provided through its center.  I am not a member of esemtia school. If your school does not use yet esemtia as a platform for school management, you may apply by contacting us through the following mail info@esemtia.com or by visiting the developer www.esemtia.com. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.esemtia.fpconnect.permission.RECEIVE_ADM_MESSAGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.esemtia.fpconnect.permission.C2D_MESSAGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.amazon.device.messaging.permission.RECEIVE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.esemtia.fpconnect.permission.RECEIVE_ADM_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}