{
"name" : "Noorani Qaida with Audio",
"url" : "https://play.google.com/store/apps/details?id=com.ifocusapps.nooraniqaida",
"package" : "com.ifocusapps.nooraniqaida",
"category" : "Education",
"description" : "Colorful Tajweedi Noorani Qaida with Audio sound is a guide to learn Quran for anyone either muslim or non muslim kids, yonger and elders. Each and every lesson is disigned with buttons for pronouncing each alphabet/letter and word. It is a free application specifically designed to educate Muslim who are naive to correctly read Arabic Quraan with perfection and proper accent. With Colorfull Noorani Qaaida you can learn Proper Accent according to the Tajweed Rules. If you are looking forward to learn to read Quran in Arabic, then our Noorani Qaida App will be your first tutor, which will educate you in learning Quran in a tremendous way. Its an Interactive app with different animation styles that will attract the kids as well as adults. it is self learning guide which will teach you each and every part of the quraan. the app also contains Collection of fourty Rabbana Duaas / Doas (Supplication / Invocations) from Quran with English Pronuncition and Translation. the application aslo contains qawaid and zawabit (rules and guidance), Makharij (Articulations), Sifaat(the qualities), Name of teeth, part of throat, parts of tongue, definition of tajweed etc . Download the App and easily teach/learn Quran Basics.  Other Features:  - Interactive App with Audio Sound. - Fourty Duas with Translation. - User can touch on any word to listen its sound/pronunciation. - HD Graphics with Animations. - pin touch word by word qaidah - the app also contians qawaid and zawabit  - Download first time only then use offline. - Categorized in Seventeen Learning Lessons. - Tajweed Rules Color coded. - Best way to Learn Quran with ease. - Useful for both (Kids and Adults) ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}