{
"name" : "Integral Scientific Calculator",
"url" : "https://play.google.com/store/apps/details?id=com.crittermap.app.calculator.scientific.science",
"package" : "com.crittermap.app.calculator.scientific.science",
"category" : "Education",
"description" : "This smart mini calc is an essential tool for students to use in class. Integral calculation, trigonometric functions become easy with advanced scientific calculator fx. This instant calculator also has all the fundamental science constants & their values in addition to its core functions. Quickly look up and insert values without leaving the app. This functionality can also be used on an Android Wear Watch using voice search. To be clear the Android Wear component is a reference search and not a full Wear calculator.  Free download Integral Scientific Calculator to your android device & explore all the exciting mathemagic features comes with it. It provides all the essential trigonometric functions, physics constants & integral fraction conversion facilities in your hand. You can also use it for everyday general calculation. You dont need to be a mathematician to understand this pocket calc & it is designed to look like a real complex calc. Do note that this mini scientific tool app will install two icons: one called ScienceCal, the instant calculator. The other, Science Constants, brings up the reference for the Fundamental Physics constants if you want it by itself.  Integral Scientific Calculator uses data provided by the National Institute of Standards and Technology, but is not endorsed or certified by NIST. This precision calculator Includes NIST SRD 122 and NIST SRD 144. You can look up these constants quickly using the CNST, and instantly put them right into your scientific calculations for your science class.  This instant smart tool is designed to look and operate exactly like a real hand-held calc. It has all the advanced scientific functions plus history, essential memories, unit calculation, fraction conversion and science constants. You can easily customize the number of maximum smart digits. It also supports binary, octal and hexadecimal precision calculation and has an optional RPN mode. Integral Scientific Calculator fx is an essential pocket android tech that has real advanced mathemagic & all the essential perks of a mini complex science tool & it is easy to use, with full help included in the app.  Try calculation in class with an advanced pocket calc on your android devices. Works on three different modes - Float, Fixed and Scientific. A precision tool for a brilliant mathematician to calculate almost all types of calculations starting with everyday general procedures, trigonometric functions, fraction & unit conversion with option to find essential physics constants and calculate values with it.   Download Integral Scientific Calculator on your android device for free. Enjoy the mathemagic of mini pocket calc, calculate instant & complex mathematics easily.  Smart Fx features include- * Arithmetic functions to use in class for young mathematician & students. * Trigonometric functions, values & conversion facilities. * Log functions & conversion. * Advanced fraction conversion. * 9 custom Memories to save values. * Clipboard support to copy and paste values from the smart display. * Scrollable display to see large values (for small screen phones). * Unlimited history of precision calculations for instant peek. * Permutation and combinations. * Built in large number of fundamental physics constants from NTSI with ready to use values in class. * Customizable number of maximum digits. * Haptic feedback to feel like pressing real keys. * Solve multiple calculations at once with precision.  If you are looking for a advanced scientific calculator that has all the mathemagic features like arithmetic and trigonometric functions, fraction conversion, calculate science constants & their values than this new mini pocket fx is the right choice for your mathematician mind.  If you like the Integral Scientific Calculator fx app than please take a moment & rate it. Your feedback help us in making great apps. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}