{
"name" : "Coloring Games: Coloring Book, Painting, Glow Draw",
"url" : "https://play.google.com/store/apps/details?id=com.rvappstudios.kids.coloring.book.color.painting",
"package" : "com.rvappstudios.kids.coloring.book.color.painting",
"category" : "Educational",
"description" : "Kids love fun coloring games, and this Coloring Game is one of the best free coloring book and painting apps for children!  Coloring Games is filled with fun, colorful, and creative drawing and painting tools that help kids of all ages enjoy creating art on your mobile device. There are multiple modes the whole family can enjoy, including paint by numbers, color by numbers, doodling modes, and free coloring books of all types. Whether your kid is a toddler or a preschooler, theyre bound to have fun with this free coloring game!  Coloring Games was built specifically for children. It has an easy to understand interface kids as young as one year old can use. Theyll have fun using the drawing, painting, and learning games at their disposal, while parents can watch the looks of joy on their faces as they color in the pages with a wide variety of paints.  There are a ton of coloring mini-games to play in Coloring Games, including:  1. Fun Paint - Tap to fill in the blank coloring book pages with a dozen bright and fun colors!  2. Color Fill - Use a wider variety of colors and options to paint the pictures, including stickers, glitter, crayons, and cute patterns.  3. Drawing - Draw on a blank slate with a full palette of colors ready to go.  4. Glow Pen - Paint with neon colors on a dark background. A fun way to create unique artwork!  5. Number Paint - Color-by-numbers to fill in an amazing picture, one paint shade at a time!  Coloring Games comes with a number of features that help adults monitor their childs progress. You can easily add profiles for each child, customize settings to make color activities easier or harder and more. Best of all, the coloring game is completely FREE to play. There are no ads, no in-app purchases, and no paywalls to fight with, just tons of safe, educational fun for kids.  Preschoolers, toddlers, families, and boys and girls of all ages will love the simple but engaging fun of Coloring Games. Its easy to start coloring with just a few taps on the screen, and maybe your child will create a miniature masterpiece!  Note to parents: When creating this game, our goal was to craft a unique and fun experience perfectly designed for children. Were parents ourselves, and we know how ads and paywalls can get in the way of families enjoying playtime together.  Coloring Games is completely free. You wont find any in-app purchases or third party advertisements, just a great coloring book app you can play with your children. We dont want our kids consuming hundreds of ads while they learn, and we think other parents agree with that, as well!  Thank you for taking the time to experience fun learning and coloring apps with your children. Spread the word so more parents can share wholesome entertainment with their families, too!  Best wishes from the parents at RV AppStudios ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}