{
"name" : "Baby Panda's Kids Crafts DIY",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.gift",
"package" : "com.sinyee.babybus.gift",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Baby Pandas Kids Crafts DIY is a game designed for children aged 3-4 to make handcrafts. Here, Kids can work with baby panda for dolls, candies, crowns and other kids crafts DIY, through which kids creativity and hands-on skills will be developed.  The Baby Panda is good at DIY, and has opened a kids crafts shop in the forest. Every kid loves to go there to buy gifts. Dears, come and learn for kids crafts DIY with baby panda!  Step 1: Collect materials.  Put on your basket and go to the forest to find the wood on the design drawings.  Take a flashlight and go underground to look for gems.  Kids, come and improve your observational skills and memory!   Step 2: Process.  Crush the fruits into jams, add sugar and honey and then boil the syrup. Smash the raw gemstones with a hammer and take out the gems hidden within.  you can enjoy a lot of fun in the hammering!  Step 3: Shapes DIY.  Big eyes, red nose, and pouted mouth. You can decide the expressions of the dolls.  The colorful gems with different shapes, when carefully decorated, can make the crown look nobler. Kids, use your creativity to make your unique handicrafts!   The handicrafts you have made are so beautiful! Pick a box and wrap them up. Then give them as gifts to your friends!   In Baby Pandas Kids Crafts DIY, you can:  - Use your imagination and creativity freely.  - Improve observational skills and memory.  - Enjoy the fun of DIY and learn how to make easy crafts.  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}