{
"name" : "Burlington Books WordApp",
"url" : "https://play.google.com/store/apps/details?id=com.burlingtonbooks.wordapp",
"package" : "com.burlingtonbooks.wordapp",
"category" : "Education",
"description" : "Use the Burlington WordApp on all your mobile devices to get interactive unit-by-unit vocabulary and spelling practice. The WordApp includes interactive wordlists, vocabulary activities and games. To access the Burlington WordApp, scan the QR code on the inside cover of your book or the QR code in your Interactive Student (IS). Then you are on your way to unlimited learning and practice of the vocabulary from your course.  The WordApp for each course includes all the vocabulary from the course with accompanying example sentences.  Vocabulary is divided by the units of the book, and by categories.  Select a word to hear how it is pronounced, see its translation, and see and hear the word used in context in an example sentence.  Use Search to find specific words quickly.  Use the Focus Words feature to focus on specific groups of words that you choose. The Focus feature is synced between all your devices.  Practice vocabulary with a variety of activities in which you match sound to words, translations to words, or fill in the blanks in a sentence. See your score as you do the activities.   Difficulties and Successful Tries features provide immediate feedback on both vocabulary and spelling so that you can review and improve words which you found difficult, as well as see your successful results. Both features are synced between all your devices.  Progress reports all your results on the work you have done on all devices.  The Burlington WordApp will help you improve your vocabulary wherever you are, whenever you want, 24/7! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}