{
"name" : "Hadith Collection (All in one)",
"url" : "https://play.google.com/store/apps/details?id=com.greentech.hadith",
"package" : "com.greentech.hadith",
"category" : "Education",
"description" : "Hadith Collection (All in one) is an Ultimate Collection of Hadith of Prophet Muhammad (). The app contains 41000+ hadith from Most Accepted and Authentic Hadith books.   The 14 books included are:  1) Sahih al Bukhari   - Hadith collected by Imam Bukhari (d. 256 A.H., 870 C.E.) 2) Sahih Muslim   - Hadith collected by Muslim b. al-Hajjaj (d. 261 A.H., 875 C.E.) 3) Sunan an-Nasai   - Hadith collected by al-Nasai (d. 303 A.H., 915 C.E.) 4) Sunan Abu-Dawood    - Hadith collected by Abu Dawood (d. 275 A.H., 888 C.E.) 5) Jami at-Tirmidhi   - Hadith collected by al-Tirmidhi (d. 279 A.H, 892 C.E) 6) Sunan Ibn-Majah    - Hadith collected by Ibn Majah (d. 273 A.H., 887 C.E.) 7) Muwatta Malik   - Hadith compiled and edited by the Imam, Malik ibn Anas 8) Musnad Ahmad - Hadith compiled by Imam Ahmad ibn Hambal  9) Riyad us Saliheen   10) Shamail Muhammadiyah   11) Al Adab Al Mufrad   - Hadith collected by Imam Bukhari (d. 256 A.H., 870 C.E.) 12) Bulugh al-Maram   13) 40 Hadith Nawawi   - Hadith collected by Abu Zakaria Mohiuddin Yahya Ibn Sharaf al-Nawawi (631676 A.H)  14) 40 Hadith Qudsi    Features:   41000+ Ahadith from the Sunnah  Hadith grade (Sahih, Hasan, Daif etc)  Search any word (partial or exact word) - Powerful Search engine  Adjustable font size for both Arabic and translation (Pinch zoom feature)  Hadith of the day   Share option with ability to share images lets one to distribute beautiful hadiths with loved ones.   No Ads  Add/Remove Bookmarks/Favorites with online sync with google drive  Start reading from where you left off (last read)  Super quick response & Database load  Multiple View Modes: List view and Page mode  Inclusion of chapters in some books  Reference and Courtesy of Sunnah.com  If you find any errors/issues in the hadiths, kindly report it to us.  May Allah have mercy on the collectors and translators of the Hadeeth  Share and Recommend this Beautiful Hadith app for Android to your friends and family. May Allah bless us in this world and hereafter. Whoever calls people to right guidance will have a reward like that of those who follow him... - Sahih Muslim, Hadith 2674  Developed by Greentech Apps Foundation Visit our Website: https://GreentechApps.com Follow us on Social Medias: http://bit.ly/GreentechFacebook http://bit.ly/GreentechTwitter http://bit.ly/GreentechYoutube  Our apps are Completely Free to Use and Contain No Ads. For us to contribute more to the Ummah with new apps and features, our team needs regular funds to support the progress. Heres Your Chance to Make a Difference, Benefit the Ummah and Share the Rewards.  Support our Projects by Donating generously & Sharing with others, and Be Part of Sadaqah Jariyah in sha Allah: https://greentechapps.com/donate  Important Note:   The Hadiths included in the App are in Arabic & English Language ONLY. Although we would love to add more languages, but we dont have the required hadith databases for other languages.   We also feel compelled to make an observation here: this is not a fiqh or fatwa application. Hadith are made available on this application as a resource for research, personal study and understanding. The text of one or a few hadith alone are not taken as rulings by themselves; scholars have a sophisticated process using the principles of fiqh to come up with rulings. We do not advocate do-it-yourself fiqh using these hadith for those who are untrained in these principles. If you have a question on a specific ruling, please ask your local scholar. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}