{
"name" : "Spelling Games for Kids - Learn Spelling, Words",
"url" : "https://play.google.com/store/apps/details?id=com.gkgrips.spelllearningforkids",
"package" : "com.gkgrips.spelllearningforkids",
"category" : "Education",
"description" : "550+ Kids Spellings to Learn with Pictures  Spelling Games for Kids  Teaches your kid new English words with spelling, pronunciation and beautiful images. Specially, designed for toddlers and kids aged 3-5 who are eager to learn new words.   Ever wondered if there is an app to learn your kids how to say English words? An English words pronunciation app with HD pictures and HQ voice over? Also, an app that teaches your toddlers spelling?   Well, you are at the right place as Spelling Games for Kids 2-5 year Old teaches your kid new English words with spelling, pronunciation and beautiful images. Specially, designed for toddlers and kids aged 3-5 who are eager to learn new words.   Spelling Games for Kids Categories  Think of this cool English learning kids puzzle as a broad and kid-friendly learning activity game. All words are categorized and feature HQ voice overs. Help your kids learn new words in categories like:   123 Numbers: Learn Numbers Spelling  Abc Alphabet Letters: Learn Alphabets  Birds: learn Birds Spelling  Animals: Learn Animal Spelling  Fruits: Learn Fruits Spelling  Vegetables: Learn Vegetables Spelling  Food: Learn Food Spelling  Shapes: Learning Shapes Spelling  Colors: Arrange the Color Spelling  Music: Learn Music Equipment Spell  Bathroom: Learn Bathroom Equipment  Kitchen: Learn Kitchen Equipment   Flag: Know Various Country Flag  Education: Learn Education Equipment  3 DIFFICULTY MODES  Pick between 3 difficulty modes of the learning English words challenges: easy, medium, hard. Start with easy, but if you want your kid to further his pronunciation learning & say English words loud and clear go with medium and hard. The challenges are harder and you may check their knowledge.   WHO CAN MAKE USE OF OUR ACTIVITY WORD & SPELL LEARNING APP?   Toddlers who want to learn to spelling  Toddlers who need to learn how to say English words  Kids who need letter learning & need to learn to spelling  Kids who want to understand the meaning of certain words and categories of words  So parents, if you want a toddler letter learning, English pronunciation & toddler spelling app, this is the perfect app for you. The best part is that this is a learning English words with pictures app, meaning your little angels will learn with both pictures and high quality voice overs.  There is no better way of learning with pictures, letters, nice illustration and high quality voice overs. So get this helpful educational activity English words learning for toddlers app for free and let your kids have fun while learning new words!  Download Word & Spell Learning for Kids / Toddlers Age 3-5 for free! ",
"desc_perms" : "['android.permission.READ_CALL_LOG', 'android.permission.READ_CONTACTS']",
"manifest_perms" : "['me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.INTERNET', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.ACCESS_WIFI_STATE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.READ_APP_BADGE', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.READ_SETTINGS', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.gkgrips.spelllearningforkids.permission.C2D_MESSAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}