{
"name" : "Phrases - Learn Languages",
"url" : "https://play.google.com/store/apps/details?id=com.ulilab.phrases",
"package" : "com.ulilab.phrases",
"category" : "Education",
"description" : "Phrases - the best application for learning a foreign language!  Learn English , Spanish , French , German , Italian , Russian  with us!  The application is excellent for people with any level of language knowledge from beginner to advanced.  Features of Phrases: - 8 unique exercises, each teaches the specific skill of the language being studied. - Learn ready-made sets of phrases or adding your own. - Convenient search. - System of achievements and detailed statistics of training. - Clever reminders of classes. - Several variants of pronunciation of each phrase. - Individual training program. - You do not need access to the Internet - you can study anywhere.  Spending a lot of time in transport on the way to work or study, or are you standing in a long queue for a doctor or a multi-kilometre traffic jam? Use this time to benefit! Start to learn a foreign language together with Phrases. Only 20 minutes a day and in a month you will be much more confident to understand and speak a foreign language.  Do you want to learn English or another language for school, work or travel? Phrases makes it easy to learn a foreign language with the help of exciting exercises in a game form, in which you want to play again and again. Each training teaches the specific skill of the new language, creating a comprehensive experience. With the help of Phrases you will be able to quickly memorize new material and easily check your knowledge, practice spelling and listening.  Our unique algorithm improves the learning process, using proven methods from the field of memory research. Phrases adapts individually to you, selectively repeats the material with which you had problems. Completing lessons and playing games, you will gain experience, move to higher levels and collect rewards. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.ulilab.phrases.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}