{
"name" : "Surah Yasin",
"url" : "https://play.google.com/store/apps/details?id=com.QuranReading.SurahYaseen",
"package" : "com.QuranReading.SurahYaseen",
"category" : "Education",
"description" : "Surah Yasin is an Android App, which is designed to facilitate the users with the imperative Surahs of Quran all together in one App. App comes with a distinctive feature of Surahs with translation, transliteration, and audio recitation of each Surah of Quran.  Surahs of Quran included:  1. Surah Yaseen, which is the heart of Quran and has divine virtues associated with it, which awards innumerable  virtues to the one who recite it daily. 2. Surah Rahman, which is the adornment of Quran, soothes the hearts of the believers. 3. Surah Mulk the reverend Surah of Quran e Hakeem, which shields against the afflictions and punishment of grave 4. Surah Kahf is one that significant Surah which will help from the pugnacities of Anti Christ (Dajal) 5. Surah Waqiya the divinity of which is proven with the authentic Hadith that it alleviates poverty and makes you  enrich by heart  App Features:  The detailed features of this App entail:   Translation in almost every language for each verse of the chapters included in Application to enhance the  understanding of Quran teachings  Recitation in the soulful voices of renowned Recitors Mishray Al-Afsay and Abdur Rahman as Sudais  Transliteration to help user in correct pronunciation of each Arabic Alphabet (Tajweed) for authentic recitation of  this divine book of Allah Almighty  GoTo option to search any particular verse of the Surahs mentioned in this App  Change of font style and font size for the clear visibility of text on your smart Phone screens  Play and pause option helps to take the hold of recital process for the users  Benefits and Blessings Section:  This bonus feature has added in this App to enlighten the users with the blessings of these aforementioned Surahs of Quran. It further consist sections, which separately are covering the virtues of each Surah enlisted in the App.  Rate and download this imperative free of cost App to grasp the divine bounties of Quran e Pak. JazakAllah! ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}