{
"name" : "Pharmacology Exam & Board Review: Katzung & Trevor",
"url" : "https://play.google.com/store/apps/details?id=com.gwhizmobile.mcgrawpharma",
"package" : "com.gwhizmobile.mcgrawpharma",
"category" : "Education",
"description" : "Studying for medical pharmacology course exams or the USMLE? Make sure that this comprehensive and innovative study tool is in your arsenal. Derived from the highly respected Katzung and Trevors Pharmacology Examination and Board Review, Pharmacology Exam and Board Review has the broadest scope of anything on the market today.   Install the free version today and jump-start your studying!  We have provided a limited free version of the app that you can try before deciding to upgrade. This version includes a limited amount of practice questions and basic progress metrics.  Subscribe today and get access to:   600+ practice questions   Detailed explanations with images  Developed by experts  400+ high yield terms  200+ must-know drugs  200+ tough quiz questions  Dozens of test taking tips and strategies  Unlimited access to ALL categories:  Toxicology, Cardiovascular Drugs  Autonomic Drugs, Endocrine Drugs  Chemotherapeutic Drugs and more!  Detailed results tracking  With information specific to the USMLE as well as generic test prep advice, you are about to download an indispensable tool for any medical pharmacology student preparing for one of the most important tests of your life.  About the Authors:  Anthony J. Trevor, PhD Professor Emeritus of Pharmacology and Toxicology  Department of Cellular and Molecular Pharmacology  University of California, San Francisco  San Francisco, CA  Bertram G. Katzung, MD, PhD  Professor Emeritus of Pharmacology  Department of Cellular and Molecular Pharmacology  University of California, San Francisco  San Francisco, CA  Susan B. Masters, PhD  Associate Professor of Pharmacology  Department of Cellular and Molecular Pharmacology  University of California, San Francisco  San Francisco, CA  Get access to all questions when you subscribe:  1 Month: one auto-renewing payment of $14.99  12 Months: one auto-renewing payment of $59.99   This app offers two auto-renewing subscription options to help you pass your exam.  -Payment will be charged to your Google Play Account at confirmation of purchase -Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period -Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal -Subscriptions may be managed by the user and auto-renewal may be turned off by going to the users Account Settings after purchase -Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable  These prices are for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.   Our Customer Success Team is available from 9am to 5pm, Monday - Friday (except on major holidays). Call us at 319-246-5271 and email us at support@hltcorp.com with any questions.  Privacy Policy - http://builtbyhlt.com/privacy Terms of Conditions - http://builtbyhlt.com/EULA ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_SYNC_STATS', 'android.permission.BLUETOOTH', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}