{
"name" : "Orthographe - Francais CM1&CM2",
"url" : "https://play.google.com/store/apps/details?id=com.powowbox.objectifzerofaute",
"package" : "com.powowbox.objectifzerofaute",
"category" : "Education",
"description" : "STOP AUX FAUTES DORTHOGRAPHE ! ObjectifZroFaute est le jeu qui apprend  votre enfant les bonnes questions  se poser quand il crit et se relit. Cette application lamnera rapidement et sans stress au niveau requis pour son entre au collge. Les points de grammaires abords sont conformes au programme de fin de primaire (CM1 & CM2).   LE PRINCIPE DU JEU  voluant dans une ambiance sonore et graphique ddramatise et inspire des jeux vido, lenfant est  chaque niveau confront  des phrases courtes avec ou sans faute. Sil identifie une faute, il lindique en cliquant sur le mot. Un petit robot anime et commente de faon image ses russites et ses erreurs. Sil se trompe une explication simple et prcise lui est donne. Les rgles proposes sont volontairement pragmatiques, le plus souvent bases sur le principe de substitution par un terme quivalent afin de lever les ambiguts entre mots de mme son ( ou a ?) et donner ainsi  votre enfant des outils simples pour mettre en vidence le sens et la fonction grammaticale des mots.  La rptition tant la cl de lapprentissage, 1  5 toiles sont associes  chaque niveau, pour inciter lenfant  les rejouer sans commettre derreur et obtenir les 5 toiles.  LE JEU SADAPTE  LENFANT  Chaque niveau contient 5 rgles  mmoriser, un algorithme dtermine automatiquement celles que lenfant matrise ou pas, et choisit  chaque tape le type derreur  lui montrer, en privilgiant les rgles quil narrive pas  identifier. Quand lalgorithme dtermine que lenfant matrise une rgle, il gagne une toile.  LES CONTENUS  Lactivit est divise en douze niveaux de difficult progressive et permet dapprendre 60 rgles illustres par 1200 exemples. La dure totale dutilisation pour terminer tous les niveaux est en moyenne de 20  30 sances de 5  10 minutes de jeu, en fonction du niveau de votre enfant .  JE VOUDRAIS TESTER !  Cette version vous permet dvaluer les quatre premiers niveaux, sans aucune limitation du nombre dutilisations. Votre enfant pourra ainsi sentraner autant de temps quil le dsire sur ces niveaux. STOP THE SPELLING MISTAKES! ObjectifZroFaute is the game that teaches your child the right questions to ask when he writes and reads. This application quickly bring and stress level required for entry to college. The points of grammar covered conform to the primary end of the program (CM1 & CM2).   THE PRINCIPLE OF THE GAME  Operating in a sound and graphics dramatized atmosphere and inspired video games, children are at each level facing short sentences or fault. If it identifies a fault, it indicates this by clicking on the word. A small robot anime and comments pictorially successes and mistakes. If he is wrong a simple and precise explanation is given. The proposed rules are deliberately pragmatic, often based on the principle of substitution by an equivalent term to resolve ambiguities between the same words (to or a?) And thus give your child simple tools to highlight the meaning and grammatical function words.  Repetition is the key to learning, 1 to 5 stars are associated with each level to encourage the child to play them without error and get 5 stars.  GAME FITS FOR CHILDREN  Each level contains five rules to remember, an algorithm automatically determines those the child masters or not and chooses at each step the type of error to show, emphasizing the rules he can not identify. When the algorithm determines that the child masters a rule, he earns a star.  CONTENT  The activity is divided into twelve levels of increasing difficulty and allows 60 to learn rules illustrated by examples in 1200. The total usage time to complete all levels on average 20 to 30 sessions 5 to 10 minutes of play, depending on the level of your child.  I WOULD LIKE TO TEST!  This version allows you to evaluate the first four levels, with no limit on the number of uses. Your child can practice as much time as he wants on these levels. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.powowbox.objectifzerofaute.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.GET_ACCOUNT', 'android.permission.VIBRATE', 'android.permission.BLUETOOTH']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.SEND_SMS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.GET_ACCOUNT']",
}