{
"name" : "Little Panda's Insect World - Bee & Ant",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.hexapod",
"package" : "com.sinyee.babybus.hexapod",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Ever been curious about the world of insects? How do bees make honey? How do ants carry food? How much do you know about these insects and their colonies? Lets take a close look! Little Pandas Insect World tells you the answer!  Ants and bees are intelligent and highly organized. Dont be afraid of them! Little Pandas Insect World helps you to understand and appreciate the tiny world of these insects and even spark an interest in biology.   Product Features:  LIFE CYCLE LEARNING: learn the life cycle of ant and bee withinteresting scenario and interaction play: egg, larva, pupa, and adult!   CARRY FOOD: Use your skills to help the bees and ants carry food home!  DEFEND THE HOME: The insects are marvelous but the world they live in is quite dangerous! Its time to defend their home!  DRESS UP QUEEN BEE: Play our make up game and let the queen bee looks stunning and gorgeous!  Cute cartoon characters and animations make the insect world come to life for you of all ages! Learning is fun and engaging when its combined with an appropriate amount of play! See what activities they are busy with everyday. There are lots of wonderful discoveries in our Little Pandas Insect World!  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}