{
"name" : "MyLexicon: Vocabulary Builder",
"url" : "https://play.google.com/store/apps/details?id=com.gumballsplayground.wordlypersonaldictionary",
"package" : "com.gumballsplayground.wordlypersonaldictionary",
"category" : "Education",
"description" : "Improve your vocabulary by keeping a collection of any words or phrases you want to learn in your own personal dictionary.  Features:  Save your data to the cloud and access it on any device by signing in with your Google account.   Create entries for the words/phrases you want to learn. You can use suggested definitions, or you can create your own.   Keep your words organized using categories, which allow you to group related words together for easier searching and practicing.   Learn your words using the built-in practice mode, which currently allows for flashcards and spelling tests.   Look for new words using the find feature, which allows you to build your own query and find matching words.   Check out a new word every day on the Word of the Day page.   Upgrade to premium for even more functionality! A premium subscription will allow you to save images to terms, export your data into a CSV format, and use the dark theme. Purchasing a subscription will also remove all ads forever, even if your subscription expires!  When your subscription expires you will still be able to view any term images you saved, but you will not be able to create new ones unless you resubscribe.   Notes:   On Android Marshmallow devices and above, you can choose the Save Term option when highlighting text outside of the application to automatically create an entry.   In order to receive word and definition suggestions, an active internet connection is required. Also, ad blockers may cause issues with suggestion pop-ups.  Results powered by the Datamuse API ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}