{
"name" : "Learn Chinese Offline",
"url" : "https://play.google.com/store/apps/details?id=com.ufo.learnchinese",
"package" : "com.ufo.learnchinese",
"category" : "Education",
"description" : "You want a handbook of essential phrases, sentences ! Speak Chinese Phrasebook is an easy to use Phrasebook that will give visitors to China and those who are interested in learning Chinese a good start in the language. Learn Chinese Free is recorded using native speaker and we have tried our best to be authentic in the pronunciation whilst ensuring it is easy to understand. Recommended app for tourists and business people visiting China or Chinese language country.  Learn Chinese Mandarin Free contains over 1300 commonly-used Chinese phrases and vocabularies for travellers and beginners in 18 categories. + Greetings + General Conversation + Numbers + Time and Date + Directions & Places + Transportation + Accommodation + Eating out + Shopping + Colours + Cities & Towns + Countries + Tourist & Attractions + Family + Dating <3 + Emergency + Sickness + Tongue Twisters  NATIVE PRONUNCIATION :  -- each phrase with speech of native speaker help you speak chinese correctly.  ALWAYS LEARN PHRASES, NOT INDIVIDUAL WORDS:   Meaning: Phrases are easier to remember, because they have meaning, they paint a picture, they tell a story.   Speed: When you learn phrases instead of a word, youre learning how to use that word correctly, and its much faster. When were children, we learn with phrases, groups of words, not just one word by one word by one word. Word by word is slow.   Pronunciation: In real life some groups of words are said as though it were a single word, in one breath-group, without pausing. If you stop to take a breath in the middle of the phrase, you are not saying it correctly, and you risk being misunderstood.  App is completely offline. No require internet to study Quick search by Chinese or English Save your favourite sentences to review later] When you travel, business to China, dont forget this app ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}