{
"name" : "StarSense Explorer",
"url" : "https://play.google.com/store/apps/details?id=com.celestron.skybox",
"package" : "com.celestron.skybox",
"category" : "Education",
"description" : "Unleash the power of your smartphone to take you on a guided tour of the night sky, even if youve never used a telescope before.  STARSENSE SKY RECOGNITION TECHNOLOGY  This one-of-a-kind app uses patent-pending technology in combination with a Celestron StarSense Explorer telescope (sold separately) to analyze star patterns overhead to calculate the telescopes position in real time with pinpoint accuracy.  StarSense Explorers sky recognition technology has revolutionized the manual telescope by eliminating the confusion common among beginners and enhancing the user experience for even seasoned telescope users. Many would-be astronomers become frustrated or lose interest in their manual telescope because they dont know where to point it to see planets, star clusters, nebulae, and galaxiesthe good stuff! StarSense Explorer tells you exactly which celestial objects are currently visible in the night sky and where to move your telescope to place those objects in the telescopes eyepiece.  THE NIGHT SKY AT YOUR FINGERTIPS  The user-friendly planetarium interface allows you to scan the skies for objects you wish to view. You can also search for objects in the extensive database.  Not sure what to observe? StarSense Explorer automatically generates a list of all the best stars, planets, galaxies, nebulae and more currently visible from your location. Simply select one from the list and off you go!  While you observe, you can access detailed information, images, and audio descriptions for the most popular objects. Its a great way for the entire family to learn scientific facts, history, mythology, and more, deepening your understanding of the night sky.  EASY AS 1-2-3: DOCK, LAUNCH, OBSERVE  To get started, assemble your StarSense Explorer telescope and download the app. Your telescope includes a unique unlock code to access the full features of the app. Connect your phone to the telescope by placing it into the StarSense dock and launch the app.  After a simple 2-step procedure to align the smartphones camera with the telescope, the app displays a view of the night sky and shows a bullseye on the screen to represent the telescopes current pointing position. From here, you can select an object to view by tapping it in the planetarium view or selecting it from the Tonights Best observing list. Objects will vary from night to night; you may see planets like Jupiter or Saturn, nebulae like Orion, the Andromeda Galaxy, or other object types.  Once you select an object, the app displays pointing arrows onscreen. These indicate where to move the telescope to find it. Follow the arrows until the bullseye appears centered on target. When the bullseye turns green, the object is visible in the telescopes lower powered eyepiece.  HOW STARSENSE EXPLORER WORKS  StarSense Explorer uses image data captured by the smartphones camera to determine its pointing position. The app captures an image of the night sky and then matches the star patterns within the image to its internal database in a process like fingerprint matching or facial recognition.  The process of extracting star pattern data in images to determine a telescopes current pointing position is called plate solving. It is the same method used by professional observatories and orbiting satellites.  The StarSense Explorer app is the first app ever developed that uses plate solving to determine the smartphones current pointing position. Other astronomy apps rely on the smartphones gyroscopes, accelerometers, and compass to estimate its pointing position. These methods are not accurate enough to place objects within the telescopes field of view.  StarSense Explorer technology is patent-pending.  COMPATIBILITY  Most smartphones manufactured after 2016 running Android 7.1.2 and higher. Check celestron.com/SSE for detailed Android compatibility information.  StarSense Explorer has localization support for French, Italian, German, and Spanish. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.android.vending.CHECK_LICENSE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.celestron.skybox.permission.C2D_MESSAGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.android.alarm.permission.SET_ALARM', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.CHECK_LICENSE', 'android.permission.CAMERA']",
}