{
"name" : "NATA (Designing) App: Online Mock Tests",
"url" : "https://play.google.com/store/apps/details?id=com.edugorilla.natatest",
"package" : "com.edugorilla.natatest",
"category" : "Education",
"description" : "Preparing for NATA (Designing)? Download the No. 1 Vernacular Test Series app #EduGorilla and get: - 21,000+ mocks for 700+ competitive exams - Questions that you would probably get in NATA (Designing) - A multitude of NATA (Designing) mocks, sectional tests, and previous year papers - Tests in both English and Hindi  About NATA (Designing):  The National Aptitude Test in Architecture (NATA Designing) is conducted online by the Council of Architecture (CoA) to select eligible candidates for graduate programs in Architecture (B.Arch.). NATA (Designing) is one of the most sought-after exams in the Architecture and Design sector and is taken by a lot of candidates. This app helps you to prepare for NATA (Designing) by providing the best online test series. You can practice mock tests of NATA (Designing) online and achieve success.  NATA (Designing) App Details:  NATA (Designing) app helps to prepare for mathematics, drawing and general aptitude questions. NATA (Designing) test series provides syllabus-wise unique questions. NATA (Designing) test series by Edu Gorilla also helps to prepare for NATA (Designing) questions based on the latest syllabus. Previous year papers and mock tests are also provided for better practice of NATA (Designing) exam.   NATA (Designing) Online Test Series:  Practice NATA (Designing) online test series only on EduGorilla. The test series is specially designed keeping in mind the level of NATA (Designing). All the mock tests are based on the updated exam pattern and can be accessed 24x7 online.  In NATA (Designing) Mock Test:  Get more than 120 Mock Tests for NATA (Designing). The test series is updated on a regular basis. You will get new mock tests for NATA (Designing) that can be accessed online anywhere anytime. Sectional tests and topic-wise mock tests are also given to help you practice more.  Key Features of EduGorillas NATA (Designing) Test Series:  EduGorilla offers a lot of features in its NATA (Designing) test series    Exams covered: NATA (Designing) Subject-wise Tests and Sample Question papers  More than 120 mock tests available  247 Online Access  Personalized Performance Analysis of your mock test  Online Mock Tests as per the latest pattern;   Subjects Covered:   General aptitude - Objects, Interpretation of pictorial composition, visualizing three-dimensional objects from 2-D drawing, general awareness of national and international architects, etc.  Mathematics- Algebra, Logarithms, Matrices, Trigonometry, Coordinate Geometry, Theory of Calculus, Permutation & Combination, Sets & Relations, 3-D Coordinate Geometry, etc.  Drawing skills- Understanding of scale and proportion of objects, geometric composition, shape, building forms and elements, aesthetics, color texture, harmony, and contrast, Drawing of patterns  both geometrical and abstract, Generating plan, elevation and 3D views of objects, etc.  Alerts and Updates:  Now practice EduGorilla NATA (Designing) test series on the go! Get regular alerts and latest updates of NATA (Designing) like exam notifications, important dates, syllabus, etc.  Practice free mock tests and various online topic-wise tests on the EduGorilla NATA (Designing) App. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE']",
}