{
"name" : "Mango Languages: Personalized Language Learning",
"url" : "https://play.google.com/store/apps/details?id=com.mango.android",
"package" : "com.mango.android",
"category" : "Education",
"description" : "Download the Mango app to learn a new language on the go with hands-free features and offline accessibility. Prepare for business trips, family vacations, or study abroad with practical, conversation-based language lessons.   Start now:  Try your first lesson in any language for free!  Equipped with authentic content, interactive features, and algorithmic review activities, the Mango system is designed to adapt to your individual learning path.  In our comprehensive course units, youll learn vocabulary, pronunciation, grammar, and culture simultaneously through interactive words and phrases, pronunciation pointers, and cultural insights.  Popular features:    Linguist-approved language courses  Content aligned with international standards  Practical, real-world conversations  Native-speaker audio   Individualized Review System   Interactive listening and reading exercises   Essential cultural insights  Designed with ADA standards in mind  Bluetooth syncing  Auto play for on-the-go learning  Pre-downloadable lessons  24/7 customer support  --------------------------------------------------  Available courses for English speakers:   Arabic (Egyptian)  Arabic (Iraqi)  Arabic (Levantine)  Arabic (Modern Standard)  Armenian  Azerbaijani  Bengali  Chinese (Cantonese)   Chinese (Mandarin)  Croatian  Czech  Cherokee  Danish  Dari  Dutch  Dzongkha  Filipino (Tagalog)  Finnish  French  French (Canadian)  German  Greek  Greek (Ancient)  Greek (Koine)  Haitian Creole  Hawaiian  Hebrew (Modern)  Hebrew (Biblical)  Hindi  Hungarian  Icelandic  Indonesian  Igbo  Irish  Italian  Japanese  Javanese  Kazakh  Korean  Latin  Malay  Malayalam  Norwegian  Pashto  Persian (Farsi)  Polish  Portuguese (Brazilian)  Punjabi (Pakistani)   Romanian  Russian  Scottish Gaelic  Serbian  Slovak  Spanish (Latin American)  Spanish (Castilian)  Swahili  Swedish  Tamil  Telugu  Thai  Turkish  Tuvan  Ukrainian  Urdu  Uzbek  Vietnamese  Yiddish  Available English courses:   English for Arabic (Egyptian) Speakers  English for Arabic (Modern Standard) Speakers  English for Armenian Speakers  English for Bengali Speakers  English for Chinese (Cantonese) Speakers  English for Chinese (Mandarin) Speakers  English for French Speakers  English for German Speakers  English for Greek Speakers  English for Haitian Creole Speakers  English for Hmong Speakers  English for Italian Speakers  English for Japanese Speakers  English for Korean Speakers  English for Polish Speakers  English for Portuguese (Brazilian) Speakers  English for Russian Speakers  English for Somali Speakers  English for Spanish (Latin American) Speakers  English for Turkish Speakers  English for Vietnamese Speakers  --------------------------------------------------  Get full access:  Want to learn more than one lesson? You can get full access to all of our language courses by linking your profile to a library/institution that offers Mango near you or by purchasing a subscription. There are two types of subscriptions:    All Access Monthly Subscription: An auto-renewable monthly subscription.   All Access Yearly Subscription: An auto-renewable annual subscription.  If you have a question, comment, or would just like to say bonjour, feel free to contact us at support@mangolanguages.com.  Terms of use:   https://mangolanguages.com/legal/terms-and-conditions/ ",
"desc_perms" : "['', 'android.permission.INTERNET', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}