{
"name" : "Oda Kids Math: Learning Maths with Funny Games",
"url" : "https://play.google.com/store/apps/details?id=com.odaclass.mathcheck",
"package" : "com.odaclass.mathcheck",
"category" : "Education",
"description" : "Have fun when learning math with the excellent app. Directed by proven systematical methodology, mathematics are designed to systematical levels from easy to difficult and over 10,000+ quizzes.  For self-learning and practice purposes, the app is of great help to enhance the foundation of mathematics in an interesting and high-efficiency way.   Main Features  1 Proven scientific methodology  - Learn and practice arithmetic in levels to improve mathematic skills after school - Support practice of all four of the major arithmetic operations: Addition(+), Subtraction(-), Multiplication() and Division() - Include math skills of kindergarten, preschool, grade 1, grade 2, grade 3, grade 4, grade 5 and grade 6   2 Systematical arithmetic quizzes for FREE  - Offer over 10,000+ quizzes all for kids to improve math skills - All arithmetic skills taught in kindergarten and primary school were included - Necessity app for self-learner, parents and math teachers to practice math and check math exercise answers   3 Customized content for every child  - Many customized exercises to help you enhance your mathematic basis - Improve arithmetic skills through free exercises and error analysis - Quickly practice oral arithmetic and vertical arithmetic   4 Learning math with fun  - Practice mathematics in interesting level-based games - Finish daily challenge to get more scores and improve your levels - Try to get the highest score of 3 stars for all levels   5 Take one photo to check all answers  - Take 1 photo to check all answers of math homework are correct or wrong - High-efficiency math check app for kids, parents and teachers - Many arithmetic question types are supported to photo check function   6 Automatically error list collection and error analysis  - Wrong answers will be automatically collected into error list - Free analysis for wrong answers explains arithmetic skills for you - Summarize and analyze wrong answers to strengthen childrens math skills   Contact email: support@pigeonedu.com  Oda team tried our best to offer excellent online education services for you. If you need any help or have any suggestions, please do not hesitate to contact us via Email. Thank you! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.BATTERY_STATS', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_USER_PRESENT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_LOGS', 'android.permission.CAMERA', 'android.permission.BROADCAST_STICKY', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.RECEIVE_USER_PRESENT', 'android.permission.BATTERY_STATS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_LOGS', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION']",
}