{
"name" : "VHF Trainer Lite",
"url" : "https://play.google.com/store/apps/details?id=com.adveniosoftware.vhftrainerlite",
"package" : "com.adveniosoftware.vhftrainerlite",
"category" : "Education",
"description" : "Changing the way of learning  VHF Trainer Lite is the most complete application on the market for learning and practicing about VHF radio, Digital Selective Calling and GMDSS. It is divided into three sections (Learning, Test and Simulation) so you can have an immersive experience aboard a ship, read, train and test all your knowledge in a didactic and fun way.  in the full version you will get :  - 9 illustrated chapters in full color and with great quality that will allow you to learn in an easy and attractive way everything related to the Global Maritime Distress and Safety System and radiocommunication equipment at sea.  - More than 20 scenarios: The 3D simulation allows you to navigate aboard a ship using a marine VHF equipment with all its functions: you will receive radio communications, send alerts and you will be able to experience situations of distress. Get ready to navigate and experience an interaction with the ocean in a safe and controlled environment.  - More than 200 questions about the VHF equipment: Answer questions, join concepts with arrows and choose the right option from a list of possibilities in a trivia that will allow you to evaluate the knowledge that you have assimilated. VHF Trainer Lite will score your answers and congratulate you or invite you to continue studying according to your performance.  Our focus is on advancing, growing and evolving, always thinking about the end user experience, and to be able to offer products of quality and easy assimilation following the principle if I listen, I forget; If I see it, I remember it; If I do and I practice it, I understand.  ----------------------- Keywords: VHF, DSC,VHF-DSC, SRC, GMDSS, Skipper, PNB, PER, LRC, General operator, Short range certificate ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}