{
"name" : "Piano Academy - Learn Piano",
"url" : "https://play.google.com/store/apps/details?id=com.yokee.piano.keyboard",
"package" : "com.yokee.piano.keyboard",
"category" : "Education",
"description" : "Piano Academy is for anyone whos looking to learn the piano from scratch, or for those who have prior knowledge and want to continue learning by practicing to their favorite songs.  Piano Academy offers an on-screen touch keyboard so you can start playing immediately. The app also supports MIDI connection, and it can even detect the notes you play if you have an acoustic piano.   MAIN FEATURES - Watch tutorial videos introduced to you by your personal instructor, teaching you theory topics like notes, the staff, chords, and much more. - The app listens to every note you play and gives you instant feedback, so you know how to improve. - Practice playing tons of great tunes by reading real sheet music. - Play fun games to train your musical hearing, hand-coordination, and sense of rhythm.   WHO IS IT FOR? Piano Academy is suitable for all ages, from kids to adults.  We have designed and built this app from the very beginning to help transform even the complete beginners into actual pianists.   HOW DOES IT WORK? We are going to teach you how to read notes, so youll be able to play while reading sheet music. Youll play tons of amazing classical pieces, as well as contemporary hit-songs on your own.  As you progress, youll learn to play with both hands, play chords, and much more.  Theory topics are introduced to you by your personal instructor with the aid of animations and walk-through videos.  You will play fun games that are explicitly designed to train your senses, such as musical hearing, hand-coordination, and your sense of rhythm, among other skills.  And the crowning glory is our staff player that shows music notes as you see in real sheet music. The notes are perfectly synced with the background music that will accompany you while playing. The app listens to every note you play and gives you instant feedback, so you know whether you hit the correct note at the right time.  BOTTOM LINE, youre going to have an enriching, rewarding, and challenging experience, and youre going to love it!   ABOUT YOKEE Yokee Music is the creator of Yokee, the worlds #1 ranked sing-along mobile app, with over 100 million users and the creator of Piano by Yokee, the most successful piano app game available in its genre.  If youre having any issues with the app, please dont hesitate to contact us at support@pianoacademy.app and well be happy to help.  Also, please join the Piano Academy community on Facebook and share your experience with other beginner-piano players like yourself: https://www.facebook.com/YokeePianoAcademy ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECORD_AUDIO', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}