{
"name" : "Drops: Language learning - learn Japanese and more",
"url" : "https://play.google.com/store/apps/details?id=com.languagedrops.drops.international",
"package" : "com.languagedrops.drops.international",
"category" : "Education",
"description" : "Drops takes boring out of language learning: useful vocabulary is beamed into your memory via gorgeous minimalist illustrations and fast paced micro-games.  The fun part? It only takes 5 minutes a day. In fact thats all the time you get! Insane? Yes. Works? Absolutely!   The overall design and gamification elements make Drops one of the most unique language learning apps Ive tried so far.  CNET   Pick up the essential words of 37 languages!  Cornerstones of Drops:   Drops is 100% visual: We use pictures to directly connect the meaning to - not to your native language! No middleman. Quicker, better and more fun in learning 36 languages! :)  5 minute session limit: limiting learning time may sound counterintuitive but it makes Drops incredibly addictive, which is not a bad thing when we talk about language learning. The barrier of entry is nonexistent. No excuses: you ALWAYS have 5 minutes!   Effortless practice: We took a good look at why games are so fun and addictive and injected the essence into Drops to create an app that is freakishly immersive but in this case you dont waste your time playing instead you build a valuable asset: knowledge of a new language. Rapid pace: We believe in quick pace and typing on your phones keyboard is nothing but fast. Say hello to rapid swipes and taps! Youll need those extra seconds to get the most out of your 5 minutes ;)  Vocabulary focus: No grammar, only curated words with high practical value. Drops focuses on one thing and it does it extremely well. Drops also teaches alphabet courses for beginners. Forge learning habit: Drops wants to convert you into a language learning addict. No matter how effective your learning tool is, if you dont use it on a daily basis, it doesnt really matter. Drops tricks your mind and youll be better for it!  Languages in Drops We are proud of the wide range of languages that you can learn with Drops and we are adding new ones nearly every month. Besides the usual suspects  plenty of exotic ones are available too!    Planning to visit Estonia soon? Pick our vocabulary, that is designed especially for tourists. We are extremely proud to our beautiful word pronunciations recorded by voice actresses and actors!    Drops offer a complete package for free for casual learners: 5 minutes of blazingly fast and epic fun learning per day, more than 2400 words in 99+ topics. More dedicated language learners can subscribe for premium features to achieve much faster progress and of course provides unlimited learning time.   Our mission at Drops is to empower people of the world with the gift of language knowledge via a special tool that uses the universal language we all speak: images.   -----------------  Have questions? Feel free to contact us at sup@languagedrops.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.android.vending.BILLING', 'com.languagedrops.drops.international.permission.C2D_MESSAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.VIBRATE', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}