{
"name" : "French Pronunciation",
"url" : "https://play.google.com/store/apps/details?id=com.az20.frenchpronunciation",
"package" : "com.az20.frenchpronunciation",
"category" : "Education",
"description" : "Are you learning French? You can practice and improve your French pronunciation with this simple app. It works offline and so is very handy. Learn French pronunciation by listening to how words are pronounced and repeating them. It is important to learn the right pronunciation of French words from the beginning. Learn and improve your French vocabulary the right way by practicing every day. Learn French daily through practice using this French Pronunciation app to improve your French pronunciations.   This French Pronunciation app is a quick tool to reach out to when in doubt. Simply enter the text and you will hear a pronunciation of the word.   Just use this app anytime youre confused about the right pronunciation of a word. It is very useful to all, students, tourists, teachers, workers, etc. who may need to check the pronunciation of a word on the go. It is a simple app to help you learn and speak French the right way.  Speak confidently with your friends, boss, colleagues, and tourists. Good pronunciation is essential for learning, speaking and understanding French well.  The ultimate mobile French pronunciation aid, for all. The French Pronunciation app helps you learn, practice and play with words wherever you are. French Pronunciation app teaches you how to learn to pronounce French text properly.   Main Features:  - Clear pronunciation of words  - Simple straightforward interface - History of learned words - Small app size - Works offline - Settings screen to regulate speech rate and pitch ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.az20.frenchpronunciation.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.INTERNET']",
}