{
"name" : "Learn English With Amy for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.squins.tkl.en",
"package" : "com.squins.tkl.en",
"category" : "Education",
"description" : "Learn English With Amy helps young children to improve their vocabulary.   13 appealing categories like farm, numbers, transportation, and body.  Test the listening and reading skills of your child.  For children 2 to 7 years.  How can Learn English With Amy help your kids?  Learn and play: challenging games (slideshow, concentration game, puzzle, and quiz).  Learn step by step: words are ordered into clear categories (Farm, Clothing, Colors, Transportation, Numbers, Shapes, Playground, Food & drinks, Zoo, Home, Body, Music, and Sports).  High-quality graphics designed by professionals.  Words are spoken by a voice over professional with a friendly female voice.  Teaches pronunciation and spelling.  Helps children learn new words they do not know yet (expanding your childs vocabulary).  Listening and reading skills of children are measured by the app, and can be viewed by parents and supervisors. The results can be viewed for a limited time only. An in-app purchase allows you to view the results of the last two weeks, and allows filtering by category and skill.  Learn English With Amy offers several fun and interactive preschooler games that teach kids in the following areas:  FARM: match cute animals from ducks to cows and learn how these words look, sound, and how to write and pronounce them correctly before kindergarten.  Words: tractor, cow, chicken, horse, cat, dog, duck, goat, and 5 more!  CLOTHING: what do we put on today and how do you pronounce that in English?  Words: knit cap, boot, mittens, shoe, trousers, dress, blouse, belt, and 8 more!  COLORS: your child will learn the most common colors as easy as 123.  Words: black, brown, red, dark green, gray, light blue, light green, orange, and 5 more!  TRANSPORTATION: see and learn the different means of transportation on the road, in the water or in the sky!  Words: car, train, truck, airplane, bicycle, bus, helicopter, motorcycle, and 5 more!  NUMBERS: learning the basics of the 123s is vital for toddlers and preschool aged kids and will help later with kindergarten math.  Words: zero, one, two, three, four, five, six, seven, and 3 more!  SHAPES: your preschooler will get to know the basic shapes by learning cute and colorful rectangles, circles, triangles, etc.  Words: arrow, circle, heart, oval, rectangle, ring, spiral, square, and 2 more!  PLAYGROUND: learn how to pronounce and write the equipment of the playground in English.  Words: carousel, horizontal bars, jungle gym, rings, sandpit, seesaw, slide, spring rider, and 4 more!  FOOD & DRINKS: learn how to pronounce and write the names of different food and drink items from around the world and tell everyone about them!  Words: apple, banana, bread, carrot, cheese, egg, fish, fork, and 15 more!  ZOO: look at the zoo animals and learn how they are written and pronounced in English.  Words: parrot, lion, monkey, zebra, elephant, giraffe, camel, crocodile, and 8 more!  HOME: apart from learning the basic shapes of everyday home appliances, your preschooler will hear the names along with their pronunciations.  Words: chair, door, phone, plant, shower, stairs, table, toilet, and 3 more!  And 3 more categories!  The following categories are available for free: Food & drinks, Zoo, and Body.  Remaining categories are available as an in-app purchase.  New games and categories regularly become available.  Kindergartens use this game to decrease language delays for newcomers.  Teachkidslanguages.com is a startup that aims to improve the way young children learn languages.  Do you have questions or feedback? We love to hear from you! Please contact us at info@teachkidslanguages.com  Visit us! https://www.teachkidslanguages.com Like us on Facebook! https://www.facebook.com/TeachKidsLanguages Follow us! https://twitter.com/TeachKidsLang  Like us? If yes, please give us a review! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
}