{
"name" : "Keeping Holy Quran",
"url" : "https://play.google.com/store/apps/details?id=com.msbahi_os.keepingquran",
"package" : "com.msbahi_os.keepingquran",
"category" : "Education",
"description" : "Program of the Keeping Holy Quran is a program that helps you to save and read the Quran    Features :  - Reminds you to read the pages of the Quran , the user specifies the number of pages also determines the number of hours alarm  - Search feature in the Quran which allows you to easily find verses arabic - Contains several readers to choose what suits you best from a reader  - Contains references page or favorite which allows you to save the page in the references until you get back to it easily  - Contains save feature which allows the user to repeat the verses and the page several times  - Contains download feature sounds, which allows the user to download the sounds to the reader, which is determined by   Viewing scanned(soft) copy of real printed Mosshaf. Al Quran recitations by many famous reciters (two of them are by Rewayat Warsh an-Nafei). Repeating each Aya as many times as desired with time interval in between. Search through Al Quran text. Six Arabic Tafsir(Commentary) Al-Saadi, Ibn-Katheer, Al-Baghawy, Al-Qortoby, Al-Tabary and Al-Waseet. One English Tafsir(Commentary) Tafheem Al-Quran by Al-Maududi. Text Translation of the A; Quran meanings for more than 20 languages. Voice Translation of the Al Quran meanings for two languages (English and Urdu). Sync between recitaion and Aya position in the Page (highlighting Aya while recited). Sync between recitaion and voice translation (repeat the translation after the recitation). Program Interface in both Arabic and English.  ** App permissions ** - the app needs the read phone status permission so it can stop the audio playback (the recitation) when a phone call comes in.- the app needs internet access so that it can download required contents (recitations, translations and Quran pages images).- the app needs to access to file storage so that it can store downloaded contents (recitations, translations and Quran pages images). ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}