{
"name" : "PSC Gk4Success- Kerala PSC Malayalam & English app",
"url" : "https://play.google.com/store/apps/details?id=com.iroid.gk4successweb",
"package" : "com.iroid.gk4successweb",
"category" : "Education",
"description" : "Best app for Kerala PSC, PSC, KPSC, PSC KAS, PSC LGS, PSC Assistant Grade, University assistant, PSC Degree level exams  Quiz, KAS - Kerala Administrative Service, Secretariat Assistant, University Assistant, Lower Division Clerk, LDC, Last Grade Servants, LGS, Fireman, Police Constable, Village Assistant, University Assistant, Panchayat Secretary, Company corporation board assistant, Company corporation board Last Grade, BDO, Deputy Collector, Excise Inspector, VEO- Village Extension Officer, Police Constable, Sub Inspector, Lab Assistant, CGL, Malayalam Quiz, English Quiz. SSC, RRB, Civil Service Prilims, Bank Tests. 50+ Previous Solved Question Papers of LDC, LGS, Secretariat Assistant, Village Assistant etc, University Assistant.  PSC Question Bank Malayalam, PSC Question Bank English, PSC LDC, PSC LGS,  ********** Topics Covered: KERALA :- Renaissance of Kerala, Kerala History, Kerala Basic Facts, Malayalam Literature, Malayalam Cinema, INDIA Basic Facts on India, Indian History, Indian Constitution, Indian Economy, Geology, Indian Literature, Education policies, Facts in a nutshell; WORLD Basic Facts, World History, World Geography, World Literature, International Organisations, World Cinema, GENERAL SCIENCE :- Science Basic Facts, Physics, Chemistry, Biology, Astronomy, Economics, Information Technology, 10000+ PSC Repeated Questions, 2000+ Mental Ability practice Questions, 2000+ Malayalam Language questions, 5000+ English Language questions One word Substitutions, Synonyms, Antonyms, Idioms & Phrases, Singular & Plural etc, This App Helpful For Following : Kerala PSC, KPSC, PSC, RRB, Bank, Railway, Civil Service Preliminary, PSC exam 2017, PSC Exam 2018, Assistant Grade, University Assistant, LDC, Lower Division Clerk, Sub Inspector, Company corporation board Assistant, Last Grade Company Corporation Board, Village Assistant, BDO, KAS, Kerala Administrative Service, Panchayat Secretary, BDO, Deputy Collector, Excise Inspector, Village Extension Officer, Police Constable, , Lab Assistant, CGL PSC Byjus App,  Free PSC Malayalam App, PSC Malayalam question bank, Free PSC Degree level exam preparation, Top Kerala PSC Question bank Malayalam, Kerala PSC Question bank English, PSC Gk in Malayalam, PSC Apps in Malayalam, PSC Maths, PSC Maths questions, PSC English,  PSC notifications, PSC online application, PSC Kerala, Kerala PSC exam date, PSC university assistant, latest PSC notification, Kerala PSC LDC exam 2018, KPSC online apply, PSC exam, LDC Kerala PSC, state PSC jobs, KPSC LDC 2018, Kerala PSC notification 2018, Keralapsc, one time registration, Kerala PSC vacancies 2018, Kerala PSC vacancies, Kerala PSC jobs, upcoming PSC exam 2018, Kerala PSC upcoming exams, thulasi PSC Kerala, PSC recruitment, PSC exam syllabus 2018, upcoming Kerala PSC exams 2018, Kerala PSC LDC, PSC exam notification, PSC latest notification, Kerala PSC thulasi, LDC syllabus, KPSC, Kerala PSC question papers 2018, PSC upcoming exams, PSC vacancies in Kerala, Home KPSC, Kerala PSC LDC 2018, Kerala PSC thulasi, Kerala PSC LDC notification, login Kerala PSC, thulasi.keralapsc.gov.in, Kerala PSC thulasi, Kerala PSC one time registration, Kerala PSC guide, exams Kerala, Kerala PSC previous year question papers, Kerala PSC police constable, LGS Kerala, Kerala PSC, KPSC, LGS previous question paper  Gk4success, Gkforsuccess, Gkbook Learning Solutions Features ********* Content: GK, General Knowledge & Current Affairs 2018 in Malayalam and English, English Language, Malayalam Language, Mental Ability, Numerical Ability & PSC Repeated Questions. Two lakhs+ Objective Questions & Multiple Choice Questions and Answers in Malayalam & English on GK, General Knowledge & Latest Current Affairs.  200000+ Questions 200+ PSC Model Exams. 50+ PSC Previous Question Papers Best Free PSC Malayalam App in Play Store. Completely Free PSC Malayalam, PSC English App. PSC SSLC Level and Degree Level Exams ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}