{
"name" : "Vocabulary List:Define words,Word List & Vocabula",
"url" : "https://play.google.com/store/apps/details?id=com.clearfaun.spencerdepas.vc",
"package" : "com.clearfaun.spencerdepas.vc",
"category" : "Education",
"description" : "Vocabulary List Define Words & Vocabula is a dictionary vocabulary app. You can create a custom list of words you wish to store. When you click on the words all the words details are displayed including, multiple definitions, a wiki link, synonyms & antonyms, the ability to define words, pronounce words, multiple example sentences and a searchable note section.  No vocabulary words or are included in the app. You must search for your own words.  We have an integrated Vocabulary community group connected with deep-links :  http://bit.ly/vocabulary_facebook_group  The advanced vocabulary app will find all your vocabulary word information and keep them in one centralized place.   You start with a blank slate and you only add the words you want. Learn Vocabulary you want, add the vocab to your Vocabulary List. You can then add the word and learn it in your own time. Pronounce word is available for all words. If you are a Logophile you will love this app. Start your personal vocabulary building today. Vocabulary List building makes learning words more efficient.    Over 100,000 vocab definitions, The English Lexicon  Example sentences  Multiple definitions  Thesaurus that includes synonyms and antonyms   Add notes to each vocab word and search for them   Audio pronunciations/Pronounce word  Transcriptions  The option for a daily personal notification   Marshmallow feature add words to your vocabulary list from any app  Integrated private fb group for discovering new words - works with deeplinks    A responsive developer who you can email with bugs and feature requests   Adaptive icons  Wiki button  Add words when offline   Community vocab list   Back your words up  Excellent Vocabulary Practice app  Vocabulary building to make your Vocabulary list  Perfect for a Logophile  With Vocabula Expand your Lexicon  A great Advanced Vocabulary app   Learn vocabulary  With Define add any word to your dictionary list. Target the vocabulary that is important to you. Dont waste time learning words that are not relevant. Learn the vocabulary you want by vocabulary building with this free vocabulary practice app. If you are a logophile please send me an email I would love your feedback.  Got any feedback? Have any questions? Say hi!  Your satisfaction is important to us. Any questions or comments, please email us at clearfaun@gmail.com. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}