{
"name" : "Baby Panda' s House Cleaning",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.assistant",
"package" : "com.sinyee.babybus.assistant",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Its the house-cleaning day for the baby pandas family. My dears, get your tools and help the baby panda clean the house!   Lets clean the interior first!  Melt the ice with a hairdryer. Wipe up the water before putting the sorted drinks, meat, and vegetables into the refrigerator.  Suck up the bugs with a vacuum cleaner, and then clean the toilet with detergent and disinfectant. Lastly, fix the water pipe and flush all the filth into the sewer.  Next, clean the yard!  Weed the parterre and plant a sapling. Remove the broken leaves from the strawberry plant before fertilizing. The baby panda will be able to enjoy eating strawberries under the tree in no time!   Now, help baby panda fix the furniture and home appliances in the house!  Patch the roof of the dog house and paint it. Throw away the broken gearwheels of the juicer. Install new ones and lubricate them. Remove the torn wallpaper and pick your favorite new one. Now the room becomes snug and cozy!   Thank you for helping the baby panda clean the house! BabyBus gives you this badge as a gift!   Features - 5 cleaning scenarios : kitchen, bathroom, yard, living room, dog house.  - over 40 cleaning tasks for kids to learn house cleaning. - 4 puzzles with adorable graphics.  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}