{
"name" : "Japanese Vocabulary Flashcards",
"url" : "https://play.google.com/store/apps/details?id=com.mytimeeducation.mytimejlptn5",
"package" : "com.mytimeeducation.mytimejlptn5",
"category" : "Education",
"description" : "** If you installed on Android 9 and the app crashes on startup, please clear the data and re-install. The database is corrupt and needs to be cleared. The latest version should work after that. Sorry for the delay in fixing it. **  - Master over 16,000 words in Japanese (JLPT N5 all the way up to N1)  - See both Kanji and Hiragana/Katakana readings  - App adjusts to your schedule - you wont fall behind if you miss a day or two  - Japanese->English AND English->Japanese flashcards for all vocabulary words helps maximize memorization  - Scientifically proven Spaced Repetition System helps you learn as fast as possible   This application will help you master all levels of the JLPT vocabulary as fast as possible. Guaranteed.  We use Scientific Learning and Customized Scheduling to teach you as fast as possible while making it impossible to fall behind!   SCIENTIFIC LEARNING  Youll master words faster with the scientifically proven Spaced Repetition System. If you dont know a word, or if its hard for you to remember, youll see it again sooner. If you get one right or its really easy for you, youll wait longer before seeing it again. This is proven to help you learn new information as rapidly as possible.   CUSTOMIZED SCHEDULING  1) Set the number of new flashcards you want to see each day (from 1 up to 500). Study faster or slower...whatever works for you and your schedule.  2) Our unique My Time Algorithm automatically keeps up with your study pace. If you miss a few days of practice, or even a few weeks, it wont schedule more review cards until youve finished the current set. It keeps you from falling behind and feeling discouraged.  This means you can get new cards as fast as you want, but you wont get backlogged if your study schedule gets messed up. Because, lets face it, life happens. You get sick, you get busy, or you just plain forget to study for a day...a week...two weeks.  And who wants to open the app after 2 hectic weeks and see 300+ cards waiting for you? This app works for your schedule, not the other way around.   DOWNLOAD NOW and start mastering Japanese Vocabulary! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}