{
"name" : "Dutch 5000 Words with Pictures",
"url" : "https://play.google.com/store/apps/details?id=com.language.dutch5000wordswithpictures",
"package" : "com.language.dutch5000wordswithpictures",
"category" : "Education",
"description" : " Application:  Dutch 5000 Words with Pictures  is the easy and fun new way to learn Dutch , You can learn vocabulary by seeing an images to illustrate words, with audio support phonetic transcriptions and pronunciation recordings by native speakers.  Its offline and free .No more boring when learning Dutch , vocabulary. Have fun and learn Dutch , vocabulary as easy as possible. Give it a try and download now !  Features:   The entire vocabulary has been translated into 89 languages:  Afrikaans  Albanian  Amharic  Arabic  Azerbaijani  Belarusian   Bengali  Bosnian  Bulgarian  Catalan  Chinese  Traditional Chinese  Croatian  Czech  Dutch  Dutch  Estonian  Tagalog  Finnish  French   Georgian  German  Greek  Hebrew  Hindi  Hungarian  Icelandic  Igbo  Indonesian  Irish  Italian  Dutch  Kazakh  Korean  Latvian   Lithuanian  Macedonian  Malay  Mongolian  Nepali  Norwegian  Persian   Polish  Portuguese  Brazilian Portuguese  Romanian  Russian  Serbian   Slovak  Slovenian  Spanish  Swahili  Swedish  Thai  Turkish  Ukrainian  Urdu  Vietnamese etc.  Quality audio pronunciation and images.  No internet connection required while learning (offline).  There are many mini games for you, playing game to learn Dutch .  Add all your new vocabulary to Reminder, it will remind you to learn your Dutch vocabulary daily  Commonly-used Dutch vocabularies  100% Free: No limitations of content or functions in an attempt to make you buy a paid version. Everything is free. - Please support us by leaving a good rating, or share this app with your friends on Facebook, Twitter or Google+ if you like it.  - If you have any issues regarding this app, please feel free to let us know at: kevinsmithsoftware2017@gmail.com - LIKE US: https://www.facebook.com/English5000WordswithPictures  About KevinSmith: KevinSmith: has developed many applications to help people around the world learn foreign languages for free.  Fun Easy Learn applications improve your Languages skills: speaking, listening and grammar.  The dictionary of the apps has human voice pronunciation for each common phrase to improve your speaking skill. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}