{
"name" : "Repeat player WorkAudioBook",
"url" : "https://play.google.com/store/apps/details?id=com.povalyaev.WorkAudioBook",
"package" : "com.povalyaev.WorkAudioBook",
"category" : "Education",
"description" : "WorkAudioBook is the best audiobook player / podcast player designed specifically FOR LANGUAGE LEARNERS who are listening English or ANY OTHER LANGUAGE. What it does:  -- Automatically splits audiobook into PHRASES; -- Allows you to change PLAYBACK SPEED (Android 6.0+); -- Can make AUTO-PAUSES between phrases; -- Can AUTO-REPEAT phrases, files, folders; -- Supports SUBTITLES and secondary subtitles and integration with many DICTIONARY apps; -- Has NOTES for files and folders to put there text of your book, list of characters, words to learn; -- Supports BOOKMARKS with TAGS; -- Supports HEADSET button; -- Opens folders and supports PLAYLISTS; -- Shows audio as a WAVEFORM and allows you to select and listen to any fragment and even an individual word; -- REMEMBERS where you stopped and list of recent files.  All these features work with any MP3 file that you have in the memory of your device.  App works with files in ANY foreign language, not only English. User interface is optimized for both PHONES and TABLETS.  Full version -- $4.95 (in app menu choose Purchase), first two weeks are free of charge. There is also fully FREE version for WINDOWS  http://www.workaudiobook.com NO ADS. Learn a language with pleasure! :)  Write your opinion and suggestions to my E-MAIL  your responses are valuable for me!  You can listen and repeat audiobooks or podcasts in any of these foreign languages: English, French, Spanish, German, Russian, Mandarin, Chinese, Arabic, Portuguese, Japanese, and more! The app has Download functionality that allows you to download several popular classical English audiobooks from LibriVox, and train your English listening and speaking skills! With smart pause and AB repeat functionality you can improve your pronunciation and articulation easily! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'com.android.vending.CHECK_LICENSE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}