{
"name" : "Inglés de negocios gratis",
"url" : "https://play.google.com/store/apps/details?id=com.mosalingua.enbusifree",
"package" : "com.mosalingua.enbusifree",
"category" : "Education",
"description" : "Siempre has deseado aprender ingls de negocios de forma fcil y ldica? Desde MosaLingua queremos contribuir a que tu aprendizaje de ingls sea mucho ms sencillo. Por esto hemos desarrollado un curso de ingls de negocios completo que te permitir aprender todo lo que necesitas saber para ingls en el mundo laboral en poco tiempo.  MosaLingua es un mtodo eficaz para aprender o mejorar tu nivel de ingls aunque solo cuentes con algunos minutos al da para realizar tus revisiones.  Trabajas en el servicio al cliente, marketing, ventas o publicidad? Eres profesional en recursos humanos, contabilidad o finanzas? Tu especializad son las compras, la informtica, la logstica o la produccin? MosaLingua ingls de negocios se concentra en el vocabulario y en las competencias esenciales y necesarias en el ambiente laboral:   Hablar por telfono en ingls  Escribir emails en ingls  Mantener contacto en ingls con tus compaeros, clientes y socios  Organizar reuniones en ingls  Realizar con xito una entrevista de trabajo en ingls  Aprender a negociar en ingls   LO MS DE DESTACADO DE MOSALINGUA:  1) Contenido til y prctico: No pierdas el tiempo con nociones que no te darn resultados. Aprende el 20% del vocabulario ingls de negocios necesario en el 80% de las situaciones! Adems, t decidirs qu contenido quieres aprender y descartar el que no te interese.  2) Mtodo innovador y basado en estudios cientficos: Nuestro equipo internacional est compuesto por polglotas expertos que han probado las tcnicas de aprendizaje y memorizacin ms modernas (sistema de repeticin por espacios, active recall, metacognicin, etc) para tu curso de ingls.  3) Acompaamiento asegurado durante tu aprendizaje: Para ayudarte a tener xito en tu aprendizaje, te proporcionaremos consejos que contienen pequeas lecciones de ingls para aprender vocabulario ingls de manera eficaz.  4) Aprende mientras te diviertes: Obtn resultados rpidos estudiando ingls y de manera ldica. Cada uno de tus progresos, aumentar tu MOTIVACIN, elemento esencial en todo aprendizaje.  No esperes ms y prueba gratis la aplicacin de MosaLingua ingls de negocios. Estamos seguros que cumpliremos con tus expectativas.  Si necesitas ayuda o si tienes alguna sugerencia sobre la app de MosaLingua, no dudes en visitar nuestra web: https://mosalingua.com/es o escribirnos a support_es@mosalingua.com Nos encantar ayudarte! Have you always wanted to learn business English easily and playfully? From MosaLingua we want to contribute to making your English learning much easier. That is why we have developed a complete business English course that will allow you to learn everything you need to know for English in the working world in a short time.  MosaLingua is an effective method to learn or improve your level of English even if you only have a few minutes a day to make your revisions.  Do you work in customer service, marketing, sales or advertising? Are you a professional in human resources, accounting or finance? Do you specialize in shopping, computing, logistics or production? MosaLingua business English focuses on vocabulary and essential and necessary skills in the work environment:   Talk on the phone in English  Write emails in English  Maintain contact in English with your colleagues, clients and partners  Organize meetings in English  Successfully conduct a job interview in English  Learn to negotiate in English   MOST OUTSTANDING OF MOSALINGUA:  1) Useful and practical content: Do not waste time with notions that will not give you results. Learn 20% of the English business vocabulary needed in 80% of situations! In addition, you will decide what content you want to learn and discard the one that does not interest you.  2) Innovative method and based on scientific studies: Our international team is composed of expert polyglots that have tested the most modern learning and memorization techniques (space repetition system, active recall, metacognition, etc.) for your English course.  3) Secured accompaniment during your learning: To help you succeed in your learning, we will provide you with tips that contain small English lessons to learn English vocabulary effectively.  4) Learn while having fun: Get quick results by studying English and playfully. Each of your progress will increase your MOTIVATION, an essential element in all learning.  Dont wait any longer and try the MosaLingua English business application for free. We are sure that we will meet your expectations.  If you need help or if you have any suggestions about the MosaLingua app, do not hesitate to visit our website: https://mosalingua.com/es or write to us at support_es@mosalingua.com We will love to help you! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.mosalingua.enbusifree.permission.C2D_MESSAGE', 'android.permission.READ_PHONE_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'com.htc.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.sec.android.provider.badge.permission.WRITE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.RECORD_AUDIO', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.READ_APP_BADGE', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}