{
"name" : "Blarma – English Vocabulary",
"url" : "https://play.google.com/store/apps/details?id=com.blarma.high5",
"package" : "com.blarma.high5",
"category" : "Education",
"description" : "Welcome to the English vocabulary learning and memorization app. With Blarma you can learn 300 words every month and improve your pronunciation. Do you want to learn British English or American English? Make your choice and learn English words with fun!   Download the English vocabulary app and try it for free.  The perfect English learning program for beginners. Improve your vocabulary by listening, writing and pronouncing. Blarma has all the necessary features.   Audio-Visual Learning: Learn English language with pictures. Watch short videos to better understand some words. Listen to the native pronunciation of word. The information you see, hear and associate is forgotten later than the others.   Limitation of Daily Learning: Learn 10 words every day to improve your vocabulary. It is important that you learn in a balanced way. More words learned do not mean that you can always remember them. Therefore, the number of words you can learn has a daily limit.  Question-Based Learning: Courses are designed to learn vocabulary with fun. Start the lesson by choosing new words. Learn basic English language skills. See, listen, write and pronounce all words. Once youve learned the words, complete the lesson by answering questions.   Skill Scoring System: At the end of each lesson, you can examine your success and mistakes in detail. By doing the activities you need, you can quickly correct your mistakes and improve your skills.  Free Activities: - Pronunciation practice - Writing practice - Listening practice - Memorization exercise  Spaced Repetition System: As you learn new words, you begin to forget the old ones. You dont have to repeat all the words. Blarma reminds you of the words you are about to forget.  ____________ We have collected the most common English words (verbs, adjectives, nouns, etc.) under 15 thematic titles according to 3 difficulty levels. All words have been translated from English to 8 languages: Spanish, French, Russian, Arabic, Hindi, Turkish, Indonesian and Vietnamese.  If you have any questions about the English vocabulary app Blarma, please send an email to appblarma@gmail.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}