{
"name" : "Audio Stories to Sleep: +200 Stories for Kids FREE",
"url" : "https://play.google.com/store/apps/details?id=com.kaboom.apps.childrens.audiobooks",
"package" : "com.kaboom.apps.childrens.audiobooks",
"category" : "Education",
"description" : " AUDIO STORIES TO SLEEP IN ENGLISH FREE   Dear parents, if you are looking for a way for your sons and daughters to fall asleep in a matter of minutes, you have just found the free audio bedtime stories for kids which will make it possible thanks to their more than 200 audiobooks from audible, that fall into the most deep from sleep. We have all kinds of stories, be it audio tales to sleep, stories with morals, listening for kids, short stories for children, long stories and many more childrens audiobooks that you can find by downloading our App on both your mobile and tablet.  Within our App youll be able to find a a great variety of free fairy tales for kids to listen to, with a totally clear sound in MP3 format and with a fairly simple interface which you can use even the smallest of the House. With over 200 stories for kids FREE, we are the application that currently has a greater variety and that is why we encourage you to download the App and listen to the best audiobooks for free. If we have not yet convinced you, then we will leave you with the books that our users have listened to the most in the last 30 days.   AUDIO STORIES IN ENGLISH FREE MORE LISTEN IN THE LAST DAYS   1   Little Red Riding Hood 2   The Three Piglets 3   Hamelins flutist 4   The Ugly Duckling 5   Goldilocks 6   Cinderella 7   The Cat in Boots 8   Hansel and Gretel 9   Snow White and the 7 Dwarfs 10   John without fear  Once youve shown the most played audio books for kids within our app, you may also want to know the list of features that make our App unique and the best you can find on Google Play so your kids Go to sleep always having fun while listening to the best children tales.   FEATURES OF OUR AUDIO STORIES FOR KIDS FREE    Audiobooks in English and Spanish.  Audio stories with moralands and values.  Moral stories for kids.  We have over 200 audio stories to sleep for FREE in our App.  Simple to use and quite fast interface.  Our App has an effective fairy tales finder to be able to find any story at any time.  Play, Pause, and Stop buttons in a custom-designed player.  Push Notification every time new audiobooks from audible free are added to the App.  Maximum quality in MP3 audios of each audiobooks free app in english.  You can play free audio bedtime stories for kids with the screen locked or even leaving the App in the background.  If you see all these features of the english listening for kids app and seeing the most listened stories audio ranking within our app, you still havent downloaded this app on your Android device, we dont know what youre waiting for. Click Install this App on your device and enjoy the best kids stories in english free audio of all ages, even any adult can relive their childhood by listening to these audio stories with values and morals for free.    LEGAL: Any questions or suggestions you have about our FREE Audio Books for Kids, you can contact us via Email: contact@kaboomapps.info. We will solve your doubts in less than 24 hours   ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.kaboom.apps.childrens.audiobooks.permission.C2D_MESSAGE', 'android.permission.FOREGROUND_SERVICE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.READ_APP_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'me.everything.badger.permission.BADGE_COUNT_WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}