{
"name" : "Speechling - Learn to Speak Any Language",
"url" : "https://play.google.com/store/apps/details?id=com.speechling.speechling",
"package" : "com.speechling.speechling",
"category" : "Education",
"description" : "Get free pronunciation coaching with dictation, flashcards, cloze tests, quizzes, and listening comprehension for Spanish, French, Italian, Japanese, Chinese, German, Russian, Korean, Portuguese and English.  Want to sound native fast? Speechling skips the vocab lists and grammar rules.  Get immersed with Speechling: pronunciation coaches, daily feedback, advanced algorithms, and mindblowing endless content.  We have a web and iOS version as well.  ----------  Speechling is a 501(c)3 educational nonprofit based in California, USA.  We are committed to providing the highest quality free language education to anyone in the world.  ----------  How it works:  1. Listen to a native speaker, of either gender, say a sentence. 2. Record yourself on the microphone. 3. Get feedback within a day. 4. (Soon) Have others think youre native.  ----------  The Speechling Method  With a foundation in our mission, the Speechling Method uses a combination of technology and human coaching to help our students learn new languages.  We place an emphasis on speaking, because of the lack of free and affordable tools for helping people speak. By breaking down spoken language barriers, we hope to increase access to education, employment opportunities, and a better quality of life.  ----------  Immersion  As a technology platform, were available as an educational tool 24/7. Speechling uses spaced repetition and sophisticated algorithms to let our users practice from thousands of sentences with real human voices from both genders.  Unlike other for-profit companies, our platform is entirely free - for eternity. We aim to be build the best platform to learn a language with spaced repetition and adaptive learning algorithms.  ----------  Personal Feedback  As a personal tutoring service, our certified pronunciation coaches give feedback on your speaking within 24 hours. Advanced students can answer a question or describe an image, and we will give feedback similar to what a private tutor will provide.  Unlike other for-profit companies, our coaching is also free - but because it has significant overhead costs, we charge just enough to cover our costs and for those who demonstrate that they cannot afford that price, we provide full scholarships. ",
"desc_perms" : "['android.vending.BILLING']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.google.android.c2dm.permission.RECEIVE', 'host.exp.exponent.permission.C2D_MESSAGE', 'com.speechling.speechling.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'host.exp.exponent.permission.C2D_MESSAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}