{
"name" : "Konceptca - CPT trainer (Free)",
"url" : "https://play.google.com/store/apps/details?id=com.ekoncept.konceptedu",
"package" : "com.ekoncept.konceptedu",
"category" : "Education",
"description" : "Introducing the most comprehensive CA CPT coaching - free forever.  With 90,000+ Students trusting our CA CPT CLASSES, this app is 1 stop solution to all your CA CPT requirements. Within seconds do a CPT registration with us on this app and get the following benefits   1. Get Study Videos for CA CPT complete Syllabus 2. Unlimited CPT Practice MCQs with complete description & solution, compiled by All India rankers after a lot of research & digging. Once, you do our practice, you will not require any other CPT reference book or CPT model test paper. 3. If have any doubts while practice, just add that question in doubt kart, we will resolve it by way of a video solution. 4. Unlimited CPT Mock Tests  chapter wise, subject wise & paper wise. 5. In the end, solve the CPT previous year exam papers with complete solution. 6. Get most amazing tricks and methods to solve CA CPT exam papers 7. Updates on new CA CPT syllabus  Yeah .. BTW this all is completely FREE !!   THE PASSION FOR HELPING STUDENTS IN EACH AND EVERY WAY and to do that WE WILL KEEP ON IMPROVISING OURSELVES.   Koncept Education considers Real Teaching where Real teaching is not teaching standard methods, its giving student the power to develop his own methods.  Often students take studies as boring unless it is in some pressure or fear of approaching examination date. If some mechanism is made through which a student is instigated and motivated to start studying on his / her own, then that is the real victory of our team.   We continuously strive for creating such mechanism so that the learning is kind of an experience and he is compelled to study with us (NOT OUT OF THE FEES THAT HE PAYS US BUT THE AMAZING LEARNING EXPERIENCE THAT HE CHERISHES). He should be happy and deeply satisfied that he is associated with us.   With this simple & easy approach students success in CPT is ensured.  For our team - STUDENTS ARE OUR BIGGEST TREASURE. They are of the up-most importance and we will go out to any way to help them and provide them lateral learning by teaching them not just the text book material but beyond that as well. This happens by the tools that we provide them.  With this thought in mind, the brainchild Koncept Education has been crafted. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}