{
"name" : "Prepscale: Kerala PSC Preparation App",
"url" : "https://play.google.com/store/apps/details?id=com.prepscale.app",
"package" : "com.prepscale.app",
"category" : "Education",
"description" : "Prepscale app is the best yet simple platform for online Kerala PSC preparation. We offer a comprehensive learning experience with specifically designed study materials, video lectures by more than 24 prominent subject matter experts and many more features. The app also has user-friendly mock tests and quizzes prepared by rank holders and subject experts to revise the learning and achieve your goals to secure a government job.  Detailed analysis of each test will make you concentrate more on the weaker areas.  Available both in Malayalam and English languages, currently the Apps focus is on various Kerala PSC examinations including the recently announced Kerala Administrative Service Exam.  Courses offered   Kerala PSC LDC/ Fireman trainee   Kerala PSC LPSA/UPSA   Kerala Administrative Service (KAS), etc  Our top features include   Video classes by more than 24 prominent & well experienced teachers   Video classes divided into topics and subtopics for easy grasping   School textbook (SCERT & NCERT) based classes   Offline Download (no buffer no suffer!)   Practice tests after each topic based on previous exams and expectant questions to tell you exactly how well you have learned   100s of mock test prepared by experts with detailed analysis   100s of previous exams   Detailed explanations for mock tests, previous exams and practice questions   Daily GK Quiz   Daily Current Affairs Quiz   Daily English and Malayalam Vocabulary   Live tests   Bookmark Questions/videos/news   All Kerala Rank List for all tests   Ask & Clarify your doubts   Important Job alerts   PDF notes (coming soon)  Scale up your preparation with prepscale ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'com.android.vending.CHECK_LICENSE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'com.android.vending.CHECK_LICENSE']",
}