{
"name" : "Kids Construction Game: Educational games for kids",
"url" : "https://play.google.com/store/apps/details?id=com.androbaby.kidsconstructiongame",
"package" : "com.androbaby.kidsconstructiongame",
"category" : "Educational",
"description" : "Kids learning game has three educative sections and include learning games for toddlers age 3. These are memory games for toddlers, brain games for toddlers and drawing games for toddlers. Boys will love these games. Construction games for kids is a unique game with various structures, construction machines and tools. Construction game is very special in boys games and the best boys game with many features and different than classic children games.  All Preschool Games and Kids Games - Memory games for kids: Kids will make brain exercise by playing memory matching game with structures, construction machines and tools. - Brain games for kids: Toddlers will practice by trying to find the correct construction item. - Drawing game for kids: Kids will draw on empty canvas or on different construction shapes. Kids coloring apps for toddler has different sections. They can use various colors for drawing and can save their drawings. This section is a doodle for kids.  - Toddler games for kindergarten kids have 3 kids construction flashcard categories (structures, machines, tools) - Learning games for toddlers age 3 will allow your child to meet the common structures (house, airport, factory, bridge etc.), machines (bulldozer, concrete mixer, forklift, dump truck etc.) and tools (bricks, cement, hammer, helmet etc.).  - Preschool games for little kids stimulates the childs senses through images, sounds and touch. - Professional pronunciation of words for childs correct learning different than other learning games for kindergarten free. - Nice animations and real sounds of construction machines and tools! - Construction games for kids offline and no need for wifi. - Games for boys should have many items for boys interest. Boy games come with many vehicles and interesting construction items as a unique children game.  Educational games for toddlers is not just another toddler learning game for kids. This game is ideal for parents and children to play and enjoy together. Playing is so easy that even a baby can do it without the help of an adult. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
}