{
"name" : "Maple Companion: Calculator & Solver",
"url" : "https://play.google.com/store/apps/details?id=com.maplesoft.companion",
"package" : "com.maplesoft.companion",
"category" : "Education",
"description" : "Solve math problems, check homework, explore graphs with a powerful calculator   Maple Companion is your ultimate calculator and math learning tool, whether you are doing simple calculations or working on university-level math problems. It is a scientific calculator, a differentiation and integration calculator, a matrix calculator, a polynomial manipulation tool, an equation solver, a graphing tool, and so much more! This versatile app makes it incredibly easy to enter, solve, and visualize mathematical problems from algebra, precalculus, calculus, linear algebra, and differential equations, for free! You can even enter problems using your camera, so you can check your homework with a click of a button. This app is your essential companion to help you learn math, whether you are in a classroom or learning from home.  Key Features   Just click to enter your math: Enter handwritten and typeset math problems at the click of your camera using powerful AI technology. Or, enter your expression into the calculator using the same mathematical notation your teacher users  your problem is easy to enter because it looks right!  Do all sorts of math: No matter how you enter your problem, you can find integrals, factor polynomials, invert matrices, solve systems of equations, solve ODEs, and much more. The app has the power of the world-leading Maple math engine behind it, so it can do a LOT of math!  Graph problems and results: See graphs of your expression instantly, and watch how the graph changes as you change the expression. You can even zoom in to get a closer look.  Get answers even when youre offline: Some aspects of the app require an internet connection, but you can use the powerful graphing calculator anytime!  Avoid transcription errors when using Maple desktop: Avoid the mistakes that can occur when transcribing mathematical expressions into Maple manually, by taking a photo in the app and uploading the results into Maple for further explorations and visualizations  International language support: Available in English, Spanish, French, German, Russian, Danish, Japanese, and Simplified Chinese  Math Capabilities  The Maple Companion uses the world-renowned Maple mathematics engine, so it can solve many kinds of problems, including: Basic Math: Arithmetic, fractions, decimals, integers, factors, square roots, powers Algebra: Solving and graphing linear equations, solving and graphing systems of equations, working with polynomials, quadratic equations and functions, logarithmic and exponential functions, trigonometric functions, trigonometric identities Precalculus: Graphing, piecewise functions, absolute value, inequalities, implicit functions Calculus: Derivatives, limits, definite and indefinite integrals Linear Algebra: Matrix multiplication, inverse, determinant, transpose, Gaussian elimination Differential Equations: Ordinary differential equations and much more! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.CAMERA']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "[]",
}