{
"name" : "Airport Adventure 2",
"url" : "https://play.google.com/store/apps/details?id=com.PSVStudio.Airport2",
"package" : "com.PSVStudio.Airport2",
"category" : "Educational",
"description" : "Kids Hippo games about airport are popular educational apps for toddlers. Travelers find adventures by themselves! Today Daddy Leo has bought a lottery ticket. What a pleasant surprise is waiting our favorite heroes this time? Hippo scratches the protective type and wins Super prize, a great trip for the whole family! Now this is time to pack the luggage and go to the airport. Exciting adventures for boys and girls are waiting for us!  Free kids games are renewed with a remarkable novelty. This time, Hippo and the whole family goes to the airport to start their funny adventure. In this collection are included educational games united with a topic  hidden objects. These apps are suitable for boys and girls, they develop attention and coordination of toddlers. And all this takes place unobtrusively. We add the pleasant music, funny characters, various adventures and everybody will get a lot of fun, conducted with great benefit for you and your kids.  So, Hippo has won a great trip. What do we have to do next? First of all, we will help our characters to pack their bags. Put things scattered around the room into suitcases of all the family members. And then lets jump in the car and drive to the airport, where wonderful and exiting adventures will be waiting for us! All the things need to be checked on a special scanner before departure. After that, we will fly to another airport located in a far away country. And an another great kids game from the hidden objects series is waiting for us on the other end of the world. Our heroes will need to pick up their luggage. And this time, another funny element is added, where players develop their intelligence. Our characters are not the only ones to pick up the luggage. Funny pandas may accidentally remove one of the bags of our heroes from the conveyor belt. Ji is also being naughty today. He can take other passengers suitcases because he is bored. Be careful to make sure that everyone has got their own bag.  Are you ready to go on a long journey? Then - full ahead! Have a lot of positive emotions with your family! Stay tuned and stay with us. Our free kids games will always make you happy! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'com.PSVStudio.Airport2.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}