{
"name" : "InterviewReady",
"url" : "https://play.google.com/store/apps/details?id=com.tcs.interviewready",
"package" : "com.tcs.interviewready",
"category" : "Education",
"description" : "Get ready for a confident job interview in the company of your most trusted buddies, with our free award-winning app, InterviewReady  Use the language guides in Arabic, Assamese, Bengali, English, Gujarati, Hindi, Kannada, Kashmiri, Malayalam, Marathi, Odiya, Portuguese, Spanish, Tamil and Urdu for a smooth journey.  Improve and practice your English language skills with our powerful mix of lessons and games. Use our world of information, knowledge and inspiration to prepare for a corporate career.  Build an industry standard resume using our resume-builder and start applying for jobs.  InterviewReady is the winner of:  Gold  Stevie Award 2016, Professional Education Category  Gold  Brandon Hall 2015, Best Use of Mobile Learning  Features - Vernacular guides in 14 Indian and international languages. - Study Buddy-Groups for learning together. - Study Bag containing all preparation material. - Knowledge of 20+ business domains in IT IS and BPS, familiarisation with industry jargon. - Daily digest of videos, articles, posters and brain teasers. - Practical, scenario based English lessons in only 8 modules. - Sample sentences for you to read, record and replay and track your improvement. - 3 levels of exciting games to play and get InterviewReady. - Easy to use resume-builder to build a world class resume.  InterviewReady is awesome and its free. So what are you waiting for, download right now and get interview ready!  Write to us at interview.ready@tcs.com Facebook: https://www.facebook.com/InterviewReady Twitter: Interviewready_ Instagram: Interviewready  Important Note Regarding Permissions  Please note that the InterviewReady app requires access to the following Android permissions to operate properly:  * RECEIVE_BOOT_COMPLETED - This permission is used to check if the Android device has booted or not. InterviewReady can then perform initialisation of the local notifications. * WRITE_EXTERNAL_STORAGE - This permission is used to create the folder required by the app on your storage device. * READ_CONTACTS - This permission is used to invite your friends to play English activity games. * READ_EXTERNAL_STORAGE - This permission is used to read the contents of the folder created by the app on your storage device. * GET_ACCOUNTS - This permission is used to retrieve your Facebook and Google accounts when registering or when using a social media login. * RECORD_AUDIO - This permission is used to record and playback audio in the English lessons section. * READ_PHONE_STATE - This permission is used to pause audio recording or playback when a phone call is received or made. * VIBRATE - This permission is used when a new notification is received or when a wrong answer is submitted in the English activity games. * USE_CREDENTIALS - This permission is used to connect to your Google account. * INTERNET - This permission is used to retrieve latest posts on the home noticeboard, used for group activities and upload your resume for sending to your email ID. * ACCESS_NETWORK_STATE - This permission is used to check if your device is connected to Wifi or mobile data so that embedded videos can play smoothly.  Minimum Specs:  Min OS 4.4, 320x480 Screen Resolution.  Tablet users may find UI variance. Display of regional languages may vary based on your devices built-in language support.   2018 Tata Consultancy Services. All rights reserved. InterviewReady is a registered trademark of Tata Consultancy Services Limited. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'android.permission.READ_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.tcs.interviewready.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.USE_CREDENTIALS']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}