{
"name" : "1100+ Spelling Quiz for spelling learning",
"url" : "https://play.google.com/store/apps/details?id=com.ackad.kidsspellingquiz",
"package" : "com.ackad.kidsspellingquiz",
"category" : "Education",
"description" : "1100+ Spelling Quiz is for Kids to learn spelling as well as typing. 1100+ spellings to learn with pictures. Spelling correct and incorrect checking with sound. We have designed kids keyboard especially so they can understand which fingers to use for typing. While pressing key it also plays sound of key.  Kids will also learn how to pronounce words as we have included text to speech engine. There are two types of keyboards included capital and small letters. Free to play any levels. Very easy and useful application for spellings learning with picture. Shows the help of each spelling if you done know.  Features 1. 1100+ spelling included with below categories. 2. Learning Animals spellings. 3. Learning Fruits spellings. 4. Learning Vegetables spellings. 5. Learning Body Parts spellings. 6. Learning Numbers spellings. 7. Learning Flowers spellings. 8. Learning Birds spellings 9. Learning Transportation spellings. 10. Learning Months spellings. 11. Learning Days spellings. 12. Learning Shapes spellings. 13. Learning Colors spellings. 14. Learning Domestic Animals spellings. 15. Learning Three letters words spellings. 16. Learning Four letters words spellings. 17. Learning Five letters words spellings. 18. Learning Six letters words spellings. 19. Learning Doctor and Hospital spellings. 20. Learning Kitchen spellings. 21. Learning Planets and Space spellings. 22. Learning Computer parts spellings. 23. Learning Office items spellings. 24. Learning Living Room items spellings. 25. Learning Bathroom Items spellings. 26. Learning School Items spellings. 27. Learning Professions (Jobs) spellings. 28. Learning Indoor Activities spellings. 29. Learning Outdoor Activities spellings. 30. Learning Water Animals spellings. 31. Learning Food Items spellings. 32. Learning Countries spellings. 33. All thirty-one categories of spellings are free. 34. All categories have high quality images. 35. Speak It button will speak the spelling. 36. Help Me button will show spelling in case kids dont know. 37. Delete and eraser button to remove single or all typed characters. 38. Settings to enable or disable key sound and text to speech. 39. Use next and previous buttons if you want to skip spelling.  for any feedback send us mail to ACKADinfo@gmail.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}