{
"name" : "Practise",
"url" : "https://play.google.com/store/apps/details?id=com.dlapp.practise",
"package" : "com.dlapp.practise",
"category" : "Education",
"description" : "The Practise app helps you memorize vocabulary from the English designed with Direct Method coursebook series. The vocabulary is arranged according to various thematic categories. You can choose which coursebook you want to study words from, helping you easily find and memorize more words.  For your convenience, in each thematic category words are divided into small 4-word chunks so that you can learn more effectively.  New technology in language learning The Practise app uses the latest technology to improve the process of acquiring a foreign language. It enables you to use your smartphone to advance your English in any place at any time  Internet access is enough to start your lesson.  How does it work? The app is mostly about practicing vocabulary. Three exercise types will facilitate the rapid retention of learnt vocabulary. You will also be able to listen to the correct pronunciation recorded by native speakers. The meaning of each lexical item is shown with a picture which helps to understand it. In the following exercises you will be able to check if you have memorized the meaning and pronunciation of words. All the exercise types have been especially designed for smartphones and are easy to use. The result will be shown as an emoticon.  When should the app be used? As a matter of fact the application should be used as often as possible. If you have time to spare, why not spend time practising vocabulary with this app? We strongly advise using the app before revision lessons and before exams. Remember, continuous repetition guarantees success in consolidating vocabulary in your long-term memory. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCOUNT_MANAGER', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.HARDWARE_CONTROLS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCOUNT_MANAGER', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.HARDWARE_CONTROLS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}