{
"name" : "Unicorn Popcorn Maker- Crazy Popcorn Popper",
"url" : "https://play.google.com/store/apps/details?id=com.funpop.android_popcorn",
"package" : "com.funpop.android_popcorn",
"category" : "Education",
"description" : "Unicorn Popcorn Maker- Crazy Popcorn Popper is a street food game for little girls.By this palomitas game you can become a star food stylist of the cooking world.Popcorn is always seen as movie snack,but little girls also enjoy eating sweet popcorn as street food or fair food.In this popcorn game,little chef,yes,its you,can DIY unicorn popcorn with popcorn maker.That is Super Surprise for all the girls and boys!This rainbow popcorn is not only street food but also unicorn food,especially for those unicorn girls.Want to know how to make these rainbow honey snack?Lets play the game for ms rainbow to pop the corn with colors of rainbow.  Popcorn Game Features:  1.Popcorn making mania!Lets make the colorful popcorn in this fun cooking girly game!  Palomitas with your friends in the popcorn game.  2.Cooking popcorn is super fun!This tasty snack is popular in real food street and mobile food making games.Right? 3.Wow!Time for popcorn ratings! Youre the best.Rainbow Corn! I believe youve never seen rainbow corn in any other food maker game or unicorn games. 4.Create some crazy colorful popcorn with popcorn popper.Choose your favorite flavor drop in the popcorn maker!Different flavors,different colors!Find your surprise color in the game for girls.  5.Most girls love rainbow popcorn!Lets rainbow it right now!And it is easy for this unicorn food game,with rainbow corn,you will get rainbow popcorn. 6.Rainbow popcorn maker,as one chef food maker, is fun and easy to cook those unicorn food especially for little girls.  7.As a professional popcorn chef in the street food maker,you have to prepare yummy colorful popcorn for every girl. Be the best Popcorn popper and serve customer now! 8.Design your rainbow popcorn bucket personality while decorate it with unicorn ear,unicorn horn and unicorn eyes.You will make the best unicorn food and eat it in the movie night. Dont forget add the cream soda, you will love it! 9.It is true that unicorns love rainbow.Where is unicorn,where is rainbow.So the popcorn game is a unicorn game and also a rainbow game for little girls. 10.Besides,tons of cute toys and shining glitter toppings are available to have more fun.Show your creation! 11.Food party time!So many colorful cool soda drinks are here for little girls!Cola,blue,purple,yellow, rainbow and also galaxy color! I love this cool drinks with bubbles.  12.Learn the process of making crazy colorful snack of glitter unicorn popcorn.Make a flappy unicorn snack as you like in this fun game for girls. 13.Street food is also to be made as carnival snack or fair food for girls.Undoubtedly,the most popular one is popcorn!  Youre the best popcorn maker and you can sell snacks in food street.Little girls,lets make and design the best unicorn food - rainbow popcorn in this food making game right now. Download this popcorn game for girls TODAY!  ABOUT FunPop  FunPop are specialize in kids games on mobile platform. We are aiming to provide innovative & educational game for the whole family. We help them to learn the basic life skills and good habits through our games.  Visit us:http://www.funpop.com.cn Watch us: https://www.youtube.com/c/FunPopMedia  CONTACT US Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@funpop.com.cn ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.funpop.android_popcorn.permission.C2D_MESSAGE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.GET_TASKS', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_PHONE_STATE']",
}