{
"name" : "Most Holy Rosary Prayer Audio",
"url" : "https://play.google.com/store/apps/details?id=com.Best.Catholic.Apps.Holy.Rosary.Prayer.audio.offline",
"package" : "com.Best.Catholic.Apps.Holy.Rosary.Prayer.audio.offline",
"category" : "Education",
"description" : "About The Most Holy Rosary Prayer  Offers you the best Holy Rosary Prayers app for Android gadget. High quality audio with text so you can have deep knowledge about Catholics Holy Rosary prayer. Use your Rosary bead and follow the prayers. Embrace the holy experience with God in most intimate way. One of the best app availabe for Catholic faith.  The Rosary is divided into five decades. Each decade represents a mystery or event in the life of Jesus. There are four sets of Mysteries of the Rosary (Joyful, Luminous, Sorrowful, and Glorious). These four Mysteries of the Rosary therefore contain, a total of twenty mysteries.  The Joyful, Luminous, Sorrowful, and Glorious Mysteries are then said on specific days of the week. During private recitation of the Rosary, each decade requires devout meditation on a specific mystery. Public recitation of the Rosary (two or more people), requires a leader to announce each of the mysteries before the decade, and start each prayer.  Key Features  * Quality offline audio. Can be listened anywhere and anytime even without Internet connection. No need to stream each time which is a significant saving for your mobile data quota.  * Transcript/Text. Easier to follow, to learn, and to understand.  * Shuffle/Random Play. Play randomly to enjoy unique experience each time.  * Repeat/Continuous Play. Play continuously (each or all). Give a very convenience experience for user.  * Play, pause, and slider bar. Allows user to have fully control while listening.  * Minimal Permission.It is very safe for your personal data. No data breach at all.  * Free. No need to pay to enjoy.  Disclaimer All of content in this application is not our trademark. We only get the content from search engine and website. The copyright of all content in this application is fully owned by the creators, musicians and music labels are concerned. If you are the copyright holder of the songs contained in this application and are not pleasing your song displayed, please contact us via email developer and tell us about the status of your ownership. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}