{
"name" : "Essential English Vocabulary Builder. Learn Words",
"url" : "https://play.google.com/store/apps/details?id=com.arturagapov.englishvocabulary",
"package" : "com.arturagapov.englishvocabulary",
"category" : "Education",
"description" : "Learn English 3000 is an app for building up your vocabulary with new English words.  English is the most widely spoken as a second language. You can use it in formal situations: in business, education, traveling, shopping, medicine as well as in informal ones like communication with company of friends etc. And this app helps you to pick up and practice the most essential vocabulary for this.  2 billion people speak English daily. But they often face the same challenges. How to activate already acquired knowledge in colloquial speech? How to use an appropriate word according to the context without misspelling or orthography mistakes?   This app is great for beginners and advanced learners of English who want to reach the level of a native speaker. Also, it will be useful for those who want to find work or get a higher education in the US. This is a great way of preparation for passing TOEFL, IELTS and other tests successfully.  Key Features: Interval repetition method Selected most important words in English speech Over 30k examples of using words in everyday speech Interval repeat calendar Individual lesson schedule Scheduled class notifications Exciting exercises to consolidate skills and tests for knowledge   How will you master the words with this app?  There are many exercises in the app for memorizing words. There are flashcards with words in the first part of the lesson. You can listen to the correct pronunciation, take a look at the meaning and 10 examples of usage. If you already know this word, you can skip it and proceed with the next one. After that you should pass a test to consolidate the learned words to define your weakest points. In the third part of the lesson you need to put the missing word into the sentence. These examples present quotations from popular English publications. You can also choose a goal for the day and track your progress with a convenient interface. So that you dont forget about the revising, we have added notifications.  Each year scientists from the University of Oxford compile a list of 3000 the most used words in the English language. You can memorize all these words using our app.  Write to us in support: english3000app@ukr.net We welcome your feedback and high ratings. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}