{
"name" : "TopperLearning",
"url" : "https://play.google.com/store/apps/details?id=com.topperlearning",
"package" : "com.topperlearning",
"category" : "Education",
"description" : "TopperLearning App  Get More Marks For CBSE/ICSE Class 6th to 10th  Access the most important questions and resolve all your doubts with a smart app Now you dont need to go to tuition classes only to collect study notes, to understand concepts better or to get solutions to difficult questions in the textbook. Download the TopperLearning App to enjoy the myriad benefits of mobile learning with all the study resources for the best K-12 education at any time.   With easy access to video solutions, most important questions, NCERT solutions, practice tests and sample question papers, CBSE students in Class 6 to 10 can change the way they learn with the TopperLearning App to reap all the benefits of online education.   Download the TopperLearning App to access  Video solutions  Textbook solutions (NCERT, RD Sharma)  Topic notes and revision notes  Practice tests  MCQs and SAQs  Most important questions  Sample papers  Past year papers (for CBSE Class 10 only)  Pre-board practice tests (for CBSE Class 10 only)  Weekly tests (for CBSE Class 9 and 10 only)  In-video assessment (for CBSE Class 9 and 10 only)  Learning does not have to be traditional; try learning online to obtain higher test scores. Studying online everyday will not only improve your scores but will also make you smarter. The education app gives you full access to the most important questions which can feature in your exams. Last minute revision is considered by many to be the most important, and students even revise solutions to the NCERT textbook questions using the TopperLearning App a day before their exams. Overcome learning difficulties and fears by taking online tests in all your school subjects of Science (Physics, Chemistry, Biology), Maths, Social Science (History, Geography, Economics, Civics), English and Hindi. Studying has no holidays, and studying online with the TopperLearning App has its advantages. Devote time to gain more knowledge of your subjects during your vacations and holidays. Learning by watching videos with practical applications has helped TopperLearning registered users easily learn concepts in the CBSE syllabus. You too can acquire knowledge and improve conceptual understanding by watching videos with practical applications. Or simply search for a specific question from any of your school subjects at the Undoubt section, and discover and find the most apt solutions answered by subject experts.   Students love for learning can grow exponentially because the process of learning doesnt only occur in the classroom. Online learning has several advantages, but one of the most important is discovery learning, which has been used by kids to derive more meaning and significance as they learn topics thoroughly. Other advantages include saving time and understanding topics in an easy manner. The TopperLearning App is a smart app to make you smart and get more marks! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE']",
}