{
"name" : "French lessons - Frantastique",
"url" : "https://play.google.com/store/apps/details?id=com.gymglish.ftqmobile",
"package" : "com.gymglish.ftqmobile",
"category" : "Education",
"description" : "Frantastique delivers short, personalized and fun French lessons. Our goal: your motivation, participation and progress. Its the easiest, friendliest way to learn French.  Test Frantastique for free and get a level assessment and a personalized pedagogical report!    More than 4,000,000 users around the world   Long-term results   A personalized approach   Modern and business French   You can try Frantastique for 7 days free of charge  Adapted for post-beginners (from 15 years old)  Personalized French Content: Frantastique lessons are based on your needs, your requests, and your level. Youll come across professional scenarios, a variety of accents, exercises and plenty of humor. 10 to 15 minutes daily is all it takes!   Motivation, Humor and French Culture: Discover the diversity and richness of French culture around the world with the help of Victor Hugo and friends. Every day, youll come across different accents, songs, and films in addition to original stories and texts.   Tailored Corrections: After clicking the send button, you will receive a correction with your daily score, explanations of your answers, scripts of dialogues or videos, the vocabulary you have requested and more.   Progress: Each Frantastique lesson is built dynamically to focus on points of difficulty and your own requests, to ensure youve committed information to your long-term memory. Your French will improve effortlessly, daily and over the long term!   Try the first 7 days of Frantastique free of charge. The trial is absolutely free and non-binding. Under no circumstances will you be registered for the full, paying version of our lessons without your explicit consent. We guarantee the confidentiality of your personal details.    Frantastique is developed in its entirety by A9 SAS Gymglish. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
}