{
"name" : "Pinyin Master ~ Chinese Pinyin Game ~",
"url" : "https://play.google.com/store/apps/details?id=com.majestechllc.chineseear",
"package" : "com.majestechllc.chineseear",
"category" : "Education",
"description" : "This game helps you improve the pronunciation of pinyin by comparing similar sounds which are easily mistaken.  While solving questions in the form of quizzes, your ear will gradually be trained and you could easily start recognizing Chinese pronunciation.  A popular iOS application Chinese Pinyin Game for Chinese learners, has finally been newly released as a Android version!  [Recommend for] Im learning Chinese, so I want to try using it! Id like to eliminate my bad Chinese pronunciation of pinyin. I can read chinese but not good at listening. They cant understand what I say in Chinese.  [Youtube] https://youtu.be/7FN9YYLPUhQ  [How to use] Choose One, Syllable, Word  Choose the correct pinyin pronunciation after listening to the womans voice.  You will know whether your choice is correct or incorrect depending on the sound, ding dong! or buzz!.  The following question will appear automatically after a little while.  Please answer one after the other. At the end of 10 questions, you will see the results page.  If you want to see the results while still answering the quiz, please press the button quit & results.  Pinyin Chart  You will be able to check the Pinyin Chart used in Chinese textbooks.  You should swipe the screen to the right to be able to see the hidden part of chart.  The lower half part of the screen is displayed if you press the arrow button located in the upper right corner.  The four tones will pop up when you press each blue syllable.  You can hear the pronunciation by pressing the pinyin you want to hear. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.majestechllc.chineseear.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}