{
"name" : "Dinosaur games for kids and toddlers 2 4 years old",
"url" : "https://play.google.com/store/apps/details?id=com.amayasoft.dinosaur.games.little.kids.toddlers",
"package" : "com.amayasoft.dinosaur.games.little.kids.toddlers",
"category" : "Educational",
"description" : "Set off on an exciting journey with a new friend - Raccoon! Explore Dinosaur World, help each of the dinosaurs break free from a block of ice, make friends with them and play interesting games with dinosaurs. They all want to be a part of your unique Dinosaur Park!  Application features:  Play with 8 amazing dinosaurs (2 dinosaurs free)  Learn interesting facts about these amazing creatures  Delight the dinosaurs with surprise gifts  Feed the dinosaurs their favorite treats  Engage in fun educational games  Enjoy the colorful graphics and animations  Use easy and kid-friendly controls  Play offline  Dinosaurs came in a variety of sizes and shapes  some no bigger than a chicken, others taller than skyscrapers. We have chosen the most astonishing dinosaurs to introduce children to the prehistoric world!  This app is just perfect for preschool kids who love playing games and also like to know more about their favorite creatures  dinosaurs! Learning and remembering facts becomes fun when it is coupled with fascinating games that toddlers can play here.  Friendly dinosaurs are waiting for kids to play with them:  Roar along with the mighty Tyrannosaurus  Fly together with the Pterodactyl  Catch fish with a Spinosaurus  Climb to the top of a cliff with Dilophosaurus  Play a melody with Parasaurolophus  Help a Triceratops protect its herd  Gather the most delicious leaves for a Diplodocus  Collect some crystals together with an Ankylosaurus  Enjoy the fun graphics, cool music and sounds and learn a lot as well! The games are designed for improving memory, attention and hand mobility of toddlers.  The app also provides tips during gameplay that helps children learn about dinosaurs all by themselves!  We appreciate your feedback. Please take a few minutes to review the app! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.READ_PHONE_STATE']",
}