{
"name" : "Match Game - Animals",
"url" : "https://play.google.com/store/apps/details?id=com.orange.memory.game.animals",
"package" : "com.orange.memory.game.animals",
"category" : "Educational",
"description" : "This is an educational, attractive and fun game for the whole family!  Are you ready to challenge your memory?  Have fun, learn about animals and exercise your memory with this amazing game  Find the Pairs .  It is also a good way to relax!  By activating the pronunciation option, it becomes a valuable tool for children to learn to read, write and pronounce the name of the animals from different habitats.  Over 100 animals with pronunciation of names!  Pronounce of animal names in selected languages promotes learning languages.  Play against the clock and beat your own record, or challenge your family and friends in 2 players mode!  If you are brave, challenge the intelligent robot in the Player vs Robot mode.  Features:   Totally FREE: No content blocked!  SIMPLE and INTUITIVE design for the little ones!  Ideal for kids to learn to recognize and pronounce the name of animals.  4 levels of difficulty for the whole family to have fun (6 to 20 Cards).  3 levels of AI to compete against the robot.  Various collections of cards (Farm, Garden, Sea, Jungle, Forest and many more that will be added)  The best way for children and adults to exercise memory and concentration.  Develops recognition, memorization and concentration.  Beautiful effects of visuals and sound.  Supports all sizes and screen resolutions.  Modes:   1 player (beat your own time record and get more stars!)  2 players (challenge your friends and show who is the best!)  Robot Vs Player (are you able to beat the robot?)  **** Do you like our free application? **** Help us and take a few moments to write your opinion on Google Play. Your contribution allows us to improve and develop new applications for free!  This application contains Icons made by Freepik from www.flaticon.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}