{
"name" : "Nuclear",
"url" : "https://play.google.com/store/apps/details?id=com.escapistgames.nuclear",
"package" : "com.escapistgames.nuclear",
"category" : "Educational",
"description" : "*** Brought to you by the team behind the internationally acclaimed educational star gazing app - Star Chart ***   Dare you enter the quantum world of Nuclear? Where things are not just stranger than you might imagine, but stranger than you can imagine! Witness the interplay of energies and physics at the tiniest of scales as you learn to play, discover and explore the chemical elements at the atomic level.  Nuclear is a high tech educational application that dynamically models an interactive atom in a beautiful and intuitive way. In Nuclear, you get to build all the elements of the periodic table via a simple mechanic of adding and subtracting the atomic building blocks of neutrons, protons and electrons. The goal of the app is to let you learn about each of the elements of the periodic table by constructing a stable version of that element. Once a stable element has been created, it is unlocked in the periodic table. Can you create and unlock them all?  This app has been designed for all types of users: from children interested in learning through play about what matter is made of and how it works, to teachers looking for an intuitive and exciting way to help educate others on chemical elements.   Nuclear lets you:  * Learn about the atom through this stunning 3D visualisation.  * Explore the effects of manipulating matter at the atomic level.  * Add or subtract protons, electrons or neutrons to create virtually any base chemical element.  * Create and watch as unstable isotopes decay into more stable elements.  * Through tactile exploration grasp an understanding of what we and everything around us is made of.   - Please note the initial app allows you to create and unlock the first 54 elements for free. The remaining elements can be unlocked via a small in-app purchase.  Nuclear is continually being developed, so please feel free to let us know your thoughts and feedback. We will endeavour to expand and improve Nuclear, incorporating customer feedback wherever possible. Contact us at: Nuclear@EscapistGames.com   Dont forget to check out our other great Educational App - Star Chart. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.READ_PHONE_STATE']",
}