{
"name" : "Learn Thai Alphabet",
"url" : "https://play.google.com/store/apps/details?id=com.yuly.learnthai",
"package" : "com.yuly.learnthai",
"category" : "Education",
"description" : "Learn Thai Alphabet App is intended to help you learn the Thai Alphabet quickly and easily using visual and Audio combined for quick learning and also Writing practice - New addition is the Quiz Mode for great practice and new Traditional and Modern Fonts to be able to understand all Thai scripts easily. Learn Thai Alphabet covers the Thai Script including:  * 44 consonants * 28 vowels  * The numbers.  On top of that you also have useful phrases that include:  * Colors * Days of the week and Months of the year * Timing * Clock reading * Durations * Questions * Pronouns * Animals * Family. The application is designed to ease the process of remember the letters, vowels, numbers and their sounds/class/length and uses sounds and images to help embed it.  Main features: 1. Clear, correct and pleasant Thai tone Audio for all the sections of the App including all the tabs and sub divisions. 2. Automatic Mode -> scrolls through automatically speaking out the sounds with a toggle to define the speed of transition to your liking and skill as you improve. 3. Displaying the pronunciation of the sounds both in the beginning/middle of the words as well as the sound at the end. 4. Practice Writing the alphabet letters, vowels, numbers and all the phrases by yourself - which is great for remembering. 5. Sub division of each tab (by class, length and etc).  The Learn Thai Alphabet consists of 11 main parts that are accessible from the tabs at the top of the screen. These include Consonants, Vowels, Numbers, Colors, Days and Months, Clock reading, Durations, Questions, Pronouns, Animals and Family. The Consonants are divided into 3 classes each in different color. Each consonant has its own word/drawing connected to it - and that is the way the Thai people learn it. By clicking a Consonant you will hear the consonants name and sound and see all its details - you can swipe your finger to the sides and move to the next/previous consonant. The Vowels are divided into 2 groups - short and long - according to their length and the numbers section includes all the necessary numbers to represent all the numbers in Thai Language. Times are divided into Days Months and General timing terms. Clock is divided into Time telling in Thai and Duration phrases. Animals are divided into Animals, Birds, Insects and Sea Life. At every point in the application you can click the menu button and get help. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION']",
}