{
"name" : "Daily duas for kids Muslim dua",
"url" : "https://play.google.com/store/apps/details?id=com.osratouna.translateddowaa",
"package" : "com.osratouna.translateddowaa",
"category" : "Education",
"description" : "Daily Duas for Kids - Dua Series with arabic Audio is based on the Fortress Of The Muslim book (Quran & Sunnah) which compile all authentic duaa for Muslim to supplicate on a daily basis and on special occasions.  The app will help your kids in learning the most important supplications for daily activities.   MAIN FEATURES:   Daily Duas for Kids - Dua Series with Arabic Audio works on both phone and tablet.  You can hear Duaa  Native arabic reciter.  Search feature allows the user to find out Duas featuring the particular term.  Transliteration choice helps user in knowing correct articulating Islamic supplications in Arabic.  80 Duas and Zikr.  Arabic with transliteration of duaa  Fully translated to: English, Franais, Bahasa Indonesia, Deutsch, Espaol, Trke, , , , ,   Favorites Tab  List of Categories:   Morning/Evening: Contains daily supplications for After Waking up, Before Sleeping...  Restroom: Entering and leaving the restroom  Prayer: Contains Duas for Wudu, Hearing Adhan, Replying to Call of Muazin, Entering Masjid etc.  Eat/Drink: Learn Duas for meal i.e. Before eating, on finishing the Meal etc.  Dressing: Enlists supplications for Wearing New Clothes, and getting Dressed and Undressed.  Travelling: Contains supplication While undertaking a New Journey, upon Reaching Destination etc.  Blessings: Duas upon visiting the sick, praising other Muslims etc.  Protection: When wind blows, against distractions of Satan.  Forgiveness: Asking for Allah`s Forgiveness (Astaghfar),  Fasting/Ramadan: Dua after forgetting Fast Dua, family inviting for breaking fast etc.  Funeral/Grave: Dua For Dying person to say, while visiting Graves etc.  Animal: For person stung by scorpion, mounting on animals etc.  Rain: During and after rain and withholding of Rain.  Random: Dua against an enemy, being angry etc.  If you wish to send us comments or feedback please get in touch with the team via email app@osratouna.com or via our Facebook page  http://www.facebook.com/osratouna.en  If you like the app please leaves us a review on the Google play. This really helps the app get discovered by more Muslim.  - Follow us on:   http://www.facebook.com/osratouna.en http://www.twitter.com/osratouna https://plus.google.com/+Osratouna ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING']",
}