{
"name" : "Fun Word Puzzle 2020",
"url" : "https://play.google.com/store/apps/details?id=com.hangman.free.hang.man.wordpuzzle.games",
"package" : "com.hangman.free.hang.man.wordpuzzle.games",
"category" : "Educational",
"description" : "Hangman - Fun Word Puzzle Games 2020 is a new version of classic hangman games of your childhood best ever games. Enjoy hundreds of exciting levels of fun word guessing game with lot of categories to make words with meaningful connection in this new hangman 2020.   This English word play game of your childhood is a best classic hangman new version to memorize old people games for free. Enjoy fun with words by making a new word in each level of this one of the best free hangman games to survive and never let your sketchy player handed by guessing wrong word. This hangman game 2020 is best for users of all ages. If you are looking for free hangman games for kids to sharpen their vocabulary? Or you want to recall your childhood with ever best games of word puzzle games for kids by sketching words in this best hangman fun word guessing games? Then this hangman word puzzle game 2020 is for you.   Gameplay of Hangman - Fun Word Puzzle Games 2020 This new hangman game is a digital gameplay of your childhood classic hangman games. You need to guess the right word by selecting different alphabets separately. On each wrong selection, a part of your imaginary player will sketch. If you fail to guess right word? Then your sketched player will have hanged with words. If you fill the blanks with right alphabets? You will save the hangman in this best word games 2020. To give you an actual gameplay of writing words and sketching hangman on paper, we have designed this word puzzle games 2020 with 2 players. So that, you can play multiplayer hangman free games with your friends and family as played in your childhood. As classic hangman words guessing games, it is suggested to use vowel letters first as they are commonly used in most words of all hangman free games.  Features - Extreme addictive gameplay of fun word puzzle games. - Suitable for players of all ages like kids, adults and all senior players. - 10 categories to challenge your brain: Actor, Animal, Brand, Country, Film, Food, Fruit & Vegetables, Professions, Sports and Verbs.  - 700 interesting levels of hangman word. - Cool and fun gameplay of best classic hangman game. - Colorful and eye-catching graphics. - 2 player mode to play as hangman multiplayer. - Exciting word complete levels of best word games. - Leaderboard to defeat senior players of hangman word puzzle.   Remember that hangman 2020 is called with different names in different countries around the world like English hangman, French le pendu, Spanish ahorcado, Italian limpiccato, Portuguese jogo da forca and many more.  If you want best word puzzle games free download of this year? Then you are only one click away to have this best hangman game. Click on download button and get this amazing new Hangman - Fun Word Puzzle Games 2020, which is best hangman game 2020 of this year with exciting levels of hangman free games. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}