{
"name" : "Baby Caring Bath And Dress Up Baby Games",
"url" : "https://play.google.com/store/apps/details?id=com.msgame.babyCarinMakeUp",
"package" : "com.msgame.babyCarinMakeUp",
"category" : "Educational",
"description" : "Baby Caring Bath And Dress Up Baby Games its amazing app for little girls and boys, Meet your baby twins who cant wait to have fun while you spend the day babysitting and caring for her. In this baby game you can act like a real mommy and care for your baby by getting her out of bed, feeding her, dressing her up in lovely dressup outfits, playing with her, bathing her after a long day, and putting your sleepy princess to bed! This is the most fun baby game for babies yet! So come and have fun today!  This mom needs your help ! Choose among a lot of levels and let the fun begin! Its amazing game for all ages. In this game you need to take care of new baby. In this you need to completed all levels. Play one by one levels. In this there are so many different levels.  The game has colorful pictures, fun music, a lot of different accessories that will entertain and delight the little fidget. Game help in the development of skills such as responsibility, kindness, caring.   Features: - HD beautiful game play. - There are 6 different levels. - Completed guide step by step levels. - Easy to play. - Ultimate sounds. - Save and share function. - Supported all device what you get in this babys game : * Dress, Feed & Bathe your Baby - Have a Tea Party & Put your Baby to Bed! * Play Mommy & Care for Adorable Babies, Hundreds of Outfits & Loads of Fun! * Kids will Learn Responsibility - Dont Let the Babies Cry!  Bath Time!  Get the soap and shampoo out and transform your dirty baby into a clean baby. Wash her hair, rinse her off, as well as soap and wash her body to rinse the dirt off. Once clean dry her with her favourite towel ready for bedtime!   Dress Up Time! First, its time to dress up your baby in style. Choose from dozens of hairstyles, outfits, onesies, dresses, jeans, silly pacifiers, accessories and toys! Now shes ready to eat.   Play Time!  Play with your baby princess and have lots of fun in the play pen! Play with the ball, plane, car, spin top and more to make your baby smile. When she is happy and ready, move out into the park to play on the slide, swings, trampoline, and rocking horse. Remember a smiling baby is a happy baby!  Kids just love playing mommy to babies. This free online baby game is the best helper game available for young kids.  So are you ready for play? Download Now. Its FREE Game. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_MULTICAST_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE']",
}