{
"name" : "Salesgasm: Free Marketing and Sales Training App",
"url" : "https://play.google.com/store/apps/details?id=com.salesgasm.app",
"package" : "com.salesgasm.app",
"category" : "Education",
"description" : "The free sales training and marketing training app to always keep yourself updated on the latest techniques and tools in sales, digital Marketing and marketing. A very light app that is a must for all sales and marketing professionals in the world from Startups, SMEs and MNCs.   - Are you getting a lot of objections from clients and dont know how to reply to convert the deal? - Is your social media strategy working? If not, do you know the ways you can dominate social media? - Have you ever got stuck before replying to a client as you dont know what to write in the email? - Do you have a long list of leads in your CRM but none of them are close to conversion? - Are you about to give a presentation on a high value deal to a client but do not know how to convince them, or what body language should you have to increase the chances of conversion? - Are you spending too much on your marketing and want to know the ROI on marketing?  If the points above are something you are pondering, try downloading the Salesgasm app. Salesgasm is a free app for Sales training as well as Marketing training. It features videos, articles, webinars, sales motivation videos/articles and other training material from professional trainers/training companies from across the globe. The app can be used anywhere where there is an internet connection and the user gets access to high-quality sales and marketing training on the move.  Hand-Picked Training Material: The team at Salesgasm only adds data after confirming that it is the right sales and marketing training material for you  Powerful search: Salesgasm provides a very quick and powerful search to assist you in finding the exact videos/articles you are looking for. The sections have been divided into categories to make navigation easy and effective.  User-friendly: Simply open the app and click on the menu section. The app navigation is self-explanatory and comprehensive. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}