{
"name" : "Bhagavad Gita - Sanskrit Audio",
"url" : "https://play.google.com/store/apps/details?id=com.bhagavadgita.sanskrit.audio",
"package" : "com.bhagavadgita.sanskrit.audio",
"category" : "Education",
"description" : "FEATURES  Sankrit narration by vaishnava devotee Ramadevi Rao  Offline App. Large size due to high quality sound. However, once downloaded, it never requires internet nor it consumes increasing space.  Complete Bhagavad Geeta  Most authentic  High quality sound   Nice thematic images for every chapter  Good to play everyday while  Easy to play  Very simple Interface  No unwanted Pop-ups, Spam, Ads and Notifications  Absolutely Clean app  App can be moved to SD Card  Free  You can easily share this app with family and friends thro Google Play  Bhagavad-gita, a philosophical poem comprising seven hundred Sanskrit verses, is one of the most important philosophical and literary works known to man. More commentaries have been written upon the Gita than upon any other philosophical or religious text in history. As a classic of timeless wisdom, it is the main literary support for the oldest surviving spiritual culture in the world-that of Indias Vedic civilization. Not only has the Gita directed the religious life of many centuries of Hindus, but, owing to the pervasive influence of religious concepts in Vedic civilization, the Gita has shaped Indias social, ethical, cultural and even political life as well. Attesting to Indias nearly universal acceptance of the Gita, practically every sectarian cult and school of Hindu thought, representing a vast spectrum of religious and philosophical views, accepts Bhagavad-gita as the summum bonum guide to spiritual truth. The Gita, therefore, more than any other single historical source, provides penetrating insight into the metaphysical and psychological foundation of Indias Vedic culture, both ancient and contemporary.  The influence of Bhagavad-gita, however, is not limited to India. The Gita has deeply affected the thinking of generations of philosophers, theologians, educators, scientists and authors in the West as well Henry David Thoreau reveals in his journal, Every morning I bathe my intellect in the stupendous and cosmogonal philosophy of the Bhagavad-gita ... in comparison with which our modern civilization and literature seem puny and trivial.  The Gita has long been considered the essence of Vedic literature, the vast body of ancient scriptural writings that forms the basis of Vedic philosophy and spirituality. As the essence of the 108 Upanisads, it is sometimes referred to as Gitopanisad.  Bhagavad-gita, the essence of Vedic wisdom, was injected into the Mahabharata, an action-packed narrative of an important era in ancient Indian politics.  Bhagavad-gita comes to us in the form of a battlefield dialogue between Lord Sri Krishna and the warrior Arjuna. The dialogue occurs just before the onset of the first military engagement of the Kuruksetra War, a great fratricidal war between the Kauravas and the Pandavas to determine Indias political destiny. Arjuna, forgetful of his prescribed duty as a ksatriya (warrior) whose duty is to fight for a righteous cause in a holy war, decides, for personally motivated reasons, not to fight. Krishna, who has agreed to act as the driver of Arjunas chariot, sees His friend and devotee in illusion and perplexity and proceeds to enlighten Arjuna regarding his immediate social duty (varna-dharma) as a warrior and, more important, his eternal duty or nature (sanatana-dharma) as an eternal spiritual entity in relationship with God. Thus the relevance and universality of Krishnas teachings transcend the immediate historical setting of Arjunas battlefield dilemma. Krishna speaks for the benefit of all souls who have forgotten their eternal nature, the ultimate goal of existence, and their eternal relationship with Him.  #bhagavad-gita-iskcondesiretree ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}