{
"name" : "Learn Nagamese",
"url" : "https://play.google.com/store/apps/details?id=com.priyanksharma.learnnagamese",
"package" : "com.priyanksharma.learnnagamese",
"category" : "Education",
"description" : "Learn Nagamese is the best and probably the only app out there that enables you to learn the Nagamese dialect in a fun and engaging way. Start conversing with your Naga friends and acquaintances instantly. Its fun, effective and addictive.  Master Nagamese in a month  the ONE dialect that is spoken and understood by all the 17 major tribes in Nagaland. Spoken by about 300,000 people on an average, Nagamese is based on Assamese, Hindi, English and Bengali.  While the first four lessons are absolutely free to try out, you can unlock the remaining lessons for a little more than a dollar. Dont forget to tell your friends and family about us. Tag us using #Nagamese to join the conversation.  Make sure you always have the latest version of Learn Nagamese. We keep introducing new lessons and features with each release.  Like us on Facebook: https://www.facebook.com/learnnagamese  Follow us on Instagram: https://www.instagram.com/nagamese   Why Learn Nagamese needs the following permissions:  CAMERA  take pictures and videos Explanation: For clicking a picture using your phones camera and setting it up as your profile picture  STORAGE  modify or delete the contents of your USB storage  read the contents of your USB storage Explanation: For picking up a picture from your Photo Gallery and setting it up as your profile picture  OTHER  have full network access Explanation: For detecting internet connectivity and accordingly switching to offline mode  Google Play billing service Explanation: Required for unlocking all lessons and the cheat sheet  prevent phone from sleeping Explanation: Required for reminder notification to work  receive data from the Internet Explanation: This is the heart of the app, enabling you to save and retrieve your account details, profile picture and level  view network connections Explanation: To enable the app to work offline ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}