{
"name" : "MarcoPolo Arctic",
"url" : "https://play.google.com/store/apps/details?id=com.gomarcopolo.arctic",
"package" : "com.gomarcopolo.arctic",
"category" : "Education",
"description" : "Explore one of the most fascinating places on Earth - the Arctic. Learn about 30+ animals and play with them in an interactive land/sea environment. Feed the animals, throw snowballs, drive an amphibious vehicle, and much more!  Build Bring the arctic animals to life with interactive puzzles! Snap each piece in place as you learn special facts about every animal.  Explore Tap, drag, and swipe your way through the arctic landscape! There are animals to feed, seals to juggle beach balls with, and snowballs to be thrown. Try to discover all its secrets!  Features  4 robust interactive puzzles to build: land animals, land and sea animals, whales, and birds  30+ arctic animals to learn about  100s of interactive elements  6 different types of food  feed the polar bear, and help the musk ox graze  3 types of arctic environments: tundra, taiga, and ocean  Through self-directed discovery, we expose children to early skills in science, technology, engineering and math (STEM), focusing on the following:   Identifying a wide variety of animal species that live in the arctic land, sea, and sky  Learning the characteristics and behaviors of arctic animals  Understanding the arctic biosphere and its various features  Determining the eating habits of the arctic wildlife  Topic-specific vocabulary exposure and acquisition  Privacy Policy  We take privacy very seriously. We do not collect or share personal information about you or your child, nor do we allow any third-party advertising. You can see our full policy at: http://www.gomarcopolo.com/privacy-policy/  About Us: http://gomarcopolo.com/us/ ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE']",
}