{
"name" : "Learning numbers for kids",
"url" : "https://play.google.com/store/apps/details?id=com.bimiboo.numbers",
"package" : "com.bimiboo.numbers",
"category" : "Educational",
"description" : "Learning numbers for kids is an educational game for preschoolers. The game will allow boys and girls to learn numbers 1 to 20 while playing entertaining mini-games. Learning numbers features over 100 educational activities for your child to enjoy. The game will also help children to develop important basic skills such as creativity, motor skills, coordination, attention and memory.  Each number in our educational game for kids has its own story. This makes the game process diverse and exciting for children. The game includes essential learning activities such as number tracing, math and counting.  Learning numbers is an educational game that is designed for kindergarten and preschool kids ages 2, 3, 4, 5 and 6. The game will teach your child to identify numbers, count them, write them and pronounce them correctly. The learning process is easy and extremely engaging.  Our toddler game allows kids to learn numbers in a variety of languages: English, French, German, Italian, Russian, Spanish, Portuguese, Turkish, Danish, Finnish, Dutch, Norwegian, Swedish, Greek, Chinese, Japanese and Korean.  Features: - Number learning for kids - Tracing and counting from 1 to 20 - Math game for preschoolers - Learning numbers in 17 different languages - Over 100 educational activities for both girls and boys - Kids number games with cute animals - Numbers 1, 2 and 3 are available for free  Ages: 2, 3, 4 or 5 years old pre-kindergarten and kindergarten children.  You will never find annoying ads inside our app. We are always glad to receive your feedback and suggestions. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}