{
"name" : "Vernier Go Wireless",
"url" : "https://play.google.com/store/apps/details?id=com.vernier.android.gwta",
"package" : "com.vernier.android.gwta",
"category" : "Education",
"description" : "The Vernier Go Wireless app allows users to conduct experiments using Go Wireless Temp, a wireless temperature probe. Users collect temperature data that is displayed in a graph and can calculate basic statistics on a region of data. Additionally, users can export the data as a CSV file for use in other applications for even more analysis.  HARDWARE REQUIRED - Vernier Go Wireless Temp is required to make use of this application. Visit http://www.vernier.com/gw-temp for more information.  Features when using a Go Wireless Temp  From the list of available sensors  Discover nearby Go Wireless Temp probes and monitor their temperature readings  Connect to a specific sensor for further study  When connected to a specific sensor  View live temperature values displayed in a thermometer bar  Collect data  displayed in a graph  Graph scales automatically to show all collected data  Customize the sensor name, view battery status, and flash the sensor LED (identify)  Toggle units   C and F (US  English only)   C and K (all other languages)  With collected data  On the graph - Pinch to zoom /double tap to autoscale  Tap to examine the collected data  Select a region to calculate the average temperature  Tap the statistics box to view additional statistics  Export a CSV file for additional analysis in other software  Experiment possibilities include  Science fair projects  Monitoring environmental conditions  Monitoring temperatures in a fish tank or greenhouse  Measuring the rate of temperature change of a liquid in a Thermos  Measuring the temperature of the air coming from an air conditioner or furnace  Vernier Software & Technology has over 30 years of experience in providing effective learning resources for understanding experimental data in science and math classrooms. Go Wireless is a part of Verniers extensive system of sensors, interfaces, and data-collection software for science education. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.CAMERA', 'android.permission.BLUETOOTH_PRIVILEGED', 'android.permission.FLASHLIGHT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MANAGE_DOCUMENTS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.MANAGE_DOCUMENTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.BLUETOOTH_PRIVILEGED']",
}