{
"name" : "Learn English For Kids",
"url" : "https://play.google.com/store/apps/details?id=com.learnenglishforkids.learnenglishforkids",
"package" : "com.learnenglishforkids.learnenglishforkids",
"category" : "Education",
"description" : "Learn English for Kids is an educational application for your kids to learn English effectively. With this free app to learn english for kids, kids can recognize English Alphabet, animals, fruits, color, food, numbers.... Teach English for Kids is important language for kids development. Learning while playing is the best fun and effectively way for your kids to learn English easy.  So, Learn English for Kids has 2 fun game. In game, kids can practice phonics English, help kids remember vocabulary better. One word will be automatically pronounced, kids have to listen what is it, then choose true image by touching screen Lets your kids learn and play now! Learn English for Kids has 21 topics which are around kids real life, 694 words vocaburaly with sound and images of them . You can use all of them without network, its free. * English Alphabet: 26 English letters of alphabet and kids can watch many ABC songs, Alphabet videos in Videos English. Learning by image brings better results for learn english for kids. * Numbers: Beside ABC alphabet, this learn english for kids also provide about 1- 20 numbers of section that helps kids learn english number conveniently.  * Animals: includes 90 animals with real pictures of them. Your kids very love animals so it help kids impression and want to learn english. * Transports: 24 pictures of vehicle in english for kids, which all of kids are interested! * Color: 18 colors in english for kids. * Country: 60 countries with engish name for kids. * Vegetables: 40 popular of vegetables arround the world. All of us is english name for kids.  * Fruits: The 51 Healthiest Fruits On Earth with real picture. Your kids very love it and you can find the way to get your kids to eat better. * Flower: includes top 22 flowers beautiful in the world. Your girls will very like them and help kids learn english name of them.  * Food: have 40 english words for many different types of delicious food. * Object: 40 common objects in real life. Kids will learn english name object around their life. * Shape: 26 type of shapes in english, the app helps to build the skills and knowledge of your kids in a playful manner. * Job: 50 english name of Professions & Jobs will help kids know about your dream jobs in the feature. * Verb: Learn and study the most frequently used 50 English vocabulary verbs used in speaking english daily.  * Adjectives: Kids can learn 30 adjectives common in english to describe physical appearance. * Nature: 18 pictures of nature will help your kids knowledge about nature. * Classroom: 24 popular objects in school. * Dates: includes 7 days of week, 12 months and 4 seasons in a year! * Christmas & Halloween: During festivals like Christmas, Halloween and New Year a lot of vocabulary related to celebrations can easily sink into kids  ABOUT VIDEO * 640 best YouTube videos compilation for Kids to learn English. These videos will get your kidss attention as they are funny and your kids wont make that much effort to enjoy them. * Videos in this app do not belong to us, we collect all from YouTube and just link to them for education purposes. We dont show ads on those videos. If you see any video of yours and dont want us to link to it, please email us!(app.KidsTube@gmail.com) I will remove them! ----------------------------------------------- FEEDBACK & SUPPORT Please support us by leaving a good rating, or share this app with your friends on Facebook, Twitter or Google+ if you like it If you have any issues regarding this app, please feel free to let us know at: app.KidsTube@gmail.com LIKE US: https://www.facebook.com/AppLearnEnglishForKids ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.learnenglishforkids.learnenglishforkids.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}