{
"name" : "MarcoPolo World School",
"url" : "https://play.google.com/store/apps/details?id=com.gomarcopolo.worldschool",
"package" : "com.gomarcopolo.worldschool",
"category" : "Education",
"description" : "At MarcoPolo World School, weve reimagined how your child can best discover and learn about the fascinating world around them. Perfect for curious minds aged 3-7, our award-winning early learning program helps children develop the 21st century skills they need to prepare for school and beyond!  Designed by PhD early childhood education specialists, our STEAM + literacy curriculum offers your child the very best, inviting them on a magical journey of more than 400 premium lessons and 3000 interactive learning activities!   Start exploring World School today with a 7-DAY FREE TRIAL!   **2019 International Emmy Award Nominee** **Winner of the 2019 Kidscreen Awards - Best Original Learning App** **Winner of 2019 Rockies Award - Children & Youth** **Rated A+ for educational value by Common Sense Media** **Winner of the Parents Choice Award 2018**   Your Child Will Learn About:  SCIENCE: Prepare to travel deep inside the human body, learn about the worlds climate and weather conditions, explore new environmental habitats, discover different life cycles and more!  TECHNOLOGY: Blast off into space to learn about rockets, the International Space Station and the wider mysteries of our solar system! On planet Earth, learn how humans are creating technology thats inspired by nature!   ENGINEERING: See the mechanics behind why hot balloons need warm air to fly, visit the depths of the ocean in a submersible or learn how humans use electricity to make cars go!   ART: Encourage your child to unleash their creativity with some hands-on learning! Transfer learnings from World School lessons into the real world with crafty art tutorials, coloring exercises and more. Dont forget to snap a photo of their magical creations!   MATH: Were making math fun with interactive activities that introduce number recognition, geometry, sequencing and addition - all in the context of the many topics taught in World School, helping kids to apply their knowledge!  LITERACY: Be propelled by a natural curiosity to learn more! Identify letter sounds and formations, start reading fluency and sight words, learn sentence composition or practice handwriting with fun tracing activities!  SOCIAL STUDIES: Learn about holidays and traditions, geography, music and arts, resources from around the world and ancient civilizations to name a few! World School is a gateway to a world of knowledge.   SOCIAL EMOTIONAL: Learn about empathy, jealousy and nervousness while exploring an entire lesson on feelings, friendships and human interactions.   The Polos  Our interactive educational lessons start with a journey with a group of fun-loving animated characters. And we add new lessons and fun activities every week so that the fun and learning never ends!  Key Features:  Unlimited access to over 400+ lessons and 3000+ interactive, fun learning activities.  STEAM + Literacy curriculum designed by PhD early childhood specialists. Develop 21st century skills with the four Cs: Critical Thinking, Creativity, Communication and Collaboration. Contextualized learning encouraging real world knowledge application. Perfect for kids aged 3-7 years.  Exclusive new content in regular updates.  The only app that prepares kids for school and beyond.  COPPA and GDPR certified.   Subscription details:   Subscribing includes a FREE 7-day trial on both annual and monthly plans. Your payment will be debited to your Google Play Store account at confirmation of purchase. Your subscription will automatically renew unless auto-renew is turned off at least 24 hours before the end of the current subscription period. Your account will be charged for renewal within 24 hours prior to the end of the current subscription period. You can manage your subscriptions and turn off the auto-renewal function by entering your Account Settings in-app, after purchase. Any unused portion of your free trial will be forfeited when you purchase a subscription to MarcoPolo World School. ",
"desc_perms" : "['android.permission.CAMERA', 'android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE']",
}