{
"name" : "Smart Calculator - All in one Free",
"url" : "https://play.google.com/store/apps/details?id=com.deep.smartcalculator",
"package" : "com.deep.smartcalculator",
"category" : "Education",
"description" : "Totally ad-free, everyday use all in one lightweight calculator with powerful features & easy interface. Perfect calculator & converter designed with simplicity in mind. Support Dark mode as well other stylish themes.  Calculators:  - Standard calculator  - Scientific calculator  - GST/Sales Tax/VAT calculator  - Loan calculator, Amortization  - Interest/Saving calculator, FD, RD, ROI, SIP, Doubling Time  - Percentage calculator, Markup & Margin  - Unit Price calculator  - Equation solver  - BMI, BMR & Daily Calories burn calculator  - Date & Time calculator  - Age calculator  - Discount calculator  - Tip calculator   Converters Unit converter  Currency converter   Features   Standard & Scientific Calculator  - Facilitates instant & accurate calculations from simple to complex - Store value for later using memory keys - Track your calculations with History. Write a short note for important calculation  Unit Converter  - Simple, smart & elegant tool with more than 200 unit converters that are used in everyday life - Supported conversion categories:- Length & Distance, Weight, Area, Number Base, Digital Storage, Data Transfer, Time, Speed, Volume, Cooking, Temperature, Force, Power, Fuel Efficiency, Energy, Angle, Density, Torque.  Currency converter  - Foreign exchange rates of 70 countries currency - Exchange of one currency to another - Offline, No internet required at each request.   GST /Sales Tax/VAT Calculator  -Include(+) or Exclude(-) GST from given amount with single click. - 5 Pre-provided tax rates can be customized as per your country rates. - Sales Tax & VAT calculator can be enabled from settings.  Interest Calculator  -Calculate interest & maturity amount on your saving through Simple Interest, Compound Interest, RD, SIP & Doubling Time.  -Check your investment opportunities through ROI(Return on Investment)  Percentage Calculator  -Simple percentage, percent increase/decrease, percent change, what percent, fraction to percent -Markup calculator: Calculate Markup percentage, Margin percentage & total profit based on cost & selling price  Health Calculator  - Calculate BMI & BMR based on your age, gender, height & weight. BMR lets you calculate daily calorie requirement as per selected activity level.  - With BMI & BMR calculator, you can also track your weight to improve your BMI and overall health.   Equation Solver  - Linear equations with one,two & three variables - Quadratic equation  Date Calculator  -Age calculator & Birthday tracking -Date Difference: Calculate the duration between two dates. Additionally shows age summary.  -Add/Sub Date: Calculate final date & time after adding or subtracting no of years, months, days, hours, minutes & seconds.  Loan Calculator -Calculate your monthly EMI, total interest on loan and final amount with amortization chart in a easiest way.  -Compare two loans to know which one is better for you.  -Loan affordability: Calculate how much loan you can afford based on your max monthly EMI.  Discount Calculator -Calculate or confirm discounts quickly on original price  -Fin out how much you save for an item  Tip Calculator Calculate the tip percentage or tip amount & split the bill among number of persons on table.  -Save time when you use the bill splitter, and tip exactly what you mean to, no more, no less.  Unit Price Calculator -Compare prices of two or more products having different quantities of same unit & buy cheapest price item.  - Number to word on click of every result field  User Preferences - Calculator is fully customized where user can set No of Decimal places, Vibrate or Sound on keypress & Choose from attractive & user friendly themes.  - More features will be added. Stay in touch! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}