{
"name" : "Sago Mini Forest Flyer",
"url" : "https://play.google.com/store/apps/details?id=com.sagosago.ForestFlyer.googleplay",
"package" : "com.sagosago.ForestFlyer.googleplay",
"category" : "Education",
"description" : "The fun begins at Robins birdhouse. Ring the doorbell and invite your new feathered friend out to play. Discover the magical forest together as you soar through the sky, splash in the pond, do a little dance, and make new friends. This open-ended play experience is loaded with exciting animated surprises guaranteed to make your little one giggle with joy.   Made with love, Sago Mini Forest Flyer puts kids in control. Part of the award-winning suite of Sago Mini apps, the app is sure to bring joy to your little one.   Sago Mini apps have no in-app purchases or third party advertising.  These open-ended play experiences are the perfect starter apps for little ones. Our team of designers and developers create apps that children love and parents trust. We build on kids natural sense of wonder, creativity and curiosity to make apps that are safe, positive and fun. Millions of parents trust Sago Mini as the ideal first apps for their little ones.  All of our apps are free of third-party advertising and in-app purchases for kids. In each app there is a small icon with news about our new apps, special offers, fun videos and more.  Features  Choose between summer and winter scenes  Tap Robin, and fly through the forest  Guide Robin to the yellow markers to uncover fun animations  See Robin dance, sing and play  More than 30 fun animations to discover  Make up stories to go with the actions  Recommended for toddlers, age 2-4 years  Play without wi-fi or internet  No in-app purchases or third-party advertising, so you and your child are free to discover without interruptions!  Sago Mini is an award-winning company devoted to play. We make apps and toys for preschoolers worldwide. Toys that seed imagination and grow wonder. We bring thoughtful design to life. For kids. For parents. For giggles. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.CHECK_LICENSE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}