{
"name" : "SSAT English Comprehension LE",
"url" : "https://play.google.com/store/apps/details?id=com.webrich.ssatrclite",
"package" : "com.webrich.ssatrclite",
"category" : "Education",
"description" : "SSAT Reading Comprehension app contains 21 passages with 600 questions.  Along with comprehension there are also questions based on words and phrases, spelling, punctuation and grammar exercises. This app makes your childs SSAT preparation a fun.  **NOTE: This is a lite version where in only few topics are available. All the remaining locked topics will be unlocked on buying the full version from within this lite version. It will be a one time purchase to unlock ALL the locked items in one go.  The passages are categorized into 12 practice papers. Each papers has one or two reading comprehensions and questions based on them. The questions on punctuation, spelling and complete the sentence test childrens grammatical correctness in writing.  DETAILED TEST RESULTS   On the completion of each test the user is given a summary of questions answered correctly, incorrectly and skipped along with the time taken on each question. Every question can be reviewed and all questions have an explanation of the answer.   PROGRESS METER   An interactive pie chart displays current progress for each topic. You can touch the different color slices of the pie and choose if you wish to answer only incorrectly answered questions, unattempted or correctly answered questions. This feature is very useful to achieve 100% score in each topic.   MOCK TEST  After you have practiced all types of questions, you can take a Mock Test with 50 questions. The Mock Test has questions selected randomly from each topic. Scores for the mock tests taken in the past are displayed in a bar chart. This is a great way to track how you are progressing in mock tests. There is no limit on how many mock tests you can take.   FEATURE LIST    600 multiple-choice questions.   Explanation with every question.   Option to choose the number of questions to test.   Progress meter helps to track progress, topic wise and mock test wise.   Ability to re-attempt only the questions you get wrong or correct or never attempted.  Option to choose reset the progress and start from scratch. ",
"desc_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.STORAGE']",
}