{
"name" : "Grammar Express : Degrees Lite",
"url" : "https://play.google.com/store/apps/details?id=com.webrich.degreeslite",
"package" : "com.webrich.degreeslite",
"category" : "Education",
"description" : "1. Over 26 Pages of Grammar Lessons. 2. Over 102 examples with Grammar Rules. 3. Over 300 Test Questions with Explanation.   **NOTE: This is a lite version where in only few topics are available. All the remaining locked topics will be unlocked on buying the full version from within this lite version. It will be a one time purchase to unlock ALL the locked items in one go.  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Full version has over 300 multiple - choice questions. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  Grammar Express: Degrees is the complete course in mastering the use of variety of expressions in writing English. It contains over 26 pages of lessons explaining how to change a sentence from one grammatical form into another without changing its meaning with several examples. Its a valuable exercise for it teaches you how to introduce variety in writing English. You can learn the grammar rules, study the examples and test their understanding by taking quiz. At the end of quiz the user is presented with test summery and explanation for each test question. Grammar Express can help you to improve your understanding of Degrees and make use of them in your writing for greater effect. Custom timer setting can assist you to improve response times under exam time constraints. Research suggest that kids and adults learn most quickly when playing learning games with real-time error-feedback. Grammar Express provides learners with an opportunity to improve strategies for grammar success.    ~~~~~~~~~~~~~~~ PREPARE BY TOPICS: ~~~~~~~~~~~~~~~ You can study the grammar rules by topic. All questions are sorted by topic. It also tells you the areas that each topic covers.  1. Interchange of Positive and Comparative  2. Interchange of Comparative and Positive  3. Interchange of Superlative into Comparative and Positive   ~~~~~~~~~~~~~~~ MOCK TEST MODE: ~~~~~~~~~~~~~~~ In mock test questions are presented randomly from all the topics.   ~~~~~~~~~~~~~~~ DETAILED TEST RESULTS: ~~~~~~~~~~~~~~~ A summary of the practice test is presented at the end of each test. It shows you the time you took, the score, which questions you answered correctly and where you were wrong.  ~~~~~~~~~~~~~~~ PROGRESS METER: ~~~~~~~~~~~~~~~ The app records your progress as you start giving practice tests.  It shows you a beautiful bar chart so that you can track your weak areas and give more focus on them.  ~~~~~~~~~~~~~~~ VERY EASY TO USE: ~~~~~~~~~~~~~~~ The slick user interface allows you to choose from possible answers.  You dont need to press too many buttons or encounter any alert messages.   ~~~~~~~~~~~~~~~ FEATURE LIST: ~~~~~~~~~~~~~~~  Over 26 pages of grammar lessons and rules with over 102 examples.  Over 300 multiple -choice questions with explanation.  Choose number of questions you would like in each test.  A new module, Pie chart keeps track of how you are performing in a particular topic or mock test.  Choose your own timer settings.  Special algorithm that randomizes questions every time you take a test. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.STORAGE']",
}