{
"name" : "Slang: English for your career",
"url" : "https://play.google.com/store/apps/details?id=com.slangapp.mobile",
"package" : "com.slangapp.mobile",
"category" : "Education",
"description" : "Slang offers an unprecedented variety of comprehensive, career-specific English courses. Our adaptive English learning app optimizes your learning experience in real time, getting to know you as a learner and presenting you with the study experience you need based on how where you are in your English-learning journey. Other solutions all follow the same one-size-fits-all approach, teaching only the highest-frequency terms, covering <1% of the English language and leaving out the field-specific knowledge you need to be a bilingual professional. Slang is here to help you go beyond basic English and unlock your potential by making English-language knowledge around the world accessible to you.  If youre a new user, youll receive a free 7-day trial to Slang Pro and get a chance to explore the comprehensive selection of professional English courses we offer. After your trial, subscribe to Slang Pro for unlimited access to all Slang courses and features.    THE SLANG APPROACH   Study only what you dont know: stop wasting time on one-size-fits-all solutions. Slang builds a personalized learning experience so that you study only whats new for you.   We make things easy: translations and explanations in your native language support you while you build toward total immersion.   Reach fluency quickly: our adaptive technology measures your proficiency in real time and selects the study material and activities that will help you progress faster.   A lifelong learning companion: your knowledge syncs across all of our English courses, so you can easily study new topics without repeating content.   A comprehensive solution: our wide variety of exercises helps you master all four language skills  reading, writing, listening, and speaking.   ABOUT SLANG PRO  Slang Pro is the world-class solution for learning professional English, available for organizations and individuals.  Our B2B offering  for businesses, universities, and ESL schools  includes extensive support for developing bilingual programs along with our app itself. Please visit our website to learn more about the Customer Success Program, the Academic Consultancy, and other features included for each organization type.  Our service for individuals is available via in-app purchase with a monthly or annual auto-renewing subscription. Your account will be charged at confirmation of purchase, and Slang Pro will automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period. Accounts will be charged for renewal within 24 hours of the end of the current period. Your Slang Pro subscription may be managed or cancelled in your account settings after purchase. Any unused portion of your accounts 7-day trial will be forfeited upon subscription.  Privacy policy: https://slangapp.com/legal/privacy Terms and conditions: https://slangapp.com/legal/terms   TALK TO US  If you have any comments or feedback, please reach out! You can reach us via email at support@slangapp.com. ",
"desc_perms" : "['android.permission.INTERNET', 'android.vending.BILLING', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}