{
"name" : "Study Kanji N4 N5",
"url" : "https://play.google.com/store/apps/details?id=com.porolingo.kanji45",
"package" : "com.porolingo.kanji45",
"category" : "Education",
"description" : "Study Kanji N4 N5 is one apps of our ongoing project for Kanji learner with purpose of giving helful and easy tool for Japanese learner to learn Kanji N5 and Kanji N4.. This apps suitable for both beginner and pre-intermediate, around level N5 N4. Each kanji has detailed information of meanings, kunyomi, onyomi and many examples. By giving learner many tools to study from flashcards, customizable quizzes to kanji challenges and also marking remembered words.  The application content included 500 Kanji of level N4, N5 which are divided into 45 topics, covering almost kanji of basic level. With the unique choosing reading way of kanji, onyomi and kunyomi, and so on based on the content you have just learned to help you understand all about that kanji. This is also a type of question in the Japanese Language Proficiency Test. These tests help you remember deeply and have a quick reaction to kanji that you have learned.  Main Features  Detailed kanji info  View kanji, its meaning, learn kunyomi and onyomi of each kanji  Check out example words, kanji relations and its meanings to build up your word power.   Flashcard study  The visibility of readings, onyomi, kunyomi and associated meanings.  Swipe to quickly to test your remembering of that kanji and also to move to another kanji to learn  Assign favorite mark to filter kanji that you love   Practice test  Customize questions to test your remembering and understanding of kanji, meanings, kunyomi, onyomi and also its relation.  Spread out your vocabulary by doing test with relation words  Quiz timer to check your reaction to that word is fast or not  Customized repeat wrong answers to help you remember it.  Review in the end of test showed you which words have you remembered.   Kanji N5, Kanji N4 challenges  Improve your kanji recognition by challenging yourself recognize right kanji with given meaning in limited time   General view all 500 words of Kanji N5 and Kanji N4  By seeing all 500 words of Kanji in overview screen, you can look and compare the differences from each other  Tracking your learning progress by seeing which kanji you already remembered by mark  4 levels, from beginner to pre-intermediate, for choosing to learn. Suitable for learner level N5, N4  *** Poro - Study Kanji N4 N5** suitable for: - Japanese learner from basic to intermedite - Is preparing to practice Japanese JLPT N4, JLPT N5. - Love Japanese culture. - Anyone interested in Japanese letters - Like to challenge your level  Poro - Study Kanji N4 N5 is in developing process; we hope to receive your contribution comment to make it better. We are just a team that love Japanese and try to share our love to community, so if you like this app then please take a moment to rate it. You can also get in touch with comments or suggestions via the feedback button on the Options Screen.  Please kindly contact: - Email: poro.lingo@gmail.com - Fanpage: https://www.facebook.com/poro.japanese/ Thank you very much and Good luck!  Japanese, Kanji N4, Kanji N5, Kanji, kanji by picture, learning kanji, practice kanji, learn kanji, kanji study, JLPT N5, JLPT N4, basic kanji, kanji for beginner ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.porolingo.kanji45.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}