{
"name" : "Star Hoppers",
"url" : "https://play.google.com/store/apps/details?id=com.hkspm.starhoppers2",
"package" : "com.hkspm.starhoppers2",
"category" : "Education",
"description" : "Star Hoppers won the Smart Mobility (Smart Tourism) Certificate of Merit in the Hong Kong ICT Awards 2019.  Star Hoppers integrates the Chinese and Western star charts with information of astronomical events and related activities while telling the stories of constellations to you with its audio recordings.  With its digital star chart, you will find that people from the ancient Chinese and Western cultures created different constellation and asterism system due to their different associations with the stars. The star chart has three different operation modes: the Virtual Reality (VR) mode simulates the star field according to the location and orientation data obtained from the device to help you identify celestial objects and constellations; the Augmented Reality (AR) mode marks the celestial objects, constellations and asterisms on your camera image in real-time by employing the augmented reality technology; the Manual (M) mode allows you to navigate the star chart at will. Tapping on any constellations, planets, the Sun, Moon or Three Enclosures and Twenty-eight Mansions, you can listen to the recorded stories of the constellations or celestial objects.  Star Hoppers also introduces the basics of stargazing to promote the proper manner of stargazing as well as to help the novice to identify the constellations.  You may also select the Calendar function to receive the latest information of various astronomical events and activities provided by the Hong Kong Space Museum. You may use the Share function with third party apps to invite your friends to join the activities and share the fun of stargazing with you!  Features of the app: * Help users to learn and identify celestial objects and constellations with the realtime generated digital star chart at any locations in the world. * Display unique ancient Chinese star chart with the complete ancient Chinese asterism system including the Three Enclosures, twenty-eight lunar mansions and more. * Playback more than 200 bilingual audio recordings of basic information of celestial objects and asterisms in the Western and ancient Chinese cultures. * Employ augmented reality technology to label celestial objects and constellations on your screen instantaneously when you point the camera of your mobile device to the sky. * Provide the latest news on the coming Hong Kong Space Museum events such as astronomical films, lectures, stargazing activities etc. * Share astronomical events and activities information to your friends easily and invite them to join with you. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_GPS', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_CALENDAR', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_GPS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}