{
"name" : "Careerwill App",
"url" : "https://play.google.com/store/apps/details?id=com.careerwill.careerwillapp",
"package" : "com.careerwill.careerwillapp",
"category" : "Education",
"description" : "Careerwill App is Indias leading Government Jobs Preparation App (   ) helping Millions of Students achieve their dream of Government Job by Indias Best Educators like Gopal Verma, Gagan Pratap, Piyush Varshney, Satyendra Tiwari, Adutiya Vashishta, Vivek Yadav etc.   Rakesh Yadav Sir  :- Careerwill App        Careerwills Best Educators provides quality content with latest pattern & syllabus in both English and Hindi language for all competitive Exams like SSC CGL, SSC CHSL, SSC CPO, Bank PO, SSC JE, DMRC JE, Rajasthan JE, Delhi Police, RRB NTPC, CTET, Super TET, HTET Etc. Our Most Advanced Courses for Government Exams Preparation:   Maths Special   English Special   Reasoning Special   GS Special   CTET Special   Hindi Special   SSC JE/DMRC JE/ Rajasthan JE   Haryana Gk Special   Rajasthan Gk Special   Jharkhand Gk Special   Banking Special   Banking GA Special   Science Special   Bihar Gk Special   RRB NTPC    Why Choose Careerwill App for Competitive Exam Prep:   Live Sessions   Study in your own schedule anytime anywhere   Mukherjee Nagar Best Faculty at your doorstep   Live Doubt Solving Classes   Pocket Friendly Course Fee   Daily Current Affairs   Study Materials (Free PDFs)   Get Updates on Government Job Latest Exams (2020)   Previous Year Exams Discussion  Free Mock Test by our Educators  Course Provided for Following Government Exams ( ) in 2020-2021: If you are about to start your Government Jobs Preparation Journey, Study with our Courses from Mukherjee Nagar Best Faculty at a pocket friendly price.   SSC CGL 2020, SSC CHSL 2020, SSC Steno, SSC CPO, SSC, MTS etc. - SSC CGL/CHSL Previous Year Paper Discussion  - SSC CGL Reasoning, SSC CGL English  - SSC CGL Maths, SSC CGL GS  - Basics to Advanced Exam Preparation in Hindi & English language  - Mock Tests (Updated) by our Faculty   Banking Exams 2020 (IBPS Clerk 2020, IBPS PO 2020, IBPS RRB 2020, SBI PO, SBI Clerk & Other Banking exam preparation) - IBPS PO/Clerk Previous Year Paper Discussion  - Doubt Solving Classes  - Basics to Advanced Exam Preparation in Hindi & English   CTET 2020 Exam Preparation, UPTET, DSSSB, KVS, NVS 2020 Exam Preparation  - Child Development and Pedagogy  - English, Maths, Hindi  - History & EVS  - CTET Previous Year Questions   DMRC JE 2020, SSC JE 2020, Rajasthan JE Exam Preparation: - DMRC JE Electronics, DMRC JE Electrical  - SSC JE Mechanical, Electrical, Electronics  - Rajasthan JE Previous Year Paper Discussion   Indian Airforce X Group & Airforce Y Group 2020 (Technical & Non-Technical), Defence (NDA, AFCAT, CDS) Exam Preparation App: - Airforce X Group Practice Set & Airforce Y Group Previous Year Paper Discussion   Railway Exams (RRB JE, RPF, ALP, Technician and Group D) - Basics to Advanced Exam Preparation in Hindi & English   HSSC Haryana GK in Hindi (Haryana Police, Group D, Clerk, Patwari, Canal Patwari etc.) - Basics to Advanced Exam Preparation in Hindi & English   Other Exams like Delhi Police Constable/SI Exam, DSSSB, MP Police Constable/SI Exam etc.  Our Vision : Our Vision is to provide Best Quality Online Coaching for SSC, Banking Exams, Railway etc to all the students living in Bihar, UP, West Bengal, Tamil Nadu, Gujarat, Haryana etc who cant afford to come to Mukherjee Nagar to study.   Find us here: career Will Facebook YouTube ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}