{
"name" : "Français Authentique",
"url" : "https://play.google.com/store/apps/details?id=com.francaisauthentique.app",
"package" : "com.francaisauthentique.app",
"category" : "Education",
"description" : "Welcome to the free official application of Franais Authentique. My name is Johan and I created Franais Authentique in 2011 to help you learn to speak French in an enjoyable and natural way.  If you can understand but have difficulties speaking in French then Franais Authentique is for you. Dont just take my word for it, there are more than 300,000 delighted members of our community that have benefited and made remarkable progress with my easy to follow system.   This application was created for you to fit easily into your daily life and allow you to consume my free content easily from your mobile devices. Each week I put at your disposition a podcast (MP3 & PDF) and the videos can be found on my YouTube channel. All of my articles will be published automatically on the application so that you do not miss a second!   If you have just discovered Franais Authentique I would like to offer you a very warm welcome to the community. Take your time to explore the site and the concept of Franais Authentique. Subscribe to my free course The 7 Rules of Franais Authentique to understand the method. Do not hesitate to contact me or to come and join in the discussion on our lively and welcoming Facebook page.  If you follow me already I am grateful for the confidence that you place in me. I am very conscious of how lucky I am to be able to count on such a fantastic community. I hope that this application is both helpful and enjoyable for you. If you have any ideas or thoughts about how it could be improved please let me know.  NB: Franais Authentique is most suitable for non French speakers who already have a good level of comprehension or at least a basic understanding of French. The programme is based on a natural style of learning largely through listening and repetition so a basic foundation of French is highly advantageous. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.francaisauthentique.app.permission.C2D_MESSAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}