{
"name" : "Hungry Caterpillar Shapes and Colors",
"url" : "https://play.google.com/store/apps/details?id=com.storytoys.veryhungrycaterpillar.shapesandcolors.free.android.googleplay",
"package" : "com.storytoys.veryhungrycaterpillar.shapesandcolors.free.android.googleplay",
"category" : "Educational",
"description" : "Your kid will love solving puzzles and developing their reasoning skills with Eric Carles Hungry Caterpillar Shapes and Colors.   Encounter delightful and surprising interactions when the puzzles are completed. Watch as The Very Hungry Caterpillar floats away with a balloon, flowers magically grow, mechanical toys whirr into action, and hidden doorways open up for the Very Hungry Caterpillar to crawl into!   Prepare to be amazed as a magical learning adventure unfolds and your child learns about math, art, reading and writing. Explore this beautiful 3D playground. Your baby Einsteins are a lot smarter than even you imagined!   FEATURES  Over 50 puzzles in six categories which increase with difficulty to keep kids engaged and excited. Learn how to:  Recognise basic and advanced shapes  Sort and match shapes with similar colors  Compare light and dark shades  Identify patterns and sequences  Order shapes by size  Combine shapes to complete pictures  BENEFITS  Developed in line with the US Head Start Child Development and Early Learning Framework  Encourage logical thinking and math skills by comparing, sorting, identifying sizes and patterns, your baby Einstein will love learning to solve puzzles   Tapping and dragging strengthens fine motor skills  Kids interact with a wide range of colors and shapes   The Very Hungry Caterpillar  Shapes & Colors is designed for preschoolers and baby Einsteins, and is a follow-up to the global bestseller My Very Hungry Caterpillar:  * Kidscreen 2016 Award * Winner of the 2015 Bologna Ragazzi Digital Award * * The #1 Kids app in over 30 countries * * Tech With Kids Best Pick App Award * ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}