{
"name" : "Idioms And Phrases",
"url" : "https://play.google.com/store/apps/details?id=com.rishabhk.idiomsandphrases",
"package" : "com.rishabhk.idiomsandphrases",
"category" : "Education",
"description" : "Idioms And Phrases aims to aid in learning new idioms/phrases to improve English and hence the power of expressing oneself. Usage and examples are provided to make the learning process easier and smoother.  All this is done without causing overload of information, by following an Idiom/Phrase Of The Day format.  The idioms/phrases are retrieved from a carefully selected database which is relevant and useful.  May be helpful for exams like SSC CGL, Bank Exams, AFCAT etc.  Key Features:- -> Dual Theme - Light And Dark - Choose your favourite! -> Dark Bi-chrome Theme To Reduce Eye Strain -> Customizable Quiz - Choose quiz source, type, number of questions and time per question -> Star Favourite Idioms -> Long Press To Bookmark Idiom - During scrolling, down arrow takes you to the bookmarked idiom -> Search Available Idioms -> Random Tab - Displays an Idiom at random, along with usage and examples -> New Idiom Each Day -> Home Screen Widget   Note:-  1) Some manufactures like Xiaomi do not use the stock android but their own custom android, which blocks certain features of applications in order to conserve battery. This may prevent the automatic daily idiom/phrase fetch from working. It is recommended that you white-list this application from the blockers for the best user experience.  In MIUI (Xiaomi devices), go to Security -> Permissions -> Autostart -> Select Idioms And Phrases   2) The app uses a text to speech engine for pronunciation. It is highly recommended to download the Google Text To Speech Engine for the best experience.  3) Additional Voice Data may need to be downloaded to use voice accents other than your device default. If you are on a Wi-Fi network, the download will be done automatically.  If you are on a cellular network, go to Settings -> Language & Input -> Text-to-speech output -> Google text to speech engine settings and then disable Use Wi-Fi only.  In rare cases, you may have to install the voice manually using Install voice data.    Feel free to shoot an e-mail for feature requests/bug reports. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.rishabhk.idiomsandphrases.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}