{
"name" : "Disaster Management",
"url" : "https://play.google.com/store/apps/details?id=com.saduvu.disastermgmt",
"package" : "com.saduvu.disastermgmt",
"category" : "Education",
"description" : "Disaster Management Act, 2005 defines disaster as a catastrophe, mishap, calamity or grave occurrence in any area, arising from natural or manmade causes, or by accident or by negligence which results in substantial loss of life or human suffering or damage to, and destruction of, property or damage to, or degradation of environment and is of such a nature or magnitude as to be beyond the coping capacity of the community of the affected area.  A quick guide to Village Revenue Officer(VRO) IN REVENUE DEPARTMENT, MANDAL PLANNING AND STATISTICAL OFFICER / ASSISTANT STATISTICAL OFFICER IN DIRECTOR. App is designed for Environmental issues and Disaster Management This app explains Hazard, natural hazard, manmade hazard, vulnerabilities such as physical vulnerability and socio-economic vulnerability.  Geological Hazards classified as Earthquake, Tsunami, Volcanic eruption, Landslide, Dam burst & Mine Fire Water & Climatic Hazards are Tropical Cyclone, Tornado and Hurricane, Floods, Drought, Hailstorm, Cloudburst, Landslide, Heat & Cold wave, Snow Avalanche and Sea Erosion Environmental Hazards are Environmental pollutions, deforestation, Human, Animal epidemics, pest attacks, Desertification, pest infection, food poisoning and weapons of mass destruction. Chemical, Industrial and Nuclear Accidents such as Oil Spills etc Accidents related disasters are Boat/Road/Train accidents, air crash, Bomb/Serial bomb blasts, forest fires, building collapse, Electric Accidents, festival related disasters and mine flooding This app discusses the highlights of Disaster Management and Disaster Risk Management. Easy to read, crisp study material that is designed to meet the needs of Government job aspirants. App provides good knowledge and insight to Environmental issues and Disaster Management to those who want to understand concepts of Disaster management without spending much time.  App on Disaster Management 9 concise chapters and followed by quiz on topics of Environmental issues and Disaster Management that make you master on the Disaster Management subject. App allows Readers in 1)book mark the favorite questions on constitution of India 2)changing the modes between night mode & day mode 3)allows changing the font size. App helps to prepare for civil services examination (IAS, IPS, IFS), Engineering Services Examination (IES) , state services (State Public Service Commission), SSC, SSC CGL (Staff Selection Commission  Combined Graduate Level Exam 2018), Railway Recruitment Board(RRB), Defense, MBA, UGC/NET, Bank P.O, VRO, VRA, police, SI, constable & competitive exam on subject with concise material on Disaster Management.  Apps screens are designed such that easy navigation is maintained between study material, quiz, review attempted quiz & view book marked Favorite objective questions on Disaster Management.  App covers 260 MCQ (Multiple Choice Questions) on Environmental issues and disaster management that includes Current Affairs on disasters and disaster management. App on Disaster Management is best suited for all state services examinations like upsc (Union Public Service Commission), apspsc (Andhra Pradesh PSC), appsc (Arunachal Pradesh psc), apsc (Assam PSC), bpsc (Bihar PSC), psc , goapsc (GOA psc), gpsc Gujarat (Gujarat PSC), hpsc (Haryana PSC), jpsc (Jharkhand PSC), keralapsc (Kerala PSC), mppsc (Madhya Pradesh PSC), mpsc (Maharashtra PSC), npsc (Nagaland PSC), opsc (Orissa/Odisha PSC), ppsc (Punjab PSC), rpsc (Rajasthan PSC), spscskm (Sikkim PSC), tnpsc (Tamil Nadu PSC), tspsc (Telangana State PSC, tpsc (Tripura PSC), uppsc (Uttar Pradesh PSC), ukpsc (Uttarakhand PSC).  App is designed such away it covers key Highlights of Disaster Management and the Exercises on Disaster Management makes each student an expert on Disaster Management. This app explains the important aspects of Disaster Management in simple language.  Covers very important notes of chapters of Disaster Management. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE']",
}