{
"name" : "NEET Test Prep - Extramarks",
"url" : "https://play.google.com/store/apps/details?id=com.Extramarks.neetaiimspreparation",
"package" : "com.Extramarks.neetaiimspreparation",
"category" : "Education",
"description" : "If medical profession is your dream, NEET Test Prep App is all you need to realize it!  Extramarks NEET Test Prep App is an advanced and adaptive preparation platform for National Eligibility cum Entrance Test. Integrated in the app are all the latest changes in the exam patterns and format of NEET. The app has been curated by Indias top coaching faculty and helps test the preparedness for NEET. In addition, students gain access to Extramarks Sessions, which are live and recorded lectures delivered by experienced teachers, with proven track record of producing top NEET ranks over the past many years.   The NTA (National Testing Agency) has started conducting NEET completely in the digital mode. Extramarks NEET Test Prep App has shaped itself to the requirement of the day by providing superlative preparation resource and guidance through an advanced technological platform and by conducting National Level Live Tests. These tests are adaptive in nature. Through them, students can assess their exam prep and get detailed analytics of their performance, including national peer ranking and identify their strength and gap areas. In addition, they can get a feel of the actual exam environment and learn to manage time, while understanding the pattern of the examination.  A key feature of the app is Extramarks Sessions by in the form of live and recorded videos on all important topics included in the NEET syllabus. Students can also save and access these sessions offline. They are also provided with Downloadable Notes, created by experienced subject experts.   Doubt resolution is an important part of the app experience. Student can resolve their doubts during the Live Doubt Removal Sessions or by submitting their doubts on the app. They can also place a request for doubt removal session on specific topics they wish to address.   The app has a robust testing engine with different types of practice tests. Several mock papers, previous years papers and customizable chapter wise tests are available in the practice segment. Extensive reports are generated based on these tests, which help an aspirant understand areas of strength and gap. To give students an idea of their performance in comparison to other students, the app focuses on percentile rather than percentage marks. Along with factors like concept mastery, the app also uses data analytics to capture traits like speed to recommend to students their complete exam strategy.  With Extramarks NEET Test Prep App, you can practice 1000s of MCQs suited for all MBBS entrances. The mock tests are mapped to the actual exam pattern and difficulty level. Extramarks gives you the best CBSE NEET preparation while comprehensively covering subjects like Physics, Chemistry, Biology, Zoology, Botany, Organic Chemistry, Physical Chemistry, Inorganic Chemistry etc.   Highlights -  - National Level Weekly Tests with Ranking and Analysis - Extramarks Sessions  Live and recorded video lectures available 24x7 - Offline Access  Extramarks Sessions can also be saved offline - Downloadable Notes  prepared by experts, available for download - Papers and Solutions from Previous Years NEET - Full length Mock Tests  Based on latest exam pattern  - Question Bank - for NEET Physics, Chemistry and Biology - Detailed Performance Analysis based on Practice Tests and National Level Weekly Tests - Information on Exam dates, pattern and syllabus - Subscription Packages based on student needs - Free Access  to 2 recorded lecture per day and 1 premium lecture per week. - Micro-scheduling  personalized exam strategy and study plan  Be it Physics, Chemistry or Biology  all subjects can be tested through the platforms ever-increasing question bank. So, if students want to score top marks in their Medical Entrance Exams, like - NEET, AIMPT, CPMT, PGI, JIPMER, DNB, NBE, CET, etc. and get into prestigious institutes, this is the Test Preparation App that they need! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
"manifest_perms" : "['com.myapp.pack.permission.SET_ALARM', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_PROFILE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SET_ALARM', 'android.permission.READ_LOGS', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.MICROPHONE', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.WRITE_CALENDAR', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_CALENDAR', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.CLEAR_APP_CACHE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_LOGS', 'com.myapp.pack.permission.SET_ALARM', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MICROPHONE', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_CALENDAR', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SET_ALARM']",
}