{
"name" : "HOMER - Proven Learn-to-Read Program for Kids 2-8",
"url" : "https://play.google.com/store/apps/details?id=com.learnwithhomer.webapp",
"package" : "com.learnwithhomer.webapp",
"category" : "Education",
"description" : "HOMER Reading is the fun, interactive way to spark your childs passion for reading. Help your child build critical skills with a personalized learn-to-read plan! Download HOMER Reading and start a FREE trial to help your child fall in love with learning. After your free trial, your HOMER subscription costs just $7.99 USD/month, auto-renewing at the end of your free trial. You can easily cancel at any time during your free trial.   HOMER Reading is an early learning program for ages 2-8 that is personalized to your childs interests to help them fall in love with reading. It has been proven to increase early reading scores by 74% with just 15 minutes a day. And with stories and activities customized to each childs interests, theyll learn while having fun.  When kids read about what they love, they love learning to read. HOMER Reading combines your childs passions and current reading level to create a personalized learn-to-read plan on their Android phone or tablet. It includes thousands of lessons and games on the alphabet, phonics, sight words, and more. HOMER Reading is great for toddlers learning their letters, support during preschool, and continued learning to help children become advanced, confident readers.   MEMBERSHIP DETAILS:  A HOMER Reading membership is needed to access and create a personalized learn-to-read plan, as well as the rest of the content HOMER offers. If you are already an existing HOMER member, just log in with your username and password.   SUBSCRIPTION DETAILS:   You can easily cancel at any time during your free trial period  After your free trial period, your HOMER subscription costs just $7.99 USD/month.  If you do not cancel before the last day of your free trial period, your membership will automatically continue and a $7.99 USD per month membership fee will be charged to your account.   To cancel, go to the Google Play Store, click Manage My Subscriptions and click Cancel, or contact customer support (below) BEFORE the free trial period is over. If you have any questions about cancelling, visit Homers cancelling subscription FAQs at http://bit.ly/2yjSk2m.    CUSTOMER SERVICE:  Please send us an email at support@homerapp.com or visit https://homerlearning.zendesk.com/hc/en-us, and well gladly help you with any questions or concerns.   Privacy Policy: http://learnwithhomer.com/privacy/  Terms of Use: https://learnwithhomer.com/terms/  PRESS AND AWARDS:  HOMER has been featured on the TODAY Show and Morning Joe as well as in the New York Times, USA Today, Forbes, and Parents Magazine. HOMER has won the prestigious Teachers Choice and Moms Choice Awards.  KEY FEATURES:   Proven to increase early reading scores by 74% with just 15 minutes a day  Combines your childs passions and interests with their age and ability to create a personalized learn-to-read plan  The only program that actually teaches your child to read step-by-step  Thousands of expert-designed lessons on ABCs, sight words, and phonics for readers at every level  A program that grows with your child as they learn  Hundreds of stories your child will love, from classic fairy tales like Little Red Riding Hood to favorites like Thomas the Train  Download 150+ printable worksheets, learning games, and activities  Track your childs progress with the Parent Dashboard and record your child reading their first book  One membership designed for the whole family with up to 4 customizable profiles   FOR EDUCATORS:  HOMER is free to qualified and verified teachers and librarians to support educational instruction with progress tracking for up to 32 individual students. ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}