{
"name" : "Viruses",
"url" : "https://play.google.com/store/apps/details?id=com.soft24hours.dictionaries.dictionary24",
"package" : "com.soft24hours.dictionaries.dictionary24",
"category" : "Education",
"description" : "Viruses  The free application Viruses is very friendly, it has a beautiful and simple interface. The best choice for a pocket dictionary that is always at hand. From which you can learn a lot of new and interesting things, for example, that:  Zika virus Zika virus (ZIKV) is a member of the virus family Flaviviridae. It is spread by daytime-active Aedes mosquitoes, such as A. aegypti and A. albopictus. Its name comes from the Ziika Forest of Uganda, where the virus was first isolated in 1947. Zika virus is related to the dengue, yellow fever, Japanese encephalitis, and West Nile viruses. Since the 1950s, it has been known to occur within a narrow equatorial belt from Africa to Asia. From 2007 to 2016, the virus spread eastward, across the Pacific Ocean to the Americas, leading to the 201516 Zika virus epidemic.  Bayou orthohantavirus Bayou orthohantavirus (BAYV) is a species of Orthohantavirus first identified in 1993 in Louisiana. and later confirmed by other investigators. In 1996, the marsh rice rat was identified as the natural reservoir of the virus, indicating the virus to be widespread throughout the Southeastern United States. BAYV infection causes hantavirus pulmonary syndrome (HPS) and represents the second most common hantavirus in the United States behind the Sin Nombre orthohantavirus.  Nucleocytoplasmic large DNA viruses The nucleocytoplasmic large DNA viruses (NCLDV), are an order of viruses that contain the Megavirales or giant viruses. There are nine families of nucleocytoplasmic large DNA viruses that all share certain genomic and structural characteristics; however, it is uncertain whether the similarities of the different families of this group have a common viral ancestor. One feature of this group is a large genome and the presence of many genes involved in DNA repair, DNA replication, transcription, and translation. Typically, viruses with smaller genomes do not contain genes for these processes. Most of the viruses in this family also replicate in both the hosts nucleus and cytoplasm, thus the name nucleocytoplasmic.  Features:  The dictionary works offline - you do not need an internet connection. Access to articles (descriptions) offline, without an Internet connection (except for photographs);  Very quick search for descriptions. Equipped with a quick dynamic search function - the dictionary will start searching for words during input;  Unlimited number of notes (favorites);  Bookmark - you can add descriptions to your favorites list by clicking on the asterisk icon;  Manage bookmark lists - you can edit your bookmark lists or clear them;  Search History;  Voice search;  Compatible with modern versions of Android devices;  Very efficient, fast and good performance;  An easy way to share with friends;  The application is very easy to use, fast and with extensive content;  Automatic free updates every time new terms are added;  The directory Viruses is designed to occupy as little memory as possible.  Features Premium:  no ads;  photos, images of access offline;  Clear browsing history. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}