{
"name" : "Learn Amazon Web Services : AWS tutorial app free",
"url" : "https://play.google.com/store/apps/details?id=com.vrpmeone.LearnAWS",
"package" : "com.vrpmeone.LearnAWS",
"category" : "Education",
"description" : "This app is not affiliated with or approved by AWS.  Amazon Web Services (AWS) is Amazons cloud web hosting platform that offers flexible, reliable, scalable , easy-to-use, and cost-effective solutions.  if you want learn amazon web services free, so we are here with another phenomenal app which name is Learn Amazon Web Services : AWS tutorial app free . here you will get good materials stuff of AWS. we developed this app according to beginners and advance learners both. if you belong to any category Learn Amazon Web Services : AWS tutorial app free will try to help you.  here we divide our apps all content if several points:   1) basics of amazon web services 2) storage of amazon web services  3) backbone of amazon web services 4) databbse of amazon web services 5) and other stuff of AWS 6) Interview Questions of AWS  we were trying to make this apps amazon web services tutorials offline and wanted to make this app totallyAWS tutorials offline, but with having of some designing library issue, we couldnt make it happened. but that doesnt mean. we put all our stuff at any x server. our all stuff in this app only. you will get fast access of AWS tutorials . you just need to do mobile data on while using this app.   we have also taken care of your exam of job interview perspective of learning :   Learn Amazon Web Services : AWS tutorial app free will help you there a lot. if you are learning aws for your college studies or , for any kind of things. this app will help you there.  we put all the latest interview questions and answers of amazon we services.   if you like our work then, you can share our work with your friends and do not forget rate us on play store, and if you want us to make any app for your help then contact us on gmail or on whats app.   gmail : vrpmeone@gmail.com whats app : 9624752577   our references :   www.javatpoint.com www.tutorialspoint.com www.iconfinder.com ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}