{
"name" : "Kids Learn Colors 🌈🚦",
"url" : "https://play.google.com/store/apps/details?id=com.forqan.tech.iLearnColorsLite",
"package" : "com.forqan.tech.iLearnColorsLite",
"category" : "Education",
"description" : "This application helps the small kids to learn the colors with many interesting sections.  iLearn Colors for Preschoolers has 7 sections for colors learning: 1. Learn the colors, the kid will learn the color and can touch objects and get the color pronounced 2. Match between the colors and the corresponding objects 3. The kid is required to touch the objected with the pronounced color 4. Colors sorting 5. Colors memory: match the cards with the same colors 6. Another interesting section for colors matching 7. Match the filled shape to its skeleton: circle, square and triangle.  We believe that preschool kids have to have fun in order to learn and we come with a very interesting and enjoyable application for teaching the small kids the colors. This application is one a of the iLearn series for preschooler and all of them are educational. The series is addressing all the skills expected by 2-6 years old: colors, fruits, vegetables, numbers, letters, sorting, shapes and more.  We, at Forqan Smart Tech, have always sought to provide the best for your family through applications designed, and directed each age group separately, our belief in the feature each evolutionary stage passes by your son, but in order to lend life skills and the mentality to learn and grow and play correctly and properly, and to communicate with his peers and the environment surrounding it.  Download iLearn: Colors for Preschoolers and enjoy learning with Forqan Smart Tech ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.forqan.tech.iLearnColorsLite.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}