{
"name" : "Coinage of India – New & Old Coins of India",
"url" : "https://play.google.com/store/apps/details?id=com.craftfive.indiancoins",
"package" : "com.craftfive.indiancoins",
"category" : "Education",
"description" : "Coin collectors, organize your entire Commemorative Coins of India, British Coins of India & Republic Coins of India collection in this free, easy-to-use coin collection numismatics app. Coinage of India numismatics app offers an extensive Commemorative Coins of India, British Coins of India & Republic Coins of India catalogue to choose from, allowing you to quickly begin adding your Pice, Anna, Paise, Paisa, Rupees and Mohur to the app.   Improve your coin collecting experience with an extensive feature list: -  - Complete catalogue of British Coins of India - Complete catalogue of Republic Coins of India - Complete catalogue of Commemorative Coins of India - Allows users to keep track of their personal coin collections - Manage Your Coin Collection - Track Your Coin Collection - Explore Your Coins Collection - Identify Missing Coins In Your Collection - Track And Manage East India Company Coins  - Track And Manage Empress Victoria Coins  - Track And Manage King Edward VII Coins  - Track And Manage King George V Coins  - Track And Manage King George VI Coins  - Track And Manage Republic India Coins  - Track And Manage Circulating Commemorative Coins  - High resolution images of obverse and reverse sides of Coins of India - Accurate details of metal, weight, diameter, mint mark and shape of Coins of India - Year wise mintage details - Approximate coin prices of British India coins & Republic India coins - Complete numismatic specifications - Does not require an active internet connection to operate  You can learn the fairly accurate coin prices of Commemorative Coins of India, British Coins of India & Republic Coins of India in Indian Rupees. Each coin contains detailed numismatic info, high resolution images of obverse and reverse sides of coin, weight, size, rarity, mint mark, mint identification remark and mintage.  Add on features: -  - History of British Mints and Republic India Mints - List of different mint marks on Indian Coins - Known fake coins with images - Rare coins of Republic India - Metal composition of Indian Coins  New section on how to book new proof and UNC Coins of India through online and counter from Mumbai, Kolkata and Hyderabad Mints.  Buy and Sell coins tab helps you to sell Coins of India to numerous people through trusted websites and through Facebook groups, you can interact directly with buyer for buying and selling respectively.  - Buy Old Indian Coins - Sell Old Indian Coins - Buy Proof Coins of India - Buy UNC Coins of India  Whether youre a novice, or an advanced numismatist - collecting Coins of India, the Coinage of India App will prove indispensable at coin shows, coin shops, flea markets or anywhere you might encounter an Indian coin for sale.   I hope you enjoy using the Coinage of India Numismatics App, and please let us know if you have any issues or feedback. I hope to add more images and Indian coins sets depending on what people are interested in. Thanks!  Note:-  - All Commemorative, British India & Republic India coin prices are valued in Indian rupees. - All Indian coin prices shown in the Numismatics app should only be considered as estimates  - Numismatics app coin prices might not be same as the coin prices of shops or auctioning portals - Market value of a coin depends on the rarity and availability of the coin  Launching Soon:-  - Madras Presidency Coins of India - Bengal Presidency Coins of India - Bombay Presidency Coins of India - Indian Coins - Proof Sets   Join our groups: Twitter: - https://twitter.com/coinage_india Facebook: - https://www.facebook.com/C5COI/ ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.amazon.device.messaging.permission.RECEIVE', 'com.craftfive.indiancoins.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.VIBRATE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'com.craftfive.indiancoins.permission.RECEIVE_ADM_MESSAGE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.craftfive.indiancoins.permission.RECEIVE_ADM_MESSAGE']",
}