{
"name" : "FREE Korean by Nemo",
"url" : "https://play.google.com/store/apps/details?id=com.nemoapps.android.korean",
"package" : "com.nemoapps.android.korean",
"category" : "Education",
"description" : "Nemo is designed to start you speaking the most useful words in Korean immediately and confidently. With millions of downloads from around the world, Nemo is now available for Android phones and tablets.   Every Korean word is pronounced clearly in high quality audio from a native speaker.  All audio is downloaded to your device, and is available offline or in airplane mode.  Master your accent with the Speech Studio. Simply record yourself saying a phrase and then hear your voice next to the teachers. Then try again. Youll be AMAZED how quickly your foreign accent melts away.  Nemo is not built around lessons at all. It is meant to be picked up throughout the day, whenever you have a few minutes to spare.  NO PRIOR KNOWLEDGE of Korean is required.  Nemo targets the words and phrases most often used in conversation. For beginners, weve prepared If You Only Learn 10 Things, If You Only Learn 50 Things, and If You Only Learn 100 Things lists for a fast introduction to the essentials. Intermediate learners can progress to a course of the highest frequency words needed for travel and business and begin to have conversations in Korean in a month. Advanced students will benefit most from the Speech Studio technology to correct their foreign accent.  With Nemo, you can customize flashcards to exercise the language skill you want to improve. When beginning a new topic, setup flashcards to practice translation of Korean to English so you can build familiarity with new words. Next, switch to translate English to Korean to train your recall and ability to speak. To complete mastery, switch to cards that specialize in fine-tuning your listening and perfecting your pronunciation.  Any card can be marked as a favorite, allowing you to make your own custom deck of cards to focus on the words of the day. Turn on Review Mode to recap what you practiced earlier in the day to boost your memory retention.  Dive into what you want to learn at any time. The phrasebook offers quick access to the vocabulary in the app through a Korean-English dictionary interface. Nemo also functions as a translator. Simply find the words you need in the search interface and play its audio through the device speaker.   Get off the beaten path or find comfort with traveler phrases.  Build your proficiency with numbers and the most important verbs and sentence building blocks.  Korean is the primary language spoken in South Korea and the cities of Seoul, Incheon, and Busan. It is normally written in Hangul script. In this app, you can display Korean words in either Hangul, Roman characters, or both.  Use your new skills to make friends, impress old friends, bring smiles to children, get out of jams, experience new things, talk confidently, and make your travel and cultural experience more rich and fulfilling.  Download this free app now! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.RECORD_AUDIO']",
}