{
"name" : "Brick Train Build Game For Kids & Preschoolers",
"url" : "https://play.google.com/store/apps/details?id=com.laboladoapp.labo_brick_train_5y_free",
"package" : "com.laboladoapp.labo_brick_train_5y_free",
"category" : "Educational",
"description" : "Labo Brick Train is an amazing train building and driving app for children. It provides a virtual sandbox where children can freely build and play with brick trains.  In Labo Brick Train, children build unique trains by putting together pieces of colorful bricks like a puzzle. They can select from 60+ classical locomotives templates, which range from old steam train to powerful diesel locomotive to modern high-speed train. Optionally, they can create entirely new designs using various brick styles and train parts. Once a train has been built, the children can thus go on the railway and experience exciting adventures.  Features: 1. 2 design modes: template mode and free mode. 2. 60+ classical locomotive templates in template mode. 3. various brick styles, locomotive parts with 10 colors. 4. classical train wheels, and a large number of stickers. 5. 7+ amazing railways, built-in a variety of mini-games. 6. Share trains with other players and browse or download trains created by others online.   - About Labo Lado:  We develop apps for kids that inspire creativity and pique curiosity.  We do not collect any personal information or include any third-party advertising. For more information, please see our Privacy Policy:  Join our Facebook Page:  Follow us on Twitter:  Support:   - We value your feedback  Feel free to rate and review our app or feedback to our email: app@labolado.com.   - Need Help  Contact us 24/7 with any questions or comments: app@labolado.com  - Summary Children love transportation games, car games, train games and railway games. Labo Brick Train is a digital train toy, train simulator and train game for kids. Its an excellent game for kids and preschool. In the app, You will become a train builder and train driver. You can create trains or locomotives freely, or build classic locomotives from templates(George Stephensons Rocket, Shinkansen High-Speed Train, Big Boy, Bullet, Concept Train, Monster Train, Metro, etc.). You can race your train on the railways. Labo Brick Train is a game for train fans and locomotive fans. Its a train game that train fans. Its a game for boys 5+ and girls 5+. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION']",
}