{
"name" : "Cooking Unicorn Rainbow Cake- Food Game for girl",
"url" : "https://play.google.com/store/apps/details?id=com.funpop.android_unicorncake",
"package" : "com.funpop.android_unicorncake",
"category" : "Education",
"description" : "Sweet cake baker, how about make the sweet desserts in this cake baking game? Make cakes such as unicorn cake has been a new trend in the sweet bakery! Wanna make a cake in this cooking game for girls? Wanna be the best cake maker in cake making games? Start your baking story to bake cakes in this cake game with unicorn chef today! Everything has been ready for sweet maker in the baking game for girls. Dont believe that? Play the free eating game to verify Now!  Unicorn Food Baking Game Features:  1.Sweet unicorn cake is the best choice of sweet maker for any important day, such as birthday, party, and festivals. Agree? 2.In the cake games, youll make a tasty recipe of a sweet cake in shape of a rainbow unicorn. Show your creativity! Baking any kinds of rainbow unicorns you can imagine in my bakery! 3.First of all, mix various ingredients to create the unique delicious flavor! Then design your rainbow unicorn cake with colorful decorations, for example, colorful candies, sweet fruits, and colorful rainbow sprinkles in the colorful land. 4.In the bakery games, you can try dozens of food materials: icing butters, tasty cream, milk, eggs, food coloring, sugar, salt, flour and so on. All the kids can also see them in the fun kitchen food maker game! 5.And also you can play dozens of realistic cooking tools: glasses, dispenser, kettle, bowl, oven, pot, mixer, spoon. Sounds great! I really love my bakery empire! 6.I see a naughty fondant fat unicorn lying on the colorful cake stand with satisfaction! Does the bite of the sweet unicorn cake show that he ate the sweet deserts? Or its just the cake decorating? 7.That colorful rainbow unicorn is spilling rainbow! It is so amazing! I know its just the fondant unicorn on the delicious cake, but Ive never seen such tasty gateau in any other baking games! 8.Now design cake from frost cakes! Girls, mix cakes cream with a blender and then you can also get some beautiful decorations from the queen cakes in the bakey! By the way, some kids called cake to be kek.Little baker, dont make the same mistake in this unicorn cake game.  9.In the cooking academy, you should have learn how to bake a cake after this tasty cake games. Besides, making food can also bring you much fun in the make food games. 10.Little chef, when you put your delicious unicorn cake over there, and eat cakes in the bakery game, youll find the baking fun with unicorn food!  Such funny bakery story! Lets get fun to make sweet and colorful unicorn rainbow cake in the fun girl kitchen game.What are you waiting for?Download this sweet baking cake game TODAY!  ABOUT FunPop  FunPop are specialize in casuals games on mobile platform. We are aiming to provide innovative & educational game for the whole family. We help them to learn the basic life skills and good habits through our games.  Visit us: http://www.funpop.com.cn Watch us: https://www.youtube.com/c/FunPopMedia  CONTACT US  Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@funpop.com.cn ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.ACCESS_WIFI_STATE', 'com.funpop.android_unicorncake.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}