{
"name" : "UCEED: Online Mock Tests",
"url" : "https://play.google.com/store/apps/details?id=com.edugorilla.dsguceed",
"package" : "com.edugorilla.dsguceed",
"category" : "Education",
"description" : "Preparing for UCEED Exam? Download the No. 1 Vernacular Test Series app #EduGorilla and get: - 12,446+ mocks for 460+ competitive exams - Questions that you would probably get in UCEED Exam - A multitude of UCEED mocks, sectional tests, and previous year papers - Tests in both English and Hindi  About UCEED:   Undergraduate Common Entrance Examination for Design UCEED is an entrance examination conducted by Indian Institute of Technology, Bombay. It is a joint entrance examination for admission into Bachelor of Design programs in IIT- Bombay, IIT- Guwahati and IITDM - Jabalpur. But quality tests are hard to attain for this purpose. To help you with your preparation for the UCEED exams we present to you the UCEED App. Practice online mock tests on the EduGorilla App for the same and gain remarkable results.  UCEED App Details:    UCEED app helps to prepare for English, mathematics and logical reasoning questions.   UCEED test series provides syllabus wise unique questions.   UCEED test series by EduGorilla also helps to prepare for UCEED questions based on the latest syllabus.  Previous year papers and mock tests are also provided for better practice of UCEED  UCEED Online Test Series:   Practice UCEED online test series only on EduGorilla. The test series are specially designed keeping in mind the level of UCEED. All the mock tests are based on the updated exam pattern and can be accessed 24x7 online.  In UCEED Mock Test:   Get more than 120 Mock Tests for UCEED. The test series get updated on a regular basis. You will get new mock tests for UCEED exams that can be accessed online anywhere anytime. Sectional tests and topic wise mock tests are also given to help you practice more. Key Features of EduGorillas UCEED Test Series:   EduGorilla offers a lot of features in its UCEED test series    Exams covered: UCEED Subject-wise Tests and Sample Question papers  More than 120 mock tests available  247 Online Access  Personalized Performance Analysis of your mock test  Online Mock Tests as per the latest pattern  Subjects Covered:   English language (comprehension, vocabulary and expression), language ability, logical reasoning, quantitative ability, data interpretation, basic mathematics .  Alerts and Updates:   Now practice EduGorilla UCEED test series on the go! Get regular alerts and latest updates of UCEED like exam notifications, important dates, syllabus, etc.  Practice mock tests, and various online topic wise tests on the EduGorilla UCEED App. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}