{
"name" : "Math Games for Kids - K-3rd",
"url" : "https://play.google.com/store/apps/details?id=com.jdsoftwarellc.mathgames",
"package" : "com.jdsoftwarellc.mathgames",
"category" : "Educational",
"description" : "Math Games for Kids app is designed for Kindergarten,1st grade, 2nd grade, and 3rd grade students. Math Games contains a variety of mini games to help teach your child math skills. The learning games help young kids have fun with math and numbers. They help students get familiar with the numbers even at a preschool level. The math lessons include multiple grade levels: Preschool, Kindergarten, first grade, second grade, and third grade.  The app is structured into worlds, one for each grade. Each world contains a path of mini games with lessons appropriate for the respective grade. As the kid passes a level, the next level is unlocked. The path lets the child see the progress as they pass each game and helps encourage more learning.   Each grade consists of several different lesson plans throughout their adventure in each world. Math Games for Kids is not just basic addition and subtraction fact tables. The lessons include and are not limited to: Counting, Find the unknown in the equation, Skip Counting, Find the Number, Smallest/Largest for the basic levels and become harder at the higher levels. To see all the lessons, click on the Scores button on the main menu. You can also track your students score per level and lesson.  Lessons  Preschool: Find the Shape, Pick the Color, Find the Number 1-10, and Counting 10 Kindergarten: Adding 1-10, Skip Count by (2/5/10), Subtraction 1-10 First Grade: Adding 1-20, Addition plus 10 max 100, Subtraction 1-20, Addition Unknown, Max/Min 100 Second Grade: Addition 1-100, Addition Carry, Adding double digits, Multiplication 2/3/5, Max/Min 1000 Third Grade: Subtraction double digits, Multiplication 1-10, Division 1-10  6 Games included..  Ice-cream Bubble Pop ------------------- Have fun popping bubbles as you stack a super ice cream cone. Watch out! the ice cream might fall over.   Rat Race ------------------- Find the correct word to speed up your rat to win the race.  Fire Truck ------------------- Help put out the fire by responding with the correct answer    Jigsaw Puzzle ------------------- Listen to the number and then complete the jigsaw puzzle to see it.   Parachute Fish ------------------- Mr. Pelican is hungry and it is his lucky day. Fish are parachuting down. Help him to learn to eat the right number.   Animals in Space  ------------------- Find the correct number to build a rocket. Blast off! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
}