{
"name" : "Dragonfly ID",
"url" : "https://play.google.com/store/apps/details?id=com.birdseyebirding.birdseye.dragonflyid",
"package" : "com.birdseyebirding.birdseye.dragonflyid",
"category" : "Education",
"description" : "The Dragonfly ID app is a comprehensive and easy-to-use resource to find and identify dragonflies and damselflies across the US and Canada. Geared towards both the avid dragonfly-watcher, and beginners, Dragonfly ID will help you find spots to look for dragonflies near you, help you identify the dragonflies and damselflies you see in the field, and learn more about the species you find.  Additionally, Dragonfly ID enables users to easily view and submit Odonata sightings from the field. This important citizen science project enhance our understanding of Odonata distributions and abundances.  DISCOVER SPECIES AROUND YOU  View species lists for any location in the US or Canada based on sightings in the OdonataCentral database  Filter to show recent sightings, or for any month(s) of the year  Bar charts of seasonal abundance built from the OdonataCentral database of sightings  Maps of recent sightings from OdonataCentral  LEARN  Use Smart Search to quickly identify a species by color, size and habitat  Read descriptive text to help confirm the identification (contact us if youd like to help!)  View the crowd-sourced gallery of images (contribute your photos at birdseye.photo/dragonflies)  Dragonfly ID is a collaboration between BirdsEye and the folks at OdonataCentral and the Xerces Society with special thanks to the membership of the Dragonfly Society of the Americas and users of OdonataCentral, the Migratory Dragonfly Partnership, and PondWatch for their data contributions. ",
"desc_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION']",
}