{
"name" : "MyMusicTheory - music theory exercises",
"url" : "https://play.google.com/store/apps/details?id=com.myrapps.musictheory",
"package" : "com.myrapps.musictheory",
"category" : "Education",
"description" : "Practice music theory and train your sight reading skills. Learn all important topics of music theory. Start with simple notes in treble clef for total beginners up to identification of exotic scale modes in mezzo-soprano clef.  These topics are covered:   Key signatures up to 7 accidentals of major or major scale  Intervals including compound intervals (up to double octave). In identification mode can be double sharps or double flats used.  Chords including triads, sixths, sevenths, extended chords (9ths, 11ths), suspended chords, open voicing, inversions...  Scales including all scale modes of major or minor scales (modes of harmonic or melodic scale), neapolitan scales, pentatonic scales  Diatonic chord degrees on major or minor scale as triads or seventh chords  Rhythm exercises with up to sixteenth notes or dotted and double dotted notes. Complete bars with notes or rests or identify note lengths of given notes (even breve note)  Practice notes in these clefs: treble, bass, alto, baritone (C or F), french violin, mezzo-soprano, soprano, tenor  Various note naming schemes: English (CDEFGAB), German (CDEFGAH), Latin (DoReMiFa...)  This app helps you to prepare for Levels 1 - 5 of ABRSM* however it does not cover all the topics. Please check the official syllabus.  * This app is not affiliated with Associated Board of the Royal Schools of Music. All names, copyrights and trademarks belong to their respective owners. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}