{
"name" : "Find the Shapes Puzzle for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.edubuzzkids.findtheshapeforkids",
"package" : "com.edubuzzkids.findtheshapeforkids",
"category" : "Educational",
"description" : "This free Find the Shape for Kids is an educational and entertaining game that helps your kids develop matching, tactile and fine motor skills while playing with different 2D shapes. It is a nice, simple, fun, and colorful game for preschool-kindergarten kids! Play with Shapes is adeptly designed to help kids practice identifying various shapes.  In this game:  1. Find the Shape: kids simply need to identify various shapes. For this, they need to find the shape asked.  2. Bingo game: Learn shapes while playing BINGO game...  Features: High-quality puzzle game for toddlers and preschool kids from ages 1 to 7 with colorful letters! Easy to use and control Fun for children Learn to recognize 2D shapes. Sweet background music Universal app for all phones and tablets This game is a perfect way to learn about various shapes and improve their hand-eye coordination. And last but not least ***All puzzles are available for FREE*** Privacy Disclosure: As parents ourselves, EDUBUZZKIDS takes childrens wellness and privacy very seriously. Our app:  Does not contain links to social networks  Does not collect personal data But yes, it does contain advertising as thats our means of providing the app free of cost to you  the ads are carefully placed such that the kid is least likely to click on it while playing. Feedback Please: If you have any feedback and suggestions on how we could further improve the design and interaction of our apps and games, please visit our website http://www.edubuzzkids.com or leave us a message at edubuzzkids@gmail.com. We would be glad to hear from you as we are committed to update all of our apps and games on a regular basis with new features and also want to get some ideas for future app development. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
}