{
"name" : "Princess House Clean Up – Girls Cleaning Game",
"url" : "https://play.google.com/store/apps/details?id=com.funpop.android_castleclean",
"package" : "com.funpop.android_castleclean",
"category" : "Education",
"description" : "While beautiful princess flied back to her lovely castle, she found that she need home cleaning  for her upcoming royal princess ball. House cleaner, can you help to opruimen house dust for princewess in home cleaning games? Clean up makeup room, dressing up room and royal garden to prepare the princess party. Besides, design the house is also very important.Little helper, you can have fun cleaning up experience in princess castle. Do the house work in the big house as your home, you will improve your house cleaning skills. Girls, lets complete the big home cleanup and tidy up the beautiful garden now. Hold a wonderful princess salon party in the girls cleanup game.  Cleaning Home and Kids Cleen Games Features:   1.Girls, do house cleaning in the royal castle! The princesss castle is full of messy dirt. Help princess to fix house, clean home, tidyup, and design princess room , get professional housekeeping skill in the cleaning games. 2.House keeper, lets tidy makeup room first! Clean up the house by dusting, mopping, and maintain things like makeup tools,cosmtics. Wow! Amazing! You recover the princess makeup house. 3.Princess girl, time to clean home. Clean up in makeup room has lots of fun. Keep my things clean tidy is very important for girls. 4.Look at those princess dresses! They are so dirty and messy! Clean them up right now! Have cleaning fun in clean home games! 5.Do you like keeping house work? Play this house clean app to practice how to tidyup in cleanup games. 6.Every little girl loves to clean home and decorate house. How about you? Will you do bathroom clean up or any other house work? 7.OMG!! Everything is messed up in the garden. Show your professional cleaning skills for spring cleaning and dusting.  8.Wow! Clean up all the things about the home is so amazing. Lets do girl clean right now. The house will be keeping cleaning after you tidy bedroom. Keep house cleaning in house games all the time! 9.I am counting on you for my house cleanup work. Princess house clean is the best fun cleaning game for all the girls who love house clean! Hope you can also have a happy cleaning in your home.  Play this princess cleaning games to learn housekeeping skill Download this game to enjoy the cool cleaning game ever created!   ABOUT FunPop FunPop are specialize in kids games on mobile platform. We are aiming to provide innovative & educational game for the whole family. We help them to learn the basic life skills and good habits through our games.  Visit us: http://www.funpop.com.cn  Watch us: https://www.youtube.com/c/FunPopMedia  CONTACT US  Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@funpop.com.cn ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.funpop.android_castleclean.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}