{
"name" : "FlexiJoy - A learn and Earn Money App",
"url" : "https://play.google.com/store/apps/details?id=com.flexijoyapp",
"package" : "com.flexijoyapp",
"category" : "Education",
"description" : "FlexiJoy is a Learn and earn money app.   For Candidates- Are you looking to earn money immediately? Do you want to learn skills free which will make you confident in your life through the method which keeps you engaged?  -Work with 100+ of companies as a freelancer, -Work and earn from the ease of your home, -It is a personality development app that helps you learn employability skills like English, giving an interview, communication, necessary technology skills. This interview skills app, teaches you email configuration, working with apps, professional resume writing, and many more lessons that help you earn faster.  For companies- The freelance job app assist companies in finding suitable workforce at scale for their business  -on-demand workforce wherever, whenever, -Grow your business with minimum cost, -Pay only on an outcome basis,  FlexiJoy work from home jobs app currently provides services in following work type categories- -Business Development & Marketing, -Auditing & Verification, -Re-seller (Entrepreneurs) -Data entry & App work/Click work, -Driver & Delivery, -Vendor acquisition, - Technical engineers (IT & Electronics) for troubleshooting and maintenance,   App Features- -Post and apply for flexible work, -Filtration and selection of candidates, -Notification for latest work & courses, -Certification for each completed course, -Earn points through gamification, -Interactive learning with engaging and gamify contents, -Training of candidates as per job role,   In this app Employability and micro-entrepreneurship (Small business owners) Problems are uniquely itemized, classified, and addressed. Automatic notification occurs for any future opportunity on the same skill set.  Training Module: Training Module can help the students discover career paths, learn skills free, and find courses as per on job application for them. This interview skills app will deliver learning experiences with fun, faster, and more accessible methodology.   Content is limited, focusing on outcome skill development, professional resume writing and earning. Content is easy to learn and engaging through gaming and other interactive learning features on this personality development app.  This work from home jobs app provides an opportunity to learn at a nominal cost and thereby earn in that field itself.  On this earn money app, students can earn coins by playing games for learning, by referring friends and can use those coins for subscriptions, applying for high demand jobs and buying for trending courses, etc.  Students will learn employability skills, get certification post each course completion, and that will be added to their profile.  Flexible work Seekers/Students: This freelance job app will introduce students to new Flexible work possibilities (part-time works, freelancer, Internships), interview communication skills which will show them the pathway to gain confidence, earn faster and more.  The students/Flexible work Seeker will get a picture of continuous learning as a profession.   FLEXIJOY learn skills app will enable people to study their preferred subject and get Flexible work in that field.  This app outlines the interview communication skills needed and provide content and connection to them. ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.CHECK_LICENSE', 'android.permission.READ_CONTACTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PROFILE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}