{
"name" : "All You Can ET",
"url" : "https://play.google.com/store/apps/details?id=com.CREATELab.AllYouCanET",
"package" : "com.CREATELab.AllYouCanET",
"category" : "Educational",
"description" : "All You Can ET is a game designed to train cognitive flexibility, a subskill of executive functions. Cognitive flexibility involves inhibiting a prior perspective and considering a new perspective (Diamond, 2013).  Players need to apply frequently changing rules to give differently colored aliens the right food or drink they need to survive.  How does this support learning? Executive functions refer to a set of top-down, goal-oriented cognitive processes that enable people to control, monitor and plan behaviors and emotions. Miyake and Friedmans model supports a unity-and-diversity view of EF in that it incorporates the three distinct but related components of EF: inhibitory control, task-switching and updating (Miyake et al., 2000).   What is the research evidence? Our research suggests that All you Can ET is an effective way to train Cognitive flexibility. Homer, B.D., Plass, J.L., Rose, M.C., MacNamara, A.*, Pawar, S.*, & Ober, T.M. (2019). Activating Adolescents Hot Executive Functions in a Digital Game to Train Cognitive Skills: The Effects of Age and Prior Abilities. Cognitive Development, 49, 20-32.   Research has found that EF is related to performance in literacy and math along with long-term gains in school performance and academic readiness (Blair & Razza, 2007; Brock, Rimm-Kaufman, Nathanson, & Grimm, 2009; St Clair-Thompson & Gathercole, 2006; Welsh, Nix, Blair, Bierman, & Nelson, 2010) and that disparities in EF among preschool children from low-income versus high-income homes may contribute to the achievement gap (Blair & Razza, 2007; Noble, McCandliss, & Farah, 2007).  This game is part of the Smart Suite, created by New York Universitys CREATE lab in collaboration with the University of California, Santa Barbara, and The Graduate Center, CUNY.   The research reported here was supported by the Institute of Education Sciences, U.S. Department of Education, through Grant R305A150417 to the University of California, Santa Barbara. The opinions expressed are those of the authors and do not represent views of the Institute or the U.S. Department of Education. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION']",
}