{
"name" : "Find Them All: Cats, Dogs and Pets for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.knbmedia.findthemallpetlite",
"package" : "com.knbmedia.findthemallpetlite",
"category" : "Educational",
"description" : "Dogs, cats, hamsters and rabbits - all their favourite pets await them in our new game. Theyll love them!  Find Them All: My Pets is the latest addition to our collection of educational games for children aged 2-8.  With My Pets, your children will discover all about cats and dogs of all breeds and also hamsters, rabbits and other members of the family.   This multi-lingual, entirely spoken game offers numerous fun things to do: - Find the animals on the screen  - Take their photos  - Solve puzzles  - And for the older ones, quizzes and videos!  Your children will learn all about pets and have fun doing so!  NEW Even more fun with the mic enabling kids to record themselves replacing the animals name!  HERES A THOUGHT! Make the game last longer by printing out game albums: cut, fold, collect!  FEATURES - Contents: 48 animals to discover. - Entirely spoken: children are autonomous, even the youngest ones. - Multi-lingual: the names of the animals are available in several languages. You can choose to change the language in which the game is played. - Educational: discover animals through photos, sound, videos and audio commentary. - Adapted to each age group: numerous activities during short games with difficulty levels adapted to the child. - Safe: No adverts, no external links and a special parents zone. - Multi-user: each child can have their games with their settings. - Printable booklet: albums can be printed and assembled through folding.  HOW TO PLAY THE GAME - The child looks for the animals on the scene on the screen. He or she then unlocks an animated card for that animal and can listen to its name in several languages or record his or her voice. - They then win a camera which means they can explore the scene creating their own photo album. - Night falls: they must find the animals in the night, with the help of a torch - And win the chance to convert their photos into a jigsaw puzzle (4 to  42 pieces)! - Then comes the PhotoQuiz; they have to take a photo and answer a series of questions to win a picture of the animal. - And finally, they have to find the cameraman to discover videos of the animals.  ABOUT OUR FIND THEM ALL COLLECTION Our collection comprises four games with different themes: Looking for Animals, Dinosaur World, Fairy Tales and Legends and Pets. Various versions exists (with in-app purchases, as a complete version or in a bundle).   HELP AND SUPPORT Please feel free to contact us through the games Settings menu or on our website www.find-them-all.com or our Facebook page https://www.facebook.com/FindThemAll! ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'com.android.vending.CHECK_LICENSE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.android.vending.BILLING', 'com.knbmedia.findthemallpetlite.permission.C2D_MESSAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
}