{
"name" : "Chinese English Dictionary Translation - Hanzii",
"url" : "https://play.google.com/store/apps/details?id=com.eup.hanzii",
"package" : "com.eup.hanzii",
"category" : "Education",
"description" : "LEARNING CHINESE WITH POWERFUL CHINESE ENGLISH DICTIONARY TRANSLATION  Hanzii is the full-featured Chinese English dictionary/ Chinese translation you are looking for. Smart Chinese translator can help you translate English to Chinese, Chinese translate in English easier with camera, voice, handwriting recognition. Useful Chinese Dictionary - Easy lookup Chinese vocabulary, Chinese character, grammar  Major features: Smart English to Mandarin Chinese translator with OCR: Accurate Chinese English translator by:  Draw Chinese characters  Offline Chinese translate voice  Experience OCR tech: Optical Character Recognition (OCR) engine helps you translate Chinese characters in images. Recognition Chinese character, Chinese paragraph with your Live Camera or on still Pictures (from your gallery) either horizontal or vertical Chinese text.  Powerful Chinese English dictionary:  Lookup words by Chinese character, Pinyin or English to Chinese vocabulary with examples, related words, pinyin.  Lookup Chinese characters to results include Pinyin, sets, drawings, detailed explanations  Lookup pictures that clearly describe the Chinese translated words  Lookup examples easy to understand  And search Chinese grammar: complete grammar levels from A1-C1 with free 500 grammar samples with detailed explanatory examples  Special, you can use:  Offline Chinese dictionary and translation by handwriting recognition to lookup unknown characters by drawing them  Offline Chinese translator by voice to look up Chinese words meaning, pinyin by speaking them into your devices microphone.   Hanziis Unique features:  Quick search:  Search or translate Mandarin to English quickly when exiting Hanzii or in another application.  Audio Pronunciation:  Chinese translate in English with native Chinese voice: 3 voices (female, male) when using the Internet and machine voice.  Chinese stroke order:  Draw Chinese characters and Chinese Vocabulary helping you identify Chinese characters by drawing and easy-to-memorize Chinese vocabulary.  >> Chinese English Dictionary Translation - Hanzii which over 250,000 Chinese words, Chinese character and include 20,000 example sentences, grammar with Pinyin and Chine sound. Satisfied by +500,000 people around the world - Easy to look up Chinese translate and translate English to Chinese with Hanzii !  In particular, you can use the Online version of the English Chinese Translation Dictionary Hanzii at http://hanzii.net.  Any feedback and questions, please contact: Email: support.hanzii@eupgroup.net ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACTION_MANAGE_OVERLAY_PERMISSION', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}