{
"name" : "Learn English from Hindi",
"url" : "https://play.google.com/store/apps/details?id=com.titli_apps.learn_english.hindi",
"package" : "com.titli_apps.learn_english.hindi",
"category" : "Education",
"description" : "If you are looking for English learning app in Hindi quickly? Learn English by conversation will be easier. Its free and can be used offline. Then you are at right destination. Learn English in Hindi is a complete application for English learning in just 10 days. Learning English was never so easy in past. Learn English Spoken from Hindi is an Android app that teaches to facilitate those who want Basic English learning with Hindi and who consider themselves weak in this regard. English is most spoken language of the world with millions of speakers. This app contains different sections so that one can understand and learn what to speak and more importantly where to speak. You can learn basic and to some extent advance English Speaking with our Learn English from Hindi. Learn English Speaking in native language Hindi, for quick understanding. Learn English in just few Days. It is the Best English Learning App and This is a Basic English Learning App that is available free and offline.   English Seekhna kbi asan na tha, English dunya ki sb say ziada boli janay wali zuban ha. App hamari is app say English sun k bolna seekh saktay hain. Ab aap sirf Chand dino main English Parhna or Bolna Seekh Sakty hain  Salient Features of App are:   Quick English learning  English Grammar  Speak English fluently  Daily Usage Words  Daily usage Sentences  Allah Creations  Tense  Grammar  English Hindi translations  Listening to thousand English phrases by native speaker  Thousand Essential Phrases and Words  English sentences with Hindi meanings  Learn English tenses in very easy way  Vegetables names  Parts of body  Fruits  English Language Translations  Common words  Educational terms  Furnitures items  Animal, Tress, Flowers name  Birds, disease and species items  Bossiness & Banking, religious terms, insects and Fish names  Ornaments, Jewelers, weather conditions, politics, warfare weapons and Tool terms  You can prepare for IELTS. So Download Our app and Learn English Speaking in just few days.                                   ,                  ,                                        Note: This is Hindi version app, for more version visit more apps. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}