{
"name" : "Candy Ice Cream Cone - Helado Ice Candy Game",
"url" : "https://play.google.com/store/apps/details?id=com.funpop.android_candycream",
"package" : "com.funpop.android_candycream",
"category" : "Education",
"description" : "Do you like ice candy? If your answer is yes, come to this ice candy pop game.Colorful and sweet ice cream in the ice candy bars! Ice cream mania must love this ice cream games. Icepop, popsicles, slushie, ice cone, ice cream sandwich, helado are necessities in hot summer. Ice cream maker is a cool guy, not only say goodbye to bad ice cream, but also have chance making sweet memo ice creams in ice cream shop. Candy and cream will meet your taste, Moreover, special ice crean decorations are waiting for you. Come on ! Yummy candy ice-cream is calling you in kids cooking game.   Candy Ice Cream Game Feature 1.Welcome to ice candy bars. For kids, candy are forever. If you are a candy or ice cream mania, you cant miss this ice cream game with tons of ice candy pop. 2.Candy girl, Whats your favorite ice desert? Ice cream! Helado belong to hot summer. I like strawberry ice cream, Sweetshop cannot open without strawberry. Lets go! Strawberry star is waiting for you. 3.Try to be a food maker, ice candy popsiclewill bring an amazing ice fever. Have you ever imagine this ice dessert? In ice cream bar, you have chance to make and try this brand new ice cream in our amazing ice cream pop shop.  4.Look, what a lovely ice candy bar. I dont know whether you are slushy maker, but in this ice cream game, all kind of candies are provided for you. For example, gummy candy, milk candy, candy corn, chocolate, candy cane. You can choose one based on your own taste and then make the most delicious ice cream.  5.Collecting mania, Do you like different candy wrappers? In this ice cream game, you will collect so many beautiful wrappers. Using these wrappers to decorate ice cream cones, Is that a real fantastic idea? Just enjoy these cone dessert party. 6.If word ice will make you cool, how about ice bucket? Ice bucket will bring you huge satisfaction in hot summer. Moreover, Ice cream stack is real yummy treat. 7.Ice-cream decoration time! In this candy ice cream game, you are permitted to make the special ice cream that other ice cream shop ever sold. Great desserts maker, just show your unique making talent in sweetshop. 8.An excellent ice cream maker in ice cream shop will make super yummy candy ice cream but not bad ice cream. I cant wait to try this kind of ice cream.  9.Are you ready for this ice cream yummy carnivals treats? Make the best ice cream in this candy ice cream game and become extraordinary ice lolly maker. 10.Ice cream is the best fair food, hot summer is best season for party. Making ice cream for fair food salon will be a nice try. 11.Ice cream boys or girls, candy girl or boy, if you like this crean game, remember share this ice cream game with your family and friend.  ABOUT FunPop  FunPop are specialize in kids games on mobile platform. We are aiming to provide innovative & educational game for the whole family. We help them to learn the basic life skills and good habits through our games.  Visit us: http://www.funpop.com.cn Watch us: https://www.youtube.com/c/FunPopMedia  CONTACT US  Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@funpop.com.cn ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'com.funpop.android_candycream.permission.C2D_MESSAGE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}