{
"name" : "Anki+ Japanese",
"url" : "https://play.google.com/store/apps/details?id=com.ankiplus.Japanese",
"package" : "com.ankiplus.Japanese",
"category" : "Education",
"description" : "Anki+ Japanese lets you learn and memorize Japanese vocabularies as well as their correct pronunciation.  KEY FEATURES:  * Over 10,000 words and phrases for FREE * Works OFFLINE - no internet needed * Lets you store words and phrases in favorites  ========================================  Why download Anki+ Japanese?  Because it is the best FREE flashcard app to learn and memorize over 10,000 Japanese words OFFLINE.  Anki+ Japanese is the easiest way to master and practice Romaji, Kanji, and Kana, along with its Pronunciation. Choose the card sets you want to study, and save cards as Favoritesits 100% customizable according to your personal preferences.   What else?  With Anki+ Japanese, you can:  1. Be JLPT ready  Choose from the 5 JLPT levels: N5, N4, N3, N2, N1. With over 7000 grammar and vocabulary points, Anki+ Japanese can help you learn efficiently and with confidence.  2. Improve your pronunciation  Practice by repeating after the audio to sound like a native speaker.  3. Memorize words effectively  Enhance your study time with flashcards using spaced repetition system (SRS) and other smart learning methods.  4. Learn useful day-to-day words  Contains every word found in the Japanese For Busy People textbooks series (#1 worldwide), plus words grouped into over 190 different categories.  5. Learn anywhere, anytime  Anki+ Japanese is simple, 100% free, and can be used offline.  ========================================  Our Mission at Anki+ Japanese is to provide people with a learning tool that will empower them and assist their career growth by being able to speak Japanese.   SUPPORT & FEEDBACK  If you have any issues or want to help improve Anki+ Japanese with feedback, please contact us directly: help@km-associates.jp  As it is our pleasure to answer all your questions and solve any issue, please do contact us first before leaving any questions you have in a review. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}