{
"name" : "Zikir MP3 - Dzikir Munajat",
"url" : "https://play.google.com/store/apps/details?id=com.edufans.zikirzikirmp3",
"package" : "com.edufans.zikirzikirmp3",
"category" : "Education",
"description" : "Zikir MP3 adalah Aplikasi Islam Terbaik.   Aplikasi Zikir MP3 ini dapat berdzikir harian, Dengan membaca dan mengamalknnya,kita akan terkeluar dari masalah dunia dan sentiasa dalam ketenangan ,,In sya Allah...  Zikir berasal daripada bahasa Arab yang bermaksud ingat atau sebut. Di dalam Islam, zikir lebih merujuk kepada ingat kepada Allah atau menyebut nama-nama Allah. Di dalam Islam, zikir kepada Allah adalah sebahagian ibadat dan orang Islam yang melakukannya mendapat pahala.  Daftar Zikir Munajat dalam aplikasi: Zikir Asma Ul Husna, Zikir Doa, Zikir Doa Nabi Yunus, Zikir Pagi dan Petang, Zikir Hasbi Robbi, Zikir Munajat, Zikir Munajat 2, Zikir Munajat 3, Zikir Munajat 4, Zikir Munajat Astaghfirullah, Zikir Munajat Doa Taubat, Zikir Munajat Haqqul Mubin, Zikir Munajat Nurinannwar, Zikir Munajat Sufi, Zikir Munajat ya Latif, Zikir la hawla wala, Zikir Penenang jiwa, Zikir Penenang Hati, Zikir Taubat Astaghfirullah, Zikir Taubat Ilahilastulil, Zikir Taubat, Zikir terapi, Zikir ya Allah Hu Ya Allah, Zikir Doa 2, Zikir Hasbiallah, Zikir Zikir Munajat, Zikir Astaghfirullaah, Zikir Taubat Ayatul Kursi, Zikir 20 Sifat Allah, Zikir Nasyid, Zikir Lawkanabainana, dll  Terima kasih buat yang sudah mendownload apikasi Zikir mp3 - Dzkir Munajat Semoga aplikasi ini bermanfaat bagi umat muslim. Jangan lupa rating dan reviewnya Recitation MP3 is the Best Islamic applications.  Applications Recitation MP3 This can be a daily dhikr, Reading and mengamalknnya, we will be expelled from the worlds problems and was always in the serenity ,, In sya Allah ...  Recitation derived rather than Arabic which intends remember or call. In Islam, remembrance is referring to remember God or mention the names of God. In Islam, remembrance of Allah is sebahagian worship and Muslims who do reward.  List of Remembrance Munajat app:  Names of God in Islam Recitation, Remembrance Prayer, Remembrance Prayer Nabi Yunus, Morning and Evening Recitation, Remembrance Hasbi Robbi Recitation Munajat Remembrance Munajat 2, Remembrance Munajat 3, Remembrance Munajat 4, Remembrance Munajat Astaghfirullah Remembrance Prayer Munajat Repentance, Remembrance Munajat Haqqul Mubin Remembrance Munajat Nurinannwar Munajat Sufi Zikr Remembrance Munajat yes Latif Remembrance la Hawla wala, Calming Recitation of the soul, Calming Recitation of the Heart, Repentance Recitation Astaghfirullah Repentance Recitation Ilahilastulil Recitation Repentance, Recitation therapy, Remembrance O Allah Hu Ya Allah, Remembrance Prayer 2, Recitation Hasbiallah Recitation Recitation Munajat Recitation Astaghfirullaah Repentance Recitation Ayatul Kursi Recitation 20 Nature of God, Recitation Nasyid Recitation Lawkanabainana, etc.  Thanks to the already download apikasi Recitation mp3 - Dzkir Munajat Hopefully this application useful for Muslims. Do not forget the rating and the review ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}