{
"name" : "Flinnt",
"url" : "https://play.google.com/store/apps/details?id=com.edu.flinnt",
"package" : "com.edu.flinnt",
"category" : "Education",
"description" : "Indias most exciting app fulfilling all the learning needs of a student. Mastering Subject Concept to preparing for all school related examinations and competitions. Each course on Flinnt has a unique channel that brings you daily posts to help you build Real World application skills.  Content is Mapped to - CBSE - NCERT - Math, Science and English Olympiads - ASSET and other competitive exams  Courses Cover the following classes - Kindergarten: Nursery to Sr. K.G. - Class 1, Class 2, Class 3, Class 4, Class 5, Class 6, Class 7, Class 8, Class 9, Class 10  Study Material for the following exams - CBSE School Exams - Schools following NCERT Curriculum - Olympiad Exams like NSO, IMO, IEO & other Olympiads - ASSET - Classmate Spellbee and MaRRS Spelling Bee - TERI Green Olympiad  Range of FREE courses - Class 2 to 8 English - Master Spelling & Vocabulary - Wild Wisdom Quiz by WWF & CBSE - CBSE India Heritage Quiz - Storytelling for Parents and Teachers - GK & Current Affairs  Whats possible on Flinnt - Select from the range of Free & Paid Courses - Watch Videos & learn at your own pace - Read News Links to understand the relation between subject topics & real World - Collaborate with the students from across the country - Practice chapter wise & get instant results - Like & share the courses with your friend circle  Features - Chapterwise Videos, notes, worksheets and quizzes with instant results - 30-60 MCQs with Explanations in Each Topic - Live Posts 4-5 per week to make students understand the connection between Topics and real-world applications - Benchmark your performance with other students to work on Weak areas - Device Friendly. Enjoy learning & preparation on the Flinnt learning App & Website  Flinnts Success Story so Far - 0.7 Million Users - 35 Cities - 8 States - 1500+ Educational Institutions - 30+ Courses - 10 Million+ Views  Flinnt is also getting used by Schools, Colleges, Kindergartens, & Tuition classes for their own communication & learning resource sharing purpose. As an expert you can create your own courses on Flinnt in paid or free form & can provide the course access to the students.  Our Vision is to make each child hooked to learning. This we are doing by bringing all the learning needs of a school student under Flinnt right from GK, Real World Skills, Competitive exams to School Exams.  Visit : Flinnt.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.edu.flinnt.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_DOWNLOAD_MANAGER']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_DOWNLOAD_MANAGER']",
}