{
"name" : "Math: Exercises Generator",
"url" : "https://play.google.com/store/apps/details?id=com.ark_software.mathgen",
"package" : "com.ark_software.mathgen",
"category" : "Education",
"description" : "Math: Exercises Generator app generates random exercises for a selected subject, providing a result and full solution steps for each of them. It also contains a short introduction (tutorial) into each matter. Math problems at the level of high school and college.  Result and solution are initially hidden. Try to solve a problem yourself and check correctness.  Use Math: Exercises Generator application before a test or exam or when you have troubles in math solving. Compare solutions yourself instead of paying a tutor.  If you are a teacher you can use an application to quickly prepare a homework or test questions for your students.  Every month there is an app update with new math problems and subjects. Currently available categories are listed below.  Numbers: - unit prefixes, - exponent rules, - radical rules, - scientific notation, - prime factorization, - Roman numerals, - repeating decimal, - rationalizing the denominator, - absolute value, - short multiplication formulas,  Linear equation systems: - determinants method, - elimination method, - substitution method,  Quadratic formulas: - quadratic equations, - Vietas formulas, - vertex form of quadratic function, - intercept form of quadratic function, - biquadratic equation,  Polynomials: - factoring by grouping, - integer root theorem, - rational root theorem, - polynomial by binomial division, - Horners method,  Sequences: - arithmetic progression, - arithmetic series, - geometric progression, - geometric series, - infinite geometric series,  Logarithms: - definition of logarithm, - sum and difference of logarithms, - change of base, - power rule,  Trigonometry: - degrees and radians, - relation between trigonometric functions, - reduction formulas (shifts and reflections),  Combinatorics: - binomial coefficient,  Statistics: - arithmetic mean, - median, - variance and standard deviation, - mode,  Logic: - tautology, ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}