{
"name" : "Expert: Learn English Language",
"url" : "https://play.google.com/store/apps/details?id=com.expert_apps.expert",
"package" : "com.expert_apps.expert",
"category" : "Education",
"description" : "This App challenges and improves your four basic skills such as Reading, Speaking, Listening and Writing, by using several educational methods at beginner, intermediate and advanced levels. You will easily find all the features and items you need to learn English and help you to enjoy learning.   This App contains two sections: 4-Basic skills and educational assistance.  The section of Basic skills includes the following parts:  - Reading skill: This part has six levels, and each level consisting of twenty  lessons.  - Listening skill: This part consists of five levels in which your listening and speaking skills will be improved by an American professor.  - Speaking skill: This part is divided into six levels, and each level has sixteen lessons for improving your speaking.  - Writing skill: The lessons in this section is divided into twelve categories. During this course, you will learn about the basics of writing, how to write a paragraph, how to write an introduction, a list and conclusion, how to start a new season, writing letters, emailing, etc.  The section of Teaching Aid includes the following parts:  - Learning English through Movies and Animations: In this part, you can improve your vocabulary and listening skills by using the most famous English animations and movies.  - Learning English through Pictures: By using this part, you can improve the range of vocabulary. Categories such as kind of animals, foods, shapes, vehicles, common verbs and adjectives, etc. are in this part.  - English Grammar: This part includes English and your mother tongue from beginner to advanced level, which can help you to understand English text better.  - English Speeches: This part contains over 30 speeches from the president of the United States. Listening continuously to these speeches can have a great influence on your unconsciousness and will teach you how to speak, express the words, and pronounce the correct accent. Just listen one speech a day and enjoy it.  - English Stories: In this part, there are 50 most famous stories of the world. Including text and meaning of key words.  - Learning English with music: You surly enjoy listening to music, and this can be a way of learning English and improving your listening skills and  vocabulary. In this part, there are over 60 top English songs with text, meanings and key words.  - English Expressions: This part contains over 200 useful English Expressions which are taught by an American professor.  - English Lectures: This part uses TED video conferences to improve your speaking skills and vocabulary. There are top videos of these conferences with subtitles in English and your native language, the text of lectures and their key words.  - English Essential Words: This part contains 4,000 essential words, 504  absolutely essential words, IELTS and TOEFL essential words, which includes  the meaning of words, example, pronunciation, and related pictures.  - English Conversations: In this part, there are over 100 conversation videos between two or more English speakers with subtitle.  Some other features of the App:  - The Leitner box and the ability to add words from all parts of the App - In-App Dictionary - Quickly translate word in texts - beginner to advanced levels in all skills - Learning by various methods - Simple interface and classifying all content - reminding the words in Leitner box in order to review them ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.WRITE_CALENDAR', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_INTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.READ_CALENDAR', 'android.permission.CLEAR_APP_CACHE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_CALENDAR', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}