{
"name" : "Etudier",
"url" : "https://play.google.com/store/apps/details?id=com.etudier.android",
"package" : "com.etudier.android",
"category" : "Education",
"description" : "Lappli officielle dEtudier est enfin arrive!! Nous avons cr Etudier avec un seul but en tte - aider et participer au succs des tudiants. Etudier.com est une bibliothque grandissante de plus dun demi-million de documents pour vous aider  russir vos devoirs. Gardez, sur vous, toutes les fonctionnalits que vous aimez dEtudier.com grce  votre Android.  Connectez-vous sur votre compte Etudier pour voir vos documents partags, favoris, et ceux rcemment tudis. Vous navez pas dadhsion Premium ? Pas de problme. Obtenez une adhsion Premium grce  votre compte Google Wallet et les diffrents plans dabonnement offerts. Pour un accs complet  toute notre bibliothque nos utilisateurs doivent souscrire  une adhsion Premium.  Pourquoi aimer lappli mobile dEtudier:   Utilisation de lappli est compltement gratuite et facile  grer  Obtenez une adhsion Premium grce  votre compte Google Wallet Synchronisation avec votre compte Etudier.com Les membres Premium ont accs  plus dun demi-million de documents disponibles sur Etudier.com Partagez les documents avec vos amis via email, texto, ou rseaux sociaux. Une source dinspiration nimporte o et nimporte quand ! Commencez  tudier aujourdhui avec lappli mobile dEtudier ! The official app of study is finally here !! We have created study with one goal in mind - to help and participate in student success. Etudier.com is a growing library of more than half a million documents to help you achieve your homework. Keep on you all the features you like to Etudier.com through your Android.  Login to your account to view your study shared documents, favorites, and those recently studied. You do not have to Premium membership? No problem. Get a premium membership with your Google Wallet and offered different subscription plans. For full access to our entire library of our users have to subscribe to a premium membership.  Why love the mobile app of study:   Using the app is completely free and easy to manage Get a premium membership with your Google Wallet Synchronization with your account Etudier.com Premium members have access to over half a million documents available on Etudier.com Share documents with friends via email, SMS or social networks. An inspiration anywhere and anytime! Start studying now with the mobile app to study! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.USE_CREDENTIALS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}