{
"name" : "Doodles",
"url" : "https://play.google.com/store/apps/details?id=com.happymongo.doodles",
"package" : "com.happymongo.doodles",
"category" : "Education",
"description" : "Doodles Imagination Library - A interactive, retina-ready & wide collection characters.  Beautiful reason to Color:  Coloring helps a child practice holding a writing tool the correct way and aids them in developing those tiny muscles in their hands, fingers, and wrist. Eventually a child can even learn to plan as they decide the colors they will use in their picture and then what order they are going to color things within the picture.  Improve visual perception of your child:  The ability to do things that involve your hands and eyes working together, Coloring aids in hand-eye coordination as the child learns to color within the specified area. A childs dexterity in activities highly dependent upon sight.  Improve confidence and self esteem:  Children develop the skill of patience and learn to focus on details when coloring Sense of accomplishment is achieved when a coloring page is completed. Coloring regularly and completing projects boosts a childs sense of accomplishment and pride in themselves.  Prepares your child for school:  Childs education takes place in a classroom with a fair amount of structure. Coloring sheets, books and pages can be integral in preparing kids for the more structured work on paper ahead of them.  Grip on Penmanship:  For many kids, crayon is the first object that they learn to hold in a certain manner. It is very important for your children to have proper grip and control over their writing and coloring tools. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
}