{
"name" : "Subtitles - Video tube player translate",
"url" : "https://play.google.com/store/apps/details?id=com.subtit.player",
"package" : "com.subtit.player",
"category" : "Education",
"description" : "The new translator for the video player Subtitles - become independent of the language of the original files in the learning and fun   If you love to watch movies in their original language, to get acquainted with books and other informative literature, but do not own the necessary linguistic knowledge, voice subtitle - the only right decision.  Simultaneous translation will allow to fully enjoy watching movies and foreign movies without waiting for the official release of their voice. This audiobook reader - your opportunity to get quick access to relevant information, regardless of its country of origin.  functional  Translator for video - Subtitles Player is used to carry out:  preview bloggers with translation ;  instant translation of any foreign language;  scoring subtitles when watching foreign videos;  variety of pleasing voice to voice;  preview lectures with translation ;  synchronized video images and voice tempo track. This voice voice will significantly simplify:  Learning Programming using materials foreign schools;  language training with the primary sources;  watching movies, videos, programs and entertainment shows.  On YouTube after installing the program for you will be available best e-reader online, all foreign sites, audiobooks, courses and training programs.  Read the subtitle for you will no longer be distracting occupation, because it is now possible to receive translate video , while choosing liked the sound of voices.  How do I use?  Video Voice is carried out automatically as definition of the original audio language. You will not be difficult to use the application after it is installed on the gadget. To eReader subtitle has been loaded and activated on your phone, it should have:  more than 21 MB of free memory;  Android 5.0+ above.  To synchronous voice Video was carried out without delays and problems, it is necessary to periodically update the application. Information about new releases will be public and available to all users of the product. This is a free version for Android, so it contains a number of promotional videos. But it does not hurt to get a quality voice translation you require video. Wishes to limit the amount of advertising can activate the Premium version.  Features of training  Online learning a foreign language has become much easier and more comfortable with the application Subtitles Player. This eReader for Android allows you to:  listen to lectures at a convenient time;  access to information in all languages of the world;  Watch all the existing Video courses transfer .  File Reader Online is not limited to educational videos. Voice is performed regardless of the direction of the selected file, its contents and size. You need Video Lecture will be accessible and understandable, regardless of the language that has been read. Such synchronicity pictures and audio track, and simplifies the understanding of the development of the material, making it easier to remember.  New foreign films without waiting  You no longer need to wait come foreign series with the voice acting or read the subtitles, straining their eyes. Synchronized voice translation , which is equipped with a audio reader , will give a nice view, facilitate familiarity with foreign cinema, bringing you to the mysterious world of art. An additional advantage - the opportunity to learn the language by listening to it from the media.  The application is in development mode, so temporarily audio support may be unstable. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}