{
"name" : "zamit- EduTech App",
"url" : "https://play.google.com/store/apps/details?id=com.MashVirtual.ZamitOne",
"package" : "com.MashVirtual.ZamitOne",
"category" : "Education",
"description" : "The app offers school listing and search, educational news, events & updates, podcasts & videos of talks by eminent experts from diverse fields, engaging activities, stories for children, teachers resources, growth opportunities for teachers, edutainment, zamit centralised admissions system (ZCAS ), live streaming of school events and more. zamit is a mobile app committed to be the one-stop platform that networks & supports school ecosystems to be future ready. The App provides information, engagement and interaction for schools, students, teachers, parents and school service providers. zamit is the brainchild of MASH Virtual (UK) who are London based creators, actively building unique AR/VR applications, games and mobile applications which utilise Artificial Intelligence, Machine Learning and Learner Analytics. With about 50,000 users, zamit is ranked among the top android apps in the ed-tech vertical. A detailed explanation of some of the unique features that zamit offers are as follow : The ZKiT programme is a unique, customised support system based on the schools ZQ (Zamit Quotient), Future Readiness Index. ZQ is a score built around an algorithm of the schools collective strengths of educational best practices, processes and systems. The ZKiT includes a range of services:  ZPoD  Zamit Professional Development Services: Seminars, Workshops and Professional development programme for teachers, parents and students that are designed to prepare them for success in the 4th Industrial Age.  ZIP  Zamit Internship Programme: A programme that offers students Internship and Apprenticeship opportunities for hands-on work experience across several verticals.  ZISA  Zamit International School Awards: A first of its kind stakeholder-driven annual recognition award that recognises Schools, Principals, Teachers, Parents and non-teaching Staff of Pre-schools and K-12 schools.  ZCAS  Zamit Centralised Admissions System: A comprehensive Web and Mobile App based end-to-end solution that simplifies the admissions process for prospective parents & schools.  ZFREC  Zamit Future Readiness Experience Centre: A physical space that offers students access to future ready resources & expert guidance for admissions, careers, placements, fitness, cybersecurity and many other areas. The ZFREC also offers various programmes that will help them prepare for the VUCA (Volatile, Uncertain, Complex and Ambiguous) world by helping them improve their Learning Power, develop the right mindset with future readiness skills that are critical for living and working in the age of Artificial Intelligence. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.VIBRATE', 'android.permission.CALL_PHONE', 'android.permission.CAMERA', 'android.permission.WRITE_CALENDAR', 'android.permission.READ_CALENDAR', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.CAMERA', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}