{
"name" : "World of Sounds Quiz",
"url" : "https://play.google.com/store/apps/details?id=com.kidscademy.sounds",
"package" : "com.kidscademy.sounds",
"category" : "Education",
"description" : "Explore World of Sounds Quiz and learn by playing. Uses images and relevant sound samples to help associate sounds with images and names.  World of Sounds Quiz has more than 100 sounds, believed to have meaning world wide. Anyway, if you have suggestion we will happy to add new sounds. Please use developer email to send new sound name, related image and sample and we will updated application.  Explorer Explore sounds in our world, from wild or domesticated animals to transportation vehicles. Explorer is organized on categories of related sounds. For example FARM contains sounds of domesticated animals. Use explorer to learn about not known sounds. Uses what to learned to score higher on game.   Game The goal is to recognize played sound and write it down. Play it again if not sure or explore the catalog if not known. There are 12 levels organized by sounds popularity. More common sounds are listed first so that difficulty increases on higher levels. Use info button to trade quiz credits for game hints.   Quiz Quiz is a easy game alternative. Instead of writing down sound name just select from 6 options. A quiz can complete even with 3 wrong answers. Quiz is also organized by levels with increasing difficulty, the same levels as for game. Take a quiz and earn credits. Use quiz credits to trade game hints.   Kids Mode There is a kids mode with simplified game and user interface. In kids mode quiz is not included. Kids mode uses the same levels as expert game but game progress is kept separately, so that is possible to switch between modes. Enable kids mode from application settings.  While playing sounds score is kept into application private storage. Score can be reviewed to reveal gaps in knowledge.   Support We invested substantial effort to ensure content quality but still there may be mistakes. If found something not reasonable please use developer email to send us corrections. Suggestions for improvement are also welcomed.  World of Sounds Quiz is completely free. Free of annoying ads, no misleading in-app payment, no spy-ware. Development effort is donated. It is a humble way to show gratitude to Internet community that gives us all so much.  Please help improving and spread the word. Do not forget to rate! Is is important for store rank so that much users to have access to this application. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}