{
"name" : "Pepi Wonder World",
"url" : "https://play.google.com/store/apps/details?id=com.PepiPlay.KingsCastle",
"package" : "com.PepiPlay.KingsCastle",
"category" : "Educational",
"description" : "All aboard and get ready to visit Pepi Wonder World! Roleplay the fairy tales you love or create new ones. Visit island worlds and play with knights, princesses, dragons, gnomes, ponies and many other fantastic characters!   FAIRY TALES FOR A WHOLE FAMILY Imagine a dollhouse or a sandbox filled with interactive toys and fun. Its exactly what is offered within this App. Fantasy-themed dollhouse includes the kings castle and dungeons, a mountain with gnomish mines, dragon cave, and cloud-kissing playgrounds. Children will be able to roleplay their favorite stories or enact scenarios of their own. Will it be a story of an old crafty gnome and his love of magic gardens? Or perhaps its about a fierce princess and her loyal dragon? A vibrant and colorful mix of environments and characters promotes diversity and offers a unique fusion of classical and modern tales.  THE IMPORTANCE OF PRETEND PLAY We at Pepi Play believe in the fundamental importance of moderated playtime. While we craft entertaining and cheerful apps for toddlers and kids, we always encourage parents to join them in play. We intentionally limit tutorial information and completely avoid setting any goals for a child, in order to spark curiosity and inspire exploration. Pretend play games help to develop social, emotional and thinking skills, expand vocabulary and put imagination into overdrive. All these effects are strengthened when playing together with your child. The game supports multitouch features, allowing multiple players to simultaneously interact with their own characters on the same screen.  CREATIVITY AND INSPIRATION Pepi Wonder World has over a dozen of interactive and scenes that inspire creativity in storytelling. While traveling through Islands kids may discover areas like playgrounds, kitchens and rock stages to create dynamic mini-scenes with dozens of characters. Huge variety of clothing items and accessories allow full character customization and if thats not enough be sure to visit an enchantment lab at the Witch House! Mix crazy and spooky ingredients, brew potions and create your own gang of tiny monsters!  EXPLORE, EXPAND AND DISCOVER LIMITLESS PLAY While playing, kids will be able to move characters and objects from one island to another. This feature greatly expands gameplay options and encourages exploration and experimentation. Some items and characters gain or lose unique properties while visiting other worlds, thus inspiring curiosity and experimentation.  KEY FEATURES:  60+ fairy tale dwellers: knights, princesses, gnomes, and dragons!  Lots of animations and sounds  use musical instruments, craft magic items, cook royal food, mine jewels, shoot bows and catapults!  Create, role play and record your own fairy tale stories! (Only available on devices with Android version 5.0 (Lollipop) and above).  Spell Lab to transform your characters into new cute creatures   Musical chamber (new song to listen and play with)   A fairy tale inspired world filled with magic, secrets, and surprises!  Find the hidden keys and jewels. Explore secret rooms to find even more toys to play with!  Create or mix and match items for some surprising results!  Hatch magic eggs to get cute baby monsters.  Use a boat to transport characters and items between islands.  Play together  the game supports multitouch functionality for parent and kid play sessions. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.CHANGE_WIFI_STATE', 'com.PepiPlay.KingsCastle.permission.C2D_MESSAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}