{
"name" : "LearnEnglish Sounds Right",
"url" : "https://play.google.com/store/apps/details?id=com.britishcouncil.phonemicchart",
"package" : "com.britishcouncil.phonemicchart",
"category" : "Education",
"description" : "LearnEnglish Sounds Right is the British Councils FREE pronunciation chart for learners and teachers of English worldwide.  LEARNERS OF ENGLISH Do you have difficulty with the sounds and pronunciation of the English language, or with understanding the symbols of the phonemic alphabet? With LearnEnglish Sounds Right on your phone or tablet you can practise anywhere and anytime. Just tap a sound and you will hear it. Tap the downward arrow sign and listen to three example words with that sound.  TEACHERS OF ENGLISH Do you use phonemic script in class to help your students with their pronunciation? With LearnEnglish Sounds Right installed on your class set of devices, or your students own devices, you can teach the individual sounds and symbols easily.  * The pure vowels are arranged the same way as in the IPA chart: according to mouth shape (left to right, lips wide / round  top to bottom, jaw closed / open).  * The diphthongs are grouped in rows according to their second sound.  * The consonants are arranged from left (front of mouth) to right (back of mouth). The top two rows of consonants are paired (top row  unvoiced, second row  voiced). When you tap a plosive consonant, the schwa () appears. This is because the plosives were recorded with a schwa for clarity.  We hope you enjoy using this chart!  Please contact us at learnenglish.mobile@britishcouncil.org if you have any comments or ideas for future versions.  Get more great English learning apps from the British Council at: http://learnenglish.britishcouncil.org/apps ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.britishcouncil.phonemicchart.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}