{
"name" : "WordSwing Chinese",
"url" : "https://play.google.com/store/apps/details?id=com.wordswing.wordswingchineseapp",
"package" : "com.wordswing.wordswingchineseapp",
"category" : "Education",
"description" : "WordSwings Chinese text adventure games and comics are targeted at intermediate learners of Mandarin Chinese. The games work a bit like an interactive graded reader whereby the course of the narrative changes depending on choices you make in the game.   All our games are carefully designed for intermediate learners and there is a built-in dictionary for when you encounter words or characters that are unfamiliar.  Features: 1. Carefully written, fun narrative suited to intermediate students. 2. Native speaker recordings of all material. 3. Supports Traditional and Simplified Chinese. 4. Built-in dictionary for easily looking up vocabulary. 5. Color-coded knowledge ratings of words to track your progress. 6. New games and comics on a regular basis. 7. Review activities.  Free to try:  The games are all free to try but you are limited to the beginning of each game (10 turns). The most recent comic episode is free.  WordSwing membership  Creating a WordSwing account is free (but optional) and will allow you to save your progress in the games, keep track of what words youve discovered and mastered, and enjoy a personalized learning experience.  Subscribe: WordSwing Complete  Our app includes an in-app auto-renew subscription that will give you full access to all WordSwings games and activities. We are continually releasing new games and other content.  This is a monthly subscription handled through Google Play and automatically charged to your account each month. You can cancel at any time.  Terms of use:  https://wordswing.com/terms  Privacy policy:  https://wordswing.com/privacy ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['com.android.vending.BILLING']",
}