{
"name" : "Kids Puzzles: Jigsaw Puzzle Games for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.kidsappbox.farmjigsawpuzzle",
"package" : "com.kidsappbox.farmjigsawpuzzle",
"category" : "Educational",
"description" : "Educational baby wooden jigsaw puzzle games for kids designed for preschool and kindergarden kids. This is a very special jigsaw puzzle story farm where only kids can go! All the characters in the farm puzzle for toddlers will come to life after kids complete the puzzle! They will meet the most friendly animals here - cow, sheep, chickens, horse, cat, little piggies and more! This is one of the best games for kids. They will explore the life in farm with puzzle games for kids!  In kids puzzle games combination of animations, jigsaw puzzles and story lines makes this kids app simply unique and educative jigsaw puzzle for toddlers!  Features: - Charming farm rhymes after solving each toddlers puzzle. - 13 Kids Jigsaw Puzzles with amazing hand-drawn farm graphics - Toddler puzzles with 3 Different levels of puzzles: 6, 12, 24 puzzle pieces - Simple and easy interface for kids from 2 to 8 years old - Puzzles for toddlers with lovely animations after completing jigsaw puzzles  - Real, high quality sounds of farm animals and machines - Kid-Friendly Environment and easy and Hard kids puzzle modes - In-app purchases math lock - A great bedtime story for kids - Designed as an educational jigsaw puzzle for kids  Helps to develop: - Cognitive skills - Fine motor skills - Patience and ability to focus  If you have an idea to make The Friendly Farm a better app, please contact us. As parents ourselves, we take childrens wellness and joy very seriously. All ideas and suggestions are welcome! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
}