{
"name" : "Picture Match, Memory Games for Kids - Brain Game",
"url" : "https://play.google.com/store/apps/details?id=com.preschoolkidsapps.memorygame",
"package" : "com.preschoolkidsapps.memorygame",
"category" : "Educational",
"description" : "Picture Match, Memory Games for Kids - Brain Game is a game designed for kids and toddlers to help improve their memory through a series of fun and interactive games. It is a recently developed app and makes use of the latest research in child memory development to ensure that your child can spend a good amount of time learning and improving their memory, whilst having fun at the same time! Picture Match, Memory Games for Kids - Brain Game is one of the best memory games for toddlers available on the Play Store at the moment, so do not waste a second more and try it out today!  This app is designed with the purpose to make learning and memory improvement a more enjoyable experience for children and toddlers, turning their own development into a game, where they can progress through levels and earn various rewards as they improve. This app makes use of extensive research in child memory development and brings into a modern setting of matching pairs of memory games for kids.  Furthermore, this app is even better than most of the development and improvement techniques for your childs memory and learning capability because of the reward system it offers. In the game, children are rewarded with coins for completing each level, allowing them to collect and save them so that they can show how much progress they have made within the game. On top of this, children are also rewarded with a new toy as a collectible for every 100 coins earned. With up to 32 toys to be collected, Picture Match, Memory Games for Kids - Brain Game guarantees that your child(ren) will remain excited and interested in improving their memory through this game, making it one of the best brain games for kids so far.   Makes learning and development an enjoyable experience for your child.  Uses research into types of memory to ensure that your child can develop all of them.  Uses difficulty levels to help the development process to continue as your child improves.  Reduces the chance of your child feeling stressed or fatigued after learning.  Provides a medium to learn for children with a variety of interests: Animals, Numbers, Letters, Birds, Vegetables, and Fruits.  The game itself features various difficulties of different matching pairs games. Your child will have the option to match Letters, Numbers or pictures of Animals, Birds, Vegetables and Fruits allowing them to choose how and what they wish to learn, as well as helping to improve the different types of memory overall. Furthermore, as your childs memory develops, you can up the difficulty of each game so that they feature more tiles and becomes difficult to remember positions of those tiles, ultimately working to improve your childs memory even further as they progress and age through matching pairs for kids.  Features:  A range of levels with varying difficulty, allowing children of different ages to learn and improve their memory.  Every time you match a pair of cards, the audio of the matched objects name will be played.  Children are rewarded with coins and toys for every level completed in the picture memory game.  The chance to review progress and track improvement as your children develop their memory. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE']",
}