{
"name" : "MyClassmate",
"url" : "https://play.google.com/store/apps/details?id=com.itc.classmate",
"package" : "com.itc.classmate",
"category" : "Education",
"description" : "Open yourself to a world of unlimited creative exploration with the MyClassmate App. With many innovative & interesting features like Subject Fundas, UnCover, QuiZone & many more, it is a learning adventure for everyone!   Subject Fundas  Master subject concepts by delving deep into the topic. With more than 100 topics covered on Maths & Science, the module is a ready reckoner for subject fundamentals. Explore subjects, dive into your favorite topic; bookmark or share them anytime!   UnCover  Experience your Classmate notebook cover come to life with UnCover. Scan your AR enabled Classmate note with the app & see the note come to life!   QuiZone  With QuiZone, take quizzes the fun way & be the Quiz master! Take quizzes on spellings, grammar, GK & much more. Track your performance & remember, you can always do better the next time.   Titbits  Your favorite back cover Titbits are now on the MyClassmate app. Explore unique & interesting facts from around the world & also share them with your friends!   FunZone  Life is always fun with some creative DIY! Watch DIY videos and learn some awesome arts & crafts to try out with your friends.   Scheduler  Now you can schedule important events like a pro. Schedule study dates, holidays & other important days that you dont want to forget. The scheduler will remind you of so that you never miss out on anything.   Converter  Conversion could be a tricky task. There are so many metrics out there and so many different formulas. With converter you can effortlessly convert within various metric systems without a sweat.   Career Explorer  Choosing a career could be difficult, but crucial. Learn about interesting career options & get inspired. Go ahead, explore the horizons and get to know about different vocations & personalities!   Timetable  Create your school timetable for your classes. You can also enter your recess & lunch timings. Now you will never miss a period!   Profile Creation  Create multiple profiles on the same phone for you and your siblings! Learning is now more fun! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}