{
"name" : "Princess Cake Bakery- Frost Cakes Baking Salon",
"url" : "https://play.google.com/store/apps/details?id=com.funpop.android_princesscake",
"package" : "com.funpop.android_princesscake",
"category" : "Education",
"description" : "Welcome to the ice princess castle in this fun bakery. So many sweetthings here and eat cakes now.In the baking games for girls under 8, you can learn how to make cakes and bake a cake. Bakery near me, now make up your princess doll first and then dress up princess with fluffy rainbow cream or colorful fondant. You can also choose a magic wand for the little princess. It seems you do a princess salon in the girls game, in fact, you make an amazing princess cake,cake pop and cakes in the royal palace. Well, maybe we can call this kid game  baking salon. Lets baking cakes and lean how to bake princess cake in the cake bakery game.  Game Features:  1.Magic Princesses always make gateau in galletas of the magic castle. But we will make an icy princess doll cake for the game girls and game girls in the sweet cake bakery.  2.It is popular to see the princess and prince wedding cake in the wedding party for the bride and the bridegroom. In this bake cakes game for little girls, we only prepare the snowy princess cake for little girls who love princess. And girls, you can find a little prince to make queen cakes together in our cake games.  3.Be the best cake baker and do sweet cake bake.My princess, lets make cakes and bake a cake first. Put your cake batter in the baking oven to get sweet cake. Really good baking time and baking game, right? 4. Time to build my bakery empire. After baking salon cooking in the kitchen, put your ice princess doll in the cake hole. And then it is time for you to make up this magic princess. 5. Bake a cake and make cakes now.Youre the best sugary chef.So many sprinkles cupcakes and cakes.Comb princess hair fashion hair style with your favorite royal crowns. They prepare the magic eyebrow pencil and lipstick for you to design your icy princess doll the trendy makeup in the princess game. 6.Now time to dress up the tasty cake with rainbow cream or fondant. Whether the colorful cream or fondant is also the beautiful dress for the princess. It is so amazing! 7.Show off your fashion skills and imagination! Personalize your magic princess cake from lots of royal outfits and accessories!So many sweetthings! Eat cakes now! 8.Have fun in the bakery food games. Girls, your magic princess needs a magic wand. This snow princess game prepares lots of fashion sparkly magic wands for you. It is also a magic game for little girls. 9.Bakery near me.There are also plenty of edible icing flowers, icing snow, glitter icing to design on the cream dress for your gateau . So sweet! 10.Such fashion dress you put on your princess! Glitter star, diamond shining, lace edged, so beautiful princess you dress up!  11.Youre the best bakery chef for baking cakes.Get make up, dress up and baking gateau  cakes skill in this princess cooking game for girls!  Girls,Lets make sweet princess cake in Princess Cake Bakery-Baking Games free together.Download this princess baking games TODAY! Have fun in our rainbow cake and do the cake bakery now.  ABOUT FunPop  FunPop are specialize in casuals games on mobile platform. We are aiming to provide innovative & educational game for the whole family. We help them to learn the basic life skills and good habits through our games.  Visit us: http://www.funpop.com.cn Watch us: https://www.youtube.com/c/FunPopMedia  CONTACT US  Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@funpop.com.cn ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.ACCESS_WIFI_STATE', 'com.funpop.android_princesscake.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}