{
"name" : "AndyQue - Android Interview Questions",
"url" : "https://play.google.com/store/apps/details?id=com.catokg.andyque",
"package" : "com.catokg.andyque",
"category" : "Education",
"description" : "AndQue is Android interview questions app for the people who are looking for jobs in android development. Youre at the right place if you are looking for the best app for android job interview questions and answers for freshers and experience.  This app contains collection of more than 250+ most important android interview questions and answers in each topic of android along with their answers. Best app for job seeking students who wants to get help in cracking android interview. Questions are for beginner or fresher as well as for experienced.  We have put together the most frequently asked questions in an interview which will help you to crack your interview.  Questions are from following topic: - Basic - Activities - Intents - Services - Broadcast Receivers - Content Providers - Threads - Fragments - Adapters - Advance Questions - Company Interview Questions - Many more...  APP FEATURES: - Company Interview questions - Collection of more than 250+ most important android job interview questions and answers. - Full android job interview questions and answers. - Useful for freshers as well as experienced professionals. - Share your favorite AndyQue app with your friends through social media, text, whatsapp, email etc. - Simple user-interface. - No special permission. - No ads, no internet. Free for all users.  WHO ARE WE:  Being a small team, your responses are really great help for us to go in right direction. We are waiting to see your comments, feedback, suggestions, bugs on this release.  Give CAtoKg a try and let us know what do you think about us at catokgdotcom@gmail.com. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}