{
"name" : "Bienen-App",
"url" : "https://play.google.com/store/apps/details?id=com.prettydigits.bienenapp",
"package" : "com.prettydigits.bienenapp",
"category" : "Education",
"description" : "Wer macht mit beim Bienen-Fttern? Das Bundesministerium fr Ernhrung und Landwirtschaft (BMEL) prsentiert die erste App rund um bienenfreundliche Pflanzen.   Mit der Bienen App kann jeder dazu beitragen, dass Bienen reichlich Pollen und Nektar finden: Einfach mit der App prfen, welche Blhpflanzen bienenfreundlich sind und dann den eigenen Balkon, die Terrasse oder Garten zum Blhen bringen.  Die Bienen-App bietet noch mehr: Ntzliche Pflegehinweise zu den 100 Pflanzen im Lexikon, Mythen und Fakten zu Honigbienen, Hummeln und Co. oder ein Wissens-Quiz.  Features der Bienen App  Service: Pflanzen-Lexikon   Bebildertes Lexikon mit 100 bienenfreundlichen Blhpflanzen   Filterbar nach ihrem Namen und bestimmten Merkmalen (Gattung, Typ, Bltenfarbe, Standort, Bltezeit, Licht, Bienen-Attraktivitt)   Funktion: Was blht gerade?   Infos: Imker werden  Imkern als Beruf oder als Hobby: Wie wird man Imkerin/Imker?  Infos: Bienen-Wissen   Wissensteil mit berraschenden Infos rund um die schwarz-gelben Bestuber   Honigbienen, Wildbienen, Hummeln im Vergleich; Mythen und Fakten; Was leisten Bienen?   Hintergrund  Das Bundesministerium fr Ernhrung und Landwirtschaft mchte mit der App dazu beitragen, einer breiten Bevlkerung die Bedeutung der Bienen ins Bewusstsein zu rufen. Wer im Gartenmarkt nach schnen Blumen Ausschau hlt, kann jetzt mit seinem Smartphone ganz einfach Bienenfreundlichkeit und Pflegehinweise abrufen. Alle knnen mitmachen, Bienen zu fttern und Stadt und Land zum Blhen zu bringen. Denn Bienen sind nicht blo Honigsammler, sondern erbringen eine wichtige Leistung fr die Bestubung von Pflanzen, also fr unsere Ernhrung und fr den Erhalt der biologischen Vielfalt.   Mehr Informationen unter www.bmel.de Who is involved in the Bee Feeding? The Federal Ministry of Food and Agriculture (BmEL) presents the first app around bee-friendly plants.  With the bees app everyone can contribute that bees find plenty of pollen and nectar: Simply check the app that flowering plants are bee friendly and then bring the private balcony, terrace or garden blossom. The Bee App offers even more useful care instructions to the 100 plants in the lexicon, myths and facts about honeybees, bumblebees and Co. or a knowledge quiz.  Features of bees App Service: Plant Encyclopedia - Illustrated Encyclopedia with 100 bee-friendly flowering plants - Filterable her name and certain characteristics (type, type, flower color, location, heyday, light, Bee attractiveness) - Function: What is flowering now?  Info: be beekeepers - Beekeepers as a profession or as a hobby: How to become a beekeeper / apiarist?  Info: Bee knowledge - Knowledge part with surprising information about the black-yellow pollinators - Honeybees, wild bees, bumblebees compared; Myths and facts; What do bees?  background The Federal Ministry of Food and Agriculture seeks to use the app to a wide population to call the importance of bees into consciousness. Who by beautiful flowers on the lookout in the garden market, can now with his smartphone easily retrieve bees kindness and care instructions. All can join, bees to feed and to bring town and country to flourish. Because bees are not only honey collectors but provide an important performance for the pollination of plants, so for our food and for the conservation of biodiversity.  More information www.bmel.de ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}