{
"name" : "Nightshift: Stargazing & Astronomy",
"url" : "https://play.google.com/store/apps/details?id=com.waddensky.nightshift",
"package" : "com.waddensky.nightshift",
"category" : "Education",
"description" : "Nightshift is the ideal free night sky app for the experienced amateur astronomer as well as the casual stargazer. Nightshift helps you find perfect nights for stargazing, assists you in observing your favourite planets, meteor showers and deep-sky objects and keeps you up-to-date about the celestial events in tonights sky.  TL;DR (Features at a glance)  Worldwide stargazing conditions and forecast  Celestial event calendar and astronomy highlights  Over 15,000 deep-sky objects  Advanced object visibility prediction for your telescopes  Clear skies and darkness: stargazing weather forecast See darkness and cloud cover forecast for any location in the world and find tonights best observing opportunities. A comprehensible twilight diagram shows you darkness, weather and observing conditions for any night at a glance. Receive notifications when conditions are good for any observing location.  Never miss out on the highlights of tonights sky Astronomy events, visible planets, active meteor showers, noctilucent clouds, moon phases, oppositions, greatest elongations, lunar eclipses and rise and set times right from the apps dashboard.  Save your favourite stargazing locations Build a database of your favourite observing locations to get location-specific advice about darkness, cloud cover and visibility of celestial objects.  Moon phases and lunar eclipses Find out the current phase of the Moon and the exact time and date of the next full moon, new moon and first and last quarter. Nightshift helps you plan the best moments for lunar observation or prevent moonlight from disturbing your deep-sky observing session. Nightshift contains a calendar with all partial and total lunar eclipses from 1801 to 2200 and gives location specific advice on the visibility of a blood moon from your favourite stargazing spot.  Planets of the solar system Nightshift shows all the visible planets for tonight and the constellations they are in to quickly locate them in the night sky. The event calendar tells you exactly when the next opposition of Jupiter, Saturn, Uranus and Neptune takes place so you can easily plan your planetary observing sessions. For Venus and Mercury, the app displays the moment of the greatest elongation to determine the best morning and evening visibility of the inner planets. Of course, a twilight diagram is available for all planets to find the best opportunities to observe them on any night and the telescopes needed for optimal observation.  Over 15,000 deep-sky objects Nightshift comes packed with a large database of deep-sky objects, including the complete Messier, Caldwell, NGC and IC catalogues. A darkness and clear sky diagram indicates when the conditions are favourable to observe your favourite galaxies, globular clusters, nebulae and other wonders of the deep space.  Tailored advice for all celestial objects Observing conditions and viewing opportunities adjusted for the rise and set times of the Moon, planets and all deep-sky objects from your location.  Comprehensive info from renowned catalogues In-depth information on all celestial objects, including classification, brightness, angular size, distance and cross references with other astronomy catalogues.   Visibility prediction for telecopes, binoculars and naked eye State-of-the-art algorithms predict if celestial objects are within reach of your equipment. The visibility calculator shows you if your favourite planet, galaxy or other heavenly body is visible with your own telescopes or binoculars, taking air mass and predicted atmospheric extinction into account.  Spread the word Clear skies on your favourite stargazing spot? Share your enthusiasm with your social network right from the app.  Icon: NPS/Quinn (CC-BY 2.0)  Discover the world of astronomy Start stargazing tonight with Nightshift and keep track of the fascinating events of the night sky! ",
"desc_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CALENDAR', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}