{
"name" : "C++ Pattern Programs Free",
"url" : "https://play.google.com/store/apps/details?id=com.sitseducators.cpppatternprogramsfree",
"package" : "com.sitseducators.cpppatternprogramsfree",
"category" : "Education",
"description" : "C++ Pattern Programs Free: An app for the programming beginners.  This app is full of pattern and other C++ programs. In addition to this, there is a lot of study stuff related to C++ programming as well.   Programs to print the numbers or symbols in different patterns (e.g. ASCII art -pyramid, waves etc.), are one of the frequently asked interview/examination programs mostly for Freshers. This is so because these programs test the logical ability and coding skills which are essential for any software engineer.   This app is very helpful for understanding how loops can be used to generate these different ASCII art patterns & also for other basic concepts of C++ with the help of programs.  Core Features :  > Pattern printing programs including :   Symbol patterns  Number patterns  Character patterns  Series patterns  Spiral patterns  Wave-style patterns  > Other useful C++ programs including :  General utility programs  Conversion (binary to decimal etc.) programs  Matrix programs  Sorting & Searching programs  Data Structure & Algorithms programs  Basic programs  Pointer programs  Inheritance programs  Operator overloading  File Handling programs  Exception Handling  Template classes and functions  Trick programs  > Study stuff  Short introduction to C++ language.  Comparison of C++ with other languages.  One liner definitions: general programming terms.  Operator precedence table  C++ Keywords  ASCII table  Other Features :  Pattern category filter.  Program search  Quick search  Change text size  Video explanation (in Hindi): To understand the logic that works behind the ASCII pattern programs. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}