{
"name" : "Baby Panda's Body Adventure",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.digestion",
"package" : "com.sinyee.babybus.digestion",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   The Little Prince has eaten too much, and his teeth and stomach cannot take it anymore! Can you help them out?   There are four organs here that need your help: the mouth, the stomach, the small intestine, and the kidney. There are ten levels with each body part. You can get one puzzle piece after passing a level. And you can piece the whole image with all the pieces you won.   Mouth: Cutting the food into pieces You need to help the teeth cut the cake, fruit, chicken meat, and tomato into pieces by waving the tool!   Stomach: Breaking up the food into even smaller pieces The stomach is now filled with food. Move and fire the bombs quickly to break up the food and complete the challenge!   Small intestine: Digesting the food Attention! The green vegetables have appeared. Please aim the green cannon at the green vegetables and destroy them to obtain victory!   Kidney: Destroying the germs The germs have started their attacks. Quick, locate the colors that are the same as the germs and connect them in order to destroy them!   This is a game that is specially designed for children. It helps children to understand the process of food digestion by various organs and also to understand that they should not overeat or be picky eaters, and should instead cultivate healthy eating habits.  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}