{
"name" : "Tittle Parental Control",
"url" : "https://play.google.com/store/apps/details?id=com.bluecube.parentalkit",
"package" : "com.bluecube.parentalkit",
"category" : "Education",
"description" : "Tittle Parental Control is a screen time and parental control app to help parents manage their childs device usage and monitor their location remotely.  Our Android & iOS friendly parental control app allows parents to easily block or enable mobile apps like the internet, as well as set up daily schedules to limit screen time use with just a few simple steps.  These are some of our parental control solutions all parents can use for screen time, device usage and location management:  APP ACCESS*  Block or enable specific apps at any time  Block childs access to apps like games, social media & internet browsers  Enable childs access to other apps like educational puzzles  SCHEDULE*  Create multiple time block schedules for daily, weekly or monthly schedules  Manage screen time at specified timings such as during school, meal times, family time, bedtime  APP USAGE  Monitor your childs daily app usage  SCREEN ALLOWANCE*  Set screen time allotment for your child to balance their own usage  Safeguard them from the harmful effects of excessive phone usage  APP ACTIVITY* & DATA USAGE*  Review apps your child downloaded, updated and deleted  Set mobile data limit to prevent excessive data consumption  LOCATION & GEOFENCING  Track your childs current location and history easily  Create geofencing alerts around known address or landmarks  Receive instant notifications when your child steps in/out of specified addresses or landmarks, e.g. amusement parks, movie theatres, shopping malls, etc  WEB TRACKING  Use Tittles custom browser to actively monitor your childs browsing history  Review and block inappropriate websites in one swipe  Safeguard your child from inappropriate website content (e.g. violent, gambling or adult websites).  You can also view and block websites blocked by other parents.  TASKS  Create tasks to remind your child what youd like them to do   Review progress and send messages to your child  Mark task as complete in one easy tap  LEARN WITH TITTLE  Learn on the go with our educational flashcards  Encourage learning and build vocabulary   High-quality learning materials   Colourful, fun  Option to export and print for offline learning  *Functions currently not available for iOS child devices   Manage your child devices on the go. Available on both Android & iOS platforms, Tittle Parental Control is easy to use and a breeze for even the non-IT savvy parents to actively manage screen time limits. Have peace of mind even when you are away or at work.  We encourage parents to set limits to their childrens screen time, and guide them through the importance of mobile responsibility and unplugging. Use Tittle Parental Control as a tool to communicate with your children and get more involved in setting boundaries to their mobile usage.  Enjoy a free 14-day trial of Tittles Max Plan when you sign up. After the trial, you may continue to use Tittle via one of our paid monthly subscriptions! All Tittle subscriptions are through your Google Play account. Your subscription will automatically renew unless cancelled at least 24 hours before the subscription period ends.  Review Tittles Terms of Use here: https://tittleforparents.com/terms/ Review Tittles Privacy Policy here: https://tittleforparents.com/privacy/  For more information, visit https://tittleforparents.com. You may also reach out to us at info@tittleforparents.com.  Say hello to smart parenting!  (Note: Tittle Parental Control uses the Device Administrator permission, Usage Access & Accessibility services) ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.bluecube.parentalkit.permission.C2D_MESSAGE', 'android.permission.BIND_ACCESSIBILITY_SERVICE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.RESTART_PACKAGES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SET_TIME_ZONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.androidid.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.INTERNET', 'com.android.browser.permission.WRITE_HISTORY_BOOKMARKS', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.RESTART_PACKAGES', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.PACKAGE_USAGE_STATS', 'com.android.browser.permission.WRITE_HISTORY_BOOKMARKS', 'com.androidid.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SET_TIME_ZONE']",
}