{
"name" : "Horse Scanner - #1 Horse Breed Identification",
"url" : "https://play.google.com/store/apps/details?id=com.siwalusoftware.horsescanner",
"package" : "com.siwalusoftware.horsescanner",
"category" : "Education",
"description" : "See a horse, but dont know its breed?  Take a picture and find out! This app will determine it automatically for you.   No horse around?  Just scan a friend of yours and find out which horse he or she looks like!   More features: - Supports many horse breeds  - Horse database containing information and pictures of all breeds can be used without scanning anything, too  - Horse Scanner supports scanning horse images from your gallery, too  - Improved accuracy when taking a short video clip instead of a single image  - Integrated camera with pinch to zoom and tap to focus  - Share your result with your friends by sending an image right out of the Horse Scanner App  - User feedback: tell us, if your result is right and ..  .. youll get the most useful tips to improve your result  .. the app will automatically learn to get more accurate  - Simply translate the app into your language by using the integrated website  - Small app size   Optional premium features:  - Get your results faster  - Configure your scans to be extra fast or even more accurate  - Offline mode: no need for an active Internet connection any longer  - No ads at all  Disclaimer: This app can not transform your smartphone into a crazy space ship being able to extract the blood of your horse with a magic laser. The app gives educated predictions based on what it sees. On average, those predictions are quite accurate. However, its obvious that the result can only be as good as the image/video you provide to the app. Furthermore, its impossible to get each and every individual horse detected correctly. People tend to take it personal, if their own beloved horse isnt predicted right though. If you give the app a chance in the first place, youll see that its overall performance is pretty decent. Instead of having to pay a lot of money for a DNA test, youre getting this app for free. Enjoy! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}