{
"name" : "Colorful ABC for Kids - Flashcards",
"url" : "https://play.google.com/store/apps/details?id=com.holidayeducationist.colorfulabc_en",
"package" : "com.holidayeducationist.colorfulabc_en",
"category" : "Education",
"description" : "Study reveals that children grasp information about colors, shapes, words, sounds and various other information long before they start to speak.  Colorful ABC is a Flash Cards App, containing ideal amount of undistracted information to help memorizing the alphabets shapes held up for children of 8 months to 5 years.  Colorful ABC starts building alphabets shapes in childrens sub-conscious mind in very early ages, so the information is recalled when its taught in schools. It is the most suited alphabets flashcards app to be used in all levels of kindergarten classes as well.  Colorful ABC is aimed to practice as a learning drill to aid memorization by way of spaced repetition learning technique and exercise the mental process of active recall and to helps building concentration and cognitive skills.  We at Holiday Educationist have a team of certified teachers onboard to consult and proof-read the apps content for the optimum quality assurance. Key Features  Carefully selected Font for memorizing alphabets shapes Zero distraction of any user interface controls Carefully selected colors Capital and small letters Animation option for toddlers attention grabbing Soft background music option Color swap option for letters Ideally largest possible screen 3 Voiceovers for all letters ABC alphabets sheet with 3 ABC Songs High Definition content for retina display Swipe left / right gesture to navigate between letters Important  Colorful ABC must be practiced on children with (Ads Free Version). You can buy the App to remove ads and unlock all the features. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}