{
"name" : "Coloring dinosaurs",
"url" : "https://play.google.com/store/apps/details?id=com.YovoGames.drawDino",
"package" : "com.YovoGames.drawDino",
"category" : "Educational",
"description" : "How to learn drawing? Actually its very simple. Learn to draw is incredibly easy. And educational coloring game will help your kids in this better than anything else. We present you our Coloring dinosaurs , a new one from the series of educational games. Drawing for kids is not just coloring patterns and outlines for coloring. This is a whole world filled with its own magic. After all to create something with own hands is a miracle. Coloring games for children is the most exciting game for children from invented ones. They are aimed at comprehensive development of a child, disclosure of ones inner world and creative potential. Educational coloring games like our coloring about dinosaurs will help your child to feel like a real young artist who creates a real colorful masterpiece. Following thoughtful prompts your baby can not only create baby picture of a dinosaur he also can get a lot of necessary life skills, develop fine motor skills of hands, perseverance and attention, imagination and color perception.. And soundtrack and rich color palette will bring a lot of joy and positive emotions. Our coloring games for kids allow to create picture with dinosaur using templates as well as pencils or felt-tip pens. So your kids have an opportunity to draw any picture they can imagine. One of the features of the game is the ability to create drawings with neon pencils and share them with friends and acquaintances. Download the game Coloring dinosaurs onto your phone or tablet and explore the world of the dinosaurs where you get to know how they looked like, learn about their habitat and most importantly - learn how to draw.   Visit our website: http://yovogames.com Twitter: https://twitter.com/YOVOstudio Facebook: https://facebook.com/yovogames OK: www.ok.ru/yovo.games VK: https://vk.com/yovogames ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION']",
}