{
"name" : "Wikids: Talking Encyclopedia For Curious Kids",
"url" : "https://play.google.com/store/apps/details?id=com.wiki_kids.wikidsanimals",
"package" : "com.wiki_kids.wikidsanimals",
"category" : "Education",
"description" : "Wikids, a talking encyclopedia for kids encourages independent learning and develop the curiosity.  Try now and get 24 fascinating topics for FREE!  ***Get access to ALL 192 topics, for an UNLIMITED period, ONE TIME payment only.****  Wikids is a special audio-visual encyclopedia made just for kids ages 3-7! It is perfect for kids who cant read yet and first- and second- graders! Join thousands of curious kids worldwide who are already exploring and broadening their horizons, with tons of information about the world around us. Wikids is lots of fun and offers an enriching educational experience. Wikids cultivates your kids curiosity and encourages independent exploration.   *** New parental area with info, tips, and Wikids printable medals ***  Designed for independent discovery, Wikids gives kids the freedom to look up what interests them. The super-accessible app explains in kid-friendly language nearly 200(!) topics. Each entry is about 80 words in written form, narrated in a friendly voice and accompanied with colorful images.  Now you can earn medals on Wikids, which encourage you to explore more!  Wikids is 100% kids safe and ad-free.  This Wikids app contains the following categories:   Animals  The Human Body   Space   Countries  Nature  Musical Instruments   Landmarks and Monuments  Traditional Food  Features: - 192 exquisite entries to broaden your childs horizons.  - Medal system that encourages your curious kids to explore more! - High-quality narration and imagery. - Intuitive navigation by category or by the ABC. - Pause/Play Button - Interrelated entries. For example, if your child explores France, Wikids will also suggest the entries Eiffel Tower and Croissant. - 100% safe, clean content. - Ad-free. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}