{
"name" : "BrainLang : Aplicación para Aprender Inglés",
"url" : "https://play.google.com/store/apps/details?id=com.brainlang.app",
"package" : "com.brainlang.app",
"category" : "Education",
"description" : "APRENDE A HABLAR INGLS CON BRAINLANG  Entrena tu ingls escuchando y comprendiendo historias interesantes.  ---------------------------------------------------------- * MTODO BRAINLANG: www.brainlang.com/guia-metodo.php  * CMO FUNCIONA: www.brainlang.com/guia-como-usar-brainlang.php ----------------------------------------------------------  REGSTRATE GRATIS Y COMIENZA A ENTRENAR TU INGLS:  * Cmo? Con vdeos creados por guionistas profesionales.  * Por qu? Porque el cerebro capta el lenguaje al entender mensajes que le interesan.  * Cundo? Entrena cuando quieras, donde quieras. Sin cursos. Sin clases. Sin rollos.   * Ests seguro? Es una inmersin sin que tengas que viajar. Sumrgete en un infinito de historias.  * Es un curso? No. Es ilimitado. Es una factora de contenidos. Creamos para ti continuamente.  * Tiene cuotas? No. EMPIEZA AHORA MISMO GRATIS CON ENTRENAMIENTOS DE REGALO. Si te gusta podrs comprar tu pack de entrenamientos y consumirlo cuando quieras. Sin cuotas mensuales.  *Y la gramtica y la fontica? Tienes que comprenderla, y aceleras el proceso. Y lo mejor es comprender las similitudes y diferencias con tu lengua materna. Tenemos guas para ello.  * Y hablar? Se aprende escuchando. Cuando tienes nivel bajo es mejor que no hables. Luego viene bien. Y en BrainLang podrs practicar con sesiones de speaking.  * Y para que lo entienda mi abuela? Pues mira, es como montar en bicicleta, es una habilidad, y hay que entrenar. No sirve estudiar.  ----------------------------------------------------------  TAMBIN CON TU NAVEGADOR WEB  Con tu email y clave tambin puedes entrenar en https://training.brainlang.com con tu  navegador web (Chrome, Safari, Firefox) con cualquier dispositivo.  ----------------------------------------------------------  Vistanos en www.brainlang.com  Contctanos en consiguelo@brainlang.com para ms informacin. LEARN to speak English BRAINLANG  Train your English listening and understanding interesting stories.  -------------------------------------------------- -------- * METHOD BRAINLANG: www.brainlang.com/guia-metodo.php  * HOW IT WORKS: www.brainlang.com/guia-como-usar-brainlang.php -------------------------------------------------- --------  SIGN UP FOR FREE AND START YOUR ENGLISH COACHING:  * How? With videos created by professional writers.  * Why? Because the brain to understand the language captures messages that interest you.  * When? Train anytime, anywhere. No courses. Without classes. No rolls.  * Are you sure? It is a dive without you having to travel. Immerse yourself in an infinity of stories.  * Is a course? No. It is unlimited. It is a content factory. Continually created for you.  * Does fees? No. STARTS NOW FREE GIFT WITH WORKOUTS. If you like you can buy your pack of workouts and consume anytime. No monthly fees.  * What grammar and phonetics? You have to understand, and accelerate the process. And it is best to understand the similarities and differences with your mother tongue. We have guidelines for this.  * And speak? You learn by listening. When you have low level is better not talk. Then comes good. And in BrainLang you can practice with speaking sessions.  * And for you to understand my grandmother? Well, look, its like riding a bike, it is a skill, and you have to train. No good study.  -------------------------------------------------- --------  ALSO your browser  With your email and password you can also train in your https://training.brainlang.com web browser (Chrome, Safari, Firefox) with any device.  -------------------------------------------------- --------  Visit us at www.brainlang.com  Contact us at consiguelo@brainlang.com for more information. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.brainlang.app.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}