{
"name" : "Jägarexamen Lite",
"url" : "https://play.google.com/store/apps/details?id=com.boboshi.jagarexamenlite",
"package" : "com.boboshi.jagarexamenlite",
"category" : "Education",
"description" : "Jgarexamen innehller allt du behver kunna fr att klara teoriprovet fr jgarexamen och r Sveriges i srklass mest nedladdade, innehllsrika och smartaste utbildningsapp fr blivande jgare som ska ta jgarexamen och fr mer erfarna jgare som vill friska upp sina kunskaper infr jaktssongen.  Fullversionen av Jgarexamen har ftt fler n 400 femstjrniga betyg p Google Play och har blivit omskriven p bland annat jagareforbundet.se, jaktjournalen.se, jaktbloggen.com, macworld.se, pcforalla.idg.se, prisjakt.nu/pryl och i tidningen Jaktmarker & Fiskevatten.    TESTA GRATIS INNAN DU KPER  Jgarexamen Lite r en begrnsad testversion som ger dig ett smakprov p vad fullversionen av Jgarexamen har att erbjuda. Fr att f tillgng till allt innehll och alla funktioner s mste du kpa fullversionen av Jgarexamen.   INNEHLL I FULLVERSIONEN   1 000 teorifrgor med tydliga frklaringar.   Pedagogisk och verskdlig rttning som lnkar frgorna direkt till rtt del av jaktteorin eller viltuppslagsverket.   Tre olika typer av prov: smarta vningsprov, teoriprov och egna prov dr du sjlv vljer alla instllningar.   Avancerad frgedatabas som sorterar bort besvarade frgor.   Lttlst och skbar teoribok med massor av bilder, exempel och anvndbara funktioner - fortstt ls dr du slutade, se hur mycket du har kvar att lsa i varje kapitel och stt bokmrken vid viktiga stycken.   Mjligheten att pausa och teruppta prov samt g igenom alla tidigare gjorda prov.   Skbart viltuppslagsverk med ver 100 artpresentationer och hundratals hgupplsta foton.   Smart checklista som guidar dig genom alla stegen fram till jgarexamen.   Provstatistik som bland annat visar din utvecklingskurva och vad du behver va p.   Hgupplst design anpassad fr alla skrmstorlekar.   Ingen bindningstid. Inga dolda avgifter. Ingen reklam.   Snabb support via e-mail.   100 % AKTUELLT INNEHLL  Teorifrgorna i Jgarexamen tcker in precis allt som tas upp i den senaste kurslitteraturen och s fort en lag eller regel infrs eller frndras s uppdaterar vi innehllet i appen. Hunting contains everything you need to know to manage to retake the hunting and is Swedens most downloaded, content-rich and brightest utbildningsapp for prospective hunters to get a hunting license and for more experienced hunters who want to brush up on their skills before hunting season.  The full version of Hunting has received more than 400 five-star reviews Google Play and has been featured on including jagareforbundet.se, jaktjournalen.se, jaktbloggen.com, macworld.se, pcforalla.idg.se, prisjakt .com / stuff and in the newspaper Jaktmarker & Fishing.   FREE TEST BEFORE YOU BUY   Hunting Lite is a limited trial version that gives you a taste of what the full version of Hunting has to offer. To get access to all content and features, you must purchase the full version of Hunting.   Content in the full version    1000 theory questions with clear explanations.   Educational and foreseeable correction related questions directly to the right part of the hunting theory or game encyclopedia.   Three different types of tests: smart practice tests, theory test and self test where you choose all the settings.   Advanced Query database to sort out questions answered.   Easy to read and searchable teoribok with lots of pictures, examples and useful features - keep reading where you left off, see how much you have left to learn in each chapter and insert bookmarks at key pieces.   The ability to pause and resume the test and go through all the previous trials.   Searchable game encyclopedia with over 100 artpresentationer and hundreds of high resolution photos.   Smart checklist that guides you through all the steps until hunting.   Sample Statistics that shows your development curve and what you need to practice.   High design adapted to all screen sizes.   No fixation. No hidden fees. No advertisement.   Quick support by e-mail.   100% current content  Theory questions in Hunting covers just about everything mentioned in the latest literature and as soon as a law or a rule introduced or changed so we update the content in the app. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}