{
"name" : "Fluid dynamics",
"url" : "https://play.google.com/store/apps/details?id=com.soft24hours.encyclopedia.fluid.dynamics.free.offline",
"package" : "com.soft24hours.encyclopedia.fluid.dynamics.free.offline",
"category" : "Education",
"description" : "Fluid dynamics In physics and engineering, fluid dynamics is a subdiscipline of fluid mechanics that describes the flow of fluidsliquids and gases. It has several subdisciplines, including aerodynamics (the study of air and other gases in motion) and hydrodynamics (the study of liquids in motion). Fluid dynamics has a wide range of applications, including calculating forces and moments on aircraft, determining the mass flow rate of petroleum through pipelines, predicting weather patterns, understanding nebulae in interstellar space and modelling fission weapon detonation, Fluid dynamics offers a systematic structurewhich underlies these practical disciplinesthat embraces empirical and semi-empirical laws derived from flow measurement and used to solve practical problems. The solution to a fluid dynamics problem typically involves the calculation of various properties of the fluid, such as flow velocity, pressure, density, and temperature, as functions of space and time.  The free application Fluid dynamics is very friendly, it has a beautiful and simple interface. The best choice for a pocket dictionary that is always at hand. From which you can learn a lot of new and interesting things, for example, that:  PrandtlMeyer expansion fan A supersonic expansion fan, technically known as PrandtlMeyer expansion fan, a two-dimensional simple wave, is a centered expansion process that occurs when a supersonic flow turns around a convex corner. The fan consists of an infinite number of Mach waves, diverging from a sharp corner. When a flow turns around a smooth and circular corner, these waves can be extended backwards to meet at a point.  Newtonian fluid A Newtonian fluid is a fluid in which the viscous stresses arising from its flow, at every point, are linearly correlated to the local strain ratethe rate of change of its deformation over time. That is equivalent to saying those forces are proportional to the rates of change of the fluids velocity vector as one moves away from the point in question in various directions.  Wave impedance The wave impedance of an electromagnetic wave is the ratio of the transverse components of the electric and magnetic fields. For a transverse-electric-magnetic (TEM) plane wave traveling through a homogeneous medium, the wave impedance is everywhere equal to the intrinsic impedance of the medium. In particular, for a plane wave travelling through empty space, the wave impedance is equal to the impedance of free space. The symbol Z is used to represent it and it is expressed in units of ohms. The symbol  (eta) may be used instead of Z for wave impedance to avoid confusion with electrical impedance.  Features:  The dictionary works offline - you do not need an internet connection. Access to articles (descriptions) offline, without an Internet connection (except for photographs);  Very quick search for descriptions. Equipped with a quick dynamic search function - the dictionary will start searching for words during input;  Unlimited number of notes (favorites);  Bookmark - you can add descriptions to your favorites list by clicking on the asterisk icon;  Manage bookmark lists - you can edit your bookmark lists or clear them;  Search History;  Voice search;  Compatible with modern versions of Android devices;  Very efficient, fast and good performance;  An easy way to share with friends;  The application is very easy to use, fast and with extensive content;  Automatic free updates every time new terms are added;  The directory Fluid dynamics is designed to occupy as little memory as possible.  Features Premium:  no ads;  photos, images of access offline;  Clear browsing history. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}