{
"name" : "French Numbers - French Number Spelling & Learning",
"url" : "https://play.google.com/store/apps/details?id=com.ribapps.frenchnumbers",
"package" : "com.ribapps.frenchnumbers",
"category" : "Education",
"description" : "French number speller helps you to write number to word. Currently app supports number spelling for traditional French, Swiss French and Belgian French. French numbers, Swiss numbers and Belgian numbers writings have some differences that you can discover through the app.  French numbers app has two main functionalities: Number speller. This functionality helps you to spell number (numbers with a floating point are supported), it converts from number to word, for traditional French, Belgian French and Swiss French. You can check the correct spelling of the number or copy it. Depending on your device you can also listen the pronunciation.  Learn French numbers writing grammar. To accomplish this task French Numbers - French Number Spelling & Learning app offers you 4 learn modes: Understanding of the french numbers. Youll be asked to write a number from a spelled number representation. Its something like show number from its text. Number writing. This one asks you to spell number and check if you were correct or not. Understanding of the french numbers pronunciation. Here you need to write number according to its pronunciation.  Understanding and writing of french numbers. Your phone will pronounce the number and youll need to write it. App will check if you were correct or not.  All french numbers writing exercises use random numbers from specified range. There are different difficulty modes of number writing: the simplest one asks you to write a simple number from 1 to 20 but the hardest one asks for writing of a very big numbers with a floating point. You can easy adjust the question to your level and to your targets.  Good luck with a learning. We hope that app makes the number writing easier. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}