{
"name" : "TED Masterclass for Orgs",
"url" : "https://play.google.com/store/apps/details?id=com.ted.TEDMasterclass",
"package" : "com.ted.TEDMasterclass",
"category" : "Education",
"description" : "Is your school or organization enrolled in TED Masterclass for Organizations? If so, youre in the right place. Download this companion app and enjoy the learning experience with your colleagues.   If your school or organization is not enrolled in TED Masterclass for Organizations, you need to head over to our other app here:  https://play.google.com/store/apps/details?id=com.ted.B2CMasterclass&hl=en_US  With TED Masterclass for Organizations, you can:  LEARN THE PROCESS FOR DEVELOPING TED-STYLE TALKS This course, hosted by TEDs Curator, Chris Anderson, will guide you through the process of developing TED-style talks.  GAIN INSIGHTS FROM TOP TED SPEAKERS TED Masterclass for Organizations provides exclusive examples of course concepts in action from top TED speakers.  COLLABORATE WITH A PARTNER The TED Masterclass course is designed to be completed by people working in pairs or small groups. Yes, you can complete it on your own, but to get the most out of the experience we highly recommend you take the course with a colleague or a friend who knows you well. You can change or add partners at any point throughout the course.  SHARE IDEAS WITHIN YOUR ORGANIZATION TED Masterclass for Organizations is designed to celebrate culture and innovation within all types of organizations. This course will help you and your colleagues learn from and share each others most compelling ideas.  SHARE YOUR TALKS WITH TED Youll be invited, but not required, to submit a recording of your final talk to TEDs curators. The top talks could potentially be featured on TED.com.  Access requires confirmed participation in TED Masterclass for Organizations by your school or organization.  To learn more about how to get your organization involved in TED Masterclass for Organizations, visit masterclass.ted.com or send an inquiry to masterclass@ted.com. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}