{
"name" : "Six Kalmas with Audio and Translation",
"url" : "https://play.google.com/store/apps/details?id=com.sharpedges.sixkalma",
"package" : "com.sharpedges.sixkalma",
"category" : "Education",
"description" : "Apps Moto **Use it without fearing about your privacy to learn 6 kalmas of islam as your privacy is our ultimate priority** This app doesnt keep any kind of hidden track of users personal information  Download this free app of six Kalmas of Islam to recite and learn by heart.  How to Use It? 1. Install and Open the Six Kalma app to learn kalmas of islam 2. It will provide you with 6 tabs for each kalma 3. Click on tab to go to the specific kalma or you can swipe left or right for previous or next kalma, respectively 4. Click on Play Icon to listen to the audio of the kalma 5. There are sub tabs where you can see the translation of the kalma in urdu and english language.  Features of the App:  > Recitation and Reading of 6 kalmas of Islam > Easy Urdu and English translation of Kalmas > Excellent Readability > Name of each Kalma is provided in addition to its literal meaning. > Play and Pause feature for Kalma Audio >Translation feature helps in understanding the meanings of each Islamic Kalma in both English and Urdu.  Thanks for downloading and please provide a valuable feedback  all six kalimas of islam with urdu translation all six kalmas of islam with english translation all six kalma in arabic all six kalma islam all six kalma mp3 all six kalmas download six kalma download mp3 six kalma first kalma to six kalma free download six kalma free download six kalma mp3 full six kalma islamic six kalma learn six kalimas recitation of six kalma six islamic kalma arabic six kalima free download six islamic kalma mp3 six islamic kalma download six kalima in arabic six kalima in islam six kalima of islam six kalima of islam in arabic six kalima of quran six kalima with translation six kalimas six kalma apk six kalma arabic six kalma free download six kalma full six kalma hd six kalma in arabic six kalma in arabic text six kalma in quran six kalma mp3 six kalma mp3 free download ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}