{
"name" : "Learn Arabic || Speak Arabic Offline",
"url" : "https://play.google.com/store/apps/details?id=com.lyric.learn_arabic",
"package" : "com.lyric.learn_arabic",
"category" : "Education",
"description" : "Learn Arabic is an easy to use mobile phrasebook that will give visitors to Dubai, Egypt, Algeria, Saudi Arabia, Morroco, UAE & more and those who are interested in learning Arabic a good start in the language.    Get the full set of phrasebooks for FREE! Search for codegent and download more languages.. Japanese, Korean, Chinese, Vietnamese, Spanish, French, & many more.   Learn Arabic is recorded using native speaker and we have tried our best to be authentic in the pronunciation whilst ensuring it is easy to understand. Recommended app for tourists and business people visiting Dubai, Egypt, Algeria, Saudi Arabia, Morroco, UAE, & more.   * Carefully translated list of essential phrases  * High quality audio pronunciation by native speaker  * No internet connection required  * Highlight important words with tips  * Store frequently used phrases in favourites  * Search by keywords  * No adverts or annoying popups   CATEGORIES   The LITE version contains over 400+ essential phrases. - Greetings - General conversation - Numbers - Directions and places - Transportation - Eating out  If you upgrade to the PRO and get 600+ more phrases  - Accommodation  - Time and date  - Shopping  - Colours - Towns and provinces - Countries - Tourist attractions - Family - Dating - Emergency - Feeling sick  - Tongue twisters  ------------------  FEEDBACK If you like this app and find it useful please take a few seconds to give us a rating in the Android Market.     Learn Arabic for Beginners  Learn Arabic Vocabulary - 6,000 Words    (Learn Arabic)  Learn Arabic - Language Learning App Learn Arabic Quran Words  Learn Quran  Arabic Learning App  Learn Arabic Easily Learn Arabic Alphabet Learn languages, grammar & vocabulary with Memrise Learn Arabic Language Free  Speak Arabic Learn Arabic From Bangla Learn Arabic Free  Learn Arabic Learn Arabic - 5000 Phrases Learn Arabic - Phrasebook | Translator SPEAK ARABIC - Learn Arabic Arabic Learning for Beginners - Urdu, English more Learn Arabic Speaking Free Learn Arabic Phrasebook  Learn Arabic Language Basics 1  SPEAK ARABIC - Learn Arabic NO LIMIT and FREE     Learn arabic in bnagla  Learn Arabic Learn Arabic with Urdu (30 Days) Learn Arabic Language Basics 3 Learn Arabic Free Offline For Travel Arabic English Dictionary & Translator Free  Speak Arabic For All 1 - Lite Speak Arabic Language for Beginners in 10 Days Speak Arabic through Tamil  SPEAK ARABIC - Learn Arabic  Learn Arabic with Audio  Speak Arabic in 30 days  Speak Arabic Free  Learn to Speak Arabic Spoken Arabic 360 English Talk Arabic (Free) Speak Arabic Hindi 360 ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.lyric.learn_arabic.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}