{
"name" : "Calculator Free",
"url" : "https://play.google.com/store/apps/details?id=com.asd.emicalculator",
"package" : "com.asd.emicalculator",
"category" : "Education",
"description" : "Key Feature :  - Free Calculator app - Perform basic calculations such as addition, subtraction, multiplication, and division  - Unit converter - To convert units, tap the unit calculator button. You can easily convert various types of units such as Area, Length, Mass, Speed, Volume, Temperature, Time, pressure, and fuel conversion  - Currency Converter - Now users can convert currency and calculate the value. We are supporting more than 50 types of currency.    Loan EMI calculator   - Home Loan Eligibility section for estimating loan eligibility.  - Calculate EMI with statistics (Monthly Mode).  - Calculate EMI: Enter Amount, Interest Rate (%) and Loan Tenure (Years / Months) to calculate EMI.   - Calculate Loan Amount: Enter EMI Amount, Interest Rate (%) and Loan Tenure to calculate the Affordable Loan Amount.   - Compare Loan: Compare loan EMI by entering Principal Amount, Rate of Interest (%) and Tenure(Payback period)  - Good Usability, Easy to Access and Innovative.   Tax and saving Calculator - Calculate GST, PPF, and SIP with an easy interface  GST CALCULATOR gives all functionality of GST and TAX Calculation for All countries with just one Single Click. Get results calculated as you type.  We Give Two Button Add GST and Subtract GST.   ADD GST or TAX :- Calculate any number of GST or TAX like +3%, +5%, +12%, +18%, +28% Etc.   SUBSTRACT GST or TAX :- Calculate any number of GST or TAX like -3%, -5%, -12%, -18%, -28% Etc.    CURRENCY CONVERTER  Currency Converter is best for the live exchange rate. We put 4 countries at a time and giving the option to select more countries from the list so you can show more than one countrys exchange rate at a time.  All Country Currency included Asian Countries, American Countries, European Countries, , African Countries, Middle East, like India, USA, Canada, Australia, Uk , China, Japan , Pakistan, France , Germany, Spain, Indonesia, Tanzania, Mali, Bangladesh, Nepal, South Africa, Brazil, Malaysia, Saudi Arabia, UAE, and many more.    We are giving support for Unit Converter Features with Many Units:-  1. Area:- Square Kilometer, Hectare, Square Meter, square Mile, Acre, Square yard, Square Foot, Square Inch. 2. Mass/weight:- Metric Ton, Kilograms, Gram, Milligram, Mcg, Long Ton, Short Ton, Stone, Pounds, Ounce, Tons. 3. Temperature:- Celsius, Fahrenheit, Kelvin. 4. Volume:- Cubic meter, Liter, Milliliter, Cubic Foot, Cubic Inch, Imperial gal, Imperial pint, US gal, Quart, Pint, Cup, Oz, US tbsp, tsp. 5. Length:- Kilometer, Meter, Centimeter, Millimeter, Mile, Yard, Foot, Inch, Nautical Mile. 6. Speed :- Miles/hour, Feet/Sec, Meters/Sec, Km/hour , Knot. 7. Fuel Consumption :- MPG (US), MPG (imp.), km/liter , liter/100km, etc. 9. Time:- Nanosecond, Microsecond, Millisecond, Second, Minute, Hour, Day, Week, Month, Year, Month, Year, Decade, Century.   To check the calculation history, tap the calculation history icon. To close the calculation history panel, tap the keypad icon. You may clear history also.   - Simple calculator for Plus(Add), multiply, Division, Subtract and complex calculations ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.asd.emicalculator.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}