{
"name" : "SNU LEI – Hangeul",
"url" : "https://play.google.com/store/apps/details?id=com.hyonga.snu.lang.edu.lab",
"package" : "com.hyonga.snu.lang.edu.lab",
"category" : "Education",
"description" : "* Product Information This Hangeul (Korean Alphabet) application enables foreign learners without experience of the Korean language to easily comprehend the sounds and shapes of Korean consonants and vowels. It consists of various educational activities that teach Korean pronunciation and writing, so learners can master the sounds and shapes of Hangeul (Korean alphabet) via a smart device anywhere in the world.   * Characteristics The overall composition is geared towards boosting a step-wise learning of the pronunciation and the stroke order for writing Korean consonants and vowels. The stroke order is numbered for learners to easily understand and follow it.  Learners can master the shapes of Korean letters while directly writing them onto their smart device.  As for vowels, you can check a native speakers mouth shape through video footage.  This applications voice-recording function leads you to directly record and check your pronunciation, and repetitive recording is also possible. In the recording section, you can compare your pronunciation with that of native speakers.  In each learning unit, you can test your performance through the practice function. This application is available in English, Japanese, and Chinese.  * Introduction to SNU Language Education Institute Do you want to learn Korean?  Located at the SNU campus, the Language Education Institute (LEI) is a specialized institution for language education that offers a wide range of Korean language courses. Language education experts with at least a masters degree do their best to improve the Korean proficiency of learners through systematic instruction.  The Regular Program consists of four semestersspring, summer, autumn, and winterand each 10-week semester features four hours of daily classes from Monday to Friday. The LEI runs an evening class on Monday and Thursday for workers and university students who cannot take daytime classes, as well as both 3-week and 5-week short-term courses for those students planning to study during the vacation.  For further information, please contact us via the homepage below, e-mail, or telephone:  - Homepage: http://lei.snu.ac.kr/klec - E-mail: klp@snu.ac.kr - Telephone: +82-2-880-5488, 8570 - Facebook: http://www.facebook.com/snuklec ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_OWNER_DATA', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_OWNER_DATA', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}