{
"name" : "Shapes for Children - Learning Game for Toddlers",
"url" : "https://play.google.com/store/apps/details?id=com.oki.shapes",
"package" : "com.oki.shapes",
"category" : "Educational",
"description" : "Shapes and Forms for Toddlers is one of our children educational games for kids of early kindergarten age - from 2 to 5 years old. With the help of mobile learning games for kids parents are able to turn boring education into an exciting and fun class. Now the study of shapes for kids becomes an exciting adventure for your child. Main advantages of shape games: 1) Playing shapes games your kid gets acquainted with a variety of geometric shapes - not only the simplest shapes for toddlers (a circle, a square, a rhombus, an oval, a triangle, a rectangle), but also more complex kids shapes (a heart, a flower, a foot). 2) Learn shapes and fix the received knowledge of geometrical shape playing 3 fun mini-games which will not allow your baby to get bored and will provide even more laughter and fun. 3) Shape puzzle games provide learning shapes in 17 languages: English, German, Spanish, Portuguese, Russian, Italian, and others. The names of all toddler shapes are pronounced by native speakers with perfect pronunciation. Playing the educational games for toddlers your baby expands vocabulary. The knowledge of geometric figures names in different languages broadens horizon. 4) Playing shapes matching games for toddlers, your kid learns not only smart baby shapes, but also colors and shapes. Juicy and bright toddler color and shapes are sure to attract your babys attention, so he or she will want to know the name of this or that color. It makes these educational games for kids a perfect tool of learning shapes and colors. 5) The shapes and color games for kids are created so simple and intuitive, that its interface will not cause the slightest difficulty to cope with. 6) Like our other learning apps for kids, you can download learning shapes for toddlers free. Shape games for kids free save family budget without any loss of quality in a childs education. What skills will your baby acquire playing shapes and colors games for kids? - Shape games for toddlers help develop memory and attentiveness of your baby, as well as concentration and perseverance. These skills will be very useful in study at school. - Learning shape games for kids included in the children educational apps for free will not only help check how well your child has learned baby shapes, but also develop logical thinking and train fine motor skills of your baby. - Playing such shape sorting games for kids free, your kid learns to find the similarities and differences between different kids shapes and colors preschool. In other words, while learning shapes for kindergarten your child tries to observe, remember and compare. Our shapes for children with shape builder can be recommended as educational games for kids nursery: - educational games for toddler age 2; - learning games for toddlers age 3; - learning games for toddlers age 3-4; - educational games for 4 to 5 year kid. How to play colors and shapes for kids app free preschool: 1) The 1st game of the app is the main teaching tool in learning shapes for kids. Your baby will learn colours and shapes for kids in the following way. One of shapes for babies appears on the screen and the pronunciation of its name follows. Three contours lower to the top of the screen, and your kid has to choose a suitable one appropriate for the given basic shapes. If the choice is correct, the shapes and colors for toddlers become painted in a bright color. This game can easily be regarded as learning games for toddlers age 2. 2) The 2nd educational games for toddler age 3 - checking knowledge after learning shapes and colours. Here, the kid will be given eight different forms for kids. The task is to choose a given shape among the eight ones.  3) Kids learn shapes and again check the received knowledge. In the learning apps for colors and shapes for 2 to 3 yr old toddlers your baby will catch shapes already familiar to him. The goal of the shape puzzles is to catch only the shapes that match the shape proposed. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CALL_LOG']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['com.android.vending.BILLING']",
}