{
"name" : "Baby Jigsaw Puzzles",
"url" : "https://play.google.com/store/apps/details?id=com.edujoy.Living.Puzzles",
"package" : "com.edujoy.Living.Puzzles",
"category" : "Educational",
"description" : "Living puzzles is a great educational game aimed at children at an early age to learn the sounds of different animals such as cow, sheep or lion among others, and to identify the places where these animals live.  The game will awaken the curiosity of children to learn animal sounds that are divided by themes and types of animals: domestic, wild, prehistoric ...  The game consists of different fun scenarios with dozens of animals accompanied by their sounds and animations. Each time the children put the piece in the correct silhouette, they can hear the sound of that animal with a fun animation.  PUZZLES WITH VARIOUS SCENARIOS   Jungle: sounds of animals like the monkey, the snake or the toucan. Savanna: enter the African savanna to meet the lion, elephant and many more. Dinosaurs: From the Tyrannosaurus Rex to the flying dinosaur. Ocean: Dive under the sea to find the little mermaid and her friends. Farm: domestic animals such as the cow, the rabbit or the sheep. Space: You will find an astronaut traveling between planets Insects: Grasshoppers, bees and small animals that live in the forest.  In addition, the game offers the possibility of performing classic puzzles with different levels of difficulty (6, 9, 12 or 24 pieces). In this way, children stimulate attention and eye-hand coordination.  GAME FEATURES  Simple interface designed for kids Two game modes: puzzles with sound and classic puzzles Funny animations every time you solve the puzzle Fantastic puzzles to learn animals Realistic animal sounds Colorful and quality drawings Large and easy to handle pieces Early stimulation of auditory and visual memory Ideal for children from 1 to 5 years old   ABOUT EDUJOY  Thank you very much for learning with Edujoy games. We love creating educational and fun games for children. If you have any questions or suggestions about this game you can contact us through the developers contact or through our profiles on social networks:  twitter: twitter.com/edujoygames facebook: facebook.com/edujoysl ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}