{
"name" : "Pictosonidos",
"url" : "https://play.google.com/store/apps/details?id=com.promedia.pictosonidos",
"package" : "com.promedia.pictosonidos",
"category" : "Education",
"description" : "Pictosonidos es una aplicacin donde a travs de los pictogramas, con sonidos y locuciones asociadas, se ayuda a la comprensin de conceptos y a incrementar el vocabulario de personas con trastornos de comunicacin oral, que aprenden ms fcilmente a travs de imgenes.  A travs de los pictogramas ayudamos a las personas a situarse en espacio y tiempo, a anticiparse a acontecimientos, a expresar sus inquietudes y sentimientos, a comunicarse de una manera alternativa de forma general.  El funcionamiento de la web de Pictosonidos es muy sencillo, los pictogramas estn agrupados en diferentes categoras; al acceder a cada categora pueden ir avanzando progresivamente uno a uno, o bien avanzar al pictograma que se quiera mediante el panel superior de acceso rpido a los pictogramas de cada categora.  Cada pictograma lleva asociada una locucin de la palabra y en aquellos casos que disponga de sonido esa unidad, dicho sonido sonar previo a la locucin, para facilitar en lo posible la comprensin de dicha imagen.  Cada palabra de cada categora lleva asociada una frase con locucin de voz incluida, para una mejor asimilacin de conceptos, a la cual se accede pulsando en el icono de conversacin de la esquina del pictograma central, el cual nos abrir una pantalla flotante con la frase complementaria al concepto.  Hemos procurado hacer la navegacin de la aplicacin lo ms intuitiva posible y alcanzar con ello un mayor grado de usabilidad a la hora de manejar tantos conceptos.  Incluimos juegos en aquellos apartados que contienen sonidos para hacer del aprendizaje una experiencia ms amena, una vez adquiridos los conocimientos de vocabulario necesarios a travs de dichos pictogramas, sonidos y locuciones.  Existe la posibilidad de descarga de la aplicacin para que pueda ser usada por cada usuario sin la necesidad de disponer de internet para su uso, en la actualidad est solo disponible para Android esperamos que en breve tambin lo est para iOS. Pictosonidos is an application which through pictograms associated with sounds and phrases, it helps to increase understanding of concepts and vocabulary of people with oral communication disorders, which more easily learn through images.  Through pictograms help people to stand in space and time, to anticipate events, to express their concerns and feelings, to communicate in an alternative way generally.  The operation of the website Pictosonidos is very simple, the pictograms are grouped into different categories; to access each category can be progressive one by one, or move the pictogram you want by the top panel for quick access to the icons of each category.  Each pictogram has an associated word and phrase in cases provided sound that unit, the sound will sound prior to the speech, as far as possible to facilitate the understanding of the image.  Each word in each category is associated with speech phrase including voice, for better assimilation of concepts, which is accessed by clicking on the icon conversation corner of the central pictogram, which will open a floating screen that reads Further the concept.  We have tried to make the navigation as intuitive application possible and thus achieve a higher degree of usability when managing so many concepts.  Games include those sections containing sounds to make learning a more enjoyable experience once acquired the necessary knowledge of vocabulary through these pictograms, sounds and phrases.  There is a possibility of downloading the application so it can be used by each user without the need for Internet use, it is currently only available for Android hope that soon also be for iOS. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}