{
"name" : "Current Affairs 2020",
"url" : "https://play.google.com/store/apps/details?id=com.careerlift.currentaffairs",
"package" : "com.careerlift.currentaffairs",
"category" : "Education",
"description" : "Exam Gateways Current Affairs 2020 app assists aspiring test takers with better and systematic preparation for various entrance and employment exams by providing plenty of mock tests and sample / solved tests.  The app is offered by Exam Gateway (offering Mock Test Series for various Competitive Exams).   Current Affairs 2020 app assists with measuring the Quantitative Ability (QA), Verbal Ability (VA) / Language Comprehension, Data Interpretation (DI), Logical Reasoning (LR), Current Affairs and General Knowledge (GK) skills of the aspirants along with providing over 10000 practice questions for exam preparations.  The app offers a plethora of mock tests for the most popular exams like -  1. SSC CGL & SSC  CHSL exams. 2. IBPS PO, IBPS Clerk, SBI Clerk, SBI PO, and other banking exams. 3. LIC & other insurance exams. 4. Government exams for defence and navy (NDA/NA); Railways and more 5. Law Entrance Exams like CLAT, AILET, SET / SLAT, MH  CET, BLAT and more 6. Management  UG (BBA & BMS) Entrance Exams like AIMA-UGAT, IPMAT, IPU  CET, NPAT and more 7. State-level exams like UPPSC, Bihar PSC, CG PSC (Chhattisgarh), MPPSC (Madhya Pradesh), JPSC (Jharkhand), RPSC (Rajasthan) and many more in both languages, English & Hindi  Our user-friendly Current Affairs 2020 app also provides instant test results and lets the test taker review all attempted questions so that they can improve their performance before appearing in the actual examinations.   Features for Current Affairs 2020 app 1. Current Affairs - It features in the Knowledge Zone and covers the National & International events to keep students on par. It covers the current affairs (CA) and static general knowledge (GK) for all the competitive exams. 2. College & University Info  This feature enables one to connect with various colleges and universities and make inquiries about admissions, infrastructure, facilities, etc through our user-friendly mobile platform. 3. Notifications - This feature will allow aspiring test takers to keep updated with the exam information and its structure. 4. Articles - This feature covers the Current Affairs and General knowledge articles, important from the students exam perspective. 5. Vocabulary - This feature allows a student to learn the most challenging words (in alphabetical order) with ease. The usage of the given word has been explained with utmost importance given to its meaning, synonyms, antonyms, usage in a sentence and other forms of the word.  6. Educational Discussion Forum - In an intuitive and open education forum like ours, one can ask doubts, difficult questions and their solutions, about courses, schools, colleges, admission requirements, study experiences, prep plans, etc. to other aspirants, teachers and subject matter experts. 7. Quizzes  Our Quizzes are assignments that have been well - designed to challenge student understanding and assess comprehension and retention of parts of the relevant course material.  8. Videos - Our curated video prep series offers exclusive insight into the exam sections with information on content, sample questions, and suggested study tips and tricks for better accuracy and speed. 9. EduNews  Get the latest Education India - News and Views on competitive exams, admission announcements, Colleges, B-Schools, Universities, and various Institutes. 10. Career Guidance  It is well-known that career guidance encompasses assisting individuals with career development. Our Career options and Ask Career questions tabs allow students to ask any career-related questions from our Experts and Counsellors.  With a question bank of over 10000 well-sought questions, our Current Affairs 2020 app is imperative to download from ones exam preparation and practice perspective. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_FINE_LOCATION', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.VIBRATE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.READ_SETTINGS', 'com.careerlift.currentaffairs.permission.C2D_MESSAGE', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}