{
"name" : "Toddler Learning Fruit Games: shapes and colors",
"url" : "https://play.google.com/store/apps/details?id=com.amayasoft.fruits.vegetables.baby.toddler.games",
"package" : "com.amayasoft.fruits.vegetables.baby.toddler.games",
"category" : "Educational",
"description" : "All games are designed to help develop kids memory, develop attention span, logic, and fine motor skills as they play with funny fruits and vegetables!   SHAPES - Sort objects by their shape to develop visual perception and eye-hand coordination.   COLORS - Classify fruits and vegetables by color and put them on the correct plate.   PAIRS - Find the matching pairs of fruits and vegetables in the fridge to develop logic and memory skills.  SIZES - Sort food by size and load them onto the boat.   PUZZLES - Complete the picture with the correct items to assemble fun graphic animations.  PARTS - Choose the correct parts for each fruit and vegetable.   Enjoy the fun and engaging graphics, cool music, and sounds while also learning essential skills!   This app is just perfect for curious kindergarten kids who love playing games and like to learn new things about the world around them!   KEY FEATURES:   Learning in a game form. Bright illustrations and interesting missions will attract the childs attention, helping to develop fine motor skills, memory, attention and perseverance.   Easy to control. A user-friendly interface will allow your baby to use the application without help. Purchases and settings are reliably protected from accidental clicks of a curious toddler!   Play offline and with no ads! The game works fine without the Internet! Play at any time and anywhere - on a long journey or in a long queue. And no intrusive advertising!  A few words about us: Our friendly team AmayaKids has been creating applications for kids for more than 10 years! We are consulted by the best childrens educators, create bright, user-friendly interfaces and develop the best applications for your children!  We love to make kids happy with entertaining games, and also like to read your letters! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}