{
"name" : "Dalam Waktu 24 Jam Belajar Bicara Bahasa Mandarin",
"url" : "https://play.google.com/store/apps/details?id=com.ventures.softwareapp.indonesianlearnmandarin",
"package" : "com.ventures.softwareapp.indonesianlearnmandarin",
"category" : "Education",
"description" : "Ini adalah aplikasi terbaru dan paling efektif untuk orang-orang Indonesia yang mau belajar bicara bahasa Mandarin dalam waktu 24 jam! Aplikasi ini menggunakan audiovisual teknologi untuk membantu mempercepat anda belajar bahasa Mandarin.  Anda mau melakukan bisnis dengan orang Cina? Expor/Impor ke Cina? Atau mungkin anda mau mendapatkan deal terbaik ketika berlibur di Cina? Mulailah belajar bicara bahasa yang sangat populer ini!  Terlalu sibuk untuk mendaftar di kursus bahasa Mandarin, atau mungkin terlalu mahal untuk anda? Kami punya solusinya! Dengan aplikasi ini, anda dapat belajar bahasa Mandarin ketika menyetir, ketika jogging di taman atau bahkan saat anda santai di ranjang. Tinggal pasang headphone dan mulailah belajar! Sangat mudah dan tidak repot!  Cocok untuk semua orang, dari pelajar, penjelajah dunia sampai orang-orang bisnis! Aplikasi ini dapat membantu anda untuk berbicara bahasa Mandarin dalam waktu 24 jam!  Di dalam aplikasi ini terdapat ribuan kata-kata di dalam kalimat-kalimat yang biasa digunakan dalam percakapan sehari-hari untuk membantu anda belajar bahasa Mandarin dengan mudah!   Terima kasih! This is the latest and most effective application for the Indonesian people who want to learn to speak Chinese in 24 hours! This application uses audiovisual technology to help accelerate your learning Mandarin.  You want to do business with China? Export / Import to China? Or maybe you want to get the best deal when on holiday in China? Start learning to speak the language which is very popular!  Too busy to enroll in Chinese language courses, or may be too expensive for you? We have a solution! With this application, you can learn Mandarin when driving, when jogging in the park or even when you are relaxing in bed. Just plug your headphones and start learning! It is easy and no hassle!  Suitable for everyone, from students, explorers the world to business people! This application can help you to speak Chinese in 24 hours!  Within this application there are thousands of words in sentences that are commonly used in everyday conversation to help you learn Mandarin with ease!  Thank you! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}