{
"name" : "Learn English Spellings Game For Kids, 100+ Words.",
"url" : "https://play.google.com/store/apps/details?id=com.preschoolkidsapps.learnspellings",
"package" : "com.preschoolkidsapps.learnspellings",
"category" : "Educational",
"description" : "Learn English Spellings Game For Kids, 100+ Words is an educational mobile game which helps kids to learn spellings in an easy and innovative way. Three categories of objects are included in this app, those are Numbers, Colors and some real life objects. It is suitable for the kids of preschool, kindergarten and toddlers.  Initially, a letter will be presented on the left hand side of the board along with a picture of the object which starts with the same letter in its spelling. After that, all letters of spelling will be presented randomly on the right hand side of the board. Once the letters and picture of learning object are placed on the board, a train will arrive with empty wagons and it contains the number of wagons equal to the number of letters in the spelling which needs to be learned.  The train arrives with empty wagons. Each wagon has an empty space to be filled with the right letters of the spelling that should be learned. some random letters from the spelling which are presented on the right hand side of the board will be moved on to the wagons. The remaining wagons will have to be filled with correct letters to complete the spelling. Kids must drag correct letter on to its respective wagon. If kids are not able to fill the blanks with the correct letter, kids can use the hint button to get the clue which is placed at the top left hand side corner.  Features:  Funny, innovative learning activities for toddlers, kids  100+ Objects to learn spellings.  Easy to navigate and understand.  Colorful graphics and pronunciation sounds of objects.  Hints for easy learning. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}