{
"name" : "Little Fire Station",
"url" : "https://play.google.com/store/apps/details?id=com.foxandsheep.firestation",
"package" : "com.foxandsheep.firestation",
"category" : "Education",
"description" : "Awarded BEST OF KIDS APPS 2017 by Google Play!  BE A FIREFIGHTER Help the little fire fighters to go on missions to extinguish a fire, save an animal or to experience many other adventures! But its not only about the missions - enjoy the daily routine of our little fire fighters: Explore the fire station and interact with the objects, animals and firefighters in each room.   DISCOVER & EXPLORE In Little Fire Station kids can discover a fire station  from a fire engine to the kitchen and to the bunk beds. Little Fire Station is a rich and fun hidden object game optimized for kids. The core of the game is centered around exploration and discovery. The different rooms in the fire station are full of animations and little secrets.   PERFECT FOR KIDS The controls are extremely simple: Tap to interact with an object, swipe to navigate into another scene - so even the younger ones can easily navigate through the App.  Highlights: - Gender neutral design - Simple controls optimized for kids age 3 - 5 - 4 unique rooms and plenty of items to search for - A fire engine with different rescue missions - Collectables and missions to guarantee hours of content and fun - Fun characters and hilarious animations - Original artwork and music - No internet or WiFI needed - Play wherever you want  DISCOVER, PLAY, LEARN Our aspiration is to introduce children to the digital world in a playful and gentle way and thus opening up a complete new world to them. With our apps, kids are able to step into different shoes, go on adventures and set their creativity free. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}