{
"name" : "My Little Car Wash",
"url" : "https://play.google.com/store/apps/details?id=com.mcpeppergames.mylittlecarwash",
"package" : "com.mcpeppergames.mylittlecarwash",
"category" : "Educational",
"description" : "My Little Car Wash is probably the best cars garage washing game for kids in the store. The game is using real physics based water particle effects and its the only car wash and spa app with your own washing liquid fun laboratory where you can mix your own washing liquids! The must have for all young fans of cars!  Parents please note: This game for kids and toddlers is part of the new high-quality apps and games family category in Google Play! Apps in this category are showing only high-quality content and are safe to play!  In this game for kids you become the boss of your own car wash garage - do you get all these cars, trucks and vehicles clean again? Earn a medal or even become the King of all Car Washes and earning your crown!  Experiment in your fun laboratory and mix your own super washing foam. Use the mixed liquids in a lot of different funny and cool car wash and bath actions. Clean a lot of different cars using different tools, a sponge and more. You can choose between a lot of amazing and awesome cars and vehicles, like for example a racing car, a fire truck, a police car, a school bus, a tractor, an adventure off-road truck, a monster truck and many many more cars and vehicles.  Contents: + Recommended for children over 2 years + A lot of different cars, trucks and vehicles + A lot of cool car washing actions  + Car wash with its own fun laboratory + High Quality graphics, sound and animation + Created for boys and girls age 2 to 9 + Its an educational learning game which trains coordination, logical thinking, fine motor skills and concentration + No third party advertising + Child Lock for safe playing + Liquid Fun Water Physics Effects + Universal App for all devices + Built-in photo function for funny self-portraits  Boys and girls aged 2 to 9 will love the game! Every kid likes to play with cars or wants to run a cars repair shop or a car wash cleaning garage. Now they can!  Please note: In this free to play game version there are some locked features (some car cleaning options and the laboratory) which can be unlocked by purchasing the full version from inside the game using only one in-app purchase. If you dont want to use In-App Purchasing in this kidsgame, please deactivate this option in your device settings!  Please note: You can easily unlock a purchased app on your other devices or when you have to reinstall the cars game like this: Go to the info booth with the character in the main version and in a locked version you will find a RESTORE button you can use to restore a once purchased game. Please make sure you are using the same account you did the purchase with and that you have an active good internet connection.  The game also includes some other funny features, like for example a photo portrait option, where children can take funny pictures of themselves and become an astronaut, a mechanic, a clown and more.  With the permission of your parents boys and girls also can send these pictures to your friends (This feature is only available behind a parental gate!). A variety of cool and different cars, trucks and vehicles and car cleaning functions ensures long-lasting gaming fun!  We wish you and your kids a lot of fun washing all the different cars and we are looking forward to your review!  For news about our other educational learning games for children, our games for kids and toddlers or apps for older kids and upcoming projects, or for support or feedback please visit us at: www.mcpeppergames.com  For more of our Google Play apps please also visit our developer site here on Google Play: https://play.google.com/store/apps/dev?id=5029755957860459217   Your My Little Car Wash Team ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'com.android.vending.CHECK_LICENSE', 'android.permission.CAMERA']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION']",
}