{
"name" : "Impara il Francese parlando",
"url" : "https://play.google.com/store/apps/details?id=com.fasoftltd.ITFR.FREE",
"package" : "com.fasoftltd.ITFR.FREE",
"category" : "Education",
"description" : "Vi presentiamo unapplicazione moderna che consente in modo efficace ed efficiente di parlare in lingua francese.  stata pensata sia per i principianti, sia per quelli che vogliono arricchire il proprio vocabolario. La nostra attenzione  stata rivolta in particolar modo alle abilit linguistiche  ovvero la capacit di condurre conversazioni senza alcun sforzo in francese. Linnovativo metodo di comunicazione che  stato utilizzato nellapplicazione permette di eliminare le barriere linguistiche nel parlare in lingua straniera e allo stesso tempo permette di esprimersi in situazioni quotidiane.  Lapplicazione generalmente  indirizzata a quelle persone, che vogliono imparare il francese in forma pratica. Tutte le parole, le frasi e i dialoghi sono state registrare da professionali lettori inglesi. La suddivisione in 127 temi e categorie assieme al sistema di ricerca veloce permette di ricercare in modo molto veloce la parola desiderata.  Lapplicazione  anche un ottimo strumento elettronico. Pu fare da traduttore vocale aiutandoti nei viaggi allestero. Grazie allapplicazione potrai capire gli stranieri nelle situazioni tipiche  al negozio, in banca, in hotel, allaeroporto.. Sarai in grado di compare il biglietto alla cassa, potrai ordinare qualcosa al ristorante, potrai chiedere indicazioni stradali oppure potrai darti appuntamento con qualcuno. Lapplicazione inoltre  unottima proposta per tutti quelli che si stanno preparando per degli esami orali in lingua francese, oppure per quelli che fanno dei viaggi allestero per turismo, ma anche per lavoro o per studio.  Caratteristiche principali: - Registrazioni con nativi francesi - 127 gruppi tematici e categorie - Conversazioni e dialoghi pratici - Dizionario francese-italiano, italiano-francese - Ti insegniamo la pronuncia corretta  - Possibilit di creare dialoghi e scene personali - Un sistema innovativo per memorizzare le frasi - Ricerca veloce di frasi e parole - Esempi duso delle parole - Corso di conversazione della lingua francese - Lettore di parole e frasi integrato   unapplicazione grazie alla quale in modo veloce e senza alcun sforzo comincerai a parlare in francese. Anche se non conoscevi finora neanche una parola. Non ci sono n esercizi, n tantomeno la noiosa grammatica. Nellapplicazione abbiamo applicato linnovativo metodo Easy Talk, grazie al quale parlerai in francese gi dopo pochi minuti. TE LO GARANTIAMO.    La versione gratuita contiene 800 frasi e parole, mentre nella versione completa hai accesso a 4000 parole, frasi e sentenze. We present a modern application that allows you to effectively and efficiently to speak in French. It was designed for both beginners and for those who want to enrich their vocabulary. Our attention has been paid in particular to the language skills - ie the ability to conduct conversations without any effort in French. The innovative method of communication that has been used in the application eliminates language barriers in speaking in a foreign language and at the same time allows to express themselves in everyday situations.  The application is generally directed to those people who want to learn French in practical form. All words, phrases and dialogues have been recorded by professional English readers. The division into 127 categories and themes along with the system of quick search allows you to search very quickly the word.  The application is also a great electronic instrument. Can be done by voice translator helping you when traveling abroad. Thanks to the application can understand foreigners in typical situations - to the store, bank, hotel, airport .. You will be able to appear the card at the checkout, you can order something at a restaurant, you can ask for directions or give you an appointment with someone. The application also has an excellent suggestion for all those who are preparing for oral exams in French, or for those who do travel abroad for tourism, but also for work or study.  Key Features: - Registrations with native French - 127 thematic groups and categories - Conversations and Dialogues Practical - French-Italian, Italian-French - Do you teach the correct pronunciation - Ability to create personal dialogues and scenes - An innovative system for storing phrases - Quick search of words and phrases - Examples of use of the words - Conversation course of the French language - Player of words and phrases integrated  It is an application through which quickly and without any effort begin to speak in French. Even if you did not know so far not a word. There are neither exercises nor the boring grammar. In the application we have applied an innovative method Easy Talk, thanks to which you will speak in French after a few minutes. I CAN GUARANTEE.   The free version contains 800 words and phrases, while in the full version you have access to 4000 words, phrases and sentences. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
}