{
"name" : "Psychic Spiritual Energy Reading - Astrology",
"url" : "https://play.google.com/store/apps/details?id=com.team.invilabs.spiritual.energy.reading",
"package" : "com.team.invilabs.spiritual.energy.reading",
"category" : "Education",
"description" : "Third Eye Spiritual energy is all about our aura and higher Chakras.   Spiritual energy comes from being clear in the Third Eye Chakra and having the Crown Chakra open & balanced.   It also gives us the energy to have new ideas and clear thoughts.   If our spiritual energy is high, it is easy to start listening to our intuition and beginning to manifest these ideas into reality.   If our aura is out of balance, this can also affect our spiritual energy. For example, if we have gone through an emotional time and keep these emotions stuffed down inside, this will effect the aura first. Our aura will start to change color and parts of it may become patchy, which then turn into holes. This in turn impacts our spiritual energy as we cannot hold our spiritual light within our aura and body any more. Once this light starts to seep out of us, this can manifest into health issues within the body.  Spiritual Energy Reading involves increasing awareness, releasing blocks and creating more flow through these energy centers. Also learn about the energy centers in the hands and feet. Discover the most effective tools for balancing & healing the energy centers.  Guided Meditation develops awareness of energy, supports releasing personal blocks, and helps you create a healthy flow in your system. Practice centering & grounding and give yourself a healing with this meditation for the 7 energy centers.  Features Include-  Spiritual Chakra Healing meditation will give you Mantras for the Spiritual Awakening Meditation Chakra Training will help you with your Chakra Balance System. Recite and Chant these Mantras for the Chakras with OM Meditation for Self Healing You can Calm your mind and heal yourself which is as great as heal your life.  Other methods include Crystals Healing Calm- Meditate Sleep Relax with the Mantras for the Spiritual Meditation You can try the Spiritual Personality Test Psychic Energy Oracle Deck and Vibration Energy Oracle Deck Unlock Your spiritual energy and Spiritual healing and Spiritual Awakening meditation  With the free spiritual reading Spiritual Adviser or spiritual guru will give you Spiritual Answers and Spiritual Awakening Guidance on spiritualism.   Other Benefits include Yoga with meditation music and reflexology how to meditate in shiatsu kundalini yoga techniques of vipassana clairvoyant guided meditation mindfulness meditation with biofeedback ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.android.alarm.permission.SET_ALARM', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}