{
"name" : "Candy's Cake Shop",
"url" : "https://play.google.com/store/apps/details?id=com.libii.CandyCakeShop",
"package" : "com.libii.CandyCakeShop",
"category" : "Educational",
"description" : "Sweet treats are always helpful to beat the blues. Come with Candy and bake some delicious desserts.  Nothing says yummy like the food made by yourself. Dont know what to bake? Candys Cake Shop has got you covered! From cream cake and macaroon to fruit tart and cake roll, here is a paradise for foodies and baking enthusiasts. Pick the ingredients and blend them until theyre evenly mixed. Next, pour the mixture into the mold and put it into the oven. And some sprinkles and decorations would make the dessert even better. Sounds easy, right? Roll up your sleeves and lets start baking!  Features: - 6 tasty pastries to delight your taste buds The pastries you made would make your mouth water and melt your heart. - Follow the Recipe to bake or design the dessert in your own way The recipe offers you inspiration to bake or you can spark creativity to make the pastry unique. - Upgrade the shop to make it one-of-a-kind Exchange your loving hearts for nice items to make the store better or beautify the window display with some stickers. - A beautiful poster creates buzz for the shop Design an awesome poster with the photo youve saved to attract more customers.  About Libii Game: With over 600 million downloads and growing, Libii is committed to creating innovative games for kids. Well keep working on establishing a good relationship with both parents and their children and bringing a healthy, happy atmosphere for them. Visit us: http://www.libii.com/ Like us: http://www.facebook.com/LibiiGame Contact us: Got any ideas? Suggestions? Need technical support? Please feel free to contact us 24/7 at WeCare@libii.com  Need You Know: This app is totally free to download and play, some basic items are also free to use, but some additional items need you to purchase and pay to unlock. Therefore, if you do not want to use these items, please turn off the in-app purchase in your settings. Thanks. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}