{
"name" : "Baby Panda's Math Adventure",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.math",
"package" : "com.sinyee.babybus.math",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Dear little heroes, Baby Pandas math world is destroyed by the devil king. Its time for you to show your talents! Beat the devil king and get the hammers to rebuild the island and save the math world!   Content:  Beat the devil king The devil king is coming to make trouble again! Dodge fires, rocks, and lightning to cross the energy bridge and collect flying energy balls. Then fly up to the sky and challenge the devil king. Pay attention not to be hit by his fireball attack.  Seize the right moment to attack and defeat the devil! Then go on to your next adventure!   Rebuild the islands Explore the puzzle world, observe the puzzle shape, put the puzzle in the right place, and rebuild the Candy Island!  Move rocks and blocks to pave the road for treasure hunting. Go through forests and oceans to get the colored jewel and rebuild the Monster Island!  Carefully observe and compare to find differences between the two pictures. Complete tasks, get the hammer, and construct the Dinosaur Island!   Decorate the Math Island Manage the farm, feed the hens and cows, collect eggs and milk, and get land to expand the Math Island!  Hatch dinosaur eggs, raise kinds of baby dinosaurs in Math Island!  Plant crops, and pick fruits and flowers. Collect math energy to get the decoration in the treasure box, then decorate Math Island as you wish!   The adventure to save the math world is ongoing! Little heroes, more islands are available for you to rebuild in Baby Pandas Math World. Come and join the adventure!   Features:  -Rebuild 6 islands: Math Island, Fairy Island, Dinosaur Island, Mechanical Island, Monster Island, and Candy island!  -1071 levels for you to challenge!  -Feed farm animals; collect farm products -Plant flowers; harvest fruits!  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}