{
"name" : "Doubtnut: NCERT Solutions, Free IIT JEE & NEET App",
"url" : "https://play.google.com/store/apps/details?id=com.doubtnutapp",
"package" : "com.doubtnutapp",
"category" : "Education",
"description" : "Doubtnut is No.1 Study App to find Instant Video Solutions to all your Math doubts, Physics doubts, Chemistry doubts, Biology doubts.. Get PDF and video solution of IIT-JEE Mains & Advanced previous year papers, NEET previous year papers, NCERT books for classes 6 to 12, CBSE, RD Sharma, RS Aggarwal, Cengage books for boards and competitive exams..  Why You Must Download Doubtnut App?   Get NCERT Solutions, CBSE , State boards Physics, Chemistry, Biology and Maths solutions.   Get Video Solution For All Your Questions With Just Clicking a Picture.   Win Exciting Prizes and Points Everyday.   Free and Super easy to Use. With No Ads Disturbing your learning.  Vidya Mandir Classes (VMC) Chapter-wise Detailed Lectures and Crash Course for JEE & NEET 2020/ 2021/2022  Class 9  -Class 9 Maths NCERT Solutions -Class 9 Science NCERT Solutions -Class 9 RD Sharma. NCERT Solutions -Class 9 Sample papers and Mock Tests  Class 10  -Class 10 Maths NCERT Solutions -Class 10 Science NCERT Solutions -Class 10 RD Sharma Solutions -Class 10 Lakhmir Singh Solutions -Class 10 Sample Papers and Mock Tests  Class 11  -Class 11 Maths NCERT Solutions -Class 11 Physics NCERT Solutions -Class 11 Chemistry NCERT Solutions -Class 11 Biology NCERT Solutions -Class 11 Previous year papers -Class 11 IIT Study Material  -Class 11 Sample Papers and Mock Tests  Class 12  -Class 12 Maths NCERT Solutions -Class 12 Physics NCERT Solutions -Class 12 Chemistry NCERT Solutions -Class 12 Biology NCERT Solutions -Class 12 Previous year papers -Class 12 IIT Study Material  -Class 12 Sample Papers and Mock Tests  BSEB Books Solution  -Class 10 BSEB Maths Solutions -Class 10 BSEB Science Solutions -Class 11 BSEB Maths Solutions -Class 11 BSEB Physics Solutions -Class 12 BSEB Maths Solutions -Class 12 BSEB Chemistry Solutions  UP Board Books Solution  -Class 10 UP Board Maths Solutions -Class 10 UP Board Science Solutions -Class 11 UP Board Maths Solutions -Class 11 UP Board Physics Solutions -Class 12 UP Board Maths Solutions -Class 12 UP Board Chemistry Solutions  Competitive exams - JEE Mains and Advanced, Government exams - SSC CGL Railways, Banks  Free IIT JEE Mains previous year question papers with solutions, solved papers with explanations in Hindi - JEE Mains 2013, JEE Mains 2014, JEE Mains 2015, JEE Mains 2016, JEE Mains 2017, JEE Mains 2018, JEE Mains 2019  Free IIT JEE Advanced previous year question papers with solutions, solved papers with explanations in Hindi  Topic wise objective questions for IIT-JEE, Important formulae & video shortcut tricks  Free Question Bank for IIT-JEE Mains  Free JEE Mains Mock Tests for practice  Free video and pdf solutions for following books - RD Sharma, RS Aggarwal, Cengage, Narayana, Bansal, FITJEE, VMC.  Previous years solved papers for AIEEE 2002-2010, AIEEE 2011, AIEEE 2012  JEE quiz tests, revision notes and videos in Hindi  IIT foundation books for class 8, class 9, class 10, class 11, class 12 in Hindi  Highlights: Free IIT JEE exam preparation, IIT JEE Main preparation, IIT JEE Advanced preparation, IIT JEE 2019, IIT JEE Guide 2019, solutions IIT previous year papers, Mock Papers. Online Maths PDF & video solutions, Maths NCERT solutions, Maths CBSE solutions for classes 6-12, previous year papers solutions, mock papers,and tricks, quizzes all for free.  Whats more on the app?   6 lakh+ free instant video solutions for math doubts, concepts & practice questions  Free mock tests to practice and prepare for competitive exams JEE Mains on app  Important date sheets, announcements, last-minute tips by expert teachers  Exciting contests on the app every day to make maths study interesting  Go hurry! Download the app now. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.truecaller.permission.sdk.internal.read_account_state', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'com.doubtnutapp.permission.MIPUSH_RECEIVE', 'android.permission.GET_TASKS', 'android.permission.READ_CALL_LOG', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.truecaller.permission.sdk.internal.read_account_state', 'com.doubtnutapp.permission.MIPUSH_RECEIVE', 'android.permission.GET_ACCOUNTS', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.READ_CALL_LOG', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE']",
}