{
"name" : "CAPM Certification Exam",
"url" : "https://play.google.com/store/apps/details?id=com.acesoft.ITCertifications.PMI.CAPM",
"package" : "com.acesoft.ITCertifications.PMI.CAPM",
"category" : "Education",
"description" : "Free practice tests for CAPM: Certified Associate in Project Management Exam. 826 questions with answers.  [App Features] - Includes full screen mode, swipe control, and slide navigation bar - Adjust font & image size feature - Save data automatically, so you can continue your unfinished exam anytime - Create unlimited practice/exam sessions as you want - With Mark and Review features. Easily go back to the questions you want to review again.  - Evaluate your answer and get the score/result in seconds  This app includes around 826 practice questions with answers, and also includes a powerful exam engine.   There are Practice and Exam two modes:  Practice Mode: - You can practice and review all questions without time limits - You can show the answers and explanations anytime  Exam Mode: - Same questions number, passing score, and time length as the real exam - Random selecting questions, so you will get different questions every time  [CAPM Overview] The CAPM certification offers recognition to practitioners who are interested in or are just starting a career in project management, as well as project team members who wish to demonstrate their project management knowledge. This certification denotes that the individual possesses the knowledge in the principles and terminology of A Guide to the Project Management Body of Knowledge (PMBOK Guide), which outlines generally recognized good practices in project management.  Individuals who do not have project experience but are interested in project management can benefit from this certification because it demonstrates their professional knowledge. Individuals who contribute specialized skills to a project team can benefit from this certification as well by allowing them to align their work with that of project managers. This knowledge can be applied to on-the-job experiences that help develop growing levels of competence in the practice of project management. Individuals who carry the CAPM designation after their name enjoy a high level of credibility from Project Management Professional (PMP) certification holders, project managers, employers and peers.   Domains (%): 1. Introduction to Project Management (6%) 2. Project Environment (6%) 3. Role of the Project Manager (7%) 4. Project Integration Management (9%) 5. Project Scope Management (9%) 6. Project Schedule Management (9%) 7. Project Cost Management (8%) 8. Project Quality Management (7%) 9. Project Resource Management (8%) 10. Project Communication Management (10%) 11. Project Risk Management (8%) 12. Project Procurement Management (4%) 13. Project Stakeholder Management (9%)  [Exam Information] Number of exam questions: No. of Scored Questions: 135 No. of Pretest (Unscored) Questiona: 15 Total Examination Questions: 150 Length of exam: 180 Minutes Passing score: 610~700/1000 (61%~70%) ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}