{
"name" : "English words - learn 20.000 words with RocketEng",
"url" : "https://play.google.com/store/apps/details?id=com.edpanda.words",
"package" : "com.edpanda.words",
"category" : "Education",
"description" : "RocketEng is a vocabulary builder application suitable for beginners and professionals. Lets learn English with us!   RocketEng features: More than 20.000 English words, idioms and collocations with translations and multiple examples Words are organized into lessons by subjects and difficulty level with an ability to view them in flashcards mode Word frequency list - will help beginners to master most common words and for competent language users it is a valuable source of rarely used English words. Just choose a difficulty level which suits you and learn what you need.  Learn English language effectively with:  Multiple exercises (flashcards, word builder, listening, multiple choice questions, spelling, pronunciation)  Fine-tuned settings to meet your specific needs  Proven spaced repetition system based on Ebbinghaus forgetting curve  An ability to hide translations in browse mode Works offline, with RocketEng you can study English language wherever you like! Comprehensive statistics to track your progress High-quality audio recordings with clear pronunciation of English words  Create your own lessons with an ability to import content from a file Night theme No annoying advertisements!   Learning English has never been easier! To achieve maximum results, we recommend to use the application several times a day with an interval of several hours. Thereby, by learning 5 words a day, in a month you will memorize 150 new words.  Master your English with RocketEng!  If you have any suggestions or complaints dont hesitate to contact us at edpandaunlimited@gmail.com. We consider all requests we receive and would be happy to help. If you like RocketEng, please support us with a 5-star review on Google Play, your support helps us to keeping going! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.QUICKBOOT_POWERON', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.QUICKBOOT_POWERON', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}