{
"name" : "School eAdmin",
"url" : "https://play.google.com/store/apps/details?id=com.iapps.schooleadmin",
"package" : "com.iapps.schooleadmin",
"category" : "Education",
"description" : "School eDiary is an advanced, secure and easy to use mobile application which empowers schools to better the communication between teachers, students and parents paperless, effective and secure and focus for student success. Relevant features like Notice Board, Homework, Class Diary, Profile, Attendance, Fee Details, Academic Details, Timetable, Bus tracking, etc. has been packed in the application in an easy to use interface. Easy customization and integration with our SchoolOnWeb School Management ERP Application for management of your entire campus. It can also be integrated with RFID/Bio-metric Attendance Management System and Online Payment as per your requirement.  FOR PARENTS/STUDENT: * Stay connected and informed about your childs notices & circulars. * Remain updated about your childs class work and home work information. * Contact securely with your childs teachers. * Parents can peek through the paid fees records and pay fees online hassle free using the app. * Parents can see marks statement of their child thereby keeping a track of their academic performance. * Student safety is greatly enhanced with real-time tracking of school bus. * Alerts and notifications regarding notices, circulars, events etc. * Attendance and holiday calendar. * Pin important notices/homework/class diary  FOR TEACHERS: * Teachers can update class work and home work from their mobile. * Teachers can take attendance from mobile thereby saving time and resources. * Teachers can save time by updating students progress report from their mobile. * Remain updated with circulars, holiday and attendance records. * Pin important notices/homework/class diary.  FOR SCHOOLS: * Make your campus paperless thereby saving the environment * Improve parent and teacher communication and save teachers time with easy to use and intuitive features. * Share school information, notices, events, circulars and other relevant information with parents in real time. * Keep parents informed about the homework and class diary of their student. * Save time and money by reducing repetitive tasks that teachers have to perform. * Improve staff productivity. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.alarm.permission.SET_ALARM', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}