{
"name" : "Hindi Varnmala Kids",
"url" : "https://play.google.com/store/apps/details?id=com.mbd.hindi_varnmala",
"package" : "com.mbd.hindi_varnmala",
"category" : "Education",
"description" : "Hindi varnmala kids ( ) app is an educational app for kids to learn Hindi consonants (Vyanjan). This Hindi kids app makes learning Hindi, a simple and joyous experience for both, young learners and first time learners. Learning the Hindi alphabets becomes so easy and interesting with the help of MBDs Hindi varnmala kids app, it helps kids recognize, read and write alphabets of Hindi varnmala.   This Hindi kids app provides the best way to teach your kids hindi alphabets. Hindi varnmala kids is the perfect app to learn Hindi for kids in an interactive way. Kids will surely enjoy the learning and writing of Hindi consonants with this creative kids app. Like English language, Hindi also have vowels and consonants called Swar and Vyanjan. Our hindi varnmala app and hindi swarmala app are beneficial to toddlers and LKG/UKG kids. These educational apps for kids are a combination of attractive and colorful animation with fascinating sound and graphics makes primary learning easy and interesting with kids alphabets game.  Modes of Hindi Varnmala App  - Learning mode to familiarize kids with different Hindi consonants. - Workbook to trace every Hindi consonant (Vyanjan) and allow kids to learn alphabets with maps, while selecting their favorite color brush for painting. - Game mode contains a quiz in which an image is shown along with various options, it make sure that kids learn alphabets while playing with this Hindi app game. - More apps contain all the links of other learning apps for the children. Check other apps as well.  Features:  - Kids practice writing Hindi consonants through the dotted lines - Hindi alphabet tracing - App contain voice and an example image for each Hindi alphabet  - Take the test to see how much kids remember - Games for fun learning - Easy to use - Previous and next buttons for easy navigation - Other games section for writing alphabets ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}