{
"name" : "Biochemistry Lippincott's Q&A",
"url" : "https://play.google.com/store/apps/details?id=com.gwhizmobile.lippincottbiochemistry",
"package" : "com.gwhizmobile.lippincottbiochemistry",
"category" : "Education",
"description" : "Busy? Tired? Facing a mountain of material to master? Take control of your biochemistry study schedule with this easy to use app based on the highly respected textbook, Lippincotts Illustrated Q&A Review of Biochemistry. Combining highly relevant content with unmatched portability, this app lets you learn at your own pace, wherever life takes you.   Written in the clinical vignette-style used in the USMLE and medical boards, the questions assess the users ability to integrate basic and clinical science in order to solve problems. Heavily illustrated with photos or pathway diagrams, this app provides a compelling, comprehensive review of major concepts in biochemistry. Free initial download presents 25 questions and detailed explanations across 21 key subject areas with more than 400 questions available through in-app purchase.    Biochemical Compounds   Protein Structure and Function   DNA Structure   RNA Synthesis   Protein Synthesis   Regulation of Gene Expression   Molecular Medicine and Techniques   Energy Metabolism Overview   Hormones and Signaling Mechanisms   Glycolysis and Gluconeogenesis   TCA Cycle and Oxidative Phosphorylation   Glycogen Metabolism   Fatty Acid Metabolism   HMP Shunt and Oxygen Radicals   Amino Acid Metabolism and the Urea Cycle   Phospholipid Metabolism   Whole-body Lipid Metabolism   Purine/Pyrimidine Metabolism   Diabetes and Metabolic Syndrome   Nutrition and Vitamins   Human Genetics and Cancer    With this app, personalizing your study plan is simple. Flag problematic questions as you go, design customized quizzes, and assess your progress using the apps detailed analytics including quiz history, strength by category, and weekly progress. By offering a rigorous review of key concepts and facts, Lippincotts Illustrated Q&A Review of Biochemistry app gives users the knowledge they need to master the USMLE and medical boards and begin rewarding professional careers.   Have a question or would like to share your feedback? Please send us an email at: wolterskluwer@gwhizmobile.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}