{
"name" : "upGrad: Raho Ambitious",
"url" : "https://play.google.com/store/apps/details?id=com.cohortplus.clientTest",
"package" : "com.cohortplus.clientTest",
"category" : "Education",
"description" : "Are you looking to get into Data Science, Machine Learning, Big Data or Product Management? Do you want to learn, interact with professionals, master Kaggle competitions, land on a high-paying job?   In a nutshell, this upGrad app lets you connect and engage with data science, machine learning, big data and product management professionals & students to enhance your knowledge, network and opportunities. You can also apply for Data Science and Machine Learning job openings.   Lets learn more about the features & functionalities of the app:  * Join highly engaging & spam free Product Management / Data Science and Machine Learning groups * Learn how to master Kaggle competitions * Interact with like-minded Product Managers and (or) Data Scientists (or) Machine Learning engineers with similar professional interests * Apply to curated jobs and get to know the status of your application  upGrad is a professional networking platform driven by the concept of groups. There are groups on either Product Management or Data Science & Machine Learning that a user could join. These groups serve the following purpose-   A user can exchange relevant information with other group members  Share, view and like relevant posts in the Product Management/Data Science & Machine Learning groups.  Get clarifications and doubts solved from fellow Product Managers/Data Scientists/Machine Learning Engineers  Get the latest news updates in the Product Management/Data Science & Machine Learning domain  upGrad enables the most effective way to network amongst Data Science/Machine Learning enthusiasts or Product Managers via communities/groups. It ensures that like-minded people can come together and can exchange information that is relevant and spam free. This is done by -   Creating Data Science/Machine Learning or Product Management groups that are skill-based and open in all cases  Enabling users to easily create and share posts in the Data Science/Machine Learning and Product Management communities.  upGrad has some unique features tailored to the groups and customised to Product Management and Data Science/Machine Learning communities that make the app engaging such as -   upGrad enables a user to bookmark posts to read them later in Product Management and Data Science/Machine Learning communities  With upGrad, a user can view the professional profile of other users so that they have the right context while participating in any discussion in Data Science/Machine Learning and Product Management communities  The enhanced profile feature also has the following benefits   You can update your Product Management/Data Science or Machine Learning skills and profile  You can also access curated jobs and apply from the app  Access various data sets for Machine Learning and Data Science  Learn from the power & knowledge of other Data Science/Machine Learning professionals through the facility of public communities.  Public Communities on upGrad are based on Product Management, Data Science and Machine Learning practice and have the following advantages -   upGrad enables the formation of private and public Product Management/Data Science and Machine Learning groups  Public Groups in Product Management and Data Science/Machine Learning are free & any user can join it and contribute to the rich conversations that take place daily  With the jobs feature, apply for handpicked jobs in 2 clicks and get to know the status  It is the best app for professional communities in Data Science/Machine Learning & Product Management  Download upGrad, explore the rich conversations, apply to the best jobs and take control of your career. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.cohortplus.client.permission.C2D_MESSAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.NETWORK', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.VIBRATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.SEND_SMS']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.cohortplus.client.permission.C2D_MESSAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.NETWORK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SEND_SMS']",
}