{
"name" : "Pushkin State Museum guide",
"url" : "https://play.google.com/store/apps/details?id=com.inforotor.saas.galleries.pushkinmuseum",
"package" : "com.inforotor.saas.galleries.pushkinmuseum",
"category" : "Education",
"description" : "We`re offering a guide to the Pushkin State Museum of Fine Arts! The Pushkin guide will be an indispensable companion for anyone planning to visit the museum. Want to know more about an artwork you`re looking at? Just open the app and point the camera at the canvas, and within a few seconds you`ll get information about the artist, how the artwork was created and a description of it. Are you tired of following a guide all around the museum? Now you`ll always have a free audio guide close by. Study the artworks you like! You don`t have to go to the museum to experience the beauty of art. Now you can view most of the collection in the Pushkin Museum without leaving home. The best artworks of great artists are on your smartphone! Use the Pushkin guide to: - keep up with museum events on the news feed - get full information about the museum, from its location on the map to reviews - view high-quality images of the artworks - view pages on artworks with descriptions and notes - search for interesting artworks by filters, from title and artist to size, materials and style of art - read the biographies of the most outstanding artists and masters whose works are displayed at the museum - buy artworks offered for sale - read announcements and details of past, present and future exhibitions - comment on artworks, art news and exhibitions and share them on social media - get early notifications of museum events. Study the artworks, make plans to buy artworks and visit the museum, and share your interests with friends at any convenient time! We`re also developing apps for the following galleries and museums: Fine Art, Borey Art Center, Vereshchagin Art Museum and Dukley European Art Community. If you have any questions, please contact us at inforotor.corp@gmail.com. We look forward to hearing your suggestions and comments about the app! ",
"desc_perms" : "['android.permission.WRITE_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.CHANGE_CONFIGURATION', 'android.permission.READ_PHONE_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CHANGE_CONFIGURATION', 'android.permission.READ_PHONE_STATE']",
}