{
"name" : "Arduino Tutorials - Examples",
"url" : "https://play.google.com/store/apps/details?id=com.bluino.arduinotutorialsexamples",
"package" : "com.bluino.arduinotutorialsexamples",
"category" : "Education",
"description" : "Arduino Tutorials - Examples is an Arduino tutorial with 64 examples. In this app contains ads and potentially in-app purchases, you can access content online for free at https://www.arduino.cc/en/Tutorial/BuiltInExamples.  You can read description & learn schematic on each example, and also practical directly by uploading code (.hex) to Arduino Uno board over USB/Bluetooth to see what happen. For the example need debugging, you can use Serial Monitor features.   Here tutorials how to make Arduino can uploaded sketch from Android to Arduino Hardware over bluetooth: https://www.instructables.com/id/Program-Your-Arduino-With-an-Android-Device-Over-B/  Features:  No Ads (In-App Purchase)  Search tools (In-App Purchase)  All content offline available  Change the Themes (Light, Dark, Black)  Change the code style theme (Light, Dark)  Change the font size  Syntax Highlight for Arduino language  Serial Monitor for debugging needed  Upload examples sketch to Arduino Uno over wireless bluetooth  Arduino Tutorials, with over 64 Examples  Contains Following Examples : 1. Bare Minimum 2. Blink 3. Digital Read Serial 4. Fade 5. Analog Read Serial 6. Read Analog Voltage 7. Blink Without Delay 8. Button 9. Debounce 10. Digital Input Pull-up 11. State Change Detection 12. Tone Keyboard 13. Tone Melody 14. Tone Multiple 15. Tone Pitch Follower 16. Analog In Out Serial 17. Analog Input 18. Analog Write Mega 19. Calibration 20. Fading 21. Smoothing 22. ASCIITable 23. Dimmer 24. Graph 25. Midi 26. Multi Serial Mega 27. Physical Pixel 28. Read ASCII String 29. Serial Call Response 30. Serial Call Response ASCII 31. Serial Event 32. Virtual Color Mixer 33. Arrays 34. For Loop Iteration 35. If Statement Conditional 36. Switch Case 37. Switch Case 2 38. While Statement Conditional 39. ADXL3xx 40. Knock 41. Memsic2125 42. Ping 43. Bar Graph 44. Roy Column Scanning 45. Character Analysis 46. String Addition Operator 47. String Append Operator 48. String Case Changes 49. String Characters 50. String Comparison Operators 51. String Constructors 52. String Index Of 53. String Length & String Length Trim 54. String Replace 55. String Start With Ends With 56. String Substring 57. String To Int 58. Keyboard Logout 59. Keyboard Message 60. Keyboard Reprogram 61. Keyboard Serial 62. Keyboard Mouse Control 63. Button Mouse Control 64. Joystick Mouse Control ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}