{
"name" : "Ispeak: English Speaking Trainer",
"url" : "https://play.google.com/store/apps/details?id=com.cherrypiesoft.ispeak",
"package" : "com.cherrypiesoft.ispeak",
"category" : "Education",
"description" : "If youve already been learning English for a while and youve accumulated some knowledge of grammar, words, and expressions, iSpeak is a great way for you to practice using all of these skills  through speaking!  Ispeak app targets users needing to transform their English from  passive form (ex: I understand what I read.) to an active form (ex: I know how to express my idea.). Its like a sandbox for practicing and polishing what you already know!  What are the pros of Ispeak?   Ispeak simulates one-on-one practice with a native speaker;   It trains you to talk about things that you would talk about in the real world, whether its small talk in a supermarket or a get-together with friends;   No more boring schoolbook topics like environment, food, and global warming. The opportunities are endless  you name it! We have more interesting things to talk about.   Each day you get to experience something new. Why not use the following as topics of conversation? For example: - How was your morning commute? - What is the news of the day? - What made you happy today? - Who did you meet today? - What is the most important thing for you to do tomorrow?   Depending on the day, youll probably give different answers to these questions. Because of this, all the answers will be relevant to you and your life  uniquely and personally yours. No one will ever have your story of the day, your feelings, your happy moments and most importantly, your words.  Like any other training, speaking training is based on lots of repetition. The more you use a certain grammar construction or integrate a word in your vocabulary, youre better able to memorize it. Additionally, its easier, and not to mention more natural, for you to slip it into a conversation.  The main goal of speaking practice is the ability to connect with real people. Because after all, a language is a social thing, first and foremost. Its not an art to be mastered but instead, a useful tool to get results.  Start speaking English today! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}