{
"name" : "English Grammar Offline Free",
"url" : "https://play.google.com/store/apps/details?id=com.omarecalde.englishgrammar",
"package" : "com.omarecalde.englishgrammar",
"category" : "Education",
"description" : "Learn English Grammar has never been easier and simpler with this free learning app. No matter you are a beginner English learner or an advanced learner getting prepared for some tough English tests as well as competitive exams and curriculum exams, weve got you covered. This offline English learning app covers every aspect of English grammar, from the noun, adjective, and adverbs to gerund, tenses, and auxiliary verbs. You just need to follow the lessons one by one, learn the grammar rules, keep practicing and exercising the lessons to make sure youve mastered the entire English grammar. The good news is that this free English grammar app can be used in offline mode and you dont need to be connected to the internet to get the most out of available grammar lessons and exercises.  Learn English Grammar comes with a clean and neat design and the interface is so user-friendly and the English lessons are so easy to follow, that youll get the whole idea after browsing through different lessons and subjects. If you think you are an advanced English learner, you may easily skip the easier lessons and focus on the more difficult grammar challenges.  Practice & Learn English Grammar Offline Main Features at a Glance:  Clean and neat design with fresh and intuitive interface  Useful for both Beginner and Advanced English learners  Wide range of Grammar lessons: Nouns, Tenses, Adjectives, Adverbs, Modal Auxiliaries, Gerund, Conjunctions & Fillers, Articles and more  Offline mode to learn and practice with no internet connection  Constantly updating database   Easy to follow grammar lessons  Free with no in-app purchase items So, download this Learn English Grammar app for free, improve your grammar skills, keep practicing, and let us know about any bugs, questions, feature requests or any other suggestions on fors27.developers@gmail.com.  Thank you ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION']",
}