{
"name" : "Ginoskos: Learn Biblical Languages",
"url" : "https://play.google.com/store/apps/details?id=com.ginoskos.biblicallanguages",
"package" : "com.ginoskos.biblicallanguages",
"category" : "Education",
"description" : "Learn biblical Greek and Hebrew with Ginoskos learning application.  Main functions and content of the application are free. However, in order to support continuity and future development, we offer premium features (bookmarks, statistics, and filtered training). Thank you for your support.  Ginoskos offers courses on Greek and Hebrew grammar. These courses will lead you through essential parts of Greek or Hebrew grammar. Every grammatical topic can be trained with exercises at the end of a particular lesson.  Ginoskos provides various kinds of exercises. You can train both vocabulary and grammar. When you start doing some exercise Ginoskos will track your learning progress and make sure that you will gradually review already learned items. Individual exercises are prepared to help you learn basic vocabulary for both Greek (300 words) and Hebrew (700 words). This vocabulary contains words you will encounter most of the time in the text.  Learning features:  Grammar lessons (learn what the grammar is about)  Learning (learn new words)  Reviewing (scheduled and gradual reviews to refresh words in your memory)  Speed run (go through learned words under pressure of time)  Custom training (adjust training specifics just as you want: mode, passage, part of speech, occurrences, etc.)  Ginoskos also provides basic tools for biblical languages like dictionary and concordance.  The application requires an Internet connection to work.  Visit our facebook page: https://www.facebook.com/ginoskos   The fear of the Lordthat is wisdom, and to shun evil is understanding. (Job 28:28) ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}