{
"name" : "Baby Panda Home Safety",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.homesafe.global",
"package" : "com.sinyee.babybus.homesafe.global",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Home is a special place. Its a place to explore, to have adventures, and also the most common place for young children to get injured. We never know when an injury will happen. But most injuries are predictable and preventable. Worried that your baby will touch an electric socket? Afraid that your baby will open the door for strangers? Baby Panda Home Safety is here to solve your worries!  Baby Panda Home Safety is an interactive toddler game allows young children to learn and play with much fun at the same time. We have included plenty of safety learning activities where toddlers and pre-k kids can learn lots of home safety knowledge in a fun and memorable way. Strangers knocking at the door, socket safety, problems with eating food, tidy bathrooms, broken stairs...All these potential safety problems and reaction tips are all in one app! Download Baby Panda Home Safety and start to learn home safety tips!  Features:  9 major scenes along with fun of baby panda care!   Role-playing and safety knowledge make learning easy and happy!  Voice guidance and easy-to-do controls allow safety learning to be simple and fast!  Childrens safety songs and entertaining animations strengthen safety knowledge!  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}