{
"name" : "BurlingtonEnglish",
"url" : "https://play.google.com/store/apps/details?id=com.burlingtonenglish.burlingtonenglish",
"package" : "com.burlingtonenglish.burlingtonenglish",
"category" : "Education",
"description" : "What is BurlingtonEnglish?  BurlingtonEnglish is a unique blended English program for adults. It offers comprehensive General English Courses as well as a wide range of Career Courses, and provides a complete language-learning solution. Students get any time-anywhere access to state-of-the-art online interactive courses. Burlingtons cutting-edge speech technology, the SpeechTrainer, provides individualized feedback and instruction in pronunciation.   With BurlingtonEnglish, students effectively improve their pronunciation, vocabulary and overall fluency, giving them the confidence to communicate successfully in any situation.  Special Features:  - SpeechTrainer Individualized Pronunciation Feedback and Instruction  This patented speech processing technology helps learners perfect their pronunciation and listening skills. The SpeechTrainer analyzes students spoken English, adapts to a wide variety of accents to discern specific difficulties, and corrects mispronunciations through individualized training. This will help improve students pronunciation, comprehensibility, and confidence to successfully communicate in English.   - Mobile Vocabulary Practice Vocabulary Practice Any Time, Anywhere!  Mobile Vocabulary Practice allows students to get additional vocabulary practice on the go. Students can access wordlists for their courses to reinforce their language learning whenever and wherever they are.  - Using Your Computer Through a series of short animated videos, students develop basic digital literacy skills such as maneuvering the mouse and using the keyboard, as well as gain a basic understanding of a computer. It is designed for learners with limited English proficiency and limited-to-no digital literacy, using easy-to-follow visual demonstrations.   - Personalized, Data-Driven Learning! Real-time feedback and reporting to track, monitor and measure progress encourage students and motivate them to learn.   And many more unique and exciting features!!!  This results-driven program, with 24/7 online access, is engaging for English language learners, and helps them to become more productive and successful members of the workforce and their communities. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}