{
"name" : "Codeplayon ( 5G,IOT, Lte 4G, Android , Php)",
"url" : "https://play.google.com/store/apps/details?id=com.codeplayon.codeplayon",
"package" : "com.codeplayon.codeplayon",
"category" : "Education",
"description" : "t is an technology tutorial App provides insight of 5G, 4G ,Radio Testing and Internet of Thing. You can also visit www.codeplayon.com .  This application allows users to learn IOT and all the topics related to it in a step by step hierarchy manner.  Efforts have been made to make the application very user friendly and intuitive with a great user interface that makes it easy for you to learn through this app  5G will be significantly faster than 4G, allowing for higher productivity across all capable devices with a theoretical download speed of 10,000 Mbps. Plus, with greater bandwidth comes faster download speeds and the ability to run more complex mobile internet apps.  However, 5G will cost more to implement and while the newest mobile phones will probably have it integrated, other handsets could be deemed out of date.  A reliable, wireless internet connection can depend on the number of devices connected to one channel. With the addition of 5G to the wireless spectrum, this could put us at risk of overcrowding the frequency range.  This RF Tools app consolidates commonly used calculators and converters which assist Cable RF designer, RF technician, Test engineer, field trouble shooter, university student, professor and other members of cable and RF community in the execution of a variety of design and analysis activities. The app is composed of three parts: RF calculators, unit converters and handbook.  The RF calculators include Cable channel power, Cable tilt, impedance matching, RF attenuation, oscillation, micro-strip impedance, and cascaded noise figure analysis RF design calculators.   The unit converter includes common RF power unit, length unit and weight unit conversion tools.   *** App features ***  * 5G Tutorial  * RF Design and testing Tutorial  * 4G Lte/Avd Lte Tutorial  * Iot Tutorial  * Android  * Php * all type of tutorial with you tube video   Web site :- www.codeplayon.com . Facebook :- https://www.facebook.com/codeplayon.co/ ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}