{
"name" : "Babysitter - Amazing Baby Caring Game For Kids",
"url" : "https://play.google.com/store/apps/details?id=com.Babies.Babysitter.dodo",
"package" : "com.Babies.Babysitter.dodo",
"category" : "Educational",
"description" : "********* Babysitter - Amazing Baby Caring Game *********  - Dress, Feed & Bathe your Baby - Have a Tea Party & Put your Baby to Bed! - Play Mommy & Care for Adorable Babies, Hundreds of Outfits & Loads of Fun! - Kids will Learn Responsibility - Dont Let the Babies Cry!  Start this crazy babysitting adventures with three beautiful children, that you can choose from, in this baby doll game!  Adorable babies are not newborns anymore, their moms and dads put them into day care to you. Baby kids are playing in the interactive playroom and waiting for your attention. Delight those cute children with diverse care activities in 7 lovely scenes, like a funny bathing, foamy teeth-brushing, changing the nappy, trendy dressing, tasty food, beauty sleep and joyful play. Babies want you at the same time, so satisfy their wishes step by step! Meet Bella, Tiara and Sweetie, 3 adorable babies who cant wait to be dressed, fed, played with, bathed, read a bedtime story and put to sleep. This is the most fantastic mommys helper game ever!   Its time for a bath! Pamper your baby with indulgent bathing. Before bath time, choose a few toys to make the baby jump for joy. Then wash the baby with some soap and shampoo and wipe him softly with a towel. Lets have fun popping soap bubbles.  Dress Up Time! First, its time to dress up your baby in style. Choose from dozens of hairstyles, outfits, onesies, dresses, jeans, silly pacifiers, accessories and toys! Now shes  Yummy! Babies need a delicious meal several times a day. Prepare 3 different types of food, powdered milk, cereals with yoghurt and berries, or slice some fresh fruit that is full of vitamins. Dont forget to use a napkin.  Time for Bed! Your peanut is dozy and tired ! And they are very demanding when they are cranky. But dont worry! Be the best baby nanny! Put your little one in the crib and make sure that the child is not alone in the cot! This kindergarten game for girls will make you learn everything and not to forget to put a pacifier in your childs mouth! This babysitter madness game gives you a collection of all sort of stuffed animals, soft toys, teddies and dolls! Play music  It is scientifically proven that playing music to children will alter their brain! In the baby learning game we have to pay attention and to keep our little ones safe and sound.Nightie night  Find toys in a nursery! Toys are everywhere. Help the baby with searching hidden toys. Keep your eyes peeled and find what the baby needs.  * games features :  - Touch the spoon and scoop the formula to make the babys bottle - The bottle shakes until its mixed and ready to be used - Feed the baby her cereal, vegetables & fruit and make her smile or cry - Simple gameplay - Be a babysitter for baby triplets - Multiple activities to accomplish - Free for playing - Beautiful clothing items to use and accessories - Having fun in different spaces - Build a sand castle and design the outside look - Prepare a variety of meals for each baby  * Download Babysitter - Amazing Baby Caring Game to become the best baby feeding and diaper tracker in this baby caring games for girls! ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}