{
"name" : "Animal Farm for Kids. Toddler games.",
"url" : "https://play.google.com/store/apps/details?id=com.gokids.farm",
"package" : "com.gokids.farm",
"category" : "Educational",
"description" : "Educational games for kindergarten are the most popular way to study for children nowadays. Also, our kids games will help toddlers in their preschool education.   Your little babies adore animals, they always curious about them? Learning domestic animals on the farm, animal sounds, caring for them this is what our educational game for babies about. In these educational games for toddlers, kids, preschoolers - one of the best free farm games for smart kindergarten little ones under 5 - you meet your favorite animals, learn where they live, how they entertain, what food is the most delicious for animals. Parents, nannies, elementary class teachers can find it useful for primary kids education.  Start the free toddler games Animal Farm for Kids that is important for intellectual development for 3-5 years, where girls and boys meet a dog, a horse, a cow, piglets, even a whole chicken family. The free animal games like this one train the order of priority, logic, fine motor skills. Take care of animals, create your garden and gather a rich crop later. Little ones explore the farming abilities, the essence of animal farm nurtures skills of care too. Process and get involved due to the entertaining aspect.  We developed our educational toddler games Animal Farm to teach our babies to be patient, care for animals, get skills of keeping the farm tidy too. Farm inhabitants are happy when kids look after them and play together. The interface is bright, easy-to-comprehend, the smallest ones can play the game intuitively. The levels are available all at once, thus, the kid can start the games with any animal he chose. Kids learn animal manners, peculiarities useful in real life. We wanted to harmoniously combine the practical duties of a farm owner and entertaining activities with animals in this free kindergarten game. So you can see the structure, key points of these toddler games below.  DOG: At the beginning of the game, you need to protect carrot patches from rabbits with the help of a dog. A smart puppy wants to play fun - make a cool dog game, throw him a stick or a ball.  HORSE: The task is to nourish the horse on the farm with some fresh hay. To heal the horse the kid attaches a horseshoe to the hoof, one by one, with the help of a hammer and nails. Then he should turn up the soil with a plow and take the harvest. Great animal games, arent it?  COW: Lets feed a cow with vegetables, fruits, for example, a lemon - vitamin C is good for health cow with juicy grass, flowers, berries even a cactus. Milking the cow goes next. Parents can also be impressed. Water the meadow later and delight your PIGS: After feeding little pigs the kid will organize active game time in the mud. Next fun activity for little piglets is splashing in the bubble bath.  HENS: We made these farm games home for hens, chickens, rooster. Scatter the grain in front of the domestic birds, after that watch everyone to be fed up. We designed the next task according to a famous game algorithm: moving the basket, catching the precious falling eggs - be careful, the hens did their best so you probably in love with an omelet. These kids games are good for reaction, accuracy training. Then put all domestic birds on a perch, be aware and patient because the chickens will jump out.  We designed these educational farm games for preschoolers, kindergarten, toddlers to promote the importance of care, love, friendship. The farm animals for kids builds preparatory capabilities for understanding agriculture.  P.S Show your kindergarten kids a real farm with living inhabitants for better understanding farm animals. You are welcome to email us at support@gokidsmobile.com We are on Fb: https://www.facebook.com/GoKidsMobile/ ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}