{
"name" : "Learn First Words - Baby Flashcards",
"url" : "https://play.google.com/store/apps/details?id=com.TooFunnyArtists",
"package" : "com.TooFunnyArtists",
"category" : "Education",
"description" : "Learn First Words is an educational game designed to introduce your baby or toddler to everyday vocabulary. This game is designed to teach your baby new words through sound, animation, and flash cards. Its fun, free, and perfect for children between the ages of 1 to 5.   Learn First Words features 15 kid friendly categories and over 150 words for free! Free Flashcards for your children of all ages and baby to learn words and phonics! This educational game has an easy to use flashcard interface that keeps children entertained while teaching them everyday word categories such as fruits, toys, animals, foods, vegetables, clothes, vehicles, body parts, and so much more! Babies, toddlers, kids, and children can all use this first words game with ease.   *Categories include: Animals, House Items, Bathroom and Bathing, Vegetables, Fruits, Food, Body, Outside, Vehicles, and Clothes. All words are in English.    High quality large pictures   Fun animations and sounds   Engaging Voice-overs   Swipe or click arrows to switch from one flashcard to another   Learn at your own pace   Multi-sensory learning tool   Easy to use game environment   FREE!   No disturbing pop-up ads between sections   All words are in English.  It is simple to use. Select a category, review flash cards, and interact with the animations. All words are in English. Building a strong vocabulary, learning language and pronunciation skills have never been so easy and exciting for babies, toddlers, and preschoolers!   Flash cards teaching method is the best for babies, toddlers, and children allowing them to learn at their own pace. It is a fun and educational game. Your kid will learn everyday words while having fun. Play and learn together with your toddler. It is also a great way to learn English for preschool children. If English is your second language, teach English to your toddler/preschooler in a fun and colorful way with this educational game. We cover all basic vocabulary.   Hope you and your toddlers love this game. If you like it, please rate us 5 stars. We love getting feedback from our users. If you have any questions or suggestions, please email us: toofunnyartists@gmail.com ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}