{
"name" : "Badanamu: Bada Talk 1",
"url" : "https://play.google.com/store/apps/details?id=com.calmid.learnandplay.badatalk1",
"package" : "com.calmid.learnandplay.badatalk1",
"category" : "Education",
"description" : "Bada Talk 1 is the third level in our ESL app line-up and uses narrative stories to teach users thematic vocabulary and phrases through contextual reading. It is the core vocabulary program in the ESL course, and it focuses on building strong concept imagery of basic vocabulary words related to themes. The two major themes are Around the Home and Health & Exercise. Like all of our Badanamu curriculum apps, Bada Talk 1 features structured learning lessons that are aligned with the ESL curriculum. Your learner will love learning with the Badanamu friends! FEATURES:  Learn with Badanamus structured ESL curriculum.   Develop thematic vocabulary through scaffolded content.  Do fun activities that reinforce cognitive development and creativity through fun puzzles and an emphasis on memory enhancement.  Enjoy interactive songs and stories with the Badanamu friends.  Adaptive learning content: intelligent content-sequencing specific to a user account that customizes navigation, pace, difficulty, and presentation.  Bada Talk 1 is perfect for:  Learners 3 years old and above.  Learners that need extra reinforcement with common vocabulary words or are just starting to build their vocabulary base.  Learners that love interactive learning environments with games and activities.  With Bada Talk 1, you can be sure of the following:  The learning content is aligned to the structured standards-based ESL curriculum.   The apps are designed specifically for young learners with a kid-friendly interface.  Your child will learn in an ad-free environment. Parental control & child lock:  The child-lock function will prevent your child from making accidental purchases.  Badanamu recommends up to 30 minutes of daily study with Bada Talk 1 and no more than 60 minutes of total screen time per day for young learners.  In-App Purchase Information:  This app is free to download but does contain in-app purchases.  To access progress analytics, adaptive learning content, and restore access to content youve purchased, its necessary for the user to create an account and sign-in. Once logged in, you can purchase the Badanamu Learning Pass or Badanamu Learning Pass Premium and begin your learners education journey with our family of ESL applications.  If you purchased your pass via in-app purchase, please refer to the terms and conditions provided to you in connection with your purchase.  Follow Us:  Homepage: https://www.kidsloop.net  YouTube: https://www.youtube.com/badanamu  Instagram: https://www.instagram.com/badanamu/  Facebook: https://www.facebook.com/Badanamu1  Questions and Customer Support:  support@calmid.com  Terms and Conditions and Privacy Policy:  Terms and Conditions: https://badanamu.com/terms-and-conditions/  Privacy Policy: https://www.kidsloop.net/en/policies/privacy-notice/  Badanamu: Lets learn and play together!   ***Permission required to access your devices external storage for saving and loading photos. ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_COARSE_LOCATION']",
}