{
"name" : "Aptitude & Logical Reasoning",
"url" : "https://play.google.com/store/apps/details?id=com.aptitudemantra.app",
"package" : "com.aptitudemantra.app",
"category" : "Education",
"description" : "Aptitude Mantra, website & mobile application allow one to prepare for Quantitative, Logical Reasoning, Verbal Ability & Data interpretation online on the go. Its an interactive and easy to use app.  These are the essentials parts to prepare for most of the competition exams like CAT, SAT, MAT, Bank PO, Bank Clerk, RRB, NDA, AFCAT, GRE, SSC, UPSC to get admission for higher studies in many courses and universities or to get job in top government organizations or companies for Sarkari Naukri.  Our app Aptitude Mantra facilitates users to prepare on the go without incurring any additional costs. Its 100% Free easy prep solution. With its add-on feature Directions to Solve it helps a candidate to be familiarized with short Tips & Tricks to solve a problem which will give you an edge over other applicants.  Aptitude Mantra now makes it possible for a candidate to review their progress on the daily basis, by its another attribute of conducting online tests for the aspirants and you get an instant result with your errors being mentioned alongside with every question. What else one can ask for, when you are getting a tutor available for 24x7 for Aptitude & Logical Reasoning.  This Aptitude & Logical Reasoning app divides your aptitude preparation into following categories viz. Quantitative, Verbal Ability, Logical Reasoning and Data Interpretation and it has a set pattern, of course. In this way, you can daily walk yourself through such tests which would help you to face the cut-throat competition without incurring any extra expenses.   How this app is useful to the candidates:  * Free of cost. * More than 6000 questions. * Upgraded weekly with new questions. * Rough Pad given below the questions. * Bookmark your favorite question. * Questions categorized accordingly. * Directions to solve given along the questions.  * Aptitude and Logical Reasoning.  * User-friendly interface.   We hope that AptitudeMantra.com will prove a success mantra for our users in their future endeavors. We wish best of luck to all of them who are preparing for sarkari exams coming in 2016 & 2017. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.VIBRATE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.aptitudemantra.app.permission.C2D_MESSAGE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.INTERNET', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
}