{
"name" : "RRB NTPC 2020 Exam Preparation : MOCK Test",
"url" : "https://play.google.com/store/apps/details?id=com.edurev.ntpc",
"package" : "com.edurev.ntpc",
"category" : "Education",
"description" : "RRB NTPC (Railway Recruitment Board Non Technical Popular Categories) 2020 Exam Preparation Solved Question Papers is the best RRB NTPC Exam preparation app in english to help in the preparation & is free. This app offers MCQ Questions, RRB Railway NTPC Solved Question Papers & Solutions, Online Mock Tests, Exhaustive Question Bank, RRB NTPC Online Mock Test Series, Topic-wise Online Tests, RRB NTPC Previous Year Question Papers with solutions  You wont need any RRB NTPC online coaching or join any academy after having this self-study RRB NTPC Exam 2020 App. All the study material, MCQs in this app has been designed as per the latest RRB Railway exams Syllabus:  RRB NTPC MCQ Questions with solutions, where questions have been gathered from a RRB NTPC question bank of previous 30 Years   Free RRB NTPC Online Test Series with Mock Tests which will give you, All India Ranking after every online test. All the tests in this Free Online RRB NTPC Test Series have been created as per the real the examination pattern.   RRB NTPC Preparation Books with all the study material required for RRB NTPC Preparation App, Important Revision Notes, MCQs Question Bank  RRB NTPC Study Material based on all the important RRB NTPC previous year papers  Previous Year Questions with solutions have been arranged in online tests to help you in the better preparation as per the pattern of the exam  RRB NTPC Solved Papers with solutions for 2018, 2017, 2016 & previous year papers  This app covers exams for following posts: RRB NTPC Junior Clerk Cum Typist (JCCT) RRB NTPC Accounts Clerk Cum Typist (ACCT) RRB NTPC Junior Time Keeper (JTK) RRB NTPC Trains Clerk (TC) RRB NTPC Commercial Cum Ticket Clerk (CC/TC)  RRB NTPC Graduate Level Post Vacancy Details: Traffic Assistant (TA) Goods Guard(GG) Senior Commercial cum Ticket Clerk Senior Clerk Cum Typist Junior Accounts Assistant Cum Typist Senior Time Keeper Commercial Apprentice (CA) Station Master (SM)  Dont forget to attempt all Previous Year RRB Railway exams Question Paper with solutions & RRB NTPC Mock Tests as per the real pattern of the exam.   If you need to enquire anything about this exam app, feel free to reach out to us on support@edurev.in. ** This app is a part of EduRev, which has been awarded as Best App of 2017 by Google & has 3Mn+ registered students with 300Mn+ lifetime views. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REORDER_TASKS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE']",
}