{
"name" : "Live puzzles",
"url" : "https://play.google.com/store/apps/details?id=com.YovoGames.puzzle",
"package" : "com.YovoGames.puzzle",
"category" : "Educational",
"description" : "Both adults and kids love such wonderful logic games as puzzles. After all, to play puzzles, or rather to collect puzzles - is very exciting and interesting, you need to have good memory and imagination for this. We present to your attention a new, amazing interactive game from the series developing games for children: Live puzzles. In this amazing game you will need to fold puzzles and assemble from various parts: a spaceship, a police car and ambulance, a helicopter and a truck, a moped and a real train. And do not just collect. After each puzzle you have gathered, you, and your kids, are waiting for real adventures. And now briefly about the main thing.  By collecting a rocket - you will fly to the moon in a real spacecraft.  Having collected the car you, going around all sorts of obstacles, will have to reach the goal, bypassing various obstacles.  After folding the ship, you will need to go fishing and catch as many fish as you can carry.  After you collect an ambulance - you, as a real veterinarian, will simply have to cure all the animals in trouble.  A cheerful locomotive will take you and your passengers to any station where you wish. But you can not do without difficulties.  And much more. Features and focus of the game: - Development of attention and assistance in the knowledge of the world around us; - development of fine motor skills and concentration; - development of assiduity; - help in studying colors, shapes of objects and figures; - Graphic design, intuitive interface and sound will please you and your baby.   Be sure to visit our website at http://yovogames.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}