{
"name" : "esemtia",
"url" : "https://play.google.com/store/apps/details?id=com.esemtia",
"package" : "com.esemtia",
"category" : "Education",
"description" : "esemtia Familias 5.0  Nueva versin esemtia Familias 5.0: ya puede consultar desde su dispositivo mvil el seguimiento escolar de sus hijos.   Con acceso fcil e intuitivo, le ofrece informacin en tiempo real, actualizada y de gran utilidad para la comunicacin con el centro escolar y el seguimiento del da de sus hijos pudiendo consultar el absentismo, calificaciones, mens de comedor, incidencias, tareas para trabajar en casa, eventos, galeras de fotos,facturacin, etc...  *PRINCIPALES FUNCIONALIDADES EN esemtia Familias 5.0 - Hemos rediseado completamente la aplicacin. - Consulta el calendario escolar y mantente informado de los eventos, exmenes, tareas, tutoras y de todo aquello que sea relevante al alumno. - Accede al resumen mensual del alumno. - Consulta las calificaciones de competencias y descarga los boletines de notas. - Gestiona tus tutoras con el nuevo mdulo de solicitud de tutoras. - Accede a las galeras y descrgalas en tu dispositivo. - Vincula cuentas de otros centros que tambin tengan esemtia. - Reenvo de mensajes. - Nuevo centro de avisos prximos para mantenerte informado en todo momento de cualquier evento relacionado con el alumno. - Consulta tus facturas.  Y mucho ms...  IMPORTANTE: Para poder utilizar esta aplicacin mvil es necesario que su centro escolar utilice esemtia school como plataforma de gestin escolar.  Ya utiliza esemtia school en su gestin diaria?  S, soy usuario de esemtia school. En este caso, puede acceder a la aplicacin esemtia Familias 5.0 a travs de las claves de usuario y la contrasea con las que accede desde su ordenador habitual.  NO soy usuario de esemtia school. Si su centro escolar no utiliza todava esemtia school como plataforma para la gestin escolar, puede recomendarla ponindose en contacto con nosotros a travs del siguiente mail info@esemtia.com o bien visitando la pgina del desarrollador. Families esemtia 5.0  Families esemtia version 5.0: and can be accessed from your mobile device tracking school children.  With easy and intuitive access, it offers real-time information, updated and useful for communication with the school and track day your children may consult absenteeism, qualifications, menus dining, incidents, tasks to work on home, events, photo galleries, billing, etc ...  * MAIN FEATURES IN esemtia Families 5.0 - We have completely redesigned the application. - Check the school calendar and stay informed of events, tests, homework, tutoring and everything that is relevant to the student. - Access the monthly summary of the student. - Read ratings competencies and download report cards. - Manage your tutorials with new tutorial application module. - Access to the galleries and download them to your device. - Attaches accounts of other centers also have esemtia. - Message forwarding. - New center next warnings to keep you informed at all times of any event related to the student. - Check your bills.  And much more...  IMPORTANT: To use this mobile application is necessary for your school use esemtia school as school management platform.  Already you are using esemtia school in their daily management?  YES, Im using esemtia school. In this case, you can access the application esemtia Families 5.0 through keys and password with which to access from your usual computer.  I am not a member of esemtia school. If your school still uses esemtia school as a platform for school management, you can recommend it by contacting us through the following mail info@esemtia.com or by visiting the developer. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.esemtia.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.amazon.device.messaging.permission.RECEIVE', 'com.esemtia.permission.RECEIVE_ADM_MESSAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.esemtia.permission.RECEIVE_ADM_MESSAGE']",
}