{
"name" : "Fresher Job Tips - Interview Tips & Job Search",
"url" : "https://play.google.com/store/apps/details?id=com.exmple.fresherjobtips",
"package" : "com.exmple.fresherjobtips",
"category" : "Education",
"description" : "Fresher job tips free app has offline/ online Collection information , This app has been provide the fresher student job tips like Dresses Tips, Interview Tips , Online test, Resume Tips , and apply Online for job In many job Portal,Fresher job Tips  Application Features :- 1. You can browse the menu of many different type. 2. You can through all the categories sub categories ans find tips in each of them . 3. Tips for What to wear for an interview , Interview tips . . 4. Interview type and question. 5. Online Technical , Aptitude test. 6. Resume Tips. 7. Apply Online on different job portal.   Features    40 Most Important Interview Questions covered for each Subject Areas ( Total 500+ Questions )  14 Different Subjects covered - General (HR) - Java job Interview - .NET job Interview - PHP job Interview - DBMS job Interview - Data Structure job Interview - Finance job Interview - Marketing job Interview - Electronics job Interview - C/C++ job - Networking job Interview - Software Testing job Interview - Android job Interview - Unix job Interview  Useful for Freshers & Experienced Professionals job Tips  GD Tips & Topics  Free Resume Sample & Review  Best Interview Guide & Aptitude Preparation  Logical Reasoning, Verbal, Maths, Puzzles covered with a sample paper, easily downloadable.  Easy to use GUI and Navigation Controls  Simply Fast and Requires NO Internet Connection  Best for preparing your resume before Interview  Helps you rehearse/practice own answers & compare them  Answers important interview tips like  - What to do when you dont know the Answer ? - What to wear on the day of Interview ?   Strong Services & We do really work on your feedback..!! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}