{
"name" : "123 Numbers - Count & Tracing",
"url" : "https://play.google.com/store/apps/details?id=com.rvappstudios.numbers123.toddler.counting.tracing",
"package" : "com.rvappstudios.numbers123.toddler.counting.tracing",
"category" : "Educational",
"description" : "Learning is fun again with 123 Numbers - Count & Tracing, the best numbers educational app for children!  Help your toddler or preschool child learn the numbers, tracing, counting and more with this easy to use app designed for kids and parents to play together. 123 Numbers features bright, colorful games that teach while children play, making it easy to learn basic number and counting knowledge from a convenient all-in-one app.  Each game in 123 Numbers features fun graphics and sounds as well as collectible stickers to encourage children to learn every single day. Parents can also customize each game to suit their childs needs. But best of all, 123 Numbers is FREE to download and enjoy. There are no third party ads or in-app purchases, just a safe and fun environment for kids to learn in.  123 Numbers is packed with fun learning games for kids:  Number Tracing  Learn the shapes of numbers with this colorful beginners mini-game. Kids follow the bright arrow guides to trace shapes on the screen. Easy!  Learn to Count  Several types of objects will be displayed on the screen. Children count the objects and tap on each one to learn numbers individually.  Number Matching  A number is displayed in a balloon at the top of the screen. Kids will recognize the number and drag the correct solution from the bottom of the screen.  Fill in the Blank - An advanced game that shows numbers in a sequence with a blank spot at the end. Kids fill in the blank to complete the sequence.  123 Numbers is a fun-filled app thats perfect for preschool, toddler and kindergarten kids. Parents will love the customizable game options and focus on learning, but children will be captivated by the bright graphics, fun sound effects, collectible stickers and entertaining games.  Note to Parents: When working on 123 Numbers, we wanted to create the best and most entertaining educational experience possible. Were parents ourselves and know how paywalls, third party advertisements, and in-app purchases can be frustrating obstacles to the learning process. To combat this, we included all the features of a paid app into a single preschool friendly package, making it easy for parents and kids to sit down and enjoy. Its exactly the kind of educational app we wanted for our own children, and we think your family will like it, too!  Thanks, and happy learning! - The parents at RV AppStudios ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}