{
"name" : "In 24 Hours Learn Spanish",
"url" : "https://play.google.com/store/apps/details?id=com.ventures.softwareapp.englishlearnspanish",
"package" : "com.ventures.softwareapp.englishlearnspanish",
"category" : "Education",
"description" : "This is the newest and perhaps the most effective app for you to learn how to speak Spanish in 24 hours! This app provides students, tourists, explorers or businessmen with an audiovisual learning experience on how to speak the Spanish language.   Doing business or on holiday in Spain, Mexico or South America? You can definitely get the best business or holiday if you can understand and speak the Spanish language! Perhaps you are an explorer travelling in Barcelona and found yourself lost in translation? No worries, you can now conquer the language barrier between you and a Spanish speaker with this app.   Too busy to enrol on a proper Spanish language course or perhaps it is too expensive? Tell you what, youre not the only one and we now have a solution. This app is designed to work with your active lifestyle at your own pace! With the audio feature of this app, you can always learn while on the go. Whether you are driving, on the bus or train, jogging in the park or perhaps relaxing in bed, just plug in your earphones and start learning! This app gives you the easiest and most hassle free way to learn the Spanish language!   Whether you are an academic student, tourist, explorer, adventurer or businessman, this app will make sure you speak Spanish in 24 hours!   This app contains thousands of words in phrases to make sure you learn the easiest way!   Thanks! ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}