{
"name" : "Hiragana Quest: Learn Japanese Alphabet",
"url" : "https://play.google.com/store/apps/details?id=com.futuretrostudios.hiraganaquest2",
"package" : "com.futuretrostudios.hiraganaquest2",
"category" : "Education",
"description" : "Are you in search of a fun Japanese language learning app that covers Hiragana Japanese alphabet with Japanese letters, Japanese writing and Japanese characters? Well, Hiragana Quest is the perfect choice. Our Japanese language learning app helps you learn to read and write: Hiragana - the Japanese alphabet! Katakana - a special alphabet for foreign words!  SIMPLE & FUN JAPANESE LEARNING We know that the hiragana alphabet, Japanese symbols, Japanese katakana and generally learning the Japanese language can be complicated. Thats why we reimagined and recreated the classic learn Japanese language apps by adding 2 cool mascots Hirako and Katato. They are here to take you on a journey to learn to write Japanese and to learn to read Japanese with simple stories and a system that makes the learning effective and easier to remember.  UNIQUE HIRAGANA PRACTICE AND LEARNING TOOLS The cool Hirako and Katato mascots are not the only unique feature of Hiragana Quest. We differ from the similar Japanese learning apps with the additional learning tools you cant find elsewhere. There are guides and trace for each stroke on your screen, you can level up as you learn and test yourself to make sure you are on point with your learning.   WHY YOULL LOVE HIRAGANA QUEST? Join our mascots Hirako and Katato on your Japanese journey. Simple stories or mnemonics for each character make learning simple and fun. Learn over a hundred characters in just a few hours! Our system ensures youll remember what you learned in years to come. Follow guides and trace each stroke on your screen. Test yourself on the characters you have learned. Earn experience points and level up your learning! Simple & intuitive UI makes Japanese learning easy and fun!  Now go learn the Japanese hiragana in the fun way.  Learn the first 7 hiragana for free! If youre impressed, then unlock the rest of the course with a small In App Purchase. Unlock Katakana at the same time for a discount!  -> Download Hiragana Quest now for free!  Developed in Tokyo in the Go! Go! Nihon studios by the team behind the language study game Study Quest! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.futuretrostudios.hiraganaquest2.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.android.vending.BILLING', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}