{
"name" : "Flutter Widget Guide",
"url" : "https://play.google.com/store/apps/details?id=com.annsh.flutterwidgetguide",
"package" : "com.annsh.flutterwidgetguide",
"category" : "Education",
"description" : "A flutter application listing all the widgets covered in Flutter widget of the week playlist on Youtube.  Features:  List of various flutter widgets with a brief description.  Check out how the widget behaves in detail.  Check out the code for each flutter widget inside the application.  Watch the YouTube video inside the app for a widget from the Flutter widget of the week playlist.  Dark Mode support.  Firebase:  Remote Config  Cloud Messaging  AdMob  Analytics  I created this project to improve my skills with dart and flutter as a development platform. I am used to developing native android apps so I focused on designing this project for the Android Platform. This project might help you to learn about Flutter if you are a beginner in this space. My experience with flutter has been great thus far. I hope you like it too.   Star the repo to encourage me to keep working on it:  Source Code: https://github.com/annshsingh/flutter-widget-guide  Connect with me: LinkedIn : https://www.linkedin.com/in/annsh/ Twitter : https://twitter.com/annsh2013  Join community at Slack: Slack : https://bit.ly/2MMkixG  Support: Paypal : https://www.paypal.me/annshsingh  Here is a list of widgets covered thus far :  Safe Area  Expanded   Wrap  Animated Container   Opacity  Future Builder  Fade Transition   Floating Action Button   Page View   Table   Sliver App Bar   Sliver List   Sliver Grid   Fade In Image   Stream Builder  Inherited Model  ClipRRect  Hero  Custom Paint  Tooltip  Fitted Box  Layout Builder  Absorb Pointer  Transform  Back Drop Filter  Align  Positioned  Animated Builder  Dismissible  SizedBox Widget  Value Listnable Builder  Draggable  AnimatedList  Flexible  MediaQuery  Spacer   InheritedWidget (coming soon)  AnimatedIcon   AspectRatio   LimitedBox   Placeholder   RichText   ReorderableListView   AnimatedSwitcher   AnimatedPositioned   AnimatedPadding   IndexedStack   Semantics  ConstrainedBox  Stack  AnimatedOpacity  FractionallySizedBox  ListView  ListTile  Container  SelectableText  DataTable  Slider  AlertDialog  AnimatedCrossFade  DraggableScrollableSheet  ColorFiltered   ToggleButtons  CupertinoActionSheet  TweenAnimationBuilder  Image  Tab View  Drawer  SnackBar  ListWheelScrollView  ShaderMask ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "[]",
}