{
"name" : "👶 Kids Songs & Nursery Rhymes for Babies 👶",
"url" : "https://play.google.com/store/apps/details?id=com.touchzing.popularrhymes",
"package" : "com.touchzing.popularrhymes",
"category" : "Education",
"description" : "Want your toddler to grasp nursery rhymes quickly? Preschool kids songs and nursery rhymes for babies are here! With interactive animations, catchy music, and cute characters, these popular nursery rhymes are fun and an absolute delight for your kids which will keep them engaged anytime and anywhere. Make your toddler sing  and dance  on the tune of popular baby rhymes!    These popular kids songs are a fun and easy way of making preschool kids learn nursery rhymes and kids songs for free.   Nursery Rhymes and kids songs are educational and fun. They teach toddlers sounds of various animals, words, actions and are really important for their overall development just on the click of a button.   Baby rhymes and kids songs in a fun and easy way will help motivate your toddler to learn and speak English. A good way of engaging your kids in video learning.   Features of Preschool Learning - Kids Songs & Nursery Rhymes for Babies :  Just touch and play the baby rhymes and kids songs for free  A 3-step video learning rhyme: Listen, chant and learn  English nursery rhymes with sound and cute characters  Sounds of various animals with action   Kids songs with lyrics, music, and sound  Easy video learning app for toddlers  4 Popular Baby Rhymes:   Hey Diddle Diddle, The Cat, and the fiddle   Mary Had a Little Lamb, Little Lamb, Little Lamb   One, Two, Three, Four, Five, Once I caught a fish alive   Row, Row, Row Your Boat, Gently down the street.    Download Preschool Learning - Kids Songs & Nursery Rhymes for Babies now for free Help your toddler learn through play.  ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}