{
"name" : "Ayatul Kursi MP3",
"url" : "https://play.google.com/store/apps/details?id=com.edufans.ayatkursioffline",
"package" : "com.edufans.ayatkursioffline",
"category" : "Education",
"description" : "Ayatul Kursi MP3 application is an application that contains the reading of Chairs in Arabic text, reading Latin verse Chair, and is equipped with an MP3 file from several Qari World.  Ayatul kursi has a great position. In the hadeeth of the Prophet sallallaahu alaihi wa sallam mentioned that it was the greatest revelations contained in the Koran. As there is on the question asked by the Prophet to Ubay ibn Kab, where the greatest verse in the Book of Allah? Ubay answered: Paragraph chair. Then he sallallaahu alaihi wasallam chests Ubay and said, O Abu Mundhir , may you be blessed with the knowledge that you have. (HR. Muslim) ..  This application contains rebound murottal paragraph seat of various renowned Qari beautiful voice. Here are - Muhammad Taha Al Junaid - Abdurrahman As Sudais - Saad Al Ghamidi - Mishary Rashid Al Afasy - Abdul Basit  Lots virtue of Ayatul Kursi. The author will explain a few of the virtue of paragraph seats. Paragraph 1. The Most Great in the Quran  As it existed in the questions asked by the Prophet to Ubay ibn Kab, where the greatest verse in the Book of Allah? Ubay answered, Verse chair. Then he sallallaahu alaihi wasallam chests Ubay then said, O Abu Mundhir , may you be happy with the knowledge that you have. (HR. Muslim).  Ayat Kursi verse categorized as the most exalted as it includes the name of Allah the most exalted, namely Al Hayyu and Al Qayyum. But scholars disagree Which Gods greatest name. 2. Exceeded sublimity of Heaven and Earth  Prophet sallallaahu alaihi wa sallam said, It is not God created the heavens and the earth exceeds the regal Ayat Kursi (as in the verse has been covering Names and Attributes of Allah)  Sufyan ats-Thawri said, For a chair paragraph (a) kalamullah (word of God), while kalamullah was greater than in the form of Gods creation of heaven and earth (HR. At-Tirmidhi) 3. One Dhikr Reading Before Bed  Prophet sallallaahu alaihi wa sallam said, When you go to bed (at night), read Ayat Kursi, Allah will always take care of you and Satan will not approach you until morning (HR. Al-Bukhari).  Make the paragraph the seat as a regular dhikr that is read when you go to sleep. In addition, the chair also includes a paragraph reading dhikr morning and evening. 4. One For Go to Heaven  Prophet sallallaahu alaihi wa sallam said: Whoever reads Ayat Kursi after finished the prayer, then no one stop him enter Paradise except death (HR. An Nasa-i, judged authentic by Shaykh al-Albani).  Download this app and listen to Ayatul Kursi from the Quran. You dont need to download mp3, just install the app. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}