{
"name" : "Vooks",
"url" : "https://play.google.com/store/apps/details?id=com.vooks",
"package" : "com.vooks",
"category" : "Education",
"description" : "Vooks is the worlds first streaming service dedicated to animated storybooks. We transport stories off the page, promoting literacy, imagination and fun for children 2 - 8 years old.   Everything great about storybooks plus so much more. Watch all your favorite storybooks anytime, anywhere with the Vooks app! With the Vooks app you can watch the animated version of the books they love. Take a trip to where the wild things are or go on an adventure with scaredy squirrel right from your device. Better than audio books or ebooks, Vooks combines the best of all platforms creating a new way to enjoy books.  With new books added monthly, youll always have access to the best in childrens storybook entertainment.  Download Vooks today and watch 6 free books via free access or start your free trial with subscription and explore award-winning childrens books to help your child learn and grow. Cancel at anytime.  VOOKS FEATURES   AD-FREE KID SAFE AGES 2-8 The Vooks app provides a safe, child-friendly viewing experience for all ages. Carefully selected award winning family friendly books that will engage and promote imagination.   STREAMING OR OFFLINE VIEWING Kids can easily watch Vooks at home, on the road, or anywhere via streaming over WiFi or with cellular data plans. Offline viewing capabilities for when your traveling or on the go, just download to your device while connected and watch offline.    NEW VOOKS MONTHLY Vooks is a growing library of your childs favorite animated storybooks.   Stream full books including: - Where the Wild Things Are - Goodnight, Goodnight Construction Site - Chicka, Chicka, Boom, Boom - Giraffes Cant Dance - Scaredy Squirrel Makes a Friend - Harold and the Purple Crayon - Stick and Stone - They All Saw a Cat - Extra Yarn - I Want My Hat Back - Hi! Fly Guy - A Sick Day for Amos Mcgee - Grace for President - Chrysanthemum - Exclamation Mark - Im Brave! - The Snowy Day - Bear Has a Story to Tell - You Are (Not) Small   EDUCATIONAL AND FUN Vooks are crafted to stay true to the original storybooks allowing for a truly entertaining and educational way to read books. Vooks are slow enough to allow children to absorb what they are seeing; yet stimulating enough to boost story comprehension and literacy.   VOOKS SUBSCRIPTION  Subscription lengths: Monthly or Yearly  Price of subscription will vary depending on plan selected, and region.   PRIVACY & SAFETY Your childs privacy and safety is our top priority.    To access all features and content you can subscribe to Vooks on a monthly or yearly basis with an auto-renewing subscription right inside the app. Pricing can vary by region and will be confirmed before purchase in the app. In app subscriptions will automatically renew at the end of their cycle. ",
"desc_perms" : "['android.permission.WRITE_CONTACTS', 'android.vending.BILLING', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE']",
}