{
"name" : "Learn Hebrew Language Offline",
"url" : "https://play.google.com/store/apps/details?id=com.speakhebrew.learnhebrewlanguageoffline",
"package" : "com.speakhebrew.learnhebrewlanguageoffline",
"category" : "Education",
"description" : "Learn Hebrew Language Offline is an educational application for you to learn Hebrew effectively. With this free app to learn Hebrew for everyone. Learn Hebrew Free Offline has 1010 common phrase in Hebrew with sound and you can use all of them without network. Very useful for you learn and go to tralvel to the world. Learning Hebrew can be a challenge, especially when it involves producing sounds you have never had to produce before. Hebrew, especially, has a few unfamiliar sounds and patterns that are hard to get used to. This application have included a lot of pronunciation, listenning, vocabulary, speaking, garmmar, converstation, travel, stories which help you know.  We have some strong opinions on this topic, and you can read them here. * Conversation: Learn Hebrew with free Hebrew conversation sentence daily. Very useful for you when to travel and go out without network! * Greetings: They also use many other Hebrew greetings and expressions to say slightly different things. You can also use such Hebrew greetings to sound more natural, and also to express yourself more clearly and precisely. * Direction & Place: Asking and giving direction in Hebrew when you go to travel. You will find these Hebrew expressions useful if you are lost or want to get to a particular place or give directions to others. * Time and Date: This lesson explains different ways of asking about and telling the time in Hebrew. * Transportation: All vehicle in real world in Hebrew for you. Here are some useful words and phrases to talk about travel and transport in English and Hebrew. Means of transport. * Tourist Acctractions: Many phrase common for you when to travel .Spain is a surprise to those who have the image of having to fight for towel space at one of its crowded beaches or sipping sangria while watching a bull fight or flamenco. * Eating Out: List food and sentence for you when to eating out in Hebrew. You can use all of them without network * Accommodation: Very useful for you when to order and book room in hotel by Hebrew and english language.  * Emergency: Here are some English phrases and Hebrew phrases and exclamations for use in emergencies and other difficult situations. Hopefully you wont need to use them! Number call in UK is 999, USA and Canada is 911 Hebrew is 112  * Shopping : Here are some English phrases and translate to Hebrew to help you when you go shopping, as well as some of the things you might see. * Family : Vocabulary that we use when talking about the family. With quiz and exercise you can learner by Hebrew * Colours: Color in Hebrew * Dating: Here are some Hebrew phrases for dating and romance. If you would like to learn how to ask someone out in Hebrew, or are looking for some romantic phrases to impress your girlfriend or boyfriend, you will find everything you need here. * Feeling Sick: You might find these Hebrew phrases helpful when talking about your health. * Tongue Twisters: To tranning your tongue when speaking Hebrew. Very useful for you to improve pronunciation and speaking Hebrew * Occasion Phrases: Here are some basic Hebrew phrases which you can use in everyday conversation, as well as some common words you will see on signs. * Countries: * Regions and Towns: * Number:   Lets install and enjoy: Learn Hebrew Language Offline!  ----------------------------------------------- FEEDBACK & SUPPORT Please support us by leaving a good rating, or share this app with your friends on Facebook, Twitter or Google+ if you like it. If you have any issues regarding this app, please feel free to let us know at: app.KidsTube@gmail.com LIKE US: https://www.facebook.com/AppLearnEnglishForKids ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'com.speakhebrew.learnhebrewlanguageoffline.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}