{
"name" : "Sorting n Learning game 4 Kids",
"url" : "https://play.google.com/store/apps/details?id=com.iAbuzz.SortingNLearning",
"package" : "com.iAbuzz.SortingNLearning",
"category" : "Education",
"description" : "Highly appreciated by teachers and parents; children are having fun classifying and matching 100 Food, Animals & House objects, while improving fine motor skills, acquiring new cognitive skills and building vocabulary.   The Sorting n Learning game is a newest addition to our educational apps for toddlers and preschoolers - representing a balance between playing & learning. It is a vocabulary teaching aid and provides kids with a good foundation for future math and language skills. It is based on an incredible and innovative concept that will help them: * Improve categorization & classification skills * Focus on visual perception and concentration * Develop cognition and fine motor skills  Features: * Simple & intuitive child-friendly interface * 3 themes with 3 scenes in each and over 100 different objects to place * Easy drag & drop game play into appropriately labeled categories * Animated positioning of objects in each scene * Wrong sorting attempt notifications * Smiley animation after each correctly placed object * Non-competitive, free of timers and scores, the more your children play, the more they practice * 28 different languages and pronunciations - English, Afrikaans, Arabic, Chinese, Danish, Dutch, Filipino, Finnish, French, German, Greek, Hindi, Indonesian, Italian, Japanese, Korean, Macedonian, Malay, Norwegian, Polish, Portuguese, Russian, Serbian, Spanish, Thai, Turkish, Ukrainian and Vietnamese.  Privacy Disclosure:  As parents ourselves, iAbuzz takes childrens wellness and privacy very seriously. Our app: * Does not collect personal data  Feedback Please: If you have any feedback and suggestions on how we could further improve the design and interaction of our apps and games, please visit our website http://iabuzz.com or leave us a message at kids@iabuzz.com. We would be glad to hear from you as we are committed to update all of our apps and games on a regular basis with new features and also want to get some ideas for future app development. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}