{
"name" : "Progate",
"url" : "https://play.google.com/store/apps/details?id=com.progate",
"package" : "com.progate",
"category" : "Education",
"description" : "Progate - Programming app for everyone  Progate is for everyone who wants to learning programming, from kids to adults. Dont worry if you have no prior experience in programming! Our friendly characters, Ken the Ninja and Master White will guide you every step of the way.   Learn while having fun With Progate, we have Levels that increase as you learn. You can learn important skills and have fun at the same time!   Learn at your own pace with illustration-based slides With our visually engaging slides, youll be able to understand programming more intuitively and learn at your own pace.   Learn by doing Once you learn the material on the slides, prepare to get your hands dirty! We have a series of exercises for you to try what youve learned. In the exercises, you can immediately check the result of your code to help you gain a more in-depth understanding of how programs work.   Top quality lessons We strive to create the best lessons possible by focusing on quality because we know that learning is fun if you understand. But if you dont, its just boring. We promise to offer lessons that are fun and easy to comprehend, so youll want to learn more.  Our list of lessons - HTML & CSS - JavaScript - Ruby - Python - Java  Progate Plus Upgrade to Progate Plus to gain access to all the lessons, including the advanced ones.  Restoring your subscription You can restore your subscription by going to Settings > Restore Subscription and signing in with your Google Account  Managing your subscription To manage your subscription, go to Subscriptions in the Play Store and select Progate.  About subscription renewal Your Google Play account will be charged for renewal within 24-hours prior to the end of the period. Auto renewal may be turned off at any time by going to your settings in the Play Store after purchase.  Price Current Progate Plus subscription price is $19.99 USD/month. The price is in U.S. dollars, may vary in countries other than the U.S. and is subject to change without notice.  Notice In-app subscriptions can only be canceled by the method above. In-app subscriptions can only be tied to one Progate account. We do not issue refunds for cancellations made on the month the subscription is made. You will be charged from your Google Play account.  Terms and Privacy Policy  Please agree to the Terms and the Privacy Policy before upgrading your plan  Terms: https://progate.com/policy Privacy Policy: https://progate.com/privacy_policy ",
"desc_perms" : "['android.vending.BILLING']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.android.vending.BILLING', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.ACCESS_WIFI_STATE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.SYSTEM_ALERT_WINDOW', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_APP_BADGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
}