{
"name" : "Daniel and End Time",
"url" : "https://play.google.com/store/apps/details?id=com.elite.the.danielandendtime",
"package" : "com.elite.the.danielandendtime",
"category" : "Education",
"description" : "This application of Daniel and End Time is an eye opener to what has taken place and what is to take place and especially Daniel and End Time explains amazing facts about the End Time. Daniel has twelve verses of which mostly Daniel and End Time explains the powers to rule the world until the End Time. The Revelations given to Daniel by Christ in this book gives us a clear line of distinctions of what to expect in the End Time. And it is clearly outlined in the app Daniel and End Time.  In the of Daniel the kingdoms that are to rule the world until the End Time are given in figurative languages, but Daniel and End Time explains in most expository manner possible to identify all these powers until End Time. It is also key to understand that Daniel and Revelation is one book given to shew us what to expect at End Time. It is there important that you read the book of Daniel and Revelation together to get the whole facts of what to expect out of this app Daniel and End Time.   This application Daniel and End Time will give you but a enough guidance to achieve your quest for knowledge about the relation that exists between Daniel and End Time events which are yet to unfold. Be sure to exhaust this app Daniel and End Time to be thoroughly informed.  Take time and study Daniel and End Time and hope you will appreciate the book of Daniel and you will too be prepared to meet End Time unfolding.  Daniel and End Time is an in-depth explanation of the Book of Daniel with a deeper look at human history, you will be amazed to see history being fulfilled. And all these are here in Daniel and End Time.  Daniel is a very amazing book and every one should read the entire book of Daniel, The book of Daniel will bring more understanding to all Christians. For one to wholly understand the book of Daniel then he Has to read The book of Daniel and Revelation together. Daniel is a very key book and all should ensure the grasp the whole concept of the Daniel the prophet. Read the book of Daniel over and over again. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}