{
"name" : "Preschool Adventures 2",
"url" : "https://play.google.com/store/apps/details?id=com.foxi.studios.PreSchool2",
"package" : "com.foxi.studios.PreSchool2",
"category" : "Education",
"description" : "Fun game that teaches preschoolers numbers, counting, letters, logic, and more Preschool Adventures 2 is a wonderful game with educational puzzles for 4-5-year old kids. Completely safe and having NO third-party ads, this game is a perfect tool to help preschool children grow, learn, and have fun at the same time. And it also gives parents some time off  while the child is having fun and learning new things, you can sit down and relax. The game is suitable for little girls and little boys alike.  The game contains 36 puzzles in 4 fun, colorful, and educational sections, specifically designed to contribute to your childs cognitive skills, exercise abstract thinking abilities, and develop general knowledge. Developing these abilities and skills can help prepare your children for school and give them extra advantage in life.  While playing the game your child will learn:   Counting from 1 to 10  Completing a missing part of an image  Matching objects according to depends on, is opposite to, and is a kind of logical relations  Bilateral and spatial awareness (above, below, left-to, right-to, behind, in front of)  Recognizing an object by its silhouette (shadow)  Letters and their pronunciations  Animal foods and habitats names  The game includes the appropriate sounds of animals, birds, instruments, etc. These (and other) sound effects are played on each correct answer.   All the puzzles were prepared by a specialist in the field of child mental development.  Our goal at Foxi Studios is to provide the best value for your children, allowing them to develop visual and cognitive abilities, to learn to communicate with their peers and the environment around them, and to acquire important life skills. Each game is designed by a professional for the specific age group.  Let your kid have fun and learn with our wonderful Preschool Adventures game! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'air.com.foxi.studios.PreSchool2.permission.C2D_MESSAGE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.DISABLE_KEYGUARD', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'air.com.foxi.studios.PreSchool2.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}