{
"name" : "Words",
"url" : "https://play.google.com/store/apps/details?id=com.dllab.words",
"package" : "com.dllab.words",
"category" : "Education",
"description" : "In this application you will find vocabulary from the English designed with Direct Method coursebook series. The vocabulary is arranged according to two categories: the coursebook and units included in it, allowing you to easily find the words you learn in your language school.  The Words app will enable you to memorize the meaning of a given word and practise the correct pronunciation. The result will be shown as an emoticon.  Vocabulary and pronunciation are very important elements of foreign language learning. Pronunciation mistakes can obviously be very amusing but they can be a source of huge misunderstanding and trouble, which most of us would prefer to avoid. This application will make English phonetics much easier for you.  How does it work? In the Words app you will be able to listen to the correct pronunciation of English words, recorded by native speakers. The meaning of each lexical item is shown with a picture which helps to understand it. The app will enable you to both learn the meanings and the pronunciation of words.  You will also be able to record your own pronunciation, listen to it, and above all, analyze how correct it is. The app will evaluate your pronunciation as very good, good or average, or will simply encourage you to keep practising.  New technology in language learning The Words app uses the latest technology to improve the process of acquiring a foreign language. It enables you to use your smartphone to advance your English in any place at any time  Internet access is enough to start your lesson.  Good accent Learning a foreign language is not only about vocabulary and grammar, a good accent matters too. It will greatly help the person you are talking to if you remove phonetic errors while speaking and you pronounce English correctly. You will also be able to understand English and American speakers easily if you know the correct pronunciation. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCOUNT_MANAGER', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.HARDWARE_CONTROLS', 'android.permission.INTERNET', 'android.permission.CAPTURE_AUDIO_OUTPUT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCOUNT_MANAGER', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.HARDWARE_CONTROLS', 'android.permission.INTERNET', 'android.permission.CAPTURE_AUDIO_OUTPUT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}