{
"name" : "Blair's Halloween Boutique",
"url" : "https://play.google.com/store/apps/details?id=com.libii.halloweenboutique",
"package" : "com.libii.halloweenboutique",
"category" : "Educational",
"description" : "How long havent you been to Blairs Boutique? Hows her shop going? It will absolutely surprise you this Halloween!  Horror, costumes, parties, treat or treat... Its Halloween, the busiest time of the year. Look, the shop is full of guests from the school. A sweet date, treat-or-treating, a birthday party, an audition... the girls will have a magnificent holiday. Dress up them as scary as possible! Whats that? Is that a pineapple? Yes, someone dresses up like a pineapple on the street! Use your imagination to dress the girls both horrific and unique!  Features: - Enjoy matching with a good deal of outfits and accessories Tons of Halloween themed items offer you a chance of being a stylist. - Get a sense of accomplishment in Election of Party Queen Join the Election and win the first prize, youll get great items as rewarded. - Exchange furniture with stars and decorate the shop The shop can look better if you earn more stars. - Learn courses and achieve higher skills and titles With more courses here, Blair can make progress every day. - Serve the guests and win surprising gifts What will the gift box give you? Try to serve all the guests and see what will happen.  About Libii: With over 600 million downloads and growing, Libii is committed to creating innovative games for kids. Well keep working on establishing a good relationship with both parents and their children and bringing a healthy, happy atmosphere for them. Visit us: http://www.libii.com/ Like us: http://www.facebook.com/LibiiGame Contact us: Got any ideas? Suggestions? Need technical support? Please feel free to contact us 24/7 at WeCare@libii.com  Need You Know: This app is totally free to download and play, some basic items are also free to use, but some additional items need you to purchase and pay to unlock. Therefore, if you do not want to use these items, please turn off the in-app purchase in your settings. Thanks. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.asus.msa.SupplementaryDID.ACCESS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_LOGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'com.asus.msa.SupplementaryDID.ACCESS', 'android.permission.READ_LOGS']",
}