{
"name" : "Linux Pro : Command Library & Complete Lessons",
"url" : "https://play.google.com/store/apps/details?id=com.rushhourlabs.linuxcommand",
"package" : "com.rushhourlabs.linuxcommand",
"category" : "Education",
"description" : "The best free Linux Command Library for beginners, intermediates & professionals. Anyone in need of the Linux command library or lessons & tutorials on Linux will find this app much helpful.   Explained in easy step by step lessons. Easy to find all your Linux needs. All in one place.   App Features:   Cool Graphics   Can Be Used Offline   Basic Information Given   Step By Step Guides On All Linux Commands   Easy To Understand Even For Someone New or Starting   The tutorials & lessons are explained in step by step lessons to help users understand everything. Linux Pro is going to be your one stop help center for all your Linux Command Library searches. Just download Linux Pro Learn how to work with the CLI (Command Line Interface).  Categories:   Users/Groups   Files/Folders   Search/Find   Network   System Information   System Control   Video/Audio   Package Manager   Terminal Games   Hacking Tools   One-liners  With Linux Pro Linux will never be a problem ever again, learn its operations like a pro in no time.  Linux Pro by Rushhour Labs is the best Linux tutorial and lesson app you will find in all of google play. We are going to say this again for you this is going to be your one stop solution for all your Linux needs. From lessons to tutorials. The cool graphics and easy interface combined with step by step lessons make it all more fun and easy to use. The Linux enthusiasts are going to love this Linux command library and the beginners and amateur and intermediates are going to love the easy lessons and tutorials.  Regards Team RushHour ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}