{
"name" : "Free Christmas Coloring Games for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.foofoo.christmascoloring",
"package" : "com.foofoo.christmascoloring",
"category" : "Education",
"description" : "Christmas Coloring Book for Kids is an absolutely free app for toddlers, preschoolers, and kindergarten kids. You can keep your munchkin busy for hours while you are busy with your Christmas preparations. Let your kid decorate and color his own Christmas tree, while you decorate yours. This app has no hidden purchases or any kind of annoying advertisements. Your toddler will surely like this little gift from us.  This app is designed for kids of age group 2 to 8 years. It contains several free coloring pages to choose from, Santa, Candles, Stars and much more. It comes with 30+ bright colors to help your child explore his/her creative side. It helps preschoolers develop their hand-eye coordination and helps improve their motor skills. The app is accompanied with several drawing tools to choose from. It comes with an auto-fill feature that makes coloring small areas easy. Kids can undo their mistakes and learn to draw and color within boundaries.  Key features of our app : - Absolutely free with no annoying ads. - No hidden Purchases. - Best app for kids of age group 2 to 8 years. - Keeps kids busy for hours. - Best for parents with kids on travel. - Designed especially for Preschool & Kindergarten Kids. - Easy to use with bright graphics.  If your toddler likes our app, please make sure you rate & review our app. Your kind words motivate us to make more such wonderful apps. Merry Christmas to one and all... ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}