{
"name" : "BYJU'S KG, Class 1-3 | Disney • BYJU'S Early Learn",
"url" : "https://play.google.com/store/apps/details?id=com.byjus.k3",
"package" : "com.byjus.k3",
"category" : "Education",
"description" : "Learning is fun, engaging and comprehensive with the Disney  BYJUS Early Learn app! A special offering from BYJUS (Think and Learn Pvt. Ltd. - Indias most valuable EdTech company) in collaboration with Disney India, this app will open doors to a world of knowledge. The personalised experience offers customised smart interactive journeys that seek to adapt to individual learning patterns. The application features Disneys timeless stories and characters, including those from Disney Princess, Frozen, Cars, Toy Story, Lion King and more! The app offering is built on the content expertise of BYJUS, enhanced with Disneys engaging stories and beloved characters.  The program offers a first-of-its-kind integration of offline to online learn by doing experience with digitally enabled worksheets that offer real-time feedback. The application creates a friendly environment and transports young minds to a world of interactive videos, educational games, engaging quizzes, and activities. The app has been diligently crafted by the in-house R&D team of 1000+ creators at BYJUS.   Key Features:  Features Disneys timeless stories and characters, including Disney Princess, Frozen, Cars, Toy Story, Lion King and more  Personalised learning programs for young minds  1000s of animated videos, games, stories and interactive quizzes  Interactive games designed to pique curiosity  Experiential learning activities and digitally enabled worksheets that aid hands-on practice and offer real-time feedback  A state-of-the-art parental reporting system that offers detailed live progress reports  ABOUT BYJUS  BYJUS is Indias largest education technology company and the creator of Indias largest K12 learning app which offers highly adaptive, engaging and effective learning programs for students in classes 1-12 (K-12) and competitive exams like JEE, NEET, CAT, etc. Launched in 2015, BYJUS has become the most loved and preferred education app for students across age groups.  BYJUS helps in developing essential skills that are needed to help prepare students to do well in school, building a solid foundation for a successful future in education. BYJUS drives experiential learning through engaging games and interactive quizzes. This helps students strengthen their foundation as well as helps them understand how Math and Science concepts along with English Arts are applied and used in real life alleviating their fear of exams. BYJUS uses state of the art technology to ensure that learning modules are supplemented with unparalleled visualizations. The BYJUS App has been designed to help make every student fall in love with learning and make education more enjoyable. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.byjus.k3.permission.C2D_MESSAGE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.amazon.device.messaging.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}