{
"name" : "Let's Talk -  Free English Lessons",
"url" : "https://play.google.com/store/apps/details?id=com.letstalkpodcast.myapp",
"package" : "com.letstalkpodcast.myapp",
"category" : "Education",
"description" : "Learn English with Lets Talk Institute, an ultimate mobile application to develop your English speaking and fluency. Access more than 1200+ English video lessons covering topics such as  English conversation, Vocabulary & Slang words, English Grammar, Accent & Pronunciation, Soft Skill and much more. Learn from the best English teachers; get an in-depth insight of the English language. 15 new video lessons every month, learning never stops with Lets Talk. Learn on the go.  Experience an amazing English language learning experience with our android English Learning app. Learn anywhere, anytime. Learn on the go. This app is carefully created keeping in mind what an ESL student may need to improve their English fluency. This English learning app is loaded with tonnes of content, content for every aspect of learning and mastering the English language.   Feature List & Lesson Category   English conversation lessons-  Learn how to talk about everyday situations in life, such as shopping, at the bank, meeting friends, greeting strangers, you have it all.  Daily video vocabulary-  Learn a new word every day, with its meaning, usage and more than 10 practice sentences, so you could actually use it in your Everyday English conversation.  English Grammar-  Dont just learn to speak, speak grammatically correct English. Learn tricky tenses, adjectives to describe things around you, writing correct English in emails and much more to explore.  Idioms  Idioms are best to express emotions and feelings in the shortest way possible. Native English speakers often use them, it adds that tangy spice to your English making you sound stylish.  Accent Training & Pronunciation    Shave that mother tongue influence in your English accent. Sound like a native English speaker. Yes, it is certainly possible to do that. Explore the accent and Pronunciation section to learn English sounds and improve your English accent and pronunciation.  IELTS Exam Preparation  Looking to study abroad or looking to take up a job in an English speaking nation. Prepare for your IELTS exam with our video lessons. Clear your doubts, get insights about the IELTS structure.   English for work/Business English  Learn English for business, create that great impression with our Business English lessons. Learn how to talk confidently in a business scenario, with your boss, your colleagues, clients etc. Learn business lingos and create a competitive edge over others.  Skillopedia - Personal development A great library of soft skills videos to learn life skills, social skills, job interview skills and just any skill required to stay ahead in life. De-stress your life, learn to do things in a cool and swank way.  Learn English through Hindi    This section in our app is created keeping in mind the Hindi speakers who want to learn English. Well explained videos in Hindi language, giving you a good understanding of the sentence structures, learning new vocabulary, everyday conversation and much more to explore.         .  We hope you would love this application, get it now and unlock awesomeness. Speed-up your learning and dont forget to rate us on the app store. Share it with your world and spread awesomeness all around. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.letstalkpodcast.myapp.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.VIBRATE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}