{
"name" : "Smart Logic Simulator",
"url" : "https://play.google.com/store/apps/details?id=com.tomaszczart.smartlogicsimulator",
"package" : "com.tomaszczart.smartlogicsimulator",
"category" : "Education",
"description" : "Create amazing logic circuits consisting of logic gates, flip-flops and hardware sensors of your smartphone. There is a variety of different input and outputs, except simple ones like on screen bulb you can use the physical flashlight or vibration engine. There are also different sensors like proximity sensor, light sensor and much more. All of that gives you an opportunity to build the circuits that can, for example, turn the flashlight on when there is dark in the room.  Smart Logic Simulator makes designing circuits easy by its intuitive interface. You can scale your projects quickly by using an integrated circuit feature, which allows you to pack advanced circuits into single reusable components and import them as many times as you want. Our dependencies manager will help you keep all of the integrated circuits inside just one file so you can easily share your work with your friends.  List of available components: AND Gate BUFFER Gate NAND Gate NOR Gate NOT Gate OR Gate XOR Gate XNOR Gate Proximity Sensor - Measures the proximity of an object relative to the view screen of a device. Charger Detector - Returns a high signal when a device is charging Light Sensor - Measures the ambient light level. Magnetic Field Sensor - Measures the ambient geomagnetic field. Seven Segment Display Seven Segment Display Decoder 5X7 Led Matrix Display Light Bulb Flashlight Speaker - generates sound with given frequency. Vibration - makes your device vibrate when an input signal is high. Clock (0.2Hz, 0.5Hz, 1Hz, 2Hz, 5Hz, 10Hz) Pulse Button Toggle Button High Constant Low Constant Notification Component - creates a notification with a given color. SR Flip-Flop JK Flip-Flop T Flip-Flop D Flip-Flop SR Latch  Are you a blogger? Wed love for you to tell your readers about Smart Logic Simulator. You can download images and resources at http://resources.smartlogicsimulator.com or contact us at mediaSmartLogicSimulator@gmail.com for any other information you might need. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.vibrate', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.FLASHLIGHT', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}