{
"name" : "Baby Wooden Blocks Puzzle",
"url" : "https://play.google.com/store/apps/details?id=com.appquiz.Baby_Blocks",
"package" : "com.appquiz.Baby_Blocks",
"category" : "Educational",
"description" : "Try out this fun educational learning app with your children. Your baby will recognize different shapes and will enjoy playing with colorful pieces. This is the classic childrens puzzle so it is quite educational for preschool and kindergarten kids.   This game will help your baby develop thinking, tactile and fine motor skills. Notice how they learn animals, transportation means, professions and fruits while playing. Babies and toddlers can have fun playing for a long time. Some of the blocks your baby will play with:  Animals: Rabbit, mouse, cow, fish, frog monkey, pig, goat, sheep Objects: Submarine, piano, car, plane, guitar, drum, rocket, train Fruits: Pineapple, lemon, apple, strawberry, coconut People: Chef, astronaut, aviator and much more  *Suitable for right brain exercise, the graphics activate the right brain. Improve the brains observation skills, cognitive ability, concentration, memory, creativity and imagination. *Improve the response speed and the coordination of the brain and the body. Exercise visual ability to observe the dynamic objects. *Simple and convenient, easy to operate. Suitable for children, the elderly, their families and friends to play together.  * Easy navigation between puzzles * Easily manageable puzzle pieces * High quality appealing graphics * Soft and stimulating sounds  It is an easy game for toddlers as it does not have menus or unnecessary options that can confuse kids. It is about placing the shape that appears at the bottom of the screen on the space provided for it. Once the piece and the shape are matched, the child will see an animation of reward that will serve as motivation to continue playing.  Drag and drop the blocks.  It doesnt matter if your baby is learning english, arabic, chinese, french, german, japanese, spanish, portuguese Our game has not text!!!!!  Sounds will guide the children during the game so that you can easily understand if they are performing the task well or need help.  If you have any suggestions please contact us. We will be glad to receive your ideas :) ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}