{
"name" : "Lexique Moré-Français",
"url" : "https://play.google.com/store/apps/details?id=com.kfidele.morefrancais",
"package" : "com.kfidele.morefrancais",
"category" : "Education",
"description" : "Parmi plus de soixante ethnies qui constituent le Burkina Faso, le peuple Mossi est majoritaire et parle le moor qui est reconnu comme une des plus importantes langues nationales aprs le franais. Arrivs entre les 11me et 14me sicles, les Mossis se sont essentiellement concentrs dans le centre du pays. Aprs avoir exclu les langues autochtones durant la priode coloniale pour mieux asseoir le franais, aucune politique linguistique srieuse ne vit le jour aprs lindpendance mme si bon nombre de langues furent enseignes dans les petites coles. Le moor dispose nanmoins dun alphabet, dun dictionnaire et de quelques matriels crits, mais le franais joue toujours un rle majeur dans la vie quotidienne des Burkinabs de sorte que le moor se cantonne encore dans un rle plutt oral. Langue gur du groupe Oti-Volta de la famille Niger-Congo, le moor possde de nombreux dialectes (Yaadre, Busumbi, Taoolend, Saremd, Zaoor, Yaand) ainsi que le parler central  Ouagadougou principalement.   Cet lexique regroupe plus de 6500 mots et expressions mor, dans lobjectif daider le mossi  bien maitriser sa langue(savoir lire et crire) et celui qui veut apprendre le mor  avoir un compagnon fidle qui le servira de guide. Among more than sixty ethnic groups that make up Burkina Faso, the Mossi people are in the majority and speak Moor, which is recognized as one of the most important national languages after French. Arrived between the 11th and 14th centuries, the Mossis were mainly concentrated in the center of the country. After excluding indigenous languages during the colonial period in order to improve French, no serious language policy emerged after independence, although many languages were taught in small schools. Moor nevertheless has an alphabet, a dictionary and some written materials, but French still plays a major role in the daily life of Burkinabs so that Moor is still confined to a rather oral role. Language gur Oti-Volta group of the Niger-Congo family, Moor has many dialects (Yaadre, Busumbi, Taoolende, Saremde, Zaoor, Yaand) as well as central speaking in Ouagadougou mainly.   This lexicon gathers more than 6,500 words and phrases mor, in order to help the mossi to master his language (to know how to read and write) and who wants to learn mor to have a faithful companion who will serve as a guide. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}