{
"name" : "LinkedIn Learning: Online Courses to Learn Skills",
"url" : "https://play.google.com/store/apps/details?id=com.linkedin.android.learning",
"package" : "com.linkedin.android.learning",
"category" : "Education",
"description" : "Grow your skills with LinkedIn Learning. Explore over 16,000 expert-led courses, available both for free and with a subscription.  Learn on the go with the LinkedIn Learning Android app.  Get the skills you need to succeed by watching bite-sized video courses anytime, anywhere.  Whether you want to learn leadership skills, build a mobile app, or how to use software, LinkedIn Learning has something for you. Take marketing classes, get management training, learn graphic design, take photography courses, watch web and interactive design tutorials, and much more. Watch expert-taught courses in leadership, programming, IT, 3D animation, and much more.  Sharpen your skills and get the most out of your LinkedIn Learning membership with the app: - Access 16,000+ courses in business, tech and creative with more added each month - Get personalized course recommendations - Download courses for offline viewing - Explore curated courses for a guided learning experience - Save courses to watch later - Watch entire courses or individual videos at your own pace - Share courses with your network - Add certificates of completion to your LinkedIn profile - Access to LinkedIn Premium networking tools, and exclusive insights like Whos Viewed Your Profile   Popular course topics and skills include: - Learn business skills like becoming a manager, learn to give presentations, and how to negotiate - Get communication tips and and time management training - Develop leadership skills and get training on strategic planning - Watch a variety of marketing tutorials like content marketing, digital marketing, SEO, and marketing tools like Google Analytics - Brush up on Excel skills, QuickBooks, and other tools - Learn coding languages like SQL, Java, C#, Python, and more - Get the skills you need in IT infrastructure, database administration, and software administration - Get training on game design and development - Learn web development and how to build web applications or mobile apps - Learn how to design and create a website - Learn how to design logos, create ebooks, and more with in-depth tutorials on Illustrator, InDesign, Muse, and other software - Learn photography and photo editing techniques, how to use a camera, Photoshop, Lightroom, and more - Learn how to record and learn music production - Learn videography and motion graphics with tutorials taught by experts - Get 3D modeling and animation skills  The LinkedIn Learning app is free to download, with courses you can watch for free right away. With a subscription, you can access our full library across technology, creative and business topics.  For Monthly Premium: $29.99 monthly USD For Annual Premium: $299.88 annual USD  If you choose to subscribe, your subscription will automatically renew until cancelled and will charge your credit card. You can turn off auto-renew at any time through your LinkedIn account. ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}