{
"name" : "Baby Panda’s Pet House Design",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.build",
"package" : "com.sinyee.babybus.build",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Baby Panda has 6 pets: Rabbit, hippo, cow, chicken, octopus, and penguin, and he decides to design a house for each pet. Would you like to help Baby Panda and his pets? Come to Baby Pandas Pet House and design pretty, comfortable houses for pets!   STEP 1: DESIGN THE SHAPES  Design a carrot house for the rabbit.  Design a milk bottle house for the cow.  Design an eggshell house for the chicken  STEP 2: PROCESS THE MATERIALS  Use a crane to pull up the carrot and trim the root.  Piece together the broken eggshells and seal the cracks with cement.  Use a shovel to clean shells and seaweed off the can  STEP 3: BUILD THE HOUSES Pile up ice pops and stick them together with ice cream to build a wall! Cover the wall with ice, then install a door and windows, and the penguin has a home!   STEP 4: DECORATE THE HOUSES Decorate the can house with shark teeth, tail and fin; Paint the wall with a mix of milk and colorful fruit juice; Use lollipops, milk bottles, windmills and balloons to make the house prettier!  Baby Pandas pets all have their own houses. Thank you for being great architects!  FEATURES: - Choose between 6 cute pets: Rabbit, hippo, cow, chicken, octopus, and penguin. - Design 6 special houses for pets: Carrot house, milk bottle house, eggshell house, ice pops house... - Identify 10+ tools and learn how to use them: Wrench, hammer, electric saw and more! - Inspire imagination and creativity with 20+ ornaments. - Easy to use: Just simple touch and drag items wherever you want.  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}