{
"name" : "Step By Step Salah - Namaz",
"url" : "https://play.google.com/store/apps/details?id=com.quranreading.stepbystepsalat",
"package" : "com.quranreading.stepbystepsalat",
"category" : "Education",
"description" : "Quran Reading wishes you All a Very Happy and Blessed Ramadan 2019  Step by Step Salah is an Islamic Smartphone application meant for instructing Muslims all over the world about how to effectively offer prayers (Namaz) along with all the essential information. It is a comprehensive guide for believers to get themselves familiar with every aspect of daily prayers, non-obligatory Salat and others.  Features Some of the unique features of this Salat app are:   In depth illustration of each step taken during every Salat Prayer along with Audio   Clear steps with detailed descriptions.   Easy on the eye user interface.   Covering each and every facet of performing Salaah.   Different Settings options depending upon gender and sect.   Share option for benefiting others with this useful Prayer App is also provided.   Categories: The learning outcomes of this application are divided into five major classes with real time step-by-step method:  1. Daily Prayers This section tells about the nature of Rakaat (Fard or Mandatory, Sunnah Emphasized or Mu`akkadah, Sunnah Gher Mu`akkadah, Nafl Mustahab and Witr Wajib) that come in each Daily Prayer for all 5 five obligatory Namaz, i.e. Fajar, Duhr, Asr, Maghrib and Isha.  2. Occasional Salah Number and kinds of Rakaat and different supplications that come in Jumma Prayer, Funeral (Namaz e Janazah), Tasbeeh (Salatul Tasbeeh), Salat al Istikhara and Eid are covered in this category.  3. Preparation In this segment, the believers will come to know about necessary characteristics associated with learning Namaz rules. The learnings are spread over maintaining complete Cleanliness, how to perform Wudu, Covering all Body parts and keeping importance of Time of the prayer in mind.   4. Making up This category is all about making Muslims aware of the significance of carrying out Missed Salah, how to offer Qaza Namaz and performance of omitted Salat under different circumstances. It also lets user know about common Mistakes that occur during routine prayers.  5. Timings This part is all about making app consumers identify with the correct prayer timing for all five compulsory Salat. It tells about the actual occasion of Namaz based on different information sources of current Location, Juristic (Hanfi, Shafi), Calculation methods (WML, Makkad, Karachi, ISNA, Tahran, Egypt) and Latitude (Angle Based, Mid Night, One Seventh). It also informs about the upcoming Namaz instance in three different Adhan Sounds.  Benefits and Blessings: Benefits and blessings of prayers are included in separate module. Blessings of prayers cover Jumma Prayers, Funeral Prayers, Tasbeeh Prayers, Salaat ul Tasbeeh and Eid Prayer, All Daily Prayers. Also Significance of prayers are included.  If you are looking for a complete guide on how to pray Namaz with step by step illustration, then download this Islamic application now in order to know about adequate information about performance of Salah. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}