{
"name" : "Puzzle Kids - Animals Shapes and Jigsaw Puzzles",
"url" : "https://play.google.com/store/apps/details?id=com.rvappstudios.jigsaw.puzzles.kids",
"package" : "com.rvappstudios.jigsaw.puzzles.kids",
"category" : "Educational",
"description" : "Whats the best way to build your childs logic skills and help them recognize shapes and patterns? By playing the colorful and completely free educational app Puzzle Kids - Jigsaw Puzzles  Puzzle Kids takes learning seriously with a selection of drag and drop object puzzles designed especially for children. Each mini-game challenges your child to locate and manipulate shapes, solve jigsaw puzzles, and recognize how shapes fit into a larger picture, all with a colorful and easy to use interface thats perfect for tiny hands. Any toddler, kindergartener or preschooler can have fun with Puzzle Kids, and they can even collect sticker and toy rewards for completing the games!  Parents love Puzzle Kids - Jigsaw Puzzles, too. The app has a number of settings and features so adults can make the games easier or harder for their children to complete, or just watch their progress as they get faster at solving the shape riddles.  Puzzle Kids is completely free from third party ads and in-app purchases. Its a free, full featured download thats ready to entertain and educate your kids!  Puzzle Kids - Jigsaw Puzzles includes the following games:  1. Shape Matching  Objects appear on the screen along with empty outlines just above. Children can drag the objects onto the outlines to make matches and complete the puzzle.   2. Object Builder  A shape is shown above with a series of pieces scattered below. Kids must match individual shapes and drag them to fit into the larger picture to reveal a fun image.  3. Guess the Object  A mystery object has appeared! Help your child guess the picture using as few clues as possible. Drag colored shapes to the outline for hints.  4. Jigsaw Puzzles  Arrange more complex shapes to complete a larger image. Several jigsaw options are available to parents to help customize the number of pieces and difficulty of the puzzles.  Features: - Challenge problem solving and logic skills with four unique mini-games - Colorful interface to help kids manipulate on-screen objects - Helps improve concentration and cognitive skills - Earn stickers and toys as rewards - Completely free to download with no third party ads or in-app purchases!  Puzzle Kids - Jigsaw Puzzles is designed for kids and parents to have fun together. Its a clever and colorful learning experience the entire family will enjoy, and best of all, its free! Download now and see just how much your child can learn.  Note to parents: When creating Puzzle Kids - Jigsaw Puzzles, our goal was to make an app thats equal parts education and entertainment. Were parents ourselves, and we know the value of providing a learning experience thats safe and engaging for our children. We also know how paywalls, third party advertisements, and in-app purchases can detract from the learning experience. With Puzzle Kids, we included all the features of a full paid app into a kid and adult friendly package, leaving out all things like microtransactions and intrusive ads. The end result is an app were proud to share with our family, and we think youll enjoy it, too!  - Best wishes from the parents at RV AppStudios ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY']",
}