{
"name" : "Piano Scales & Chords Free",
"url" : "https://play.google.com/store/apps/details?id=com.veitch.themelodymaster.psajf",
"package" : "com.veitch.themelodymaster.psajf",
"category" : "Education",
"description" : " Piano app to Learn Scales, Chords and How to Improvise in any key.  Learn Scales and Chords by viewing as a reference or playing back.  Follow finger positioning.  Follow Chord progression suggestions when improvising.  Improvise to backing tracks or metronome, record and save.  Highly configurable piano - multitouch, glissando, highlighting, note names (standard or solfege, resizable keyboard suitable for all devices and tablets.)  Listen to other players best melodies and send off your own.  Scales and Chords Games to test knowledge. Advance through levels and an area to check to progress.  Play any notes and the app will recognise the scale or chord you have played.  All keys, all scales, modes, chords and root notes available. 1000s available.  Learn Scales and Chords  Select a scale, mode or chord from the extensive list.  These can be viewed as a reference or played along to or repeated. Scales can be played ascending or descending or both. Slow down / speed up the scale.  Scales and Chords Games  Select a level, or create your own level by choosing which scales/chords to focus. Test your knowledge by playing it back. Check your progress and win stars.  Improvise  Select a backing track (mp3, wav, MIDI) from your own music collection, or use the metronome. Choose a key and the recommended notes will be highlighted. Follow the suggestions of which chords to play within the key.  Record and Save your favorite melody and play back your tune at a later date. Send off your work, and see it featured in the best user songs game in a future version.   Best User Songs  Listen to and play back the best of other users songs.  Recognition  Play some notes and the app recognises which scale or chord you have played. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}