{
"name" : "Vol 2 Right Brain Flashcards",
"url" : "https://play.google.com/store/apps/details?id=com.alvissoftware.rightbrainflashcardsvol2",
"package" : "com.alvissoftware.rightbrainflashcardsvol2",
"category" : "Education",
"description" : "This flashcards app contains Sea Creatures, Toys, Construction Vehicles, Birds, Farm Animals, Sports, Beverages and Foods. === PURPOSE OF FLASHCARDS ()  The bridges for right brain training () are Love and Speed.  Right brain training is only effective if the child is living in a loving environment. This is because any right brain training works best when the child is happy. When the child relaxes, the left brain relaxes too, and thus the right brain will take over. When the child is stressed, unhappy or crying, the right brain will shut off.  Showing flashcards at a fast rate helps to open up the right brain. Data is presented quickly such that the left brain cannot keep up and eventually gives up which gives the right brain a chance to handle it. Showing cards slowly and explaining one by one is a left brain training method.  2 of the unique right brain functions are Photographic Memory and High-capacity Memory. By flashing cards, you show pictures and say words at the same time. As a result, you connect both brains. Pictures and images are processed by the right brain, while language and words are processed by the left brain.  Flashcards also expose the child to a wider range of vocabulary.  WHY THIS APP?  * Affordable - FREE as compare to the flashcards sold in bookshops. * Portable - It can be installed in mobile phones or tablets which can be used anytime, anywhere. * No Learning Curve - Parent does not need to learn the technique of flashing cards. * Simple but Effective. * Able to select the voice (accent). * Able to select 2 different modes of quiz. * Able to choose the speed of flashing the cards. * Able to choose the flashing iterations.  HOW TO USE THIS APP?  First, select the Flashing mode in the Settings page.  Show every category to the baby/toddler using that mode. Whenever possible, try not to let them touch the phone during the flashing. For a baby/toddler, when they are not allowed to touch something, their interest will be greater and their focus can be longer.  After about one to two weeks, switch to the Quiz (Picture) mode. Let them choose the correct picture after a word is being spoken.  Then, change to the Quiz (Word) mode. Let then choose the correct word after a picture is shown and spoken.  Always remember to encourage them whenever they choose the correct answer by applauding them or giving them a hug.  Please send me your experience on using this application via email (alvissoftware@gmail.com) or posting it on Right Brain Flashcards Facebook Group (https://www.facebook.com/groups/411116319058920). ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "[]",
}