{
"name" : "Exam Preparation App for SSC CGL, RRB, PO,NEET,JEE",
"url" : "https://play.google.com/store/apps/details?id=com.study24x7",
"package" : "com.study24x7",
"category" : "Education",
"description" : "Study24x7 is a collaborative platform for Educators & Learners. We believe every student is a teacher and every teacher is a learner. Study24x7 provides a platform for our community to Learn and Earn from each other.  On Study24x7 you can Teach and Prepare on various Interests such as-  Government / Sarkari Jobs SSC CGL, Banking/ IRDA, Defence, Railway RRB, IBPS PO, SBI PO, SBI Clerk, TET, NET, UPSC/PSC, Public Sector Jobs, Private Sector Jobs.  Competitive Exam UG Engineering, UG Medical, Management, GATE/ESE/PSU, PG Medical, CE-Law, Arts & Design, Hotel Management, Finance/CA, CE-Media & Journalism  Technology Java Technologies, Digital Marketing, Databases, Microsoft Technologies, XML Technologies, Python Technologies, Mobile Technologies, Develops, Mainframe Development, Big Data & Analytics, Computer Programming, Web Development, SAP, Software Quality, Scripts  K-12 Class 5, Class 6, Class 7, Class 8, Class 9, Class 10, K-12-Medical, K-12-Non-Medical, K-12-Commerce, K-12-Arts  Higher Education Engineering, Medical, Commerce, Law, Media & Journalism, Science, Arts  Main attractions of this app are-  - On Study24x7 educators establish their market place where they can create online courses (paid and unpaid), publish study material, create free mock test and share free previous year paper.  - Educators and Learners share & post Questions to community, on which people respond to each other.  - Learners gets latest subject, topics related alerts from Teachers. Learners preparing for Government & Sarkari Jobs (IBPS, SSC, Banking) and Entrance Exam (IIT, CAT, NEET, GATE) gets real time update.  - Learners and Educators are regularly notified on entrance and Government exam dates and schedule as well as any new notice or news related to Government & Sarkari jobs.  - With active participation of Mentors on Study24x7, learners can expand their skills and knowledge and gain valuable insights from more experienced person on how to prepare for Government & Sarkari jobs. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.USE_CREDENTIALS', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}