{
"name" : "Learn Quran",
"url" : "https://play.google.com/store/apps/details?id=com.uqa.learnquran",
"package" : "com.uqa.learnquran",
"category" : "Education",
"description" : "Assalamu alaykum dear brothers and sisters,  Are you ready to learn 50% words of Quran just in 9 hours? With the help of this app, you can. This is all it takes. Are you ready?  So, you want to understand the Quran , but you are too busy? Or you think Quran is difficult to learn? Then this is the perfect app for you.  This app features our two most popular courses which are being offered to thousands of brothers, sisters and children both online and in person from UK to USA, Canada, Dubai, Saudi Arabia and the Far East. We have students from all over the world.  You will study 9 hours in total, divided over 19 sessions in which you will learn 232 words that occur in the Quran 41000 times (out of a total of approx. 78,000 words). That comes to 50%!  So, when you finish this course you will know half of the words on each page of the Quran .  What will you study?  We found out that the easiest gateway to understand Arabic is through Salah. You already know the Arabic text and this way you practise daily what you learn! You will cover:  - Surah Al-Fatihah & the last six Surahs of the Quran  - Different parts of Salah (prayer) - Basic necessary grammar - Exclusive: unique iman boosting lessons in each part.  What is the aim of this app?  - Helps you start performing daily recitations (in your salah and others) with understanding which will tremendously improve your concentration in Salah and your relationship with Allah; - shows you the Quran is not a nice thing to have, but the must have guideline to succeed in life; - Removes your thinking that the Quran is difficult to understand forever;  What are the benefits of this app? - The Key Formula to prioritize all your Quran activities! - Effective, Research-Based Approach; to ensure the fastest way for you to learn. - Included how to lessons; interact, imagine, feel and how to recite the Quran ; - Revolutionary Technique for learning grammar; TPI (Total Physical Interaction);  Wassalam, Dr. Abdulazeez Abdulraheem ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}