{
"name" : "AP Psychology Practice Test",
"url" : "https://play.google.com/store/apps/details?id=com.imptrax.ap_psychology_exam_prep_flashcards",
"package" : "com.imptrax.ap_psychology_exam_prep_flashcards",
"category" : "Education",
"description" : "AP Psychology practice exam simulator is a free ap psychology exam prep app for Advanced Placement Psychology examination. It is a complete AP psychology study guide to prepare you for actual ap psychology exam by taking AP psychology practice exam , studying ap psychology flashcards and mock test. This application is designed to take AP psychology practice exam on the go without internet on your mobile device. This AP psychology practice exam prep app record you performance and highlight the weaker area to let you focus on them while studying for ap psychology exam. All questions are formulated by experts closer to the actual ap psychology exam.  Download NOW..!!  Categories:  1. History & Approaches 2. Research Methods 3. Biological Bases of Behavior 4. Sensation & Perception 5. States of Consciousness 6. Learning 7. Cognition 8. Motivation & Emotion 9. Developmental Psychology 10. Personality 11. Testing & Individual Differences 12. Abnormal Behavior 13. Treatment of Abnormal Behavior 14. Social Psychology   AP psychology exam prep app will help you acquire information that will help you pass ap psychology test with ease.   Key features:  Two Study Modes: Flashcard and Practice Test  Detailed Explanation for each question  Feedback: Communicate with the AP psychology experts  The AP psychology exam is designed to evaluate students in 14 different main topics in the field of psychology and test their skills to use those concepts in the real world problems based on scientific methodologies and theories associated with the subfields. The Section 1 of the test has 100 questions and there is a time frame of 70 minutes to complete the test. The section 2 is the free response section and have 2 questions and 50 minutes of time. It has 33.3% score of the exam.  ImpTrax Corporation is not affiliated with AP Psychology. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'com.imptrax.ap_psychology_exam_prep_flashcards.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}