{
"name" : "Catholic Prayer Latin Audio",
"url" : "https://play.google.com/store/apps/details?id=com.Best.Catholic.Apps.Catholic.Prayers.Latin.audio.offline.text",
"package" : "com.Best.Catholic.Apps.Catholic.Prayers.Latin.audio.offline.text",
"category" : "Education",
"description" : "About Catholic Prayers Latin Audio  Catholic Prayers in Latin (Audio) is an Android Application (App) which presents the best collection of Catholic Prayers (Devotions/Sacred Readings) such as Anima Christi (Soul of Christ), Memorare (Remember), Pater Noster (Our Father), Credo (I Believe), etc. HD (High Definition) quality Latin audio with Latin text and English Translation text. Can be played offline (without internet)also included random (shuffle) and continuous play.  This app is the best choice to whom want to learn the original Catholic prayers. These prayers are treasury of Catholicism since earliest Catholic Church. It can be said that these prayers have been prayed for more than 2000 years around the world without any change. The original Latin Catholic Prayers indeed.  As for your information, Latin is spoken language in Vatican which is the center of Catholicism. So, here, an Android App presents the most best known Catholic Prayers in Latin. Enjoy the best experience of original Catholic Prayers. Listen (Latin audio), Read (Latin text), and understand (English Translation)the original Catholic Prayers.  In the Catholic Church, prayer is the raising of ones mind and heart to God or the requesting of good things from God. It is an act of the moral virtue of religion, which Catholic theologians identify as a part of the cardinal virtue of justice. Prayer may be expressed vocally or mentally. Vocal prayer may be spoken or sung. Mental prayer can be either meditation or contemplation. The basic forms of prayer are praise, petition (supplication), intercession, and thanksgiving.  Key Features  * High Quality offline audio. Can be listened anywhere and anytime even without Internet connection. No need to stream each time which is a significant saving for your mobile data quota.  * Transcript/Text. Easier to follow, to learn, and to understand.  * Shuffle/Random Play. Play randomly to enjoy unique experience each time.  * Repeat/Continuous Play. Play continuously (each or all). Give a very convenience experience for user.  * Play, pause, and slider bar. Allows user to have fully control while listening.  * Minimal Permission.It is very safe for your personal data. No data breach at all.  * Free. No need to pay to enjoy.  Disclaimer All of content in this application is not our trademark. We only get the content from search engine and website. The copyright of all content in this application is fully owned by the creators, musicians and music labels are concerned. If you are the copyright holder of the songs contained in this application and are not pleasing your song displayed, please contact us via email developer and tell us about the status of your ownership. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}