{
"name" : "Trinity Central School, Udupi",
"url" : "https://play.google.com/store/apps/details?id=com.coptin.tcs",
"package" : "com.coptin.tcs",
"category" : "Education",
"description" : "Trinity Central School is the ideal solution for students to grow to next level. In todays connected world it gives the best digital tool to our teachers, students and parents. The school Management, teachers, parents and students gets on a single platform to bring transparency in the entire system related to childs activity. The goal is to enrich the learning experience of the students and lives of parents and teachers.   Significant Features:  Messages: School administrators, Teachers, Parents & Students can now communicate efficiently using messaging features in school app. This is very helpful to keep the communication active significantly about homework, exam schedules, and many more  Events: All the events such as Exams, Parents-Teacher meeting, holidays, fee due dates will be shown in institution calendar. You will be reminded promptly before important events.   Student Timetable: Now parents can see students timetable on the go. You can see the current timetable and upcoming class in the dashboard itself. Attendance report: Parents will be notified instantly through SMS and notification in app when your kid is absent for a day or period. Attendance report with percentage for the academic year is available readily with all the details.  Fees: Now parents can pay their kids school fees instantly on your mobile. All the pending fees with due date of installment will be shown in app and the remainder will appear in app as a notification.  Gallery: Now school can upload any photos of any activities in school which can be accessible for Parents, Students and Employees  Student Report: Parents can access their childrens progress card through mobile going forward and also they can download the progress card.  Teachers Timetable: The app will show the timetable schedule for teachers, and it shows the upcoming class in the dashboard. This weekly timetable will help you plan your day effectively.  Teacher leave: Teacher can apply the leave using app and can track leave application until manager react to it, also can view number of taken and pending leaves. Mark Attendance: Teachers can mark the attendance right from classroom using mobile app, it is easier than ever to mark the absentees and access the attendance report of a class, also same time SMS will reach out to parents as their kid is absent for the day or period.  Multiple students access: If the parents have multiple kids (siblings) are studying in same school and school records have the same mobile number for all your students, all the profile can be accessed in single login using the swap profile option in app. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.coptin.tcs.permission.C2D_MESSAGE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CALL_PHONE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'com.coptin.tcs.permission.PushHandlerActivity', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'com.coptin.tcs.permission.PushHandlerActivity']",
}