{
"name" : "Quran Tajweed International",
"url" : "https://play.google.com/store/apps/details?id=com.cordoba.android.alqurancordoba",
"package" : "com.cordoba.android.alqurancordoba",
"category" : "Education",
"description" : "Bismillahirrahmannirraheem   NOTES on apk improvement:  Alhamdulillahi Rabbilaalamiin. As part of our commitment to serve our dear brothers and sisters and contribute an Al-Quran learning apk suite, again we improve this application with some new fresh design and user experience.  Kindly inform us any application hiccups or bugs and we always try to communicate with you to improve this Al-Quran apk, barakallah fiik.  Assalamu alaykum Warahmatullah Wabarakatuh  Quran Cordoba v3.0 is a free Quran application with coloured tajweed and Rasm Uthmani font. We improved the previous version with new design and worship tools specially for you:   - Quran tajweed with 604 pages - 45 variations of recitation, murattal or mujawwad - Tafseer Al-Moyassar, simple and concise translation of Quran  The content of this application is extracted from the best seller Quran Cordoba Amazing 101-in-1 Indonesian and Malaysian printed edition.  Note: kindly refer to the below notes if you found errors while updating or installing the app, or email to qurancordoba@gmail.com. We try to serve you better and resolve all possible errors as soon as possible.  Check out our next improvement of Quran Cordoba, for all our Muslim brothers and sisters! Kindly pray for our efforts so that it will become our amal jareeya, aameen   Barakallah fiik  Wassalamu alaykum Warahmatullah Wabarakatuh ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.PREVENT_POWER_KEY', 'com.android.vending.CHECK_LICENSE', 'android.permission.WAKE_LOCK', 'com.cordoba.android.alqurancordoba.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.PREVENT_POWER_KEY']",
}