{
"name" : "Kaleela - Learn Arabic the right way",
"url" : "https://play.google.com/store/apps/details?id=com.reachpublishers.kaleela",
"package" : "com.reachpublishers.kaleela",
"category" : "Education",
"description" : "Learn Arabic the right way! With the Kaleela () Arabic language learning app, you can start to learn Arabic language ( ) skills quicker and more successfully than with the traditional classroom method. From the very beginning through Kaleelas fun and interactive learning methods, youll start to learn Arabic alphabet, learn how to write Arabic letters and learn Arabic pronunciation. Then youll move on to learn Arabic basic words, learn Arabic grammar, learn to read Arabic, and learn to speak Arabic. Modern standard Arabic and many Arabic slang phrases are provided in Kaleela (). Whether youre learning Arabic for beginners or you are a seasoned pro who wants to refresh your Arabic language ( ), with Kaleela () you can learn Arabic at your own pace, in your own time, whenever and wherever you want.  What makes Kaleela () better than all the other Arabic language apps? For starters, most of the other language learning apps are cookie cutter apps made by organizations who try to create as many language apps as possible such as French, German, Spanish, and of course, Arabic. These apps generally just barely scratch the surface of the target language. Kaleela () Arabic language learning app, however, was created by highly qualified and experienced native Arabic language professors who deal with the language every day. These Arab language professionals designed the app so you can start using Arabic the minute you begin learning through Kaleela(), and dive deeper and deeper into the language after youve successfully completed every topic.   Whats more is that the Kaleela app() doesnt only teach you Modern Standard Arabic like most apps, but also takes you deeper into the world of Arabic slang words. Planning a trip to Cairo to see the Pyramids and the Great Sphinx? You can learn Egyptian slang to help get you there. Got a job in Jordan? Then why not learn Jordanian slang in the Jordanian / Palestinian slang courses ? Most recently, Kaleela introduced a new course in Syrian slang, very soon all Arabic slangs will be included in kaleela (), which could come in handy for those planning to work in journalism and need to communicate with the local Syrian population, or social workers and teachers who can help the thousands of Syrian refugee men, women, and children acclimate to their new homes in Europe, Canada, and the USA.  With Kaleela () Arabic language app, you really do learn Arabic the right way because we understand that the best way to learn Arabic is based on the five skills of learning new languages: Listening, Speaking, Reading, Writing and Culture (Arab culture) As a result, youll learn Arabic the same way native speakers, making it the most efficient way to acquire the language. In addition to fun and interactive vocabulary acquisition, youll learn skills like Arabic writing through video content and learn Arabic pronunciation by listening to audio spoken by an authentic native speaker.  Ready to give it a try? Download the Kaleela Arabic language app today and learn Arabic the right way! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}