{
"name" : "Cooking School 2020 - Cooking Games for Girls Joy",
"url" : "https://play.google.com/store/apps/details?id=com.cookingschool.cookinggames.kitchencraze.cookingcraze.cookingfever",
"package" : "com.cookingschool.cookinggames.kitchencraze.cookingcraze.cookingfever",
"category" : "Education",
"description" : "Cooking School 2020 - Cooking Games for Girls Joy Restaurant is the Best Cooking Games for Girls in the world! Enjoy the joy of Cooking! Girls games for Free! Play the new free Cooking Games 2020 & the best in 2019 in the food maker craze genre!Upgrade your kitchen & serve your customers in this food maker games!Learn how to cook new recipes like hot chicken wings with french fries & chips!You will learn from Chef of the World how to cook with madness tasty dishes & meals!Beat your fever of the cooking games madness today and cook mamas delicious meals,dishes and desserts in every country in the world!Young Chef will teach you to cook tasty desserts & Fast Food games!  Features: - 4 Amazing Restaurants with tasty food - 200+ Levels of delicious recipes - Tap to Cook & Easy To Play - Serve your hungry customers - Taste the food Craze!  Prepare and serve tasty food with a cup of fresh beans coffee for everyone in your family & learn new recipes!You will be able to prepare a delicious american pie & dessert from an original recipe.You will cook your favourite donuts, cheesecake & brownies. For the dessert you will learn the vanilla cream or chocolate cream & fruit cakes secret formula!Fried baked or grilled, the Pork Chops will be delicious anyway you prepare them!We will cover the fresh seafood area as well & the real italian dish! Play with the panda cooking madness games in real time & learn to cook.  NEW GIRLS GAMES 2020 & Cooking Games 2020 and CHEF GAMES for all the TASTY FOOD lovers! TAP fast to COOK and SERVE. become the MASTERCHEF in this Girls Games 2020, live the cooking madness of TIME MANAGEMENT GAMES. Open RESTAURANTS all over the world and become a CRAZY CHEF!   New restaurant cooking game contains a variety of restaurants like fast food, seafood, Chinese, Indian food, snow shop, beach shop and much more. Cook delicious meals as a crazy Cooking Games for Girls chef by using a fast food maker, for the customers who are waiting at the restaurant counter.  This Cooking Games for Girls gives all the fun for boys and girls with plenty of levels to play.  Play our new Cooking School 2020 - Cooking Games for Girls Restaurant Joy today! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}