{
"name" : "Unicorn Coloring 🦄",
"url" : "https://play.google.com/store/apps/details?id=com.foxi.studios.UnicornColoring",
"package" : "com.foxi.studios.UnicornColoring",
"category" : "Education",
"description" : "Unicorn Coloring Book is a coloring application with 60 images of unicorn, horses and little ponies.  This virtual coloring and drawing book, full of fairytale pictures, is designed for all family ages, girls and boys alike (although, girls especially like it). It is suitable for both phones and tablets.  You can fill the colors in prepared image outlines and can also create your own original drawings. It is so simple and easy even the youngest kids can play it. The game includes a lot of beautiful images of unicorn, horses and little ponies.  The game includes the following features:  60 colorable pictures of unicorns, horses and little ponies.  20 bright and beautiful colors to use for drawing and filling.  Filling an entire region with color, drawing with a pencil or a brush, and using an eraser.  Your can paint, draw, or doodle their favorite little ponies and unicorns, or basically whatever they want. Doodling, painting, and drawing have never been easier and more fun, so lets start now with yours favorite unicorns and little ponies.  This game has a plenty of unicorn, pony and horse images that little kids like. Download it today and enjoy!  Our goal at Foxi Studios is to provide the best value for your family, allowing them to develop visual and cognitive abilities, to learn to communicate with their peers and the environment around them, and to acquire important life skills. Each game is designed by a professional for the specific age group.  It is the time to have fun with our wonderful Unicorn Coloring Book game! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}