{
"name" : "Bouquet of Civil Services: Guide for UPSC IAS Exam",
"url" : "https://play.google.com/store/apps/details?id=com.edurev.com.edurev.crackupscbook",
"package" : "com.edurev.com.edurev.crackupscbook",
"category" : "Education",
"description" : "A Bouquet of Services by Lohit Matani, IPS and Vishal, IPS is an initiative to help all UPSC Aspirants, who are preparing for the prestigious examination. The author had cleared the UPSC Civil Service Examination in 2013 and was selected to join Indian Police Services (IPS). With the guidance of other fellow officers, the author has compiled the book for all the aspirants. And CRACK CIVIL SERVICES IN FIRST ATTEMPT by Divey Sethi (IRS) Book/App is a complete guide for IAS IRS IPS IFoS Aspirants. This app includes all details from the time when the idea of preparing for Civil Services/ IAS starts to take shape in an aspirant, he finds no one to confront too. An aspirant is pulled in several conflicting dimensions, millions of questions about Civil services torments the mind. But the preparations become easier if we know what we are supposed to study, the right pattern for answer writing and the best books available for reference. So what you need is someone to take the pain and to curate all the right information about the Civil Services Exam and to present it in a concise manner. And this is exactly what Divey Sethi has done in this book. It might look like a lean version of a UPSC guide but pretty much covers everything that pops up in the mind of the aspirant. It starts with the recent trends in the exam which itself is a big topic as UPSC seems to have seriously taken on the phrase Change is the only constant thing. The period from 2011-2014 had seen too many changes in the pattern of the exam and was indeed the golden period for the engineers. But how the balance was struck between engineers and non-engineers, rural and urban divide, English and Hindi medium students by UPSC is also detailed in this book. App is derived from EduRev App, the same app which won the Best App of 2017 award by Google, an honor given to only top 25 apps on Android Playstore.  You can check out the award-winning EduRev App at www.edurev.in/android and the website at www.edurev.in  Features of the App: Social Learning Network Connect with Students from all over India, more than 14,00,00 students using the web platform - www.edurev.in  In-Depth Analysis Insights on the basis of Deep Analysis to empower every student & convert each weakness into a strength! Free Learning App App learns about you while you learn from the app & tracks study pattern to give content/tests as per your need Marketplace of Courses Course material in over 500+ Courses which will help you learn & understand concepts in a simple language. Large Network of Teachers The best teachers from all over India are sharing content & teaching subjects of expertise. Best Teaching App available  This EduRev app contains:A Bouquet of Services   1 - Indian Administrative Service (IAS) 2 - Indian Foreign Service (IFS) 3 - Indian Police Service (IPS) 4 - Indian Forest Service (IFoS) 5 - Indian Post and Telecommunication Accounts and Finance Service (IP & TAFS) 6 - Indian Audit and Account Service (IAAS) 7 - Indian Revenue Service Customs and Central Excise (IRSC and CE) 8 - Indian Defense Accounts Service (IDAS) 9 - Indian Revenue Service- Income Tax (IRS-IT) 10 - Indian Ordnance Factories Service (IOFS) 11 - Indian Corporate Law Service (ICLS) 12 - Indian Civil Accounts Service (ICAS) 13 - Indian Railway Traffic Service (IRTS) 14 - Indian Railway Account Service (IRAS) 15 - Indian Railway Personnel Service (IRPS) 16 - Indian Railway Protection Force (RPF) 17 - Indian Defense Estates Service (IDES) 18 - Indian Information Service (IIS) 19 - Indian Trade Service (ITS) 20 - Indian Postal Service (IPoS) 21 - Armed Forces Headquarters Civil Service (AFHQCS) 22 - Indian Economic Service (IES) 23 - Indian Statistical Service (ISS)  If you have any queries, issues or suggestions, please mail us at support@edurev.in . We will be happy to solve them for you :)   Never Study Alone, Download the Free App now. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REORDER_TASKS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REORDER_TASKS']",
}