{
"name" : "Baby Panda's Monster Spa  Salon",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.bathhouse",
"package" : "com.sinyee.babybus.bathhouse",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Hi Kids, are you ready to run your own Spa Salon? Enter the world of monsters with Baby Panda and run a Monster Spa Salon to provide comfortable and pleasant spa services for adorable monsters!   The little monsters are covered in dirt after a day of playing outside; their hair is all matted. They come to Baby Pandas Monster Spa Salon to clean themselves up and relax! Together with Baby Panda, give the little monsters a spa treatment!   PREPARE THE BATHS  Show the little monsters to the bath area and add flower petals, milk, medicinal herbs and more to the baths.  CLEAN THEM UP Comb out the matted hair, and clean out the leaves and insects in their fur. Finally, wash them from head to toe with shower gel. The little monsters smell so good now!   SKIN CARE The little monster has pimples on its hand. Apply some cream on the pimples. And his skin is a little dry. Thats all right! Lets hydrate its skin with a fruit and vegetable mask.   Dont leave right after your spa! Baby Panda has prepared a buffet for the customers. You can try any food as you like!   FEATURES: -7 spa services including skin care, hair removal and pimple treatment.  -The five little monsters are adorable-looking and make some unusual sounds.  -Mix and match the five bath areas with five bath ingredients to customize spa treatments for five different little monsters.  -You can play this anytime and anywhere!  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}