{
"name" : "Thomas & Friends: Adventures!",
"url" : "https://play.google.com/store/apps/details?id=com.mattel.thomasbigadventure",
"package" : "com.mattel.thomasbigadventure",
"category" : "Educational",
"description" : "Play the new Thomas & Friends: Adventures! game and learn new things as you travel the world.   Your favorite #1 tank engine and his friends are on an all-new adventure exploring the world, discovering new cultures and learning different languages in this game built specifically for kids! Inspire your little conductors creativity and let their imagination run wild with possibilities when creating their own train track sets. Figure out how to solve problems by helping Thomas and his friends with tasks only the toughest engines can accomplish. Listen to directions, play fun games and build the ultimate track in each country for all your favorite trains to enjoy!    FEATURES:   LEARN & ENGAGE   Discover different cultures   As you play, explore countries such as China, Australia, Sodor & more!   Learn interesting facts about each country that Thomas visits   BUILD & CONSTRUCT   Create tracks in different parts of the world for Thomas and his friends   Unlock new items and add them to your collection   Build and play with your very own track sets   RACE   Meet Thomas friends and race against them   Have fun spotting new landmarks as you compete   Train your conductor skills and win   Please Note: This app is free-to-play but some items can also be purchased for real money. You can disable in-app purchases through your device settings.   Privacy Policy: https://corporate.mattel.com/privacy-statement.aspx      2018 Gullane (Thomas) Limited. The Thomas name and character and the Thomas & Friends logo are trademarks of Gullane (Thomas) Limited and its affiliates and are registered in many jurisdictions throughout the world. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}