{
"name" : "PMI ACP Exam Prep Questions & Videos",
"url" : "https://play.google.com/store/apps/details?id=com.eduhubspotacp",
"package" : "com.eduhubspotacp",
"category" : "Education",
"description" : "PMI ACP Exam Prep application has: - Access to sample free PMI ACP Chapter Questions and PMI ACP Exam Prep Chapter Videos - Access to more than 40+ PMI-ACP Course Videos [Paid] - Access to each PMI ACP Exam Prep Chapter Questions specially designed by PMI-ACP experts. Total of 180 questions [Free + Paid] - Access to 4 complete PMI ACP full length tests specially designed by PMI-ACP experts. Total of 480 questions [Free + Paid] - More than 1350 PMI ACP Course slides available to you, covering everything you need to pass the PMI ACP exam - 21 Contact Hours certificate required for your PMI-ACP application - Solve Question of the Day which changes after every 24 hours. Absolutely FREE - Student Reviews: People who LOVE us; RECOMMEND us - Step by Step PMI ACP Study Plan. Absolutely FREE. Just send us an email to services@eduhubspot.com - PMI ACP Mentor Support with internationally renowned PMI-ACP trainer/Mentor/Mrs Nidhi Kohli  EduHubSpot is one of the premier institutes for providing online and classroom PMI-ACP/PMP/CAPM training. Agile Certified Practitioner (ACP) is an internationally recognized professional designation offered by the Project Management Institute (PMI). The PMI-ACP was developed to help project management practitioners thrive in the challenges of globally-distributed teams, shifting requirements, and the need for rapid responses. The exam is based on the PMI recommended set of books, and requirements to sit for the exam include, a Secondary degree, at least 2,000 hours of experience on projects, additional 1500 hours of experience on projects using agile methodologies and 21 hours of formal Agile Practices education. Our official email address is services@eduhubspot.com  However if you want to get in touch with our star instructor directly, reach out to her on her personal email address: nidhi.kohli@eduhubspot.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}