{
"name" : "Learn Spanish Words – Blarma",
"url" : "https://play.google.com/store/apps/details?id=com.blarma.learn.spanish.vocabulary.words",
"package" : "com.blarma.learn.spanish.vocabulary.words",
"category" : "Education",
"description" : "Learn Spanish vocabulary - at least 5 words per day with effective pictures and audio pronunciations. Enrich your vocabulary by learning Spanish verbs, adjectives, nouns. Improve your pronunciation skills. Memorize the most common Spanish words in less time.   Learn Spanish words with Blarma as follow: - Adjust learning speed: 5, 10 or 15 words per day. - Choose the words you want to learn and start the lesson. - Focus on pictures to learn words. - Watch short videos to better understand some words.  - Listen to pronunciation records of words.  - Answer questions that make learning easier. - Learn to pronounce words through feedback. - If you want to increase your score, repeat the lesson. - Practice as much as you want with the words you have learned.  Learn Spanish in a fun and effective way: If you have just started language training, consider long-term progress. Build the habit of learning at least 5 words a day. Review what youve learned with spaced repetition. Blarma prepares an ideal Spanish learning program for you.  Features of the Spanish vocabulary app: - Daily vocabulary lessons - Adjustable learning speed - Spanish words, verbs, adjectives, nouns - Basic, intermediate, advanced word lists - Thematic and favorite word lists - Pictures and translations for all words - Pronunciation records of all words - Vocabulary memorization exercise - Vocabulary listening exercise - Word typing exercise - Spanish pronunciation exercise - Question-based learning system - Language skill scoring system - Spaced repetition system  Try Blarma for free to learn Spanish. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}