{
"name" : "Educational Games. Spell",
"url" : "https://play.google.com/store/apps/details?id=com.edujoy.Kids.Word.Games",
"package" : "com.edujoy.Kids.Word.Games",
"category" : "Educational",
"description" : "Our educational games are aimed at children up to 8 years old to help them read, spell, write and develop their language and creative skills.  This game tests the ingenuity of children and helps them learn hundreds of new vocabulary words and associate them with images. On one hand, children will learn to differentiate letters from the alphabet and on the other, be able to form words and associate them with objects.  In addition to stimulating intelligence and attention, children review the letters of the alphabet and their writing, while learning new words in different languages.  CHILDREN WILL PLAY TO FORM WORDS   The gameplay is very simple. During the game different drawings with images of elements recognizable in daily life will appear. Below will appear disordered letters so that the children identify which word correspond to the drawing shown. The goal is to put those letters in order and form the correct word.  GAME FEATURES  * The game offers hints so children can use them when blocked with words. * Words in 6 languages. This game is available in English, Spanish, Italian, French, Portuguese and Russian. * Different categories and word families: Choose between different themes of drawings and words: food, animals, professions, sports, numbers, colors, home items and many more ...  This app can be used by kids with dislexia or other learning difficulties, helping them to improve their reading skills.   EDUJOY EDUCATIONAL GAMES   This app is part of an educational games collection created by Edujoy in order to help kids to develop new intellectual and motor skills from elements of their environment.  All our games are created by professional educators and psychologists in order to provide pedagogical content, necessary for the intellectual development of toddlers and children.  We love creating educational and fun games for you. If you have any suggestions or questions, feel free to send us feedback or leave a comment. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}