{
"name" : "Secret Codes Book for All Mobiles 2020",
"url" : "https://play.google.com/store/apps/details?id=com.androidd.secret_codes.advance_book",
"package" : "com.androidd.secret_codes.advance_book",
"category" : "Education",
"description" : "Secret Codes book of all mobiles free 2020 include the android secret code of all android Mobiles. Secret Codes book 2020 is an Open Source application allowing you to scan your device and discover hidden functionalities of your android phone. Mobile Secret Code book 2019 include the android secret code of all mobile device like Qmobile. Samsung, Sony, Lenovo, Sony Ericson, Motorola, BlackBerry, China, HTC, LG, MicroSoft/ Windows Nokia Phones, Android Secret Codes having general codes and others. Secret Codes book include:   Network Secret Code  GPS Secret Code  Bluetooth Secret Code  WLAN test Secret Code  Usage statistics Check Update  Reset Device  Unlock Phone  Unlock the device  Recover Forgotten pattern  Engineering mode  GPS test mode  Touch Test codes  Test Device is original or copy  check battery timing  Machine information  Display Codes of phone is lock, unlock  Phone Check Codes  Firmware version information Secret Code   factory tests, PDA  hard rest code  Password Forgotten  display the IMEI number  Super Mode  Secret codes of every functionality  Service Menu  factory reset  sim lock codes  sim unlock code  Phone information  Battery information  Wifi information code  Battery history   Software Information code  Hardware Information  Test Photograph RGB and much more.   Screen Test  Some code of them may not work on specific devices, but you can still try them because their manufacturer does not allow them. You can copy and share it with your friends. Keep back of your data safe before executing these codes, we are not responsible for any loss, so be care full.    Note: This is not official Application of any cell brand. By: Advance Techno team. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}