{
"name" : "Complete Mathematics",
"url" : "https://play.google.com/store/apps/details?id=com.chidi.elearning",
"package" : "com.chidi.elearning",
"category" : "Education",
"description" : "Complete Mathematics App covers basic and high school maths in a simple way. It categorizes different aspects of math in such a way that you can pick up what you plan to learn and start learning.  Gone are the days when most people complain about learning mathematics. This app has solved the problem.   Complete Mathematics App has the following sections tutorials, formulas, calculation, theory questions, quiz, dictionary, scientific calculator, graphing calculator, math tricks, brain teaser, unit converter, binary converter, statistics calculator.  This app can be used my any math lover, teachers and students planning to write exam. This app was built around the following examinations WAEC, NECO, GCE, GCSE, KCSE and JAMB syllabus but feel free to use it to solve your own math problems.  Although we plan to cover all the topics you can think about, this app will be constantly updated with fresh topics at interval.  You can enjoy the following topics   Modular Arithmetic Arithmetic and Geometric sequence Annuities Amortization and Depreciation Approximations and Significant Figures Basic Operations On Number Base Basic rules of logarithms Instruments Traded In The Capital Market Compound Interest and percentages Financial Arithmetic Basic Operations On Fractions And Decimals Order, Notation And Types Of Matrices Number Bases Standard Form Rational Numbers Ratio, Proportions And Rates Indices and Logarithmic Functions Sequence and Series Calculations of Simple Interest Rationalization Of Simple Surds Logarithms And Antilogarithms Dividing a line segment into equal parts Construction Of An Equilateral Triangle Area of Triangles, Special Quadrilaterals Coordinate Geometry of straight Lines Angles Of Polygon Factorization Congruent shapes Angles around a Point Directions and Bearings Bisector Of An Angle-Bisecting An Angle Perpendicular Bisector Of A Line Segment Geometry Construction Of A Square Angles of Elevation and Depression Geometry construction Construction of angles 75, 90, 105, 120, 135, and 150 Introducing The Vector Graphical Solution Of Linear Inequalities Graph of Linear function Introduction To Trigonometry functions Graph of quadratic function Integration of Algebraic Functions Graphs Of The Trigonometric Functions Vectors Types of Sets De Morgans Law and Combined Set Operations Disjoint Sets Intersection Of The Sets Venn Diagram Binary Operations Domain, Co-Domain And Range Of Function Logical reasoning Surds Function Notation Functions Versus Relations Polynomial Functions/ inequality Quadratic Functions Indices and the Law of Indices Plane Geometry Solid Geometry Statistics Probability  Disclaimer: The questions and solutions section uses Past WAEC exam questions and solutions which is provided by WAEC for students planning to sit WAEC exams  If you have a suggestion or issue with this app please kindly let us know through email. We always try to respond immediately. Remember to rate this app. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_CREDENTIALS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS']",
}