{
"name" : "Free Palm Reading Chart - Palmistry Secrets",
"url" : "https://play.google.com/store/apps/details?id=com.team.invilabs.free.palm.reading.chart",
"package" : "com.team.invilabs.free.palm.reading.chart",
"category" : "Education",
"description" : "Palm Guru will help you read your palm  Have you ever tried to read your palm?   Have you ever read a how-to book on palm reading but failed to find the same palm lines on your hand  or felt that it was too difficult to compare the fine lines and make judgments on your own?  This easy to handle app is just for you!    Your hand is a map reflecting your life, your personality, past,present and future and potential. Palm Guru will give you instant access to the ancient art of palmistry.  Palm Guru will easily give you amazing character readings, and tell the fortune of your friends simply and mysteriously from their hands.  Youll learn how to interpret the length of the palm and fingers, the hand types, thumbs, marks on the fingers, the lines, fingernails, the mounts, and timing in the palm.  Its easy to learn and fun to do! Palm Reader is the most simple and easy app for palmistry.   Features include- palm reading chart future by palmistry Palmistry Psychic Reading Free  Palmistry personality Palm Reading - Fortune Teller Japanese Palmistry  Indian Palmistry Chinese Palmistry Palm reading quiz   Accurate palmistry or accurate palm reading hand reading palm reader palm lines also features Hast Rekha kismat ki rekha haath ki lakeer This App offer free palm reading Palm Psychic Reading Free  Accurate Palm reading free along with your personal psychic palmistry Free Palmistry predictions  You might never ask how to read palms or read your own palm palm reading life line plays a important role in your life. palmistry scan hand reading palmistry palm reading Palm Reader - Scan Your Future Palm Reader Scanner Palm Master Predictive Palmistry  You can read your fate know your destiny Know your Future Know your future Know your fate,   You can future prediction predict future future teller know your future predictions for future Fortune Teller Life Path  You can ask the fortune teller fortune teller online psychic fortune teller fortune telling ancient fortune telling ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.android.alarm.permission.SET_ALARM', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}