{
"name" : "Catholic Saints Of The Day: Saints Day Catholic",
"url" : "https://play.google.com/store/apps/details?id=com.angie.catholicsaintsoftheday",
"package" : "com.angie.catholicsaintsoftheday",
"category" : "Education",
"description" : "Being up to date with what the Holy Catholic Church writes, is what shows the faith towards it, which we need a wise message in our lives, For that Reason We Make a Spectacular Application where you will find REFLECTIONS DAILY, To share the day to day With your friends in your favorite social network.   As human beings we need messages from the soul that motivate us every day, regardless of the state of mind that we have, it is always necessary to feed ourselves with good messages of life, and that it is better for messages to come from God, for this reason We decided Create This APP !, Daily Catholic Reflections.   All the saints of our Holy Catholic Church have dictated to commemorate day by day, you find it easily since they are divided by each month of the year and with the indicated date, so that you can share it in the different activities and preach and give them a message positive to be able to feed the spiritual life of each person who listens to you or who reads what you share.   Learn more the history of all the Catholic Saints so that they do not deceive you easily, because it is the duty of every Catholic Christian to know well of our Holy Church they are in this stupendous Application which We have put our best effort. Messages of the day, to share with your loved ones and motivate them with the best topics that we bring to you, reflections of the day are made in order to motivate either by the circumstance that we go through in life, they are blows we receive and we must be strong to be able to pass that stage of life.   DAILY CATHOLIC REFLECTIONS motivates and helps us to express in a better way, and be better Christians, which we can not express with such simple words now you will not have more problems with it !! You preach with a great message, simple, very understandable and above all inspiring for that special moment in your life! reflections of the soul: so that your motivation is 1000% in this life thanks to these beautiful preaches made to be a great self-help in your life!   MESSAGES TO FORGIVE, with the themes to preach that we bring to you, it will be able to help you to be able to forgive, as well as the one who listens to you to share the message that God has for each one of us, so that every day you nourish yourself wisdom embodied in letters within this great app, with the goal and purpose of filling the day, the weeks, the months of good positive thinking, reflecting through each letter of each topic, not only read it, the goal is meditate deepen and Reflect! everything good that contains this powerful and great APP. The most complete of the market in the world of reflections!    We are always in constant and at the forefront with updates with content that will fill you with a free and positive thought! With thoughts of greater wisdom, All this and many more things, you will find within this application, Gods Wise Thoughts, DAILY CATHOLIC REFLECTIONS Without a doubt it will Serve You!   - Do not hesitate to download And enjoy: -And reflections with Images! -Download And Enjoy! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.VIBRATE', 'com.angie.catholicsaintsoftheday.permission.C2D_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}