{
"name" : "Dentist Doctor Clinic - Kids Dental Care",
"url" : "https://play.google.com/store/apps/details?id=com.pts.dentist.doctor.clinic.kids.dental.care",
"package" : "com.pts.dentist.doctor.clinic.kids.dental.care",
"category" : "Educational",
"description" : "Welcome to dentist doctor clinic for dental treatment!   Do you wanna be a best child dentist doctor? Is it your dream?? Yes??? So, dentist doctor clinic is your best choice.   As we all know everyone wants to be a kids dentist. Now you can get kids dental treatment experience with this dentist doctor care clinic.  We all love to smile, and this only become beautiful because of our healthy teeth. We become happier when someone other also gives us a healthy smile. So, lets make our smile healthy with this dentist doctor clinic dental care game.  Perform as crazy dentist doctor and help your poor patients who are in ache. Patients are coming towards your dental clinic whose teeth began to ache heavily because of their love for sweets.   Give them special dental treatment at your clinic. Use kids dental instruments such as scalpels, burmashin, tongs, mouth spray, braces and many more.  Your patients suffer from types of teeth problem like teeth cavity, dentist mania, bad teeth and more. Do some operations to clean the teeth completely, remove gums swelling, remove cavity and fill them. Extract completely damaged teeth carefully without hurting your patients.   Its very informative dentist doctor game for practice. Download now and have fun!  Features:  Lots of lovely characters behave as dental patient in the doctor dentist care clinic. Provide abundant of instruments for full teeth treatment. Get full dental education. Learn how to be a kids dentist doctor. Develop habit of teeth protection. Gain experience as worlds best dentist doctor for children. Amazing instrument animation. Attractive dentist doctor clinic environment. High graphical visualization. Free and easy to play. Good game play controls. Awesome sounds effect. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}