{
"name" : "Learn Hiragana Katakana Free",
"url" : "https://play.google.com/store/apps/details?id=com.pinyadapizza.japanesealphabet",
"package" : "com.pinyadapizza.japanesealphabet",
"category" : "Education",
"description" : "Want to learn basic Japanese? Lets start from learning Japanese alphabet.  If you looking for practice hiragana or katakana remember memory, this application is the right one for you. With this app, you can start memory practice Japanese alphabet by learning to write both hiragana and katakana (as known as kana alphabet). This app will show you how to write Japanese alphabets step by step. By showing how many lines in each Japanese alphabet. All you have to do to study Japanese is follow the step there and start write Japanese katakana with the line number one first. Looking for number in each Japanese alphabet and then lets start drawing by touching it in the screen. Then, drag it along with the guide line. When you finished the first line then you can start to write the second line and then the next line.  After you finished learn hiragana and katakana by practice writing, then you feel like you want more for memory practice. This application has more mode for you to study Japanese and yet jp quiz is waiting for you. With this quiz mode can help you to learn Japanese easily because this application has 3 mode for quiz game. Including hiragana quiz, katakana quiz and kana quiz. With hiragana quiz mode will only has just Japanese hiragana for you to play with. With katakana quiz mode also has only Japanese katakana. And yet, with kana quiz mode will has both hiragana alphabet and katakana alphabet for you.   FEATURES - Learn kana, learn hiragana and learn katakana in 1 app. - Learn hiragana and katakana chart - Including audios for each Japanese alphabet for you to practice hiragana and katakana pronunciation. - Drawing practice kana with your handwriting. - Reset Japanese lines anytime. If you want to draw better Japanese kana. - Choosing the previous or the next Japanese alphabet. - Select Japanese alphabet as you want from kana chart. - Kana quiz game that makes learning hiragana and katakana more fun. - Easy Japanese learning. - No internet connection is required to use the app. - Absolutely FREE!  WRITING ALPHABET Lets start Japanese studying from the beginning. Lets start practice hiragana and katakana. Learn easy Japanese writing alphabet with your own handwriting.  How to write Japanese alphabet with this language learning app? - Start drawing Japanese alphabet by touch the screen at the start point. (as you can see in the screen there is the number one image in there) - Drag the finger by follow the line in the screen to the finished point. - Dont try to hit the Japanese alphabet border. If you hit it you have to start trying writing that Japanese kana line again. - Lets finished drawing other line. After that, you should finished every line in order. Then you finished drawing kana alphabet.  After finished practice hiragana, dont forget to practice katakana too. This app is a free learning and better way to practice kana drawing.  Now lets practice Japanese more. Lets try to kana quiz.  KANA QUIZ What is kana quiz? Learning Japanese with fun kana quiz game. Included 3 mode of quiz game: hiragana quiz, katakana quiz and kana quiz.  Japanese quiz features: - Study Japanese with hiragana quiz. This mode contains only Japanese hiragana alphabet quiz. - Learn Japanese with katakana quiz. This mode contains only Japanese hiragana alphabet quiz. - Learn kana more fun with kana quiz. This quiz included both hiragana alphabet quiz and katakana alphabet quiz. - Unlimited quiz to see how far you can remember memory Japanese alphabet. - Reset score and start new learning Japanese alphabet quiz any time you want.  Learn Hiragana Katakana Free is perfect language learning app for anyone who wants to learn Japanese language. DOWNLOAD NOW and start FREE learning Japanese!  Please support us by leaving a great rating, or share this app with your friends on Facebook, Twitter or Google+ if you like this app. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION']",
}