{
"name" : "Code Karts Pre-coding for kids",
"url" : "https://play.google.com/store/apps/details?id=com.edokiacademy.babycoding",
"package" : "com.edokiacademy.babycoding",
"category" : "Education",
"description" : "Ready, Set, Code!  Code Karts introduces pre-coding to children from the age of 4 speed through a series of logical puzzles presented in the form of a raceway. Whats more, it teaches kids the fundamentals of code while they race! With over 70 levels, a variety of puzzling obstacles, and two different game modes, theres no shortage of educational content for kids to enjoy.  In Code Karts, the objective is to use direction bricks to get the race car to the finish line. Through careful observation of the track ahead and some logical thinking, kids will quickly pick up on solutions to more and more difficult puzzles and will begin to absorb key elements of code-based thinking. In our technology driven world, programming is becoming more and more of a vital skill. Its a proven fact that the earlier you are introduced to something, the more likely you are to be able to master it as you learn.  The same applies for code! By introducing kids to code at a young age, you can ensure that they get a head start in the fascinating realm of computer technology.  And whats a better way to introduce them than through Code Karts, our fun and engaging educational game!  FEATURES: - 2 modes: Classic or Competition (race against the device) - Very intuitive User Interface for children from age 4 - Develop sequencing, problem solving and logic - 10 levels FREE - Earn coins that can be redeemed to customize your car - 95 levels in the Full Game version + 9 bonus races - 21 languages  About EDOKI ACADEMY We founded EDOKI ACADEMY to bring our classroom experience with hundreds of children to the Digital world of tablets. As certified teachers, our aim is to develop a range of truly educational as well as beautiful apps based on the Montessori Method. All our apps can be used at home or in class. They can also be used by speech therapists. We are proud winners of several Awards from the Parents Choice Foundation and Common Sense Media. For any support, please contact us on support@edokiacademy.com.  Privacy Policy We take personal data protection very seriously. We do not collect or share personal information about your child. You can read our privacy policy here: https://www.edokiacademy.com/en/privacy-policy/  CONNECT WITH US! If you have any support requests, comments, or questions do not hesitate to contact us at support@edokiacademy.com or visit the Edoki Academy Online Community at edokiacademy.com. Wed love to hear from you! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_PHONE_STATE']",
}