{
"name" : "Educational Games for Kids - Colors Numbers Shapes",
"url" : "https://play.google.com/store/apps/details?id=com.kids.educational.games",
"package" : "com.kids.educational.games",
"category" : "Education",
"description" : " Kids Preschool and Kindergarten Learning in 6 Categories - All-in-one   An educational and fun app for toddlers & preschool (kindergarten) children. It will help kids to learn colors, numbers, shapes, animals, fruits, vehicles with pleasure via fun animations!   Your child will also improve his memory and motor skills step-by-step by playing this educational games for kids & toddlers very fast.  Kids Learning - Learning for toddler kids is a great learning experience for toddlers, preschoolers, kindergartners, and children of all ages.  Education for preschool (kindergarten) children in different 6 categories in one app!  Caressing natural voices will help to kids to learn how to say each letters of the colors, numbers, shapes, animals, food and vehicles.  The application does not require internet connection! It woks quickly and has a very simple design.   8 different languages are supported: English, German, Spanish, Italian, Portuguese, Russian, French and Turkish! Your kids may also learn colors, shapes, numbers, animals, food and vehicles in foreign languages!  Best of all, Kids Learning is absolutely free! No in-app purchases, just pure educational fun for you and your family.  Attractive, lovely and colorful designs and pictures for kids education.  Best educational and fun game in play store for kids & toddlers & preschoolers.  Numbers for preschool kids category will help children to recognize digits and counting of numbers 0,1,2,3,4,5,6,7,8,9!  Colors for preschool kids category will help to children to recognize basic colors; red, blue, pink, orange, yellow, purple, green, grey, black, white, and brown!  Shapes for preschool kids category will help to children to recognize basic shapes; triangle, circle, square, rectangle, star, heart, moon, plus, cylinder, cube and hexagon!  Animals for preschool kids category will help to children to recognize popular animals; lion, elephant, sheep, penguin, dog, bird, bee, giraffe, rabbit, chicken, cat, monkey, cow, horse, tiger, frog, hippopotamus etc.   Food for preschool kids category will help to children to recognize popular food; apple, grape, pineapple, orange, banana, strawberry, lemon, cherry, kiwi, watermelon, peach, pear, tomato, eggplant, onion, carrot, mushroom, lettuce, corn, pumpkin, potato, garlic, cucumber and pepper etc.  Vehicles for preschool kids category will help to children to recognize popular vehicles; car, bicycle, ambulance, airplane, truck, ship, firetruck, motorcycle, train, police car, helicopter, bus, rocket, van and submarine etc.   The app designed for education of 1 year, 2 years, 3 years, 4 years, 5 years, 6 years, 7 years, 8 years, 9 years old toddlers & preschool kindergarten children.  All preschool basic education that parents need for their children is collected in one application. Preparation to primary (elementary) school is so easy now!  ======================================= 6 Educational Categories of Preschool Learning App for Kids:  =======================================   Learning Numbers for toddlers & preschool kindergarten kids (children).  Learning Colors for toddlers & preschool kindergarten kids (children).  Learning Shapes for toddlers & preschool kindergarten kids (children).  Learning Animals for toddlers & preschool kindergarten kids (children).  Learning Food for toddlers & preschool kindergarten kids (children).  Learning Vehicles for toddlers & preschool kindergarten kids (children).  Voice to help your Kid to learn how to spell each letter of the colors, numbers, shapes, animals, fruits, vehicles.  Educational games for preschoolers.  Simple design, lovely pictures, fun and fast animations.  All content is 100% FREE.  Optimized for tablets and phones.  8 languages are supported.  Download right now for FREE now and discover all educational categories for preschoolers that will keep your kids happy and active. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}