{
"name" : "Uniword: learn to read for kids!",
"url" : "https://play.google.com/store/apps/details?id=com.redhotlime.game.keyboard.en",
"package" : "com.redhotlime.game.keyboard.en",
"category" : "Educational",
"description" : "Im going to teach your kid to read with quite an interesting method.   Regular unicorns have no superpower, but Im able to voice literally any word: the name of your kids favorite pet, superhero or yummy, the names of his or her friends and siblings, and much more to make an educational process easy, engaging and really exciting!  To make a word easier and clearer for your kid, I divide it into easy-to-pronounce parts - known as unies. There are 3 variations of uni: consonant+vowel, one vowel or one consonant. For example, the word DONUT consists of 3 unies: DO-NU-T.  In order not to puzzle a kid with a variety of silent letters, unies are represented as a transcription in clouds below the word. When you tap on a cloud, the corresponding letters get highlighted, and a kid hears the correct pronunciation of the word part.   Inside the app, you can find a variety of games, ideas and exercises you can use to improve your kids reading skills like phonemic awareness, phonics and vocabulary.  Entertaining education - this is the best description for Uniword:  - Phonics keyboard for typing any words; - Ultimate words database; - Automatic division into unies; - Professional and joyful voiceover; - Manual and auto mode  - A set of games and exercises for which you can use the keyboard; - Modern method of teaching reading; - Cute and funny character - Uniword; - Works off-line; - Ads-free!  Just type anything relevant to your childs everyday life or interesting word and enjoy his/her reading progress.  Do you want to know how good you are at teaching reading? - Write to us here: hello@uniword.app and take a short test. For sure, we highly appreciate your feedback, ideas for improvement and just wishes, so feel free to communicate with us through this e-mail address. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}