{
"name" : "MaliMath",
"url" : "https://play.google.com/store/apps/details?id=com.chingatome.malimath",
"package" : "com.chingatome.malimath",
"category" : "Education",
"description" : "Rsultat dune collaboration entre lEcole Normale suprieure de Bamako (ENSup), lEtablissement franais Libert de Bamako et lInspection Gnrale de lEducation (IGEN) du Mali, malimath est dabord un groupe de travail pour la production et la diffusion gratuite des ressources mathmatiques. Il rassemble aujourdhui, plus dune trentaine danimateurs: des enseignants du fondamental au suprieur, des formateurs, des conseillers pdagogiques, des inspecteurs.   Ds ses dbuts, le groupe malimath a eu sa propre plateforme en ligne www.malimath.net, avec le soutien technique, le travail de cration et dadministration de Thomas Castanet (concepteur du site www.chingatome.net). Il faut dire que la premire phase de travail du groupe, tait un pari: rendre exploitable  lducation malienne, la banque dexercices de plus de 6000 exercices du site chingatome.net.   Aujourdhui, tout en continuant dexploiter les nouvelles ressources de chingatome.net, le groupe malimath produit ses propres ressources, grce  une formation continue de ses membres aux applications ddies  lenseignement-apprentissages des mathmatiques.   Lapplication Android malimath dont il est question ici, a t dveloppe, pour vous permettre de rechercher et de tlcharger gratuitement toutes les ressources du site malimath.net.  Avec son interface simple, intuitive et dutilisation aise, elle vous permet daccder aux ressources selon des critres de votre choix: - Classes;  - Elves; - Professeurs;  - Officiels.  Envie dy contribuer! Rejoignez le groupe au Dpartement de Mathmatiques de lEcole Normale Suprieure (ENSup) de Bamako ou envoyer un email  malimath.net@gmail.com. A collaboration between the School Normale de Bamako (ENSup), the French establishment Freedom of Bamako and the General Inspectorate of Education (IGEN) of Mali, Malimath is first a group work for the production and free distribution of mathematics resources. It gathers today more than thirty coordinator of the teachers in the primary to higher education, trainers, educational advisers, inspectors.  From its inception, the group Malimath had its own online platform www.malimath.net, with technical support, job creation and administration of Thomas Castanet (web designer www.chingatome.net). It must be said that the first group phase of work was a challenge: make it usable in the Malian education, banking exercises over 6,000 years chingatome.net site.  Today, while continuing to exploit new chingatome.net resources, the group Malimath produces its own resources, through continuous training of its members in applications dedicated to the teaching and learning of mathematics.  The Android app Malimath in question here, was developed to allow you to search and download all the resources of the site malimath.net.  With its simple interface, intuitive and easy to use, it allows you to access resources according to criteria of your choice: - Classes; - Students; - Teachers; - Officials.  Want to contribute! Join the group at the Department of ENS Mathematics (ENSup) of Bamako or send an email to malimath.net@gmail.com. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}