{
"name" : "Shapes Flashcards for Preschool  Kids (Arabic)",
"url" : "https://play.google.com/store/apps/details?id=com.holidayeducationist.arsfk",
"package" : "com.holidayeducationist.arsfk",
"category" : "Education",
"description" : "Basic Shapes help building the memory and cognitive skills for the kids as they starts to relate real world objects with them. It is vital to teach your kids about the basic 2D and 3D shapes and help them relating real world objects with their matching shapes.  Knowing this requirement, we are presenting Shapes for Kids, a Flashcards App, containing ideal amount of undistracted information to help memorizing the basic and advanced shapes held up for children of 1.5 years to 8 years.  It also has a feature to turn off the text labels (quiz mode) for parents and teachers to ask the kids about the shape.  This app contains Basic 2D geometry shapes (Square, Circle Triangle) and Basic 3D geometry shapes (Cube, Cylinder, Cone) for 1.5  3 year kids.   We have also provided advanced 2D and Advanced 3D shapes (Pentagon, Hexagon, Rhombus, Parallelogram, Prism, Pyramid, Torus etc) for 4  8 year kids.  The app is provided in 6 different languages and two voiceovers are provided for every language.  This app is ideal to be taught shapes in PreK, Kindergarten* and initial grade classes.  We at Holiday Educationist have a team of certified teachers onboard to consult and proof-read the apps content for the optimum quality assurance.  Key Features  Carefully selected shapes and colors Multiple Fonts Turn off label (quiz mode) Available in 6 different languages Zero distraction of funky elements and controls Soft background music option Ideally largest possible objects 2 Voice overs High Definition content for retina display Swipe and Menu Navigation ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}