{
"name" : "Learn - Multiplication Tables For Kids",
"url" : "https://play.google.com/store/apps/details?id=com.tablasmultiplicar.multiplicationtable",
"package" : "com.tablasmultiplicar.multiplicationtable",
"category" : "Educational",
"description" : "multiplication tables games for kids .  The available modes are:   Learning Mode (multiplication tables 1 to 20)  Pythagoras table  Game Mode with three levels. Easy, Medium and Hard.  Duel mode is a multiplication tables challenge. Competes with a friend in the three levels available. Easy, Medium and Hard.   This app is designed to teach elementary school children, and also adults, the multiplication tables from 1 to 20.   If you are a child and you are reading this I invite you to review multiplication in an easy way with our simple app, reinforce your knowledge and you will see how it will be easier to understand multiplication.   If you are a father or mother and want your child to learn to multiply, use our application to help develop your childs math skills.   This educational game is a multiplication tables practice which will help you improve in elementary school, help solve multiplication problems.   It may also be helpful for you, dear teacher, by playing the duel mode you can make a healthy competition among your students and evaluate with scores to the one who gets the most correct answers.   You can take our app anywhere, while traveling you can entertain the kids with multiplication, its a fun learning game.   You can also find the Pythagorean Table, an easier way to show multiplication. Discovered by the famous mathematician Pythagoras and that today is still very useful for learning to multiply. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}