{
"name" : "Storypark for Educators",
"url" : "https://play.google.com/store/apps/details?id=com.storypark.app.android",
"package" : "com.storypark.app.android",
"category" : "Education",
"description" : "Record childrens learning directly from your phone. Privately share images, videos, audio and stories with your Storypark learning community. Requires a Storypark account  sign up for free at www.storypark.com.  For Educators:  Record and revisit learning with the children you teach  add their voice to their stories with audio clips.   Share learning via images, videos and text instantly with a childs family.   Receive and respond to feedback in realtime.   Create accessible ePortfolios quickly and easily.   Observe progress, improve learning outcomes, and deepen engagement between educators and families.   Storypark has actually opened communication channels with working parents who we have been trying to engage all year.  For Families:  Be more involved in your childs learning via instant updates from their early learning service.   Comment and communicate where and when you like.   Record and capture moments in your childs life and learning to share with educators and family.   Observe progress, and revisit learning over time with your child.   Private, safe and secure. Only those you approve can see the stories.   Awesome resource, thank you for making it free and so easy to use! The design is a joy to navigate.  Today was my Grandsons first day at Kindy and how lucky am I to be at work but still see the expressions on his face on his first day!! Just Magic!!  What is Storypark? Storypark is your own cloud-based private learning community. Its helping educators, parents, grandparents and families in over 80 countries nurture learning more effectively together, ensuring every child has the opportunity to fulfil their unique potential. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.storypark.app.android.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.GET_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}