{
"name" : "Kidomi",
"url" : "https://play.google.com/store/apps/details?id=com.fingerprintplay.kidomi",
"package" : "com.fingerprintplay.kidomi",
"category" : "Educational",
"description" : "Kidomi is the all-in-one super app for families! Kidomi has thousands of hours of play, tons of videos, hundreds of activities and new content to discover daily. Kidomi provides parents the tools they need to help manage screentime, understand what their family is playing and more!  Your kidomi account and subscription:  - Gives you access to a diverse set of videos, games, learning activities, and creativity platforms for kids ages 3-13 - Get a new activity to discover and play every day with the kidomix! - Easily search for activities and manage screentime within our parent area - Parents can create unique playlists based on interests - Parents can easily manage up to 3 profiles for their family - Parents can manage their account in our PIN protected parent area  Subscribe to Kidomi today for only $4.99 a month or $29.99 a year. With the monthly subscription you can pay as you go and cancel the auto-renewing subscription at anytime.  Subscription Details:   Subscribe to Kidomi and you arent billed for the first 7 days. Then, its only $4.99 per month or $29.99 a year for unlimited access to hundreds of engaging activities!  The first payment will be charged to your account on the first day following your 7th day, unless auto-renew is turned off at least 24 hours before the end of the trial period.  The subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period.  Your account will be charged for renewal within 24 hours prior to the end of the current period. Your account will identify the cost of the renewal.  Subscriptions are managed by the user and auto-renewal can be turned off by going to the users Account Settings after purchase.  Cancellation of the current subscription is not allowed during active subscription period. Cancelling the subscription will disable auto-renewal at the end of the current cycle.  Any unused portion of the initial 7 day period, will be forfeited when the user purchases a subscription to that publication.  Please note:  - Kidomi is compatible with devices running OS 5.0+ - An Internet Connection is required to play, offline play is not supported  Like Kidomi? Follow us to get updates about Kidomi. Facebook: https://www.facebook.com/KidomiUS/ Twitter: https://twitter.com/Kidomi_US Instagram: https://www.instagram.com/kidomi_us Website: https://kidomi.com  Privacy Policy and Terms of use can be found here: http://fingerprintplay.com/privacy-policy/   2018-2019 Fingerprint Digital, Inc. All rights reserved. Fingerprint, Fingerprint Digital and the Fingerprint thumbprint logo are trademarks of Fingerprint Digital, Inc. ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.fingerprintplay.kidomi.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.DISABLE_KEYGUARD', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}