{
"name" : "Quiz Maker Professional (create quizzes & tests)",
"url" : "https://play.google.com/store/apps/details?id=com.qmaker.qcm.maker",
"package" : "com.qmaker.qcm.maker",
"category" : "Education",
"description" : "## What advantages in the professional version? The professional version of QuizMaker comes with many nice additional features that will allow you to edit even more varied, more configurable, more dynamic questionnaires and all this in a way always soo simple and intuitive.  Cherry on the cake, the generated shareable **.qcm** files can be **played** by any **.qcm** file readers and even by the classic QuizMaker app which is the totally free version of this software available here : https://play.google.com/store/apps/details?id=com.devup.qcm.maker  If you are new to QuizMaker, you should know that QuizMaker is an application that allows you to create, play and share quizzes and quizzes in a simple and intuitive way via a simple portable and shareable *.qcm extension file . (NB: this is not a quiz store containing already made quizzes, but this is a tool that allows you to create your own quiz in order to play, receive or share tests with your contacts via a simple portable *.qcm extension file). If you would like more information about QuizMaker, please have a look at the description of the classic version here: https://play.google.com/store/apps/details?id=com.devup. qcm.maker  So, whats so great about the professional version?  ### Edit five (5) types of additional questions! With the professional version, in addition to **3 types** of questions available in the classic version namely: 1- Multiple-choice question with multiple answers 2- Multiple-choice question with single answer 3- Open ended question.   You will now be able to create **five (5)** other types of questions that are: 1 - Enumeration 2 - Fill in the blanks 3 - Open response to multiple possibilities 4 - Put in order 5 - Match  Thus, with QuizMaker Professional, you will be able to create a total of 8 question-answer types in all. Either the three (3) available in the classic version plus five (5) other types available exclusively in the professional version.  ### More configurations on questions and answers! With the professional version, depending on the type of question and answer you have chosen, you will now be able to make further adjustments to each question-and-answer. Thus, for each question-answer, you will be able to define the following configurations: 1 - Sensitive to the box 2 - Help with data entry 3 - Mix the answers  Thanks to these **advanced configuration** options, you can **customize** the behavior of each Q & A **individually**.  Important note: QuizMaker-pro is the fully functional professional version of the QuizMaker-Classic application that gives you full access to all advanced features during a 7-days evaluation period per device. Pass the evaluation period, you will need to activate your product with an annual subscription.  NB: The application comes with a single embedded questionnaire file named demo.qcm that will allow you to discover and experience the possibilities offered by the application. Then you will need to create your own or receive new quiz files (*.qcm) from your contacts to play or re-edit.  Note that: QuizMaker app as a simple reader and editor for file with extension *.qcm, when you share a quiz as a simple shareable and portable *.qcm file, the receiver needs to have the QuizMaker app installed (or any other compatible *.qcm file reader) in order to play your shared Quiz file (*.qcm file)  If you wish to have all the details concerning the professional version of QuizMaker, you can go here: https://stackedit.io/viewer?url=https://QuizMaker.qmakertech.com/documentations/advantages-QuizMaker-pro/body.md   With QuizMaker, play, create and share quizzes easily.  ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}