{
"name" : "Shapes and Colors – Kids games for toddlers",
"url" : "https://play.google.com/store/apps/details?id=com.bimiboo.colors",
"package" : "com.bimiboo.colors",
"category" : "Educational",
"description" : "Shapes and Colors is an educational game for kindergarten and preschool kids ages 2 to 5. Our app contains 15 learning activities for toddlers that allow them to learn by playing. These baby games will allow boys and girls to develop logic, memory, attention, visual perception, fine motor skills and creativity in an entertaining way. Children will face different learning activities in form of entertaining puzzles and challenges.  Shapes and colors has kids games in English for boys and girls of different age groups.  Games for 2 year olds: Colors. Place items on correct beds by color. Educational games for kids that develop attention and fine motor skills. Sizes. Put food into correct bowls by size. Free 2 year old game to teach pre-kindergarten kids understand sizes. Develops visual perception and attention. Shapes. Fix the sofa by placing patches into correct places by shape. Toddler puzzle games for pre-kindergarten kids. A game for 2 year olds to learn basic geometric shapes. Attention. Feed animals by giving them food they ask for. Baby game with cute animals and animations. Toddler games free for 2 year olds. Memory. Clear the room by putting items into correct places. Memory games for kids 2 years.  Games for 3 year olds: Counting game  Serve sweets on correct tables by number. Numbers learning app for kids. Allows to learn numbers for toddlers. 123 kids games for 3 year olds. Building game  Decorate the room by putting items into correct places. Shapes and colors for toddlers.  Shapes game  Sort items into correct boxes by basic shapes: square, circle and triangle. Perfect preschool game to learn shapes for kids. Logic game  Divide items into two categories  for bath and for kitchen. Logic games for children age 3. Classification game  Sort birds and fish into correct habitat. Free educational game for toddlers that develops logic and memory.  Games for 4 year olds: Puzzle game  Fill the refrigerator with food by moving the items into correct silhouette. Kids puzzles 3 and 4 years old.  Crafts game  Make paper crafts by putting paper pieces into correct spots. Fun games for girls and boys - crafts for kids step by step. Colors game  Put clothes into correct wardrobes by color. Colors for babies. Preschool games for 4 year olds. Sorting game  Arrange items in the correct order by their size. Learning apps for kids age 4 to 5 free. Matching game  Find and connect two items that work together. Matching games for toddlers and kindergarten kids.  Shapes and colors features: - Educational games for 1 to 5 year olds. - Kids puzzle games for 3 year olds - Learn shapes and colors for toddlers - Helps in development of basic skills - Counting for kids  learning numbers 1, 2 and 3 - Optimized for tablets and phones - Cute animals for kids: dog, cat, rabbit and fox. - Fully supports English language  Shapes and colors is a perfect kids game designed to help kids develop in a fun way. The game is also valid for kids with special needs such as autism. Ages: 1, 2, 3, 4 and 5 years old pre-kindergarten and preschool kids.  You will never find annoying ads in our apps. We are happy to receive your feedback and suggestions. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}