{
"name" : "Learn French with French Children's Stories",
"url" : "https://play.google.com/store/apps/details?id=com.apgems.learnfrenchshortstories",
"package" : "com.apgems.learnfrenchshortstories",
"category" : "Education",
"description" : "Learn French - Beginner Stories: Interlinear French to English (Learn French with Interlinear Stories for Beginners and Advanced Readers Book)  Do you want to learn French with real French Beginner Stories? Its easy with Free French childrens stories. 110 French Stories With the most important vocabulary to understand the content of the story French vocabulary and translated into English and Grow Your Vocabulary the Fun Way! so you can keep on reading.  Improve your French skills with and grow your vocabulary with these 110 French short stories!  he best part of learning a new language is experiencing the culture and diving into activities that will enrich your life and vocabulary. The best way to learn a new language is by reading, with short stories in French and in this French book you will find yourself turning page after page to get to the end of each captivating story that will engage your mind and help you improve your French.  110 captivating short stories that develop in circumstances such as traveling, personal relationships, among other topics that you will find easy to relate to.Learn French with Books.  The stories are broken down into manageable chapters, so you always make progress with the story.    Plenty of natural dialogues in each story that you would actually use in an everyday conversation, which will drastically improve your speaking and comprehension ability at the same time!  At the end of each chapter there will be a comprehensive guide specially by a vocabulary of some of the words from the story to make sure that you understand the story fully.    The Best French Childrens Books for French Learners with audio which will drastically improve your speaking and comprehension ability at the same time!   Enjoy with this app Learn French with French Childrens Stories ",
"desc_perms" : "[]",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.VIBRATE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'com.apgems.learnfrenchshortstories.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}