{
"name" : "Aprender ingles gratis",
"url" : "https://play.google.com/store/apps/details?id=com.language.english",
"package" : "com.language.english",
"category" : "Education",
"description" : "Aprenda el idioma ingls y use esta aplicacin para hablar y comunicarse en ingls. Puede ser utilizado por turistas o personas que quieran aprender ingls.  - Se puede utilizar sin internet. - Para principiantes y usuarios avanzados. - Las palabras y las oraciones estn agrupadas por categoras. - Puedes elegir y mostrar tus palabras favoritas. - Cada palabra se puede mostrar en ingls y en su idioma local. - Puedes escuchar cada palabra por una voz inglesa. - Zoom tu palabra para mostrarlo - Copia tu palabra y pgala por mensaje o email  Tambin puede utilizar esta aplicacin en muchas situaciones: - Pregunte por el clima y pronstico. - saber todo sobre animales en ingles - pedir una fecha o horario - comunicarse con la gente en la calle o en un pub - Obtenga informacin sobre las instrucciones para ir a algn lugar. - Comunicarte con un mdico si ests triste. - Ir al restaurante y obtener informacin sobre comidas y mens. - reservar una habitacin en un hotel - Obtenga el equivalente de los nmeros en ingls en su idioma. - Tomar el transporte y preguntar por ticket o destino. - ir de compras y comunicar - Obtener informacin acerca de las partes de su cuerpo. - Preguntar por tiempo y retrasos. - Obtener el significado de todos los pases en ingls. - expresa tus sentimientos en ingles - Obtener informacin sobre diferentes tipos de ropa y deportes. - Haz preguntas sobre lo que quieras. - Presntate a las personas que quieres discutir - Viajar y preguntar por hoteles o alquilar un coche. - encontrar o solicitar un trabajo en ingls - Comuncate sobre tu signo astrolgico. - saber todo sobre la parte de un coche  Puedes obtener muchas oraciones diferentes que pueden usarse en muchas situaciones Learn the English language and use this application to speak and communicate in English. It can be used by tourists or people who want to learn English.  - Can be used without internet. - For beginners and advanced users. - Words and sentences are grouped by categories. - You can choose and show your favorite words. - Each word can be displayed in English and in your local language. - You can hear every word by an English voice. - Zoom your word to show it - Copy your word and paste it by message or email  You can also use this application in many situations: - Ask about the weather and forecast. - know everything about animals in English - request a date or schedule - communicate with people on the street or in a pub - Get information on the instructions to go somewhere. - Communicate with a doctor if you are sad. - Go to the restaurant and get information about meals and menus. - book a room in a hotel - Obtain the equivalent of the numbers in English in your language. - Take the transport and ask for ticket or destination. - go shopping and communicate - Get information about the parts of your body. - Ask about time and delays. - Get the meaning of all countries in English. - express your feelings in English - Get information about different types of clothes and sports. - Ask questions about what you want. - Introduce yourself to the people you want to discuss - Travel and ask for hotels or rent a car. - find or apply for a job in English - Communicate about your astrological sign. - know everything about the part of a car  You can get many different sentences that can be used in many situations ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}