{
"name" : "StudyCloud - App",
"url" : "https://play.google.com/store/apps/details?id=com.studycloud",
"package" : "com.studycloud",
"category" : "Education",
"description" : "StudyCloud - Best Educational App for Maharashtra State Board Students class 1 to 10  As educators, our goal is to get students energized and engaged in hands-on E-learning experiences. The online education program is clearly an instructional medium that generates excitement.  Using sight and sound, the online education program StudyCloud is the perfect learning medium for students who are auditory or visual learners.  Our Offerings  StudyCloud provides study material based on prescribed textbooks as well as content that goes beyond the books, giving every child a large canvas to study from.   On our platform, fun-learning is facilitated by animated & image-based videos, detailed notes and last-minute revisions.   Our top-notch analytics system summarizes the childs practice tests, quizzes & full portion tests to create a Progress Report that helps guide the child through their strengths and weaknesses.   We have a team of professional educators solving the childs doubts in minutes.   Learn with your friends, by challenging them and seeing where you rank on the leader board.   Lastly, we also have an E-Library - a large collection of well-curated articles, for children to learn from.   Are you powered by an App?  StudyCloud also aims at being an online aggregator for various local private educators, classes and institutions, giving them a platform to make their content available to students across the nation instead of just their locality or city.   One can offer their own: -   Videos & Notes   Tests & Quizzes  Challenges & more   A portal to answer their students Doubts in minutes   An E-library section to pen your thoughts   Get featured in our Market place with your institutes name & a lot more.   We aim to abolish the physical barriers restricting quality education reaching everyone, making it available to every student anywhere and at any time.   Visit our website today to learn more: www.studycloud.in ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}