{
"name" : "Baby Panda's Care: Safety & Habits",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.habits",
"package" : "com.sinyee.babybus.habits",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   Baby Pandas Care: Safety & Habits is a habit development APP that can help children develop healthy lifestyle, learn how to live more safely and take care of themselves.   Dears, welcome to the city of baby panda! Kiki and his friends live healthily and happily here. Lets see what their healthy life is like?   After Getting Up Pick up the toothbrush, squeeze out the toothpaste, brush the teeth from left to right then top to bottom, and the bacteria are gone!  Breakfast is ready! But its too hot to eat. Use a fan to cool it down!   On The Way To School When coming across your friend, wave to him and say hello;  Only cross the road when the traffic light turns green;  Do not talk to strangers and refuse their snacks!   In The Kindergarten  Say thank you when accepting the biscuits from Little Rabbit;  Is the Little Penguin crying? Take out the toys and play with her to make her happy!  Dont be a picky eater when you have lunch, and wash your dishes!  Be careful when playing games, dont push around!   Before Sleep  Its late. Time to go to bed!  First go to take a bath and get rid of the bacteria;  Then put the toys and picture books away;  Turn off the lights and TV, go to bed and get up early to stay healthy!   In addition, children can learn how to take care themselves such as washing their own clothes, shoes, and socks, and how to protect themselves or escape in a disaster through Baby Pandas Care: Safety & Habits.   Download Baby Pandas Care: Safety & Habits, let your children grow up safely and healthily under the guard of baby panda!  Children can learn the following things through the life in the city of baby panda:  - Good hygiene practices;  - Healthy lifestyle;  - How to get along with friends and care for them;  - Safety knowledge in daily life;  - How to take care of themselves when disaster strikes.   About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}