{
"name" : "Little Panda Travel Safety",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.travelsafety",
"package" : "com.sinyee.babybus.travelsafety",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   How exiting! Our cute little panda, Kiki, is going outside with mama panda! However, he doesnt know potential danger is approaching. Can he stay out of risk? See the risky and emergency situations he might run into. Perhaps, you can give him a big hand! Download Little Panda Travel Safety and start learning safety tips with our little panda !  In Little Panda Travel Safety, we aims at help you, our little pandas fans, build basic knowledge of how to protect yourselves from any unsafe situation and how to react if such situations happened. We have included plenty of safety learning activities where you can learn lots of safety tips when you are in the lift, shopping mall, park, or even on the road, in a fun and memorable way.   Features:  Learn self protection techniques and basic rules of travel safety  4 independent scenes with fun interactions  Lively and entertaining animations  Easy concepts with child-friendly gameplay  An adorable little panda needs your help  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}