{
"name" : "Kids Zoo Game: Educational games for toddlers",
"url" : "https://play.google.com/store/apps/details?id=com.androbaby.kidszoogame",
"package" : "com.androbaby.kidszoogame",
"category" : "Educational",
"description" : "Kids learning game has three educative sections and include learning games for toddlers age 3. These are memory games for toddlers, brain games for toddlers and drawing games for toddlers. Boys and girls will love these games. Zoo games for kids is a unique game with lovely zoo animals.  All Preschool Games and Kids Games - Memory games for kids: Kids will make brain exercise by playing memory matching game with zoo animals. - Brain games for kids: Toddlers will practice by trying to find the correct zoo animal. - Drawing game for kids: Kids will draw on empty canvas or on different animal shapes. Kids coloring apps for toddler has different sections. They can use various colors for drawing and can save their drawings. This section is a doodle for kids.  - Toddler games for kindergarten kids have 3 baby zoo animal flashcard categories (wild animals, pets, farm animals) - Learning games for toddlers age 3 will allow your child to meet the basic farm animals (horse, donkey, cow, pig etc.), pets (cat, dog, hamster, parakeet etc.) and wild animals (lion, tiger, crocodile, shark etc.).  - Preschool games for little kids stimulates the childs senses through images, sounds and touch. - Professional pronunciation of words for childs correct learning different than other learning games for kindergarten free. - Nice animations and real sounds of animals with toddler learning games! - Zoo games for kids offline and no need for wifi.  Educational games for kids is not just another toddler learning game for kids. This game is ideal for parents and children to play and enjoy together. Playing is so easy that even a baby can do it without the help of an adult. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
}