{
"name" : "Smart Grow: educational games for kids & toddlers",
"url" : "https://play.google.com/store/apps/details?id=com.smartgrow.educationalgames",
"package" : "com.smartgrow.educationalgames",
"category" : "Educational",
"description" : "Learn numbers, colors, major shapes, differentiate between sizes and forms, develop minor motor skills and attentiveness, teach logical thinking, train reaction, inspire creativeness. A collection of beautifully designed Smart Grow educational games for children will help your kids of 1 to 5 years old do that while playing!   Smart Grow contains cute 18 educational games for toddlers and preschool kids with more being added regularly, all voiced by great talents that love to make products for children.  We do worship the taste of beauty and were confident it has to be developed from very first years of a child. Ideally every toy, every book, everything that surrounds a kid has to be beautiful. And we create our educational games for kids, girls and boys, from 1 years old to 5 years old with that idea and perception in mind.  Here is a short list of current Smart Grows games: * Collect the animals - develops logical thinking, hand-eye coordination, lets babies learn how animals look. * Sounds of Animals - helps 1, 2, 3 years old toddlers learn what animals say and how they look through play * Lead Animals  lets 1 to 3 years old children learn numbers and animals while playing * Animal Puzzles  helps girls and boys of 1 to 5 years old develop logical thinking and hand-eye coordination  * What Comes Next  develops advanced logical thinking  * Remember the Animals  helps toddlers and preschoolers train memory * World of Animals  introduces girls and boys of 1, 2, 3 years old age into the world of animals and trains hand-eye coordination * Matching Halves  learning real life objects and developing hand-eye coordination * Feed the Animals  develops hand-eye coordination and teaches animals * Cell Feeding  helps toddlers learn basic shapes and colors * Drawing Shapes  training hand-eye coordination and learning shapes * Amazing Space  teaching size perception, colors and Solar system planets at the same time! * Spot the Difference  help toddlers and preschool kids develop attentiveness  * Join the Dots  learns numbers and basic objects * Happy Coloring  develops creative spirit * Toy Sorting  lets 1, 2, 3 years old toddlers learn colors and hand-eye coordination  * Clap Hands  trains kids reaction * Home Decoration  inspires childs creativeness  Download Smart Grow for free now.  Let your kids learn through playing full of love and beauty games. All the educational games are suitable for girls and boys of 1 to 5 years old age.  *** This app features auto-renewable subscription Smart Grow Educational Games for 1 month, 6 months and 1 year featuring a 3-day trial. After the 3-day free trial subscription automatically renews. If you wish to disable subscription, go to Account Settings and disable Automatic Renewal. Subscription can be cancelled any time without any fees or penalties. Please, note that payment for any unused portion of subscription is not returned.   Please read our Privacy Policy and Terms of Use at https://smartgrow.club/privacy-policy ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.smartgrow.educationalgames.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}