{
"name" : "Miga Town: My Vacation",
"url" : "https://play.google.com/store/apps/details?id=com.miga.myvacation",
"package" : "com.miga.myvacation",
"category" : "Education",
"description" : "Miga Town:My Vacation,Welcome to the new world of adventure  drive your own car, start a new journey and search the island for great treasures. Be a real adventurer!  More interesting scenes and self-defined game-play help to create a more wonderful story!  Exploration Preparations for the journey begin at home. You can go to the beach to find out secrets of the island, or go to scenic spots to buy your favorite souvenirs, DIY your favorite masks, take your chance to win special souvenirs, and even take some photos at the spots.  Stay at the resort hotel for a few days, and each room will offer you a unique surprise.  Features - Six scenes: Home, Holiday Resort (Hotel Lobby, Deluxe Suite, 2 Themed Rooms), Beach & Island, Sightseeing Area  - Home: Your journey starts here, where you can find most tools that will be useful in your exploration. Remember to take them.  - Holiday Resort Hall: You will stay in a unique holiday resort and enjoy 5-star cuisines.  - Deluxe Suite: You can live in a deluxe suite with a super-large bathroom, fantastic sea view. You will get a mysterious key and fabulous costumes here.  - Themed Room: Choose your favorite between the flower fairy-themed room and car-themed room, and find the costumes exclusive to the room that you choose.  - Beach & Island: You can play games on the beach, explore the island, hunt great treasures and then take them to the sightseeing area for auction.  - Sightseeing Area: You can buy souvenirs at the gift shop and make your favorite masks. Many interesting scenic spots are waiting for you.   --Give full play to childrens creativity --Tens of billions of customized modes --No third-party advertising --No time limit or score ranking list  contact ussupport@xihegame.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}