{
"name" : "Tonara - Manage & Motivate Music Students to Play",
"url" : "https://play.google.com/store/apps/details?id=com.tonara.fame",
"package" : "com.tonara.fame",
"category" : "Education",
"description" : "Start using the worlds best studio management app for music teachers today, and see a 68% increase in your students at-home music practice.  Tonara is a free music app that helps music teachers manage their studio, motivate their students to practice their musical instruments more in-between lessons, and grow their music studio!   Music teachers/tutors can create music assignments, give rewards, and manage all their music students in one place. Music students can get feedback from their tutors, earn stickers, and enjoy their practice time playing on their favourite musical instrument.  Tonara supports different musical instruments such as piano, guitar, violin, recorder, drums, viola, flute, oboe, clarinet, saxophone, trumpet, trombone, and french horn. If youre a music tutor with music students who play on one of these musical instruments, Tonara will help you manage and motivate them with ease.   Join Tonara today, and your music students will have the chance to learn, practice and play their musical instrument even more! Take your piano and guitar lessons to the next level!   Features: * Manage all your music students on your digital dashboard  * Create personalised assignments and tailor practice goals for each student * Send fun animated practice reminders to your music students * Motivate your students with beautiful badges & stickers * Chat with students and parents between music lessons to keep them engaged * See each students last played status and music materials at a glance * Grow your business with additional remote music lessons   Tonara makes practicing music fun with rewarding interactions for your students. Music students can practice, record & upload recordings for you to listen to, and earn rewards as they progress from the very first time they pick up the instrument all the way to the concert hall. Tonara is the perfect music companion app for music teachers and music students.  Learning to play a new music instrument has never been so fun! If youre a music teacher, its time to make your students practice time more fun and enjoyable! Tonara is the perfect management app for teachers and future musicians who want to succeed in their daily music tasks.  Take your music teaching skills to the next level - Tonaras unique compare recording magically compares live music playing with original recordings uploaded by a teacher to instantly grade pitch, rhythm, tempo, and fluency.  If your a music student dont miss the chance to join the most advanced music practice app in the world! Start using Tonara today and increase your music abilities right now! No matter if you play piano, guitar, drums, violin, recorder or flute, we got you covered!   Music students - No matter which musical instrument are you playing, whether its piano, guitar, violin, recorder, drums, viola, flute, oboe, clarinet, saxophone, trumpet, trombone, and even french horn, Tonara will help you succeed with your music lessons right from the start.  Music classes can be hard for students, no matter if its a piano lesson, guitar lesson or a violin lesson. Tonara makes it easy for tutors to keep track of the performance of their music students and eventually increase their overall playing time at-home practice.  --------  Do you have questions, comments, or suggestions? Reach out to us at support@tonara.com ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'android.permission.READ_PROFILE', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.tonara.fame.permission.C2D_MESSAGE', 'android.permission.USE_FINGERPRINT', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.WRITE_CONTACTS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.RECORD_AUDIO', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}