{
"name" : "Target SSB",
"url" : "https://play.google.com/store/apps/details?id=com.codepur.ssb",
"package" : "com.codepur.ssb",
"category" : "Education",
"description" : "Target SSB is complete SSB (Service Selection Board) Guide having various:  1. SSB WAT- Word Association Test 2. SSB SRT- Situation Reaction Test 3. SSB TAT-Thematic Apperception Test 4. SSB OIR- Officers Intelligence Test 5. SSB GTO- Ground Officer Testing Exercises 6. Personal Interview Questions (SSB IO).  App is for NDA SSB, CDS SSB, AFCAT SSB, SSC SSB, TES SSB etc  There are two modes provided for exercises: 1. MANUAL: Candidate changes the questions. 2. TEST: Questions come automatically one by one.  WAT: Users are advised to take paper-pen and start writing sentence relate to each word. >>There are 60 words in each WAT test series >>With 15 Sec gap between each word (in test mode) >>After completing the test analyze your sentences and check where you can make improvements. With repeated practice, your speed and quality of sentences will improve.  SRT: Candidates are advised to take paper-pen and start writing their reactions relate to each situation. >>There are 60 situations in each SRT test series. >>30 Sec gap between each word (in test mode) >>After completing the test analyze your reactions and check where you can make improvements by giving a better and appropriate reaction, with repeated practice your speed and quality of reactions will improve. Instead of writing long and complete sentences prefer writing short sentences speared by colons in between.  TAT: Candidates are advised to take paper-pen and start writing their stories related to each picture >>There are 11 pictures and one blank picture in each TAT test series. 4min 30 Sec gap between each picture (in test mode) >>Observe the picture only for first 30Sec and write a story in next 4 minutes, after completing the test analyze your stories and check for these points: 1. The story should have a main character (Hero). 2. Show your qualities through that main character. 3. Choose the age and profession of the Hero what is evident from the picture. 4. Story Should be practical and if there is any problem/issue associated with your story it should get solved by the end of the story. 5. Avoid tough language, keep it simple and clear. 6. NEVER WRITE PRE DECIDED stories and the story should revolve around the elements of the picture. 7. Analyse the picture well in 30Sec and decide the theme.  SSB preparation app For: 1. AFSB Interview 2. SSB Interview 3. NSB Interview 4. TES/UES Interview 5. AFCAT/CDS/NDA SSB Interview 6. TGC/SSC SSB Interview 7. ACC/TA/SCO Interview.  All problems are unique in every test series This is for FREE of cost, feel free to give suggestions and ratings. More SRT and TAT will be available on next update Next update may also include answers to these SRTs, TATs and WATs Apart from SSB the app can also be used for Inter Services Selection Board (ISSB)  JAI HIND App created by- @chai.wala.ladka (Instagram) Chai wala ladka - Youtube channel ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}