{
"name" : "All-In-One Maths Formula Book",
"url" : "https://play.google.com/store/apps/details?id=com.gvapps.mathsformula",
"package" : "com.gvapps.mathsformula",
"category" : "Education",
"description" : "A Unique Maths Formulas and handy Calculator app for all students in high school or university and engineers to look for any easy or complicated formulas. Mathematics formulas app is specially designed for Junior College, Diploma & Engineering and students who want to study math formulas and revised chapters.  Calculator is an essential tool for your smartphone, simple and easy to use with a sleek design - the versatile calculator for Android.  Unit Converter feature with most important unit conversion(Supports both Metric and Imperial Units) including Acceleration, Angle, Area, Data conversion, Currency converter, Density, Distance, Length, Energy, Force, Fuel Consumption, Frequency, Mass, Weight calculator, Power, Pressure, Sound, Speed/Velocity, Temperature converter, Time, Torque, Volume units and many more...   Maths Formulas   Algebra Analytical Geometry Beta gamma Derivative Fourier Geometry Integration Laplace Numerical Methods Probability Number Series Trigonometry Vector Calculus Z-Transform   Disclaimer: The data collected is provided free of charge for informational purposes only, with no guarantee of whatsoever for accuracy, validity, availability, or fitness for any purpose. Use it at your own risk.  All names and images are copyrighted by their respective owners and are used in this app just for identification and educational purposes only.  Trademarks and brands are the property of their respective owners. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
}