{
"name" : "Car City Puzzle Games - Brain Teaser for Kids 2+",
"url" : "https://play.google.com/store/apps/details?id=com.minimango.games.puzzles",
"package" : "com.minimango.games.puzzles",
"category" : "Educational",
"description" : "Car City Puzzles is the perfect app for kids aged 2 to 5 who like brain teasers!   Packed with beautiful images of cars, trucks, air planes and other vehicles from YouTube Kids hit series Car City, kids will love revealing the pictures of this relaxing puzzle game!   Adapt the difficulty so that your little one overcome little challenges ! Play with 4 to 12 pieces and different original shapes: jigsaw, geometric, fractal and figurative pieces.   Kids will never run out of fun puzzles to solve and will discover new thematic collections with Puzzle of the Week  Our educational apps and games are created specifically to address the needs of preschoolers so that they can grow and learn in a safe environment.  Features: - 50+ puzzles - 20+ collections - 4 different shapes - 3 levels of difficulty - New puzzle each week  LIST OF ALL 20+ PUZZLE COLLECTIONS: - Adventures - Animals - Art - Baby - Boats - Christmas - Winter - Clean & Dirty - Food - Halloween - Medical - Music / Dance - Planes - Race - Roadworks - Soccer - Summer - Beach  To the parents: we want to make sure once your child enters the app, it is only to encounter fun & happiness. Thus, we require a parental code for any in-app purchase or external link. You can also purchase the apps full version to access all the games and exclude any in-app purchase redirection.  Mini Mango is a French app developing company devoted to create fun and interactive games specially designed for toddlers and preschoolers. We encourage kindness, autonomous exploration and experimentation. We would love to hear from you! Do not hesitate to contact us, follow us on Facebook at @MiniMangoApps or leave us a review - if you feel like it :) ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}