{
"name" : "AchieversNext: APPSC, TSPSC, RRB, SI PC, TET DSC",
"url" : "https://play.google.com/store/apps/details?id=com.spayee.rameez.reader",
"package" : "com.spayee.rameez.reader",
"category" : "Education",
"description" : "Achievers Next is the official App by Achievers Academy (AchieversNext.com) for exam preparation through Online Coaching Classes, Online Mock Test series for various exams like APPSC Group 1 Prelims, APPSC Group 2, APPSC Group 3 Panchayat Secretary, TSPSC Group 1, TSPSC Group 2, TSPSC Group 3, AP Police SI & Constable, TS Police SI & Constable, RRB NTPC, RRB Group D, TET, DSC & other government recruitment exams.  You can enroll in free online coaching course which includes preparation videos by previous Achievers, free current affairs videos, free online tests, etc.  Achievers Next App along with its website AchieversNext.Com by Achievers Academy offers online courses like  1. APPSC Group 1 Online Coaching Classes 2. APPSC Group 2 Online Coaching Classes 3. APPSC General Studies Online Coaching Classes 4. AP & TS SI & PC Prelims & Mains Online Coaching Classes 5 TSPSC Group 1 Online Coaching Classes 6. TSPSC Group 2 Online Coaching Classes 7. TSPSC Group 3 Online Coaching Classes 8. RRB NTPC Online Coaching 9. RRB Group D Online Coaching 10. Teachers Eligibility Test - TET Online Coaching  SALIENT FEATURES OF ACHIEVERS NEXT APP  - High Quality HD Video Lessons by Top Faculty - Learn Anytime Anywhere 24/7 - Watch our classes even without Internet on App - Chapter-wise study material prepared by experts - Online Practice Tests & Mock Papers - Can Watch Videos repeatedly - No worry of missing any Classes - Get Classroom experience in Online Mode  FAQS  HOW WILL THIS ONLINE COACHING BE CONDUCTED?  Video lessons will be recorded & uploaded on this website along with practice tests regulary. The entire course can be completed as a crash course at your own speed and the lessons can be watched till the date of exam. Alerts will be automatically sent immediately after uploading of lessons everyday.   ARE THESE LIVE CLASSES & WHAT IF ONE MISSES THE CLASS?  These video lessons are not live classes but are specially recorded so that these can be watched by the students anytime anywhere & any number of times repeatedly as per ones own convenient timings till the date of exam.  HOW DIFFERENT IS ACHIEVERS ACADEMY FROM OTHERS?  Unlike other Coaching centers in the market who teach in an academic way, the unique strength of Achievers Academy lies in its faculty who have already topped previous competitive exams conducted by UPSC, TSPSC, APPSC, RRB, SSC etc. and are well equipped to teach the candidates to approach the exam in a competitive manner and teach students exactly what is required to be successful in the exam.   HOW CAN ONE GET THE DOUBTS CLARIFIED?  Students can interact with the Instructors directly through Chat, Mail, Discussion Forum or Call on their Personal Mobile numbers without any hesitation to ask any subject related questions and clarify doubts    Please visit our website https://www.achieversnext.com or feel free to call us on 9966107515, 9966107516 to know more about our online courses listed above.  For latest updates, subscribe to our YouTube channel https://www.youtube.com/achieversacademy ",
"desc_perms" : "['android.permission.READ_CALL_LOG', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.MICROPHONE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'com.spayee.rameez.reader.permission.C2D_MESSAGE', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.MICROPHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
}