{
"name" : "SAT Math : Data Analysis Lite",
"url" : "https://play.google.com/store/apps/details?id=com.webrich.satdataanalysislite",
"package" : "com.webrich.satdataanalysislite",
"category" : "Education",
"description" : "Prepare to achieve the SAT scores you need to get into your top choice schools. Get ready for the test day with this most comprehensive app on SAT Math : Data Analysis, Statistics and Probability.  **NOTE: This is a lite version where in only few topics are available. All the remaining locked topics will be unlocked on buying the full version from within this lite version. It will be a one time purchase to unlock ALL the locked items in one go.  ~~~~~~~~~~~~~~~~~~~~~~~~~ Full version has 160 questions across 16 subtopics. ~~~~~~~~~~~~~~~~~~~~~~~~~  Features include:    HIGHEST QUALITY and QUANTITY  Over 160 questions and 16 revision notes in all just for Data Analysis, Statistics and Probability. High quality content written by experienced SAT tutors.    MOCK TEST  Mixed questions from all topics.    REVIEW WITH EXPLANATION  Review each question at the end of the test. Know the right answer with detailed explanation for each question.    PROGRESS METER  With our unique progress tracking feature including pie charts and bar graphs showing your progress, you know you are ready to take on the real test at the board when your progress meter says 100%.    REVISE BY TOPIC   1. Graphs & Data Interpretation Bar Graphs Circle Graphs (Pie Charts) Line Graphs Pictographs Scatterplots   2. Probability Basic Probability Independent Events Advanced Probability 1 Advanced Probability 2 Geometric Probability Probability Tree Diagrams  3. Statistics Arithmetic Mean Average of Algebraic Expressions Median Mode Weighted Average  Disclaimer: SAT is a registered trademark of College Board. College Board neither sponsors nor endorses this product or any of its content. ",
"desc_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE']",
}