{
"name" : "Scottie Go! Dojo",
"url" : "https://play.google.com/store/apps/details?id=com.becreo.scottiegodojo",
"package" : "com.becreo.scottiegodojo",
"category" : "Educational",
"description" : "Notice: To work with this application you have to first set up an account on the Scottie Go! Platform - portal.scottiego.com. To complete quests created in Scottie Go! Dojo, you will need cardboard coding tiles, included in the Scottie Go! educational sets.   Create your own adventure in the world of Scottie Go!  Scottie is an extraordinary little alien. What makes him really special is his thirst for adventure, thanks to which he keeps finding himself in the center of incredible events. Now this friendly alien puts his next adventures in your hands! In Scottie Go! Dojo every user has the possibility to create a quest for Scottie by e.g. choosing the quests environment, obstacles and designing a route which our hero has travel on the quest board. This way, users can select the programming concepts and skills they want to teach e.g. during specific classes or extracurricular homeschool activities. That is why this application forms an excellent basis for creating ones own teaching materials, which can be used during classes, after-school activities, tutoring lessons or extracurricular homeschool activities.  In Scottie Go! Dojo everyone can create and modify their own quests using all types of objects and environments for the Scottie Go! Edu application and more! Newly created quest boards can be subsequently shared via QR quest codes, generated in the application.   Scottie Go! Dojo can be used to: - teach basics of programming through fun, creative activities, - create and modify any quests, as well as quest boards for specific solutions (programs),  support learners development of logical and mathematical thinking skill,  support learners development of creative and critical thinking skills,  give pupils interesting, engaging and creative homework,  create ones own teaching materials,   develop quizzes and coding competitions for the evaluation of pupils knowledge and progress.   Our privacy policy can be found here: https://portal.scottiego.com/privacy/   Applications terms and conditions can be found here: https://portal.scottiego.com/terms/ ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
}