{
"name" : "Speak Polish - 5000 Phrases & Sentences",
"url" : "https://play.google.com/store/apps/details?id=com.funeasylearn.phrasebook.polish",
"package" : "com.funeasylearn.phrasebook.polish",
"category" : "Education",
"description" : "Play, Learn and Speak  discover common phrases for daily Polish conversation!  5,000 useful phrases for conversation.  Learn Polish in your tongue (60 languages available).  Best FREE app for learning fast.  Speak Polish Fluently in Real Conversations With Learn Polish application, you can now explore over 5,000 Polish phrases for short daily conversations while having absolutely pure fun! Whether youre a tourist having a vacation in an Polish speaking country or someone who just wants to speak a foreign language, this application will help you learn Polish phrases in a fast, easy and enjoyable way.  Why Our FREE App is Different  No internet connection required  play where you want and when you want (offline).  5,000 common phrases  audio pronunciations and phonetic transcriptions to show you how native speaker from Poland actually pronounce them.   11 fun games  a innovative approach to practice your listening, writing and speaking skills.  4 levels for learning: beginner, intermediate, advanced and expert.  20 topics divided into 145 subtopics  so youll know what and when to say each phrase.   Topics for Polish conversation: Greetings, Conversations with friends, Basic sentences, Travel, Transportation, Hotel, Restaurant, Food, Shopping, Work, Business etc.  More Features to Improve Your Polish Speaking Vocabulary  Search and bookmark your most common expressions from the phrasebook.  Earn points as your Polish skills progress and unlock all levels for free.  Random Categories feature to randomly select the topic, subtopic and game.  60 languages so you could understand and speak each phrase easily regardless of which country youre from.   About FunEasyLearn: Fun Easy Learn has developed many applications to help people around the world learn foreign languages for free. Fun Easy Learn applications improve your Polish skills: speaking, listening and grammar. The dictionary of the apps has human voice pronunciation for each common phrase to improve your speaking skill.  Speak Polish easily and fluently for travel, business or fun! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'com.funeasylearn.phrasebook.polish.permission.C2D_MESSAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}