{
"name" : "Preschool Games For Kids - Toddler games for 2-5",
"url" : "https://play.google.com/store/apps/details?id=com.queleas.preschoolgamesforkids",
"package" : "com.queleas.preschoolgamesforkids",
"category" : "Educational",
"description" : "How to Reinforce Your Childs Learning at home  Preschool Games for Kids was developed as a tool for parents eager to help their children learn new skills while playing in order to develop new skills for kinder including Math Games. Multiple studies show that the quickest and most effective way to learn new abilities is through hands-on play. Different homeschooling educational games systems including Montessori and Waldorf will agree that play and imagination are a fundamental part of the learning process. As a mother, I understand that our kids imitate our example. Even though we would like to sometimes isolate them from technology, its nearly impossible when we spend many hours a day in front of a computer or mobile devices. It is for this reason that instead of avoiding the elephant in the room, my husband and I developed games that will work as a learning tool that will stimulate our childrens curiosity. Perfect for Montessori Preschool Educational Games and Montessori Education  Develop New Skills  Preschool Games for Kids is a great place for kids to play while being constantly challenged to learn new skills for kinder with educational games. Kids need variety while training their new skills. These Toddler games for 2-5 year olds offer exactly that. We have tested all our kids games with our son and he absolutely loves them! This gives us confidence that your kids will also love these entertaining and mind challenging puzzles.    18 Homeschooling Preschool Educational Games that range from reading and spelling to drawing and shape recognition.   Spelling: 30 First words to learn reading and spelling. Kids Games for toddlers.   Shapes: A drawing tool to introduce children to basic shapes: Circle; rectangle; Square and triangle.   Coloring / Tracing: Educational games templates. From A to Z.   An introduction to shapes recognition and sorting of the following shapes: rectangle, pentagon, circle; oval; diamond; hexagon and square.   A shapes sorting game to help hand eye coordination while emphasizing the learning of shapes: rectangle, pentagon, circle; oval; diamond; hexagon and square.   Preschool Learning Educational Games for Toddler for 2-5 year olds in order to develop new skills.   Ages: 1, 2, 3, 4, 5, 6, or 7 year old.  Preschool Games For Kids  Homeschooling system  Education for Kindergarten Kids  1st Grade Learning Games  2nd Grade Learning Games  3rd Grade Learning Games  Educational Games.   Toddler games for 2-5 year olds  Were always excited to hear from you so if you have any feedback on how we can make this the best Preschool Game in town please send us an email!  We respect that parents may make different choices about technology for their families. We strongly encourage parents to discuss technology expectations with other families.   Familiarize yourself with the safety and privacy settings of this or any educational games from our store.  We encourage to use a parental control tool to help you monitor and limit your childs online activity, on all devices. However, be cautious: no tool provides perfect protection. Nothing can replace your personal attention and monitoring. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}