{
"name" : "Improve English Writing Skills",
"url" : "https://play.google.com/store/apps/details?id=com.minilab.HowtoImproveEnglishWritting",
"package" : "com.minilab.HowtoImproveEnglishWritting",
"category" : "Education",
"description" : "How to Improve English Writing Skills  Do you have trouble with punctuation? Are you always using commas instead of full stops? Is your spelling weak? Do you have difficulty filling in forms and writing letters? Then this app (How to Improve English Writing Skills) will help you improve the standard of your written English. It has been written in an easy-to understand way designed for use by anyone. Whether you are a student, school-leaver, foreign student, an employed or self-employed worker or someone at home, it should prove a valuable reference app.  The format is easy to follow with plenty of examples. At the end of each section there are exercises. Suggested answers are at the last (twelve button) of the app. Part 1 to 7 deals with the basic rules of grammar and punctuation identifying the various punctuation marks and showing how each is used. It also covers the parts of speech and demonstrates their uses. Part 8 to 11 shows you how to put Part 1 to 7 into practice. There are sections on essay writing, summarizing, writing reports and even plotting a short story. There are also chapters on letter writing, filling in forms, writing a CV and applying for a job. The use of e-mail has also been incorporated.  Feature of the apps 1. Discovering Grammar  2. Expanding your Knowledge  3. Polishing up your Punctuation  4. Paragraphing your Work  5. Checking your Spelling  6. Looking at Apostrophes and Abbreviations  7. Improving your Style  8.Writing an Essay and a Short Story 9. Summarizing and Reporting  10. Writing Letters  11. Making Applications   12. Suggested Answer   Shorting: letter writing paragraph formal letter report writing essay writing informal letter copywriter story writing thesis statement argumentative essay paragraph writing creative writing ghostwriter complaint letter business letter notice writing article writing diary entry essay typer email writing my mother essay dialogue writing research proposal reaction paper writing skills persuasive essay narrative essay script writing business proposal academic writing speech writing topic sentence technical writing ielts writing cursive capital letters formal letter writing precis writing english writing descriptive essay diary writing official letter write a letter to your friend descriptive writing cohesive devices discipline essay letter writing in english feature article summer vacation essay informal letter writing story writing in english writing prompts personal statement letter writing paragraph formal letter report writing essay writing informal letter copywriter story writing thesis statement argumentative essay paragraph writing creative writing ghostwriter complaint letter business letter notice writing article writing diary entry essay typer email writing my mother essay dialogue writing research proposal reaction paper writing skills persuasive essay narrative essay script writing business proposal academic writing speech writing topic sentence technical writing ielts writing cursive capital letters formal letter writing precis writing english writing descriptive essay diary writing official letter write a letter to your friend descriptive writing cohesive devices discipline essay letter writing in english feature article summer vacation essay informal letter writing story writing in english writing prompts personal statement    Disclaimer: The data collected is provided free of charge for informational purposes only, with no guarantee of whatsoever for accuracy, validity, availability, or fitness for any purpose. Use at your own risk. This app has no affiliation or relation with any of social media brands.  App link: https://play.google.com/store/apps/details?id=com.minilab.HowtoImproveEnglishWritting ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.minilab.HowtoImproveEnglishWritting.permission.C2D_MESSAGE', 'com.sec.android.provider.badge.permission.READ', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}