{
"name" : "French for Beginners: LinDuo HD",
"url" : "https://play.google.com/store/apps/details?id=com.lin.duo.hd.french",
"package" : "com.lin.duo.hd.french",
"category" : "Educational",
"description" : "ADVANTAGES OF OUR APP: * Audio pronunciation by native speaker (French or Canadian) * 1657 words split into 116 topic lessons * Does not require permanent Internet connection * Beautiful illustrations for each word * Dark interface to study at night * Choose from male and female voice * Choose learn words with articles or just words * Dynamic lesson difficulty * Game True or False to review pas material * Special lessons with favorite, difficult, old, random words * Flexible sound settings (music, announcer, effects) * Just 10-15 minutes per day to learn all words * Suitable for both adults and children  Only 10-15 minutes per day Spending just a 10-15 minutes every day, will easily allow you to remember all useful French words. While memorizing words, the frequency of lesson is more important than duration of each lesson. 10 minutes every day during a week will be more productive than one hour lesson but once per week.  One minute lessons Taking into account busyness of modern life, we designed each lesson in the way so it would never take more than one minute to complete it! So you no longer need to search for a free time to practice French! Simply, once you get a chance, launch app and do one lesson at a time =) Short sessions will not affect efficiency of word memorization.  Only useful French words French for beginners LinDuo HD is a free and quick start to learn French language! Unlike others, we have only the most useful words, which are divided into 116 topic based lessons. Quality is here!  Teach-yourself French is design so it will use your visual and echoic memory to help you memorize French words fast and easy!  Special illustrations We use only specially developed info-graphics (developed by psychologists), so your eyes can quickly identify meaning of word or action without stressing them with small unnecessary details.  Word pronunciation by native speakers Our app will help you master pronunciation of French words! Each word is recording by professional native speaker! Additionally, in the settings you can choose between male or female voice.  Dynamic lesson difficulty The app changes lesson difficulty gradually as you progress. To achieve this, it keeps stats for EVERY word! Example: in the spelling mode, initially you need to insert several missing letters in a word, then create a word having extra letters and finally, when you are ready, you will need to type the entire word on the virtual keyboard.  Modes for quick learning App includes four additional lesson types which are made of favorites, difficult, old, random words. You can add any word to your favorite list and later create custom lesson from your favorites. Words are automatically added to difficult (the ones you struggle to memorize) and old (which you have not reviewed for a long time) sections. A random mode will create a unique lesson.  Additional features Thanks to your reviews, we are constantly updating app to make it better! To help you take care of your eyesight, with just one tap, you can activate night mode. If temporarily you do not have internet access, no problem! App can work offline as well!  Review Past Material Many good apps do not pay enough attention to review past material! For this purpose we created word game True or False. It is very simple, but addictive, and the most importantly, it helps to repeat past material and never forget it!  SUPPORT AND CONTACTS If you have any questions or suggestions, please never hesitate to send us email admin@lin-duo.com or use the contact form which is built into app. We are always happy to answer your questions!  Thank you very much for your trust and choice! If you like our app, do not forget to share it with your friends in social networks. Learning French words together is more fun than alone! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}