{
"name" : "Translator App Free - Speak and translate",
"url" : "https://play.google.com/store/apps/details?id=com.freevoicetranslator.languagetranslate.speakandtranslate",
"package" : "com.freevoicetranslator.languagetranslate.speakandtranslate",
"category" : "Education",
"description" : "Free Translator 2020: Voice & Language Translate simple app where you can easily speak & translate languages into desired languages. Use the translator app every day for business, travel, and education. It will help you to learn the language.  The live text translates, words, and sentences in your native language rapidly. Simply speak and translate in all languages from more than 100 languages used in the translator app. Language translator 2020 is a perfect translator app that allows you to speak translates into text in all languages spoken in the world.  Camera Translator with a voice translator Download Photo translator freely from play store and get speech to text converter using this most popular audio to text converter & voice translator free app. image translator & language translator freely provides accurate speech-language & voice translator tools in one language translator free app so that you can easily translate the conversation in languages of different countries. Now you can translate text, words, and phrases can get instant speech translation with the best audio translator to text translation app. Text Translator Translate now all language translation messages and voice messages with audio to text translation and share the translation on social media networks. Voice & language translator app provides convenient and simple speak translate methods where you can easily speak and write words to translate in any language. You can understand speech translation app with a clear sound so text translator is very easy to learn all the languages with translation. Audio to Text Translate Free Translator 2020: Voice & Language Translate immediately install speech to text converter app on your Android device and get a translator for all languages in one universal translator app. If you are a student, traveler or tourist and looking for audio to text converter with smart camera translator. Language translator live English translator app will help you to learn the native language of a particular country. Just type or speak words and text to translate for any language quickly using audio to text converter app. Speech Translation Free Translator 2020: Voice & Language Translate app provide you to speak and translate languages words, sentences, text and voice translator online. New Voice language translator & speech to text converter 2020 is the best language converter tool among voice translator & language translator apps for all language having several unique accurate speak & translate functions with the reliable English translator dictionary. Text to Voice Converter Read loudly 2019 app you will convert your text with given above languages.  You will get text typing, words speaking, camera translator lives, and language scanner translator all in one voice translator free app. Learn national & international languages with camera translator online, some important languages are listed below!  English languages are included in Speak translator & voice Translator app. Features of Free Translator 2019: Voice & Language Translate: Text to speech translation Speech to text and text translator  Simple audio to text converter translator Translate image text with Multiple Language Voice Translator translate in multiple Language English to Spanish translation is really quick & easy for us Share image translate, words & documents with friends Complete free speech to text converter with daily words dictionary 2020 Easy understandable voice & language translator to listen to text in crystal clear voice Allow different translation ways like speaking words, typing text or capture text with the camera Language translator - Fast Easy access immediate translation ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}