{
"name" : "Skazbuka. English for kids.",
"url" : "https://play.google.com/store/apps/details?id=com.zebrainy.abc.rus",
"package" : "com.zebrainy.abc.rus",
"category" : "Educational",
"description" : "The first introduction to English! Educational application for children 2-10 years old. Game-quest for 26 magic worlds of the English alphabet - abc. Imagine: your child plays the alphabet every day, and six months later knows the entire English alphabet and 250 new words! Hows that?  Your child can play and learn English at the same time in a long trip, in queue to the doctor, in a quiet evening at home - everywhere.  Now lets boast ourselves a little. Skazbuka. English for children is: - Best game for kids, Best sound , Best Art according to the INDIE PRIZE in the US and UK. - 80 animated characters: animals, fairies, robots. - 26 letters of the English alphabet - 26 magic worlds. - 250 first words to learn English. - 12 tales of Leonardo Da Vinci.  And also: - Storyteller in the game says the voice of an actor of theater and cinema, the star of the TV series Interns Vadim Demchog. - Music by British composer Paul Mottram. - The daughter of billionaire Igor Rybakov started to learn English with the app Skazbuka. English for children.  A special atmosphere in the game is created by the melodies of the British composer Paul Mottram. He worked on the films: rain Man, Chaplin, Jasmine, in the television projects of the TV channels Discovery and BBC Tree.  The main character of the game-Rainbow Zebra. It must rescue her friend from the enchanted world. And in which of them it was stuck, you can find out only by starting to play. Heroes of the game gently touch the inner world of the child, affect his feelings, will contribute to the development of his imagination.  The transition to the next magic world of a new letter occurs after the baby performs the task: from memory collects the letter. Moreover, with each new letter, this process becomes more complicated. But do not worry, the invisible good storyteller will always tell you what to do and praise! The child with great passion will collect the letter from the glowing miracle balls, and, without noticing, will improve the personal result.  Each new level adds the vocabulary of the baby and gradually forms his worldview. A child learns for the first time what a toy factory, a theatrical backstage, a space kitchen is.  When the player reaches the letter Z, he gets the first magic book. This is the key to the trap that the second Zebra fell into. To activate it, you need to go through all the letters again. At this stage there is a repetition of the material and a deeper memorization of vocabulary.  There is a surprise for parents in the application: hidden in the game references to cartoons and games that they were passionate earlier for themselves. Search for them and nostalgic  But know that the kid will defend his right to enjoy the game. So do not delay long. Better yet, go and mind your own business.  You can safely leave your baby playing alone. Be sure that you have 40 minutes of free time. And the child will have 40 minutes of an exciting quest, from which he will come out the winner.  Make a gift to your child! Give him a fairy tale with him in the lead role! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}