{
"name" : "Gwakkamole",
"url" : "https://play.google.com/store/apps/details?id=com.CREATELab.Gwakkamole",
"package" : "com.CREATELab.Gwakkamole",
"category" : "Educational",
"description" : "Gwakkamole is a game designed to train inhibitory control, a subskill of executive functions. Inhibitory control involves being able to control ones attention, behavior, thoughts, and/or emotions to override a strong internal predisposition or external lure, and instead do whats more appropriate or needed (Diamond, 2013).  Players need to smash avocados that have no hat or that tip their hat but avoid smashing avocados with spiky hats or with electric hats.  How does this support learning? Executive functions refer to a set of top-down, goal-oriented cognitive processes that enable people to control, monitor and plan behaviors and emotions. Miyake and Friedmans model supports a unity-and-diversity view of EF in that it incorporates the three distinct but related components of EF: inhibitory control, task-switching and updating (Miyake et al., 2000).   What is the research evidence? Our research suggests that Gwakkamole is an effective way to train inhibitory control. Homer, B.D., Ober, T., Rose, M., MacNamara, A., Mayer, R., & Plass, J.L. (2019). Speed Versus Accuracy: Implications of Adolescents Neurocognitive Developments in a Digital Game to Train Executive Functions. Mind, Brain, and Education, 13(1), 4152. DOI: 10.1111/mbe.12189   Research has found that EF is related to performance in literacy and math along with long-term gains in school performance and academic readiness (Blair & Razza, 2007; Brock, Rimm-Kaufman, Nathanson, & Grimm, 2009; St Clair-Thompson & Gathercole, 2006; Welsh, Nix, Blair, Bierman, & Nelson, 2010) and that disparities in EF among preschool children from low-income versus high-income homes may contribute to the achievement gap (Blair & Razza, 2007; Noble, McCandliss, & Farah, 2007).  This game is part of the Smart Suite, created by New York Universitys CREATE lab in collaboration with the University of California, Santa Barbara, and The Graduate Center, CUNY.   The research reported here was supported by the Institute of Education Sciences, U.S. Department of Education, through Grant R305A150417 to the University of California, Santa Barbara. The opinions expressed are those of the authors and do not represent views of the Institute or the U.S. Department of Education. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
}