{
"name" : "Spoken English App",
"url" : "https://play.google.com/store/apps/details?id=com.octo.learnerapp",
"package" : "com.octo.learnerapp",
"category" : "Education",
"description" : "Do you want to learn Spoken English easily? You are one step closer to your goal by choosing the Octo Spoken English app to learn English speaking and become confident in Spoken English. Now you can learn English Speaking quickly by learning and practicing spoken English in various real-life scenarios on your phone with confidence. Continue Speaking English fluently on the app daily from day one. Right here, right NOW by downloading the app.  Learn English to interact with your child. Learn English to do well in a job interview. Learn English to talk in English with teachers in Parent-Teacher meetings. Learn English to avoid the embarrassment of not being able to speak in English. Learn English Speaking fast as youve learned your native language as a kid. We are here with the best English Speaking learning app, trusted by millions of our users, which will improve your English Speaking. The app will help you learn English Speaking at home or comfortably anywhere.   Octo being your personal English Teacher, Trainer, Tutor, Guru or AI-based friend Avatar helps you in improving your Spoken English in just a few days, available for 24x7 to help, converse, English speaking practice and solve your doubts about learning English Speaking or English basic knowledge and improve your spoken English.  Learning English with the Octo Spoken English app is easy and fast even if you are a Hindi speaker. Not only can you improve your English vocabulary, English grammar but you will also be able to speak English fluently step by step. You will get to practice on spoken English, English grammar topics, vocabulary building, and conversational English  Octo app will provide you live learning experience in live Mentor class through live video class and practice your spoken English in App class. You will be able to practice English Speaking every day by talking with our intelligent avatar in English, who will take care of all your needs, whether it is English vocabulary or English grammar, and yes, particularly speaking English and Reading.   Octo app is designed to give confidence to Hindi speakers who practice and learn Spoken English through Hindi. English Speaking from Hindi to English be it that you are just starting to learn English Speaking or you already knew a little bit but was not that confident in Speaking English. You will start Speaking English fluently step by step as you progress in our app.      English   confident and fluent   ,        start learning English Speaking with Octo App. Engish   with Octo Spoken English App.  Lets check out what makes the Octo Spoken English App better than other English speaking apps.  Features:-  Interactive Live Video Mentor Classes, here you actually get to learn from teachers in live classes, do English learning, and solve your doubts on our English learning app.   A huge collection of relevant real-life scenarios to learn and improve your English conversation skills, and also practice improving your English Speaking from story method   Get scored on how you speak by our AI-based Speech Scoring Engine  & improve English Speaking skills in a very short time on English learning app   Enhance your confidence by English Speaking with the AI-teacher Anita and practice your English speaking on Mic to learn the right pronunciation and accent required in English speaking.  Improve your English Vocabulary by tapping words and see the meaning feature like in the English dictionary.  Improve your Pronunciation & enhance your English Speaking skills with quizzes and puzzles.   Automatically learn grammar, as you imitate, converse, and practice on the English learning app.  Daily Practice with Daily Live English Quiz, Words of the day, Find Mistakes & Learn, and Sentence Master ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.READ_INTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.BROADCAST_STICKY', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.VIBRATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.CALL_PHONE', 'android.permission.RECORD_AUDIO', 'us.zoom.sdkexample2.permission.KUBI_MESSAGE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.octo.learnerapp.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_INTERNAL_STORAGE', 'us.zoom.sdkexample2.permission.KUBI_MESSAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}