{
"name" : "Learn Spanish. Aprender Español | Spanish app",
"url" : "https://play.google.com/store/apps/details?id=com.linguist.es",
"package" : "com.linguist.es",
"category" : "Education",
"description" : "Learn Spanish by immersing yourself in a world of interesting, authentic Spanish content! With LingQ, the smart Spanish app.  Start with easy beginner lessons but quickly progress into learning Spanish from real, compelling material. 1000s of hours of Spanish lessons, podcasts, audiobooks, interviews and more, all with transcript. LingQ, the smart Spanish app, even lets you import Spanish news articles and learn Spanish for free from any content you find on the web! Start your Spanish language journey today!  Listen and follow along in the text while learning Spanish (espaol). Look up and save new words and phrases to your personal Spanish vocabulary database. Track which words and Spanish verbs you know and which words are new to you. Watch your vocabulary, your Spanish grammar knowledge, and your avatar grow! Track all your Spanish learning activities including listening time, words of reading and more. You will learn how to speak Spanish in no time!  Review and learn Spanish vocabulary in context using our proprietary Spanish SRS review tools. Register your account and have your data synced to our web application as well so you can study on the web along with on multiple devices. The LingQ app also lets you learn Spanish free offline and syncs up when you get back online. This lets you take advantage of dead time and short breaks throughout the day to spend more time with your Spanish.  No other app will take you as far. LingQ will teach you how to speak Spanish (espanol) in no time!  Features: * 1000s of hours of downloadable Spanish audio files all with transcript * Look up and save Spanish vocabulary using multiple integrated dictionary resources * Review your vocabulary using our SRS review system * Track how many Spanish words you know, which words are new & which you are learning * Keep all your learning statistics including listening and reading time * Use the Playlist to easily listen to all your current Spanish lessons while on the go. * Sync word data, playlist data and lesson data to the web and across devices * Study Spanish offline and update data when back online *Receive notifications for all LingQ activities from web or mobile including forum and exchange activities from the web * Manage all your Spanish vocabulary * See your Spanish learning targets and measure your progress * Watch your avatar grow as your Spanish level grows  Built by language learners for language learners!  LingQ Co-Founder, Steve Kaufmann, one of the worlds leading polyglots, has learned 15 languages using this approach. Steve is the Godfather of language learning  Get Spanish language learning tips from Steve at his: Blog: blog.thelinguist.com YouTube Channel: www.youtube.com/user/lingosteve  ACCELERATE YOUR LEARNING WITH LINGQ PREMIUM  Unlimited LingQs - Look up & save all new words and phrases in our reader  Word Tracking - Track known words, new words to accelerate your learning  Unlimited Vocab Review: SRS (spaced repetition system)  Unlimited Imports - Import & study text from the web  50% off Tutoring on the web  ------- Feedback? Let us know. Send suggestions and feedback to apps@lingq.com.  You can also visit us on www.lingq.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}