{
"name" : "Kids Plane Wash Station And Repair Garage",
"url" : "https://play.google.com/store/apps/details?id=com.hts.plane.wash.salon.games",
"package" : "com.hts.plane.wash.salon.games",
"category" : "Educational",
"description" : "Kids get ready for another exciting adventure of dirty plane wash workshop garage. Lets start plane cleaning service and learn what to do for an airplane maintenance. Everyday cleaning and repairing is a very important part of keeping the plane in a good condition.  So kids lets become the owner of your own little garage and start your adventure of plane wash repair garage. Lots of responsibilities of kids plane wash cleaning service will give you hours of fun of kids plane garage and plane workshop station  After the long day duties the kids plane get dirty and it look very bad. You cant enjoy flying in a dirty plane. So first you have to clean it, give a lovely touchup and makeover. This kids garage airplane repair shop is loaded with different tools, which a little mechanic can use to make the look of muddy and dirty plane very beautiful.  Different airplanes will come to your little garage wash salon. Perform your duty as a plane mechanic and give the best plane wash repair garage service. Many tools of plane clean up will help the little garage mechanic to perform a great job of plane wash salon. Enjoy the plane wash garage by blowing the autumn leaves from the plane, removing the branches, washing the dirty plane thoroughly and cleaning the mud.  Plane maintenance is also very important for the proper kids plane clean up and airplane repair. Have wonderful experience from dirty plane wash polishing procedure and give the plane a shiny look. Clean up the plane vehicles completely, repair them and give a stunning look in your workshop garage wash salon and become the best kids plane mechanic in town   When you complete your job of kids plane wash workshop garage then its time to fly the plane. Have bundle of fun from flying in your own neat and clean plane. Lets become a good pilot, enjoy the flying and spread the sparkles. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}