{
"name" : "Spanish Learning App - Busuu Language Learning",
"url" : "https://play.google.com/store/apps/details?id=com.busuu.android.es",
"package" : "com.busuu.android.es",
"category" : "Education",
"description" : "Join 100 million Busuu users waiting to help you learn Spanish!   Become a member of the Busuu community and have your speaking and writing exercises corrected by native speakers. Plus, you can help others in your native language!   FEATURES  Learn Spanish basics with vocabulary & grammar units, audio dialogues, language games and interactive tests.  Submit practice exercises where native speakers will help you perfect your skills.  Set yourself a personalised goal to ensure you are reaching your learning objectives.  Personalised to fit your style of learning, ensuring you become proficient in the shortest possible time.  Learn the most important 150 topics and 3000 words, specific language training.  Test your knowledge with fun quizzes and word games to see how much you have learnt.   SUPPORT & FEEDBACK Language learner, are you having problems or do you simply just want to help improve the product with your feedback? Please, visit our help centre at https://busuu.zendesk.com/hc/en-us or contact us directly at team@busuu.com.  We are more than happy to answer all the questions and solve any issues, so make sure you contact us before leaving your rating.   MEDIA NEWS Forbes  Quicker, Smarter, Better New York Times  easy to use & feels cheerful Google  Must Have App BBC  easier way to learn   FOLLOW US Language learning is not only about practice, make sure you follow us on social media and on our blog. We will share a lot of tips, tricks and language games!  Facebook: https://www.facebook.com/busuucom Twitter: https://twitter.com/busuu Google+: https://plus.google.com/+busuu Blog: https://blog.busuu.com Website: https://busuu.com   OTHER INFORMATION Our Spanish language learning app is available in English, French, Spanish, Portuguese, Italian, German, Polish, Japanese, Turkish, Russian and Chinese as interface languages. Its available in all countries, and regardless of whether youre using your smartphone, tablet or computer.  Learning Spanish is easier than you think, so download the busuu app now and start working on your Spanish pronunciation, grammar and vocabulary right away! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.USE_CREDENTIALS', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.busuu.android.PAYMENT_BROADCAST_PERMISSION']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'com.busuu.android.PAYMENT_BROADCAST_PERMISSION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}