{
"name" : "Frederick: Learn to Read",
"url" : "https://play.google.com/store/apps/details?id=com.englishanyone.frederick2",
"package" : "com.englishanyone.frederick2",
"category" : "Education",
"description" : "Frederick lets speakers of ANY language learn to read, spell and pronounce English through play, all in English! No translating or memorizing!  Because traditional English programs are boring, confusing and ineffective, many English students struggle to become confident, fluent readers and speakers.  So we removed everything that makes these old methods frustrating and made a NEW way for students to teach THEMSELVES, THEIR way! With Frederick, you can correct your mistakes instantly and develop all of your communication skills as fast as you like. Its like having a native English teacher with you wherever you go!  How Frederick Works:  You move step-by-step through the reading levels of PHONICS (the rules of pronunciation)  also learning SIGHT WORDS (words that break pronunciation rules)  from the alphabet and single sounds to words and full sentences.  In each levels Explore Mode, you DISCOVER the rules of phonics, spelling and pronunciation by making different letter combinations. You learn the real, native pronunciation of words, understand meanings with icons instead of translations, and increase your vocabulary.  Then you test your knowledge and skills with different games. Winning proves youve mastered a lesson!  Theres a Word Bank where you can see all of the words youve found, and you can also unlock all levels and modes with Teacher Mode.  Frederick works offline, and you can easily track progress with word counters and rewards!  The first 3 levels are FREE:  1. the alphabet (Aa, Ba, Cc) 2. short vowels and consonants (at, in, up) 3. three-letter words (cat, bug, pig)  Pay the one-time upgrade fee to get instant access to levels 4-35. (Upgrade within the first 30 minutes of using Frederick and get 50% OFF!)  4. consonant blends (CRab, STop, deSK) 5. consonant digraphs (CHip, SHip, loCK) 6. ng, nk (riNG, siNK, taNK) 7. al, all, el, ell, il, ill, ul, ull, le (bALL, mILk, jungLE) 8. magic/silent e (lakE, linE, modE) 9. long A (rAIn, mAIl, pAY, EIGHt...) 10. long E (sEAl, mEAl, bE, fIEld, candY, kEY...) 11. long I (pIE, tIE, hIGH, wIld, kInd, flY...) 12. long O (bOAt, gOAt, lOW, gO, fOld, vOlt...) 13. long U (news, boot, clue, fruit... 14. aPPle (eGG, PHone, QUit... 15. dOg (cAUGHt, bOUGHt, frOg, wALk... 16. brEAd (hEAd, rEAd, swEAt... 17. cOIn (bOIl, cOIl, bOY, jOY... 18. bOOk (cOOk, fOOt, pUll, pUsh... 19. clOUd (OUt, cOUch, cOW, dOWn... 20. cactUs (About, Alone, tokEn, pandA... 21. sYrup (crYstal, phYsics, sYstem... 22. City (Cell, Cobra, Gem, draGon... 23. cAR (bAR, cARd, shARp, tARt...) 24. chAIr (hAIR, pAIR, cARE, shARE...) 25. EAR (gEAR, fEAR, lEER, pIER...) 26. bIRd (hER, pEARl, wORk, sURf...) 27. fORk (fOR, bOAR, dOOR, fOUR...) 28. sensitIVE (actIVE, elusIVE, negatIVE...) 29. sWAn (sWAt, WAtch, QUAlity, sQUAt...) 30. miX (fiX, EXam, EXcellent, EXpel...) 31. likED (votED, callED, lookED...) 32. canS (wishES, brickS, callS...) 33. vulTURE (culTURE, sURE, meaSURE...) 34. quesTION (convenTION, educaTION, equaTION...) 35. siGN (GNat, KNee, coMB, WRap...)  Frederick Is Perfect For:  Adult English language learners who want to understand the rules of spelling and pronunciation so they can quickly reduce their accent and understand natives more easily.  Teachers and parents (even those with NO EXPERIENCE teaching reading) who want a simple, natural and fun way to teach kids or adults to read, spell and pronounceEnglish. There are no confusing instructions in Frederick, and theres no system to learn, so even a two-year-old can use this simple tool all by themselves!  Learn more: http://frederickreadingapp.com/  Have questions or need support? Mail us: info@englishanyone.com  Thanks so much for trying Frederick! We hope you like it. :) ",
"desc_perms" : "['android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING']",
}