{
"name" : "QA Beyond",
"url" : "https://play.google.com/store/apps/details?id=com.qa.application",
"package" : "com.qa.application",
"category" : "Education",
"description" : "Looking to get certified on Amazon Web Services, Microsoft Azure, or Google Cloud Platform? Want to become more knowledgeable about DevOps, containerization, or serverless? At QA, we help you master the most important cloud computing technologies to acquire the skills you need to boost your career.   The QA app for Android offers a complete learning experience available anytime, anywhere.     Our training courses cover the major cloud platforms including Amazon Web Services, Microsoft Azure, and Google Cloud Platform, as well as emerging best practices in DevOps, containerization, serverless, and more. We guide your learning with direct access to all of the tools you need to build your knowledge base, test your skills, and prepare for cloud certification using our expert-led video courses, interactive quizzes, and dedicated learning paths, available online, 24/7. Whether youre new or an experienced professional, we have everything you need to prepare for the following certification exams: * AWS Certified Solutions Architect - Associate * AWS Certified Solutions Architect - Professional * AWS Certified Developer - Associate * AWS Certified SysOps Administrator - Associate * AWS Certified DevOps Engineer  Professional * Azure Developing Solutions 70523 Certification exam * Qualified Solution Developer Certification for Google Cloud Platform  Why QA for Android  * Certification prep: Prepare for your upcoming AWS, Azure, or GCP certification with over 150 expert-crafted questions designed to test your knowledge on the go.  * Extensive training library: Get full access to the QA library, including courses, quizzes, and learning paths.  * Available offline: Youll never lose your progress. Our courses and quizzes are accessible offline for your convenience.  * Professional development: Track your progress and identify the next skills that you need to learn.  Ready to Get Started? Upgrade Your Career with QA Today!  At QA, we want to help you accomplish your career goals. Whether you want to pass a certification exam or prepare for a job interview, were here to help! Download the QA app today to get started on your personal learning journey.   Privacy policy https://app.qa.com/privacy-mobile/  Terms of use https://app.qa.com/terms/  QA Support http://support.app.qa.com/hc/en-us/sections/201427726-MOBILE ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}