{
"name" : "IELTS Exam Preparation",
"url" : "https://play.google.com/store/apps/details?id=com.english.learnword.allielts",
"package" : "com.english.learnword.allielts",
"category" : "Education",
"description" : "Since the 60s organizations used the  International English Language Testing System  (IELTS) test to measure the English language ability of non-native speakers wishing to for immigration or enroll in English-speaking universities. IELTS Exam Preparation is the app that covers the most important words used for the real IELTS exam . The list of words were carefully selected by language experts and if these are mastered, chances of a successful IELTS test pass are very high.  Each of the 5000+ IELTS vocabulary comes with full definition, sample usage, phonetic/sound pronunciation and much more details as included in the Oxford dictionary. You can learn these words and take language tests to see how well you understand them. Youll learn words faster as this IELTS Preparation app uses different types of quizzes to make learning interactive. It includes IELTS listening exercises, helps you with IELTS reading practice, IELTS writing and IELTS speaking.  Main Features:  IELTS Vocabulary with 5000+ Words. This app has a vocabulary with 5000+ words used in the IELTS test. These are neatly divided in 4 different categories to easily study and manage (New Word,New Learn Word, Remembered words, Not Remember Word).  Easily Learn the Words. Each word in the IELTS dictionary can be easily learned. Tap on each word to listen how it is pronounced and also read a detailed description. Once youre ready to start learning it, you will need to type it 4 times. The first 3 times youll have suggestions (auto-complete), but the last time youll need to type it in correctly to be marked as learned.  Test your Vocabulary. For an effective study you will need to test the newly learned words. There are 4 different types of tests you can take: type/choose a word based on the presented description, pick a description that matches a word, use scrambled letters to create a word based on a description and lastly listen and type the word. These tests simulate partially the real IELTS test.  Word Training. You can also train for a set of words to see how well you master them. The difference between training and testing is that during training you wont be penalized if you get some wrong answers. This allows you to practice words for the real IELTS exam without any pressure.  Daily New Words. The only way to truly learn is persistence! The app helps you learn every day by teaching you some new words. It will also show a push notification to remind you that it is time to study. You can change the number of daily new words show in the app settings. For extra help you can enable an online spell-checker to verify words as you type them.  Random Test. Every now and then (randomly) the app will ask some questions to check your vocabulary knowledge. These random language tests are a great quick study method to remember what you learned.  IELTS Exam Preparation is an essential app for those that want to pass the IELTS test. It also allows you to customize the definitions for vocabulary words by choosing a main one out of the existing definitions. This IELTS Preparation makes perfection thus a daily intake of vocabulary words will help you learn faster and be prepared for the final exam.  With the help of this educational app you can fine-tune your IELTS listening and reading skills or advance from starter to English language expert. We are committed to help you learn & prepare for an IELTS exam thus any feedback is appreciated in the comments below! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}