{
"name" : "My Dino Town: Dinosaur Train Game for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.idz.dinosaur.train.ride.game.babies.toddlers",
"package" : "com.idz.dinosaur.train.ride.game.babies.toddlers",
"category" : "Educational",
"description" : "Explore the Dinosaur train game from Dubby Dino Series for kids which is free! Ride Dinosaur Train through the desert, on top of the sea, across the bridge, look around the beautiful nature and enjoy riding with our cute dino. Dinosaur game for kids and babies is a full-time entertainment game in a playful way. Dino Kids Train Ride is a simple game for kids as well as toddlers, to make it interesting we have added small and easy levels such as popping the bubbles, taking down the obstacles and many more.  We welcome you to our Dubby Dino Series. Our first app from the series is the Dinosaur Train - Riding Games For Kids & Toddlers!!! Watch out for more apps in these series.Enjoy this Dinosaur Train ride along with babies & toddlers and have fun & enjoy the journey through the beautiful nature.  Now the kids train games can be fun, happening & interesting. Ride kids train as well as learn with our cute little dinosaur whom we love to call Dino!!! Dino is up with a train ride for all the kids & toddlers out there who would love to explore and more importantly who would love to travel. If you are a parent who faces the issue of keeping your child entertained for a longer hour then this app is just perfect for your little one.  Dinosaur Train - Riding Games For Kids & Toddlers app have no in-app purchases or third-party advertising. We understand your privacy thats the reason we strictly follow no ads policy. These open-ended play experiences are the perfect starter apps for little ones. Watch out for more apps in this series  Fun things to do: Face your obstacles- Face all the obstacles that come along your way and crush them down Pop The Bubbles- Pop the bubbles in the sea while you are enjoying the ride Ride at different levels- Ride the train through water, jungle etc..  Key Features Never-ending game - Its a never-ending game you can play all the levels without getting out. Play With Cute Characters Thats You See - Beautiful and cute characters are waiting for you.  Learn About Different Shapes - Learn the names of the shapes and patterns. High Definition Quality - Why to adjust for a normal quality game when you have HD game No Ads- We strictly follow no ads policy for our little ones. Completely Free - Now all these features completely for free  We are an award-winning company devoted to entertainment for kids. We make apps for kids worldwide. We bring thoughtful design to life. For kids. For parents. For giggles. So get ready to travel with dinosaur games for kids which is for free by the way. Download Now and let us know how much your lil ones love our app. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}