{
"name" : "Learning Colors For Children",
"url" : "https://play.google.com/store/apps/details?id=com.edubuzzkids.learningcolorsforchildren",
"package" : "com.edubuzzkids.learningcolorsforchildren",
"category" : "Educational",
"description" : "* Two more play modes included * 1. Colors matching 2. Shelf Sorting * New Vehicles added in Garage and Carparking scenes.  * Graphical improvements * minor bug fixes  Learning Colors for Children is a simple and exciting learning game for the young children. It will introduce the bright colors of our world to your kid, with the educational process being funny and interesting. With no effort, toddlers will learn English colors names and associated different objects like animals and fruits. How to Play: - Car Parking: Drag the car to any parking slot to pronounce the color name. - Car Garage: Tap on any color garage button to pronounce the color name and reveal the car parked inside the garage. - Learn Colors: The game offers three illustrative pictures for each color. Tap any of the color or associated picture to hear its pronunciation. Use left and right arrows to change the color. - Play with Colors: Check the color recognition skills of your toddler and to revise the names of the colors. The child has to match each of hanging frame to the frame of similar color.  - Guess Colors: Children need to select the correct color or object from the hanging boards to match the object or color shown on the upper board. The application contains high-quality HD pictures, nice funny music, and tons of fun. - Colors Matching - Draw a line between matched pair according to the color. - Shelf Sorting - Drag the colored object to the relevant shelf. And last but not least ***All puzzles are available for FREE*** Privacy Disclosure:  As parents ourselves, EDUBUZZKIDS takes childrens wellness and privacy very seriously. Our app:  Does not contain links to social networks  Does not collect personal data But yes, it does contain advertising as thats our means of providing the app free of cost to you  the ads are carefully placed such that the kid is least likely to click on it while playing. Feedback Please: If you have any feedback and suggestions on how we could further improve the design and interaction of our apps and games, please visit our website http://www.edubuzzkids.com or leave us a message at edubuzzkids@gmail.com. We would be glad to hear from you as we are committed to updating all of our apps and games on a regular basis with new features and also want to get some ideas for future app development. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}