{
"name" : "CA Foundation Preparation- ICAI Notes & Mock Test",
"url" : "https://play.google.com/store/apps/details?id=com.edurev.cacpt",
"package" : "com.edurev.cacpt",
"category" : "Education",
"description" : "CA Foundation / CPT Prep Notes & Mock Tests App provides preparation free study material, NCERT Textbooks, Short Notes of all subjects, Question BANK, Quiz, previous year papers Online Tests, Topic Wise Quizzes, NCERT Textbook Quizzes, Online video lectures, Daily insights, Past year question papers & Important tips & tricks for Examination. Most helpful app for CA Foundation / CPT(Charted Accountant Common Proficiency Test) Exam, recommend by toppers ICAI - The Institute of Chartered Accountants of India organize Foundation / CPT exam  CA Foundation / CPT App is derived from EduRev App, the same app which won the Best App of 2017 award by Google, an honor given to only top 25 apps on Android Playstore.  You can check out the award-winning EduRev App at www.edurev.in/android and the website at www.edurev.in  Features of the App: Social Learning Network Connect with Students from all over India, more than 14,00,00 students using the web platform - www.edurev.in  In-Depth Analysis Insights on the basis of Deep Analysis to empower every student & convert each weakness into a strength! Free Learning App App learns about you while you learn from the app & tracks study pattern to give content/tests as per your need Marketplace of Courses Course material in over 500+ Courses which will help you learn & understand concepts in a simple language. Large Network of Teachers The best teachers from all over India are sharing content & teaching subjects of expertise. Best Teaching App available  This EduRev app contains:  Paper 1 : Principles And Practice Of Accounting Paper 2 : Business Laws And Business Correspondence And Reporting  Courses: Principles and Practice of Accounting Business Mathematics and logical reasoning & Statistics Business and Commercial Knowledge Business Economics for CA Foundation Business Laws for CA Foundation Mock Tests & Past Year Papers for CA Foundation  Economics: Intro to Micro Economics, Theory of Demand and Supply, Theory of Production and Cost, Price Determination in Different Markets, Indian Economy - A profile, Select Aspects of Indian Economy, Economic Reforms in India, Money and Banking Fundamentals of Accounting, Basic Accounting Procedures  Journal Entries, Accounting Introduction, Accounting Process, Bank Reconciliation Statement, Inventories, Depreciation accounting, Preparation of Final Accounts of Sole Proprietors, Accounting for Special Transactions  Business Studies: Nature and Purpose of Business, Forms of Business Organisation, Public, Private and Global Enterprises, Business Services, Emerging Modes of Business, Social Responsibilities of Business and Business Ethics, Sources of Business Finance, Small Business, Internal Trade, International Business. Nature and Significance of Management  Accountancy:Accounting for Share Capital, Issue and Redemption of Debentures, Financial Statements of a Company, Analysis of Financial Statements, Accounting Ratios, Cash Flow Statements, Accounting for Partnerships : Basic Concepts, Reconstitution of a Partnership Firm : Admission of a Partner  Business Mathematics and logical reasoning & Statistics: Ratio, proportions, Indices and Logarithms, Equations, Inequalities, Simple and Compound Interest, Permutations and combinations, Sequence and Series, Sets, Relations and Functions, Limits and Continuity - Intuitive Approach, Differential and Integral Calculus, Statistical Description of Data, Measure of Central Tendency and Dispersion, Correlation and Regression, Probability, Theoretical Distribution, Sampling Theory, Index Numbers  Official website for CA-Foundation / CPT: www.icai.org  If you have any queries, issues or suggestions, please mail us at support@edurev.in . We will be happy to solve them for you :)   Never Study Alone, Download the Free App now. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REORDER_TASKS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REORDER_TASKS']",
}