{
"name" : "Fixiki: educational  kids games for boys & girls.",
"url" : "https://play.google.com/store/apps/details?id=com.trilobitesoft.kc.kids.game.fixiki.children.tales.fiksiki.baby.books",
"package" : "com.trilobitesoft.kc.kids.game.fixiki.children.tales.fiksiki.baby.books",
"category" : "Educational",
"description" : "Enjoy amazing fairy tales and cartoons for kids with interactive Fixie games for toddlers, babies and preschool kids. New books based on Fixiki cartoons are already there! Your children will be happy!   Try your free book now!  This collection provides hours of fun, through its beautiful stories for children, fascinating animated scenes, as well as its vivid and colorful animations and engaging interactions on childrens books pages.  In our childrens place we are bringing tons of new interactive games for kids   Fixie  Fixie the little brave characters from Russian cartoons. These little friends will teach kids about electronics and other interesting things. The Fixies love inventing things and they need a lot of tools. Will you help them? You will learn how cell phones, compases, reflexes work. You will learn a lot about electricity, gadgets, simple mechanics and other interesting things. First book is free, you will love it!  Our great cartoons give a child an opportunity to become a hero who can solve various problems and make right deeds. Books for kids which you will find in our app Fixiki: educational kids games for boys & girls, like peppa pig games.  Features:  Interactive 3D pop-up scenes  Narrated by professional actors  Amazing interactive books and Mini Games for kids like peppa pig games!  Designed for Families with pre school kids  Parent Gate/Kids Mode  lay preschool games with Fixie.  Please consider that this app contains in-app purchases that cost real money.  CONTACT US  If for some reason you cannot download our bedtime books or you have any other problems related to this product please dont hesitate to contact us at kc@trilobitesoft.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING']",
}