{
"name" : "Brain Test - Have guts to pass it?",
"url" : "https://play.google.com/store/apps/details?id=com.mindpuzzle.braintest.quiz",
"package" : "com.mindpuzzle.braintest.quiz",
"category" : "Educational",
"description" : "Play fully entertaining Brainstorming brain games.  Just Think out of box The most common and obvious solution is wrong here  in this vita brain game! In each game level you will find different Chaos and mingle.  You have to chase your mind to think differently. heaks the trik to find the answer. Each question is though full like puzzle brain war, lets fight with question.  Dont stick with one idea or significance, just try different way to get it solve. Show you sightedness in solving brain puzzle game. In brain puzzles Think with various different way to solve the question. Best IQ testing bras adictivo game. Some time you think with common sense and the answer need high brainstorming and brain-teaser some time you think very serious way and the answer need just funny common sense, This is the addictive and bra in twister funny way to keep you engaged with the intelligent teaser braing game.  The way of your interpretation is the perfect key to solve the chaos in brain out game.This is best brain quiz trivia game that major your caliber and Cathexis.  Increase you thinking competency in solving problem. Discriminating question will display on your mobile screen, Solve those adjudicators. We gives facility to little help to decipher the question, But its not always applicable. Just try to unscramble  the problem and lets sharp the brain. All the problems are not direct to elucidate, its just brain-teaser riddle game. feel like learing logica enhancement in brain academies. Really mind blowing bruin game. Lets stressed out. Its Thiking of Low of solving puzzels. and gt the out pop brain.  Solve the challenging conundrum enigma.  fight with your brain and brainteaser. each puzzlements solution is hide behind little secret just push the funny brain. Win the game and feel like a king.  In this brain game some questions will dazzle, That the answer you thought is not current and its just Bizarre. brain teasers game sets the answer like it for make the fun.  Mind brain app is thinking games play it and chase your mind to solve tricky quest. Smart brain plays smart game, Brain test is just not iq game but its treasor of funny puzzle, mathematical puzzle test,Finding difference, general knowledge, common sense, mind query, completely stupid thinking, mind growing game, humor, logical think ability, depth brain storming.  Game will serve you the questions that you will get fun to play here.Make your brain crush, and find the answer you expected is totally  different.   Brain Test will refresh your old cognition of puzzle games by bringing a new brain-burning experience. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}