{
"name" : "Englisch Entdecken",
"url" : "https://play.google.com/store/apps/details?id=com.witsindia.englischentdecken",
"package" : "com.witsindia.englischentdecken",
"category" : "Education",
"description" : "Mit Ben & Bella entdecken Ihre Kinder die englische Sprache auf spielerische Art und Weise und bauen sich somit einen ersten englischen Wortschatz auf.   Diese App ermglicht Ihnen die Ben & Bella Welt (Hrbcher, Zeichentrickfilme, Songs, Tanzvideos, Malbilder zum Runterladen und viel mehr) auch von unterwegs zu genieen.  Nutzen Sie die Kamerafunktion Ihres mobilen Gertes um Illustrationen aus Ben & Bella Produkten einzuscannen und hren Sie den Begriff der eingescannten Illustration laut ausgesprochen. Sie knnen auch die Ausmalbilder zum Runterladen einscannen. Die App kann sich alle eingescannten Begriffe speichern und erstellt so automatisch Ihr ganz persnliches Wrterbuch mit englischen Wrtern, die sich jederzeit und beliebig oft abspielen lassen.   Begleitet von den beiden Zeichentrickfiguren Ben und Bella sehen, singen, artikulieren, tanzen und spielen Kinder in einer natrlich-englischsprachigen Umgebung. Mit Ben hren Kinder amerikanisches Englisch und Bella pflegt einen klassischen britischen Akzent.   Wie kleine Wissenschaftler beobachten Kinder genau und hren aufmerksam zu. Sie erkunden alles, was sie in die Hnde bekommen und probieren alles aus. Die angeborene Neugierde und der intuitive Drang zur Nachahmung verleihen allen Kindern die notwendigen Basisfhigkeiten, sich alle wichtigen Themen der frhkindlichen Bildung zu erschlieen. With Ben & Bella, your children discover the English language in a fun way and build up a first English vocabulary.  This app allows you to enjoy the Ben & Bella world (audiobooks, cartoons, songs, dance videos, downloadable pictures and much more) on the go.  Use the camera function of your mobile device to scan illustrations from Ben & Bella products and hear the term scanned image spoken aloud. You can also scan the coloring pages for download. The app can save all scanned items and automatically creates your own personal dictionary with English words that can be played anytime and as often as you like.  Accompanied by the two cartoon characters Ben and Bella see, sing, articulate, dance and play children in a natural-English-speaking environment. With Ben children hear American English and Bella maintains a classic British accent.  Like little scientists watching children closely and listening carefully. They explore everything they can get their hands on and try it all out. The innate curiosity and the intuitive urge to imitate give all children the necessary basic skills to open up all the important topics of early childhood education. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.CAMERA', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.witsindia.englischentdecken.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.MANAGE_APPLICATIONS_SETTINGS', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.MANAGE_APPLICATIONS_SETTINGS', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
}