{
"name" : "Verse By Verse Ministry",
"url" : "https://play.google.com/store/apps/details?id=com.erpdevelopment.vbvm",
"package" : "com.erpdevelopment.vbvm",
"category" : "Education",
"description" : "The Verse By Verse Ministry (VBVM) International study app features the Bible teaching of Stephen Armstrong. Access hundreds of hours of verse-by-verse teaching through entire books of the Bible for free.  BIBLE STUDIES INCLUDED:  - Genesis - Exodus - Isaiah - Ruth - Ezra - Nehemiah - Jonah - Gospel of Luke - Gospel of John - Acts - Romans - 1Corinthians - Galatians - James - 1Peter - Jude - 2John - 3John - Revelation   Plus other Bible teaching from Numbers, 1Kings, 2Samuel, the Gospel of John, with more Bible teaching coming everyday! The Bible studies include audio lessons recorded during live teaching sessions; PDF sermon notes suitable for use in preaching and small group study; student handouts, overhead slides, and more.  In addition to the Bible studies, the app offers hundreds of answers to Bible questions, devotional articles and a calendar of live events. Share content via email, Facebook, Twitter, and messages.  ABOUT VERSE BY VERSE MINISTRY INTERNATIONAL Verse By Verse Ministry International is a non-profit, non-denominational, Christian ministry dedicated to promoting the preaching and teaching of Gods word clearly and boldly, in its proper historical and theological context, and for the purposes God has ordained: to persuade the unbeliever of the truth of the Gospel and to equip the saints for the work of ministry. This ministry was founded in 2003 on a commitment to provide compelling, verse-by-verse teaching of Gods word at no charge (2Cor 2:17), thus ensuring the whole counsel of God is proclaimed (Acts 20:27).  Visit www.versebyverseministry.org for access to hundreds of hours of free verse-by-verse Bible teaching and other resources for students and teachers. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}