{
"name" : "StorySign",
"url" : "https://play.google.com/store/apps/details?id=com.storysign.storysign",
"package" : "com.storysign.storysign",
"category" : "Education",
"description" : "StorySign helps to open the world of books to deaf children. It translates childrens books into sign language, to help deaf children learn how to read.  There are 32 million deaf children in the world, many of whom struggle to learn to read. One of the main reasons being that deaf children can struggle to match printed words with the concepts they represent. With StorySign, we help change that.  HOW DOES STORYSIGN WORK?  Please make sure you have a physical copy of the book for StorySign to scan and bring to life.  STEP 1 - Download the app and click on the selected book from the StorySign Library  STEP 2 - Hold your smartphone over the words on the page of the books physical copy, and our friendly signing avatar, Star, signs the story as the printed words are highlighted  StorySign is a free app, that translates childrens books into 14 different sign languages: American Sign Language (ASL), British Sign Language (BSL), Australian Sign Language (Auslan), French Sign Language (LSF), German Sign Language (DSG), Italian Sign Language (LSI), Spanish Sign Language (LSE), Portuguese Sign Language (LGP), Dutch Sign Language (NGT), Irish Sign Language (ISL), Belgian Flemish Sign Language (VGT), Belgian French Sign Language (LSFB), Swiss French Sign Language (LSF) and Swiss German Sign Language (DSGS).  So far, the app offers five popular childrens books for each local sign language, including much-loved best-selling titles from Eric Hills Spot series.  StorySign, a Huawei initiative, has been developed in close partnership with local deaf associations, deaf schools and the European Union of the Deaf, designed by Aardman Animations, and developed with classic childrens titles from Penguin Books. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.storysign.storysign.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}