{
"name" : "Japanese Grammar",
"url" : "https://play.google.com/store/apps/details?id=com.porolingo.jgrammar",
"package" : "com.porolingo.jgrammar",
"category" : "Education",
"description" : "Japanese Grammar is one apps of our ongoing project of PORO designed with purpose of giving helful and easy tool for Japanese learner. This free Japanese grammar app is offers grammar activities at Beginner, Elementary, Intermediate and Advanced, suitable for learners of all levels, from level JLPT N5 to JLPT N4, JLPT N3, JLPT N2 and JLPT N1.   The application content included 700+ grammar points which are divided into 5 levels, covering almost JLPT level, to help practice and reinforce your Japanese grammar skills. Easy to understand examples, immediately put your grammar knowledge into action! Become a more effective communicator and writer at work, in school, and in everyday conversation. This apps also offers 1300s of questions, with 100 quizzes test, imitates type of test in the JLPT Test.   Main Features  Detailed grammar points   700+ grammar points, covering all levels of N5, N4, N3, N2, N1  Easy to understand examples, immediately put your grammar knowledge into action  Example use various grammar and combine multiple grammar together in one sentence example   Practice and test  1300s interactive grammar quizzes designed to help you remember and practice Japanese grammar.  Customize questions to test your remembering and understanding of Grammar that you learned  Each level contains over 400 grammar activities, split into about 20 tests, are made to mimic a real JLPT exam, to prepare you to JLPT test   Quiz timer to check your reaction to that grammar is fast or not   Review and grammar explanation   Review in the end of test showed you how many questions did you correct   View results, explanation of the test answers to let you know what did you wrong   Assign favorite mark to filter grammar points that you love  *** Poro - Japanese grammar** suitable for: - Japanese learner from basic to advance - Is preparing to practice Japanese grammar JLPT N5, N4, N3, N2, N1. - Love Japanese culture. - Anyone interested in Japanese letters - Like to challenge your level  Japanese grammar is in developing process; we hope to receive your contribution comment to make it better. We are just a team that love Japanese and try to share our love to community, so if you like this app then please take a moment to rate it. You can also get in touch with comments or suggestions via the feedback button on the Options Screen.  Please kindly contact: - Email: poro.lingo@gmail.com - Fanpage: https://www.facebook.com/poro.japanese/ Thank you very much and Good luck!  Japanese, Japanese grammar, learn grammar, JLPT N5, JLPT N4, JLPT N3, JLPT N2, JLPT N1 ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}