{
"name" : "myPAT - Exam Prep IIT JEE Main BITSAT KVPY NTSE",
"url" : "https://play.google.com/store/apps/details?id=com.mypat",
"package" : "com.mypat",
"category" : "Education",
"description" : "Why download #1 Exam Preparation App?  - Benchmarking against 7,00,000+ aspirants across India - 100,000+ unique questions curated by experts - 860+ hours of online practice on 100% real test screens - 10 Previous Year Papers on real test screens with detailed solutions - Instant personalised performance analysis  - Super-fast doubt resolution on myPAT Community - Exam Updates and Notifications  myPAT is a one-stop learning solution for JEE Main, JEE Advanced, BITSAT, KVPY, NTSE & Board Exams. With deep personalisation at every level, myPAT identifies & tracks improvement areas; thus helping students learn at better and be 100% prepared for all upcoming examinations.   How does myPAT work?  As you take your first test on myPAT (absolutely free), millions of data points such as subject and concept wise strengths, weaknesses, target exam difficulty are analysed. Based on your performance, youre benchmarked with lakhs of aspirants across India  helping you understand where you stand against your competition. With every test you take, our powerful analytics engine enables you to streamline your exam preparation for Indias toughest exams.  How does myPAT help?  1. Practice in the Real Online Test Environment  same test screen, pattern, difficulty level & marking scheme to build online test readiness 2. Check crucial performance insights instantly - weaknesses, strengths & areas of improvement to better understand your test performance  3. Super-fast doubt resolution in the myPAT Community with answers from experts & thousands of aspirants across India   Why myPAT?  1. Real Test Environment - Be 100% exam ready with best test prep app for JEE Main, JEE Advanced, BITSAT, KVPY & NTSE 2. Concept-based learning with the syllabus broken down into easy-to-learn smaller concepts for better learning and retention 3. Personalised Feedback with powerful analytics-driven test results focused on the strengths and weaknesses of every student  myPAT, the test preparation app helps prepare for:   1. JEE Main 2. JEE Advanced 3. BITSAT 4. NTSE 5. KVPY  With superior insightful analytics, myPAT has helped students improve their test scores up to 27%. Our exam preparation app helps in boosting the test scores of students studying in class 9, class 10, class 11 and class 12.  Our Key Features  1. Benchmark against 7,00,000+ aspirants 2. 860+ hours of online practice in the real test environment on real test screens 3. Focus on concept-based based learning with the syllabus being broken down into easy-to-learn smaller concepts 4. Powerful analytics-driven test results focused on the strengths & weaknesses of every student 5. Outstanding year on year results  Exam Preparation Resources  1. Latest exam information 2. Useful tools such as course preparation tracker, college predictor & rank predictor 3. LIVE Webinars with industry experts & previous year toppers 4. Blogs with latest news, study tips & tricks, study hacks and more 5. Interactive community to ask & answer questions, initiate discussions & share ideas  What can you do on myPAT?  1. Attempt mock tests in the real test environment 2. Evaluate results to identify your weaknesses, strengths & areas to improve 3. Solve Previous Years Papers on real test screens 4. Get latest news for all Engineering entrance & Boards exams 5. Boost your exam preparation with exclusive eBooks, hand-picked blogs by experts 6. Get success mantras straight from the toppers desk in series of topper interviews. 7. Resolve all your doubts on myPAT community   Why are we #1 exam preparation app?   1. Entire syllabus is broken into 1600+ Concepts 2. 13,00,000+ tests taken on myPAT  3. 1,46,00,000+ questions solved on myPAT  Best Part, myPAT App is completely free to download!  Website: https://mypat.in/ ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'android.permission.GET_TASKS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.mypat.permission.C2D_MESSAGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_FINE_LOCATION', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}