{
"name" : "Baby, Toddler & Kids Edu Games & Activities Free",
"url" : "https://play.google.com/store/apps/details?id=com.aadvarkstudios.babygames.BabyGamesFree",
"package" : "com.aadvarkstudios.babygames.BabyGamesFree",
"category" : "Educational",
"description" : "Children have a naturally short attention span, no single game can usually hold their attention for more than a few minutes. Baby & Toddler Games solves this problem by having multiple games inside of one app. That should hold your child attention for longer and hopefully give you some much deserved free time and a bit of peace and quiet.   App has three different difficulty / age group settings:   0-2 years   2-4 years   4+ years   Switching between these allows your child to grow up and improve with the app, and decrease the chance of them getting bored with a game when it becomes not challenging enough. It can be also used by more than one child if they are of different age groups.  List of included games  Main games and activities:   Match shadow (Drag and drop toys, animals, garden & transport items)  Musical Drum (Tap do play nursery rhyme with special effects)  Bubble Burst (Burst bubbles to get a new backgroundimage of cute kittens and puppies)  Keyboard (Learn nursery rhymes, play keyboard with various instruments and sound effects, record songs etc..)  Piano Tiles (tap on black tiles to play nursery rhymes or custom recorded songs)  Hidden games:   Paint (Paint over the canvas with cute puppies and kittens with multiple colors, erase and draw mode...)  Memory Pairs (Find matching pairs to clear the playfield)  Bonus level games:   WhackaMole (Quickly tap the squares that light up)  Bubble Wrap Pop (Pop all the bubbles in the wrap sheet before the time runs out)  Developed by a new father and ex-teacher, these games have been designed to :   Develop your childs fine and coarse motor skills  Improve and train hand to eye coordination  Develop recognition of shapes and objects  Enhance the childs vocabulary  Learn to play keyboard in a fun and engaging way  Help with learning the different colours, shapes, and numbers  Increase reaction times  Improve cognitive and memory functions  Learn new songs and nursery rhymes  Games are designed with attention to detail and feature engaging and realistic graphics & animations.   App has a lock function to prevent accidental taps and a help function for each screen and section.   Available in 15 languages. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.DISABLE_KEYGUARD', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}