{
"name" : "Allen CSAT",
"url" : "https://play.google.com/store/apps/details?id=com.allen.csat",
"package" : "com.allen.csat",
"category" : "Education",
"description" : "Features include in allen CSAT android application are -   Dashboard  Student Performance Test Analysis Score Card Paper Analysis Compare Yourself Topic Wise Report Paper Solution PTM Notification Message/SMS Video News & Updates Mail/Inbox   Dashboard :- This page gives student a brief highlights of what actual performance he/she is having - Cumulative percentage, highest Percentage , Highest rank and total test.  Student Performance :- Cumulative percentage calculated.There are two cases one in which student is absent and present.The list will appear and show the details test name, test pattern, maximum marks Marks scored and test date.  Test Analysis :- Here test list is available include - Test Name, Date, Test Type,Test Pattern, Maximum Marks and Marks Scored.  Score Card :- Subject wise analysis - marks Scored, highest marks, toppers marks, average marks, percentage and subject rank separately for each subject.  Paper Analysis :- Difficulty Level Reportion Overview -Analysis, Total Questions, correct question , incorrect question, left question, right marks, Negative marks, total marks.Difficulty level detail report - Divided into easy medium and Tough.Filter is available to view filtered paper analysis.  Compare Yourself :- Here one can compare his/her marks with the other students mark preferably topper (Top Ten) .This comparison includes -Marks scored, Percentage, Test rank, Total Questions, Attempted Questions, unattempted questions, correct question and more.  Topic Wise Report :- This shows the Marks scored, topper marks, highest marks and average marks.Total questions, Correct and incorrect questions , Right and negative marks , Left question and Marks.Subjects Name - you can click on subject to view topics in the same subject and further details on the same topic.  Paper Solution :- Here student can download Paper and solutions of the stream student belong.Include basic details such as test name, date type , status and stream along with two download button available. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BROADCAST_STICKY', 'com.sec.android.provider.badge.permission.WRITE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.READ_CONTACTS', 'com.sec.android.provider.badge.permission.READ', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS']",
}