{
"name" : "Cuemath - Mental Math & Number Games",
"url" : "https://play.google.com/store/apps/details?id=com.cuelearn.cuemathapp",
"package" : "com.cuelearn.cuemathapp",
"category" : "Educational",
"description" : "Trusted by over 50,000 families as the #1 math games platform for kids.  Want to help your child get better at mental calculations? Then this brand new math games app is for you!  If your child plays these math games for 10 mins daily, you will see noticeable improvements in your childs calculation speed, accuracy, focus, and mental aptitude.  We equip every student with a personalized training program called Math Gym. Math Gym is your childs personal coach. It helps them master concepts while building speed and accuracy through math games that have varying levels of difficulty - increasing with the childs performance, age and grade levels.   How will these math games improve your childs mathematical abilities?  Number games help your child think out of the box, and come up with solutions on their own. These time based math puzzle games for kids help your child be ready and prepared for competitive exams such as the International Math Olympiad as well.   Math gym helps your child put their math skills to the test everyday for 10 mins. The math games are designed to increase in levels of difficulty to help your child be constantly challenged.  Capped at 3-5 games per session, weve formulated our games keeping in mind that school going children today have an attention span of approximately 10 minutes.  Covering more than 20+ mathematical topics relevant to your childs grade, the math games will automatically adjust themselves in terms of the difficulty level based on how your child did in the previous session.   The mini math games will help your child target and improve various aspects of their mathematical thinking, including core math skills, reasoning abilities, logical reasoning power and more.  With Math Gym, your child will get: - Personalised training sessions that include math games on multiple math concepts. - New math games added regularly to enhance mental agility and reasoning skills. - Adaptive difficulty levels to make the experience enjoyable yet challenging.  - 10 minutes only. No more no less.   10 mins everyday! Keep your child enthralled and coming back for more. Who wouldnt want their kids to get better at math?  Both parents and students have reported significant improvement in performance after just 3 months of regular Math Gym practice.   This app is free for all Cuemath enrolled students. To know more, please visit www.cuemath.com. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}