{
"name" : "Maven Silicon - Online VLSI Training courses",
"url" : "https://play.google.com/store/apps/details?id=com.mavensilicon.app",
"package" : "com.mavensilicon.app",
"category" : "Education",
"description" : "Maven Silicon always leads the VLSI Training Industry, as a top-class VLSI finishing school, by setting new standards in VLSI training. Our mobile App based interactive online VLSI courses can justify the same and convince you that we are unique and ahead of the current VLSI training industry.  Our Founder and CEO Mr. P R. Sivakumar says VLSI training courses are very expensive and time consuming for the engineering graduates who want to learn and prepare themselves for the core industry while doing the engineering course. I have launched the online courses with the intention of democratizing the expensive VLSI courses. Now anyone can opt for this inexpensive online VLSI course and learn at their own pace on their mobile device itself at their convenience. I am sure our ambitious engineers will make use of this online course and get into semiconductor industry   VLSI SoC Design course, Verilog HDL course, VLSI Design methodologies course, ASIC Verification Methodology, Digital Electronics course, are some of the online VLSI courses available.  Join with the millions of passionate engineers who are mastering design skills, advancing their careers and exploring new opportunities in Semiconductor VLSI Industry. Prepare yourself for the jobs today, tomorrow and beyond in Electronics Industry, semiconductor VLSI and Embedded Systems.   Now you can learn all the advanced VLSI design skills on your own with the help of this Maven Silicon App.   Key Highlights:  * Live Q & A and Review Sessions * Online VLSI course with labs & projects * Learn Anywhere & Anytime with Mobile apps * Upgrade to Job oriented course with scholarship ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}