{
"name" : "Cengage Mobile",
"url" : "https://play.google.com/store/apps/details?id=com.cengage.mobile.mindtap",
"package" : "com.cengage.mobile.mindtap",
"category" : "Education",
"description" : "The Cengage Mobile app allows students and instructors to stay engaged with courses, in-class and out. For students, the app offers offline reading, gradebook access, and notifications for key course events. For instructors, the app offers an easy way to check class grades, take attendance, and create polls that keep students engaged.  To use this app, you must be either a Cengage Unlimited subscriber with ebooks in your account, or a Cengage user enrolled in a MindTap, CengageNOWv2, or SAM course. (Note that SAM users must be either enrolled in MindTap or use SAM in conjunction with an LMS.)  The app features: - Access to ebooks - Flashcards and flashcard-based practice quizzes - Notifications - Activities organized by due date - Grades - Videos - Attendance - Polling  Textbook Reading: Download your textbook with offline access! Browse between different chapters, search for specific pages and terms, or take notes, highlights and bookmarks. Have the book read aloud using Text-to Speech. Note: We currently support most 2015-2019 titles. Textbooks from 2014 and prior as well as international or custom titles are not supported. Annotations do not currently sync with web-based readers.  Flashcards & Practice Quizzes: Study on the go using pre-made flashcard decks. Then check your knowledge with practice quizzes. See your scores improve over time as you learn more!  Activity Lists: Stay on top of all your assignments with to-do lists! Browse all the assignments and activities in your course and view due dates.  Notifications & Reminders: Easily set up assignment reminders and get notified of grade and due date changes.  Gradebook: See your overall grade for the course as well as the breakdown of grades by various activities. You can also view instructor comments and grade changes! Access to the gradebook requires additional authentication, by either password, fingerprint, or face ID.  In-Class Polling and Attendance: Instructors can check if students are in the classroom using geolocation or by allowing remote check-ins. They can also review and edit attendance records, and export them to their preferred gradebook. Instructors can also author in-class polls, review the results with the whole class, and export those results. ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_BIOMETRIC', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.READ_CALENDAR', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING']",
}