{
"name" : "Teacher's assistant (grade book)",
"url" : "https://play.google.com/store/apps/details?id=com.learning.texnar13.teachersprogect",
"package" : "com.learning.texnar13.teachersprogect",
"category" : "Education",
"description" : "Teachers assistant is the most convenient electronic journal with many additional features.  It will store your schedule, lists of students, their grades and attendance, classrooms in which classes are held. It was created at the request of teachers, repeatedly tested by them, and now it is used by thousands of teachers from around the world. It is suitable for any purpose: courses, school classes, University seminars, etc.  FUNCTIONS: + Put grades and mark attendance. With a long tap on a student, you can give them multiple grades and note whether they were present in class. + Minimum of actions: knowing your schedule, the application itself will offer the current lesson. You can start the lesson immediately! + Virtual classes: instead of lists of names in front of you a virtual class, where students sit at their desks. With the long press on the student you can put him a grade.  + Do not have time to write down who and how many times answered? Mark it with one touch on the student. + Types of grades: examination, homework, quarter grade, etc. + See the statistics: on the basis of it you can put annual, quarter or semester grades. + Flexible settings: change the time grid of lessons, add your own types of responses, change the evaluation system (5-point, 100-point - anyone is possible). + Multilingual: English, Russian and Chinese language support.  FEEDBACK: We will be very happy if you help our application to advance by giving it a good rating. Most of our exciting features and improvements came from your feedback. If you do not like something or have ideas what to add, write: ivmarch2000@gmail.com.   Have a nice lessons! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}