{
"name" : "Little Panda Brain Trainer",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.logical",
"package" : "com.sinyee.babybus.logical",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   This is a game to develop childrens brain power and unlock their potential!   Little Panda is in trouble on the small island! Airplane parts, repair tools, and gifts for friends are scattered everywhere! My dears, use your smart brain to help little panda get the gifts back and fix the airplane!   In the jungle, connect matching colors in the color maze to open the stone doors and find the gifts!  In the cave, sort out the elves by shape, color or size to light up the area ahead and find repair tools!  By the river, put the elves in proper order to make a floating bridge! Go to the other side of the river quickly to collect airplane parts!   With your help, little panda has completed the brain games, fixed the airplane, and gotten the gifts back!   Features: - 3 main brain training mini-games : connecting, sorting, sequencing. - 180 + levels for children to enjoy! - Easy-to-use interface provides a fun learning environment. -Free to download with no in-app purchases!  Little Panda Brain Trainer will help children:  - Identify and match colors.  - Recognize and distinguish shapes. - Improve observation skills and logical thinking.  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}