{
"name" : "ABC Infinito - Spanish",
"url" : "https://play.google.com/store/apps/details?id=com.kidslearnendless.abcinfinito",
"package" : "com.kidslearnendless.abcinfinito",
"category" : "Educational",
"description" : "Welcome to ABC Infinito.  ABC Infinito helps kids to progress swiftly in their vocabs and ability to speak and understand words. Feature List  1. Learn Over 104 Interactive words with intuitive designs for kids 2. Interactive and funny alphabet puzzle for kids with funny animations 3. combination of mellifluous voice with cute animation is ineffable 4. Expressive visual bring words to life with pleasant animations 5. All-time favorite characters in KID kife make it easy to remember words with actions.  Without a sufficient understanding of the word, kids can not understand and express their creativity and imagination.  -------------------------------------------------------------------------- Please read below to understand the importance of vocabulary and its visual for understanding --------------------------------------------------------------------------  Vocabulary is important across the curriculum from language arts and social studies to mathematics and science. It is intimately connected to both effective reading and writing skills, and these skills are necessary for doing well in schools and life.  Research studies have shown that in most cases students have to see, read and interact with words 5-7 times before they are admitted to long-term memory. Words are more easily learned if your child is active - drawing a picture of the word, writing her definition of it, and thinking of an example sentence to use it in. This is better than simply writing the word over and over again.  What is phonics? Why is it important?  We often hear educators say, What children can say today forms the basis for what they can read and write in the future. But this only tells part of the story.  To read English successfully, children must learn to turn the words they see in a text into sounds and make sense of these sounds. It is important for children to learn letter-sound relationships because English uses letters in the alphabet to represent sounds.  Phonics teaches this information to help children learn how to read. Children learn the sounds that each letter makes, and how a change in the order of letters changes a words meaning. For example, if we dont pay attention to letter order, words such as dog and pat might be misread as god and tap respectively. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}