{
"name" : "General Science : World Encyclopedia",
"url" : "https://play.google.com/store/apps/details?id=com.titli_apps.general.science.knowledge.book",
"package" : "com.titli_apps.general.science.knowledge.book",
"category" : "Education",
"description" : "General Science contains world Encyclopedia of General Science. Now you can increase your general knowledge using your smartphone. So people in everywhere in World can easily increase their knowledge. General Knowledge Science app helps user to sharpening their knowledge and senses, help them to prepare for exams or tests which are based on all branches of Sciences and helps them to increase their knowledge. General Science Quiz for school, colleges and competitive examinations. The General science quiz includes the different questions of earth and space, social science, life science, physical science, formal science, mathematics logic, physics, chemistry, biology, mechanics, branches of science, psychology, sociology, astronomy, geoscience etc... Main Features  General Science multiple choice questions with solution  Daily Question of the Day  Unique Animations and Transitions  Background Music and Sound Effects  Share General Science Questions with Friends  Score Statistics & Reset Score Salient Features:  Branches of Science  Phobias  Elements  Sciences and Scientists  Mechanics  Waves and Optics  Thermal physics  Space, Time and direction  Medical Abbreviations  ftce general knowledge test strategy  Pti  General knowledge mcqs with answers 2018  Minerals & Nutrients  Vitamins  general knowledge triviaa  Operating System   Periodic Table  Universal Constants  Universal Measurements  Physics Quantities and Units  Biological Instruments  Physics Instruments  Chemistry Instruments  Current Affairs in various categories also supported now like World , Technology , Science and many more categories with regularly updates GK in English is useful for Interview, Competitive exams like SNAP, NTS, OTS, JTS, CTS, MTS, PTS, GCTS, BTS, UTS and other MBA exams, CSS, Entrance exams, Bank PO, UPSC, IAS and other Public Service Commission Exams.  Download, Enjoy and dont forget to share it with friends. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}