{
"name" : "Learn English Grammar",
"url" : "https://play.google.com/store/apps/details?id=com.english.vivoapp.grammar.grammaren",
"package" : "com.english.vivoapp.grammar.grammaren",
"category" : "Education",
"description" : "Best App for learning English Grammar from developers of Visual Vocabulary App.  This English grammar app covers 100+ popular grammar topics using simple explanations, many examples, and colorful pictures. All grammar topics are available for free. This English Grammar app is perfect for Beginner and Intermediate levels.  More than 2000 grammar questions will gradually improve your skills. When you complete your English test you see which aspects of English grammar you are good at and which of them require more practice. Our language app is the best way to study English. Minimalist design and clear user interface make it easy to test your grammar skills.  Whether you are an English language learner or a native English speaker, this English grammar app will help you with the structure of English. By improving your English grammar, your writing and speaking will both improve.  Entrance exams require the possession of extensive English knowledge. This grammar app can be helpful for improving required skills for exams like CAT, IELTS, TOEFL, GRE, GMAT, MAT, XAT, NMAT, SNAP, SAT, SSC, CGL, Bank PO, CET, GATE, IAS, IBPS, IES, UPSC, JKSSB, PTE, DU JAT, TOEIC, NIFT, JBPS, CFE.  You can study all the grammar lessons grouped together by types such as Nouns, Pronouns, and possessives, Prepositions, Adjectives and adverbs, Present tenses, Past tenses, Present perfect, Future forms, Modal verbs, Conditionals, Sentence patterns, Questions, Verbs, Reported Speech, Relative clauses, Linking words, Passive forms, Words that go together, Forming words, Spoken English.  Download one app to get much more: practice, analysis, interesting information.  Features: - 100+ Grammar topics - 2000+ English exercises - 20 English grammar units in every test - simple explanations - colorful pictures - total score and progress analytics - clear user interface - beautiful design - no internet connection required  Syllabus covered in English Grammar app: - Nouns,  - Pronouns, and possessives,  - Prepositions,  - Adjectives and adverbs,  - Present tenses,  - Past tenses,  - Present perfect,  - Future forms,  - Modal verbs,  - Conditionals,  - Sentence patterns,  - Questions,  - Verbs,  - Reported Speech,  - Relative clauses,  - Linking words,  - Passive forms,  - Words that go together,  - Forming words,  - Spoken English ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.alarm.permission.SET_ALARM', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}