{
"name" : "Unicorn Cookie Maker – Bake Cookies Games",
"url" : "https://play.google.com/store/apps/details?id=com.funpop.android_unicorncookie",
"package" : "com.funpop.android_unicorncookie",
"category" : "Education",
"description" : "Cookies maker are brand new food and fashion baking games. In most cookie crazy games, the best bake sale is undoubtedly unicorn cookies, cause it contains rainbow honey, kids candy, gateau, yummy carnivals treats, sweet tarts, cupcakes, cookies and most food children like. In this cookies maker and bake cookies game, you can make rainbow unicorn cookie by lots of nourriture. And you can also frost unicorn cookie like frost cakes. Let rainbow magic shine in your unicorn cookies world! Want to cook the best forest cookie by yourself in bakery food games? DIY this unicorn food in our cookie world and bakery empire right now!   Cookies Games Features:  1.Mama is preparing the cookie dough and cooking best cookies in the kitchen! What she will cook for the childrens food fest? I have seen homemade ice cream, gateau, rainbow cake, milkshake, batido, donut and other bakery snacks. Have fun with cookie maker and cookie crazy in the cookie game. 2.There are unicorn ice creams, unicorn cakes, unicorn cupcakes, unicorn milkshakes on the party table. Now mama hopes you can learn how to make unicorn cookie! It sounds really fun in the cookie game.  3. All the nourriture are in pony unicorn design with princess pink color and unicorn rainbow color! Add these unicorn style ingredients into the big rainbow mixing bowl to create the unique flavor of your unicorn desserts in this cookie games.  4.Bakery Fun!There are 4 kinds of rainbow unicorn cutters for the final unicorn cookies shapes in the unicorn food cooking game -- Fat unicorn, baby unicorn, unicorn pony, my little unicorn! I love all the cute unicornio in this biscuits game.  5.Cookie crazy! Bake the butter cookie like a cake baker in the cake bakery! Show your unicorn chef skills and make the sweet unicorn cookie in this biscuits game.  6.Desserts Maker Time!Now time to design your sweet cookies! The girly game prepare lots of unicorn staff for girls and boys to make up the dessert in the unicorn food salon. 7.Frost your unicorn cookie with fluffy cream like frost cakes. Then lets color the unicorn hair with glitter and colorful cream in our desserts maker. 8.Cookie Best Ever!How to colour the hair part of the unicorn cookie? Although unicorn cookie maker is not a color game, here you can still tap color to frost the sweet dessert. Color by numbers one by one to find happy color in this cookies maker game.  9.Cookie crazy time!After frosting hair part, decorate the unicorn horn, unicorn eyes, unicorn mouth and unicorn shoes with rainbow color and glitter color sweets and desserts. 10.Colorful sprinkles, rainbow candies, kids candy, hard candy, sweet chocolate, heart candy, glitter candyso many candies make you feel play in cookies world. 11.DIY yummy and rainbow unicorn cookie desserts is really a super fun cookie games for free. 12.Little chef, enjoy yummy sweet cookies with family and friends to have a great food fest in the fun cooking games free.Ready to eat? Enjoy the best cookies now!  You can Download and play this cookies games free!!! You can also wait for our upcoming fun cooking game in cocina, bake sale game, sweet gateau game, kids candy game, homemade ice cream game and other biscuits game.  ABOUT FunPop  FunPop are specialize in casuals games on mobile platform. We are aiming to provide innovative & educational game for the whole family. We help them to learn the basic life skills and good habits through our games.  Visit us: http://www.funpop.com.cn Watch us: https://www.youtube.com/c/FunPopMedia  CONTACT US  Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@funpop.com.cn ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'com.funpop.android_unicorncookie.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}