{
"name" : "Arduino Starter Kit",
"url" : "https://play.google.com/store/apps/details?id=com.bluino.arduinoprojectsbook",
"package" : "com.bluino.arduinoprojectsbook",
"category" : "Education",
"description" : "Arduino Starter Kit is a substitute for the Arduino Project Book that was included in the purchase of the official Arduino Starter Kit In this app contains ads and potentially in-app purchases, you can access content online for free at https://store.arduino.cc/usa/arduino-starter-kit  Tutorial upload sketch over bluetooth: https://www.hackster.io/mansurkamsur/how-to-make-bluetooth-shields-for-upload-sketch-to-arduino-96b182  Features:  Upload examples sketch to Arduino Uno over USB/Bluetooth  Serial Monitor for debugging needed  No Ads (In-App Purchase)  Search tools (In-App Purchase)  All content/projects  All content offline available  Change the Themes (Light, Dark, Black)  Change the code style theme (Light, Dark)  Change the font size  Syntax Highlight for Arduino language  Arduino Tutorials, with 15 Projects  Projects you can make: 01 GET TO KNOW YOUR TOOLS an introduction to the basics 02 SPACESHIP INTERFACE design the control panel for your starship 03 LOVE-O-METER measure how hot-blooded you are 04 COLOR MIXING LAMP produce any color with a lamp that uses light as an input 05 MOOD CUE clue people in to how youre doing 06 LIGHT THEREMIN create a musical instrument you play by waving your hands 07 KEYBOARD INSTRUMENT play music and make some noise with this keyboard 08 DIGITAL HOURGLASS a light-up hourglass that can stop you from working too much 09 MOTORIZED PINWHEEL a colored wheel that will make your head spin 10 ZOETROPE create a mechanical animation you can play forward or reverse 11 CRYSTAL BALL a mystical tour to answer all your tough questions 12 KNOCK LOCK tap out the secret code to open the door 13 TOUCHY-FEEL LAMP a lamp that responds to your touch 14 TWEAK THE ARDUINO LOGO control your personal computer from your Arduino 15 HACKING BUTTONS create a master control for all your devices!  Once youve mastered this knowledge, youll have a palette of software and circuits that you can use to create something beautiful, and make someone smile with what you invent. Then build it, hack it and share it. You can find the Arduino code for all these projects within the Bluino Loader - Arduino IDE, find on BluinoLoader/examples/10.StarterKit_BasicKit. ",
"desc_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}