{
"name" : "Best Kids Song - 66 Indonesia English Kids Songs",
"url" : "https://play.google.com/store/apps/details?id=com.alidya.kumpulanlagu",
"package" : "com.alidya.kumpulanlagu",
"category" : "Education",
"description" : "This Kids Song App that contains the Most Popular Indonesia Kids Song and English Kids Song throughout time that are sung from generation to generation. This Kids Song Collection can be played offline, so children can enjoy and play with Childrens songs anytime and anywhere.  This Kids Song App is designed with a simple and easy to be used (available play button, pause, repeat, back, next song) and comes with interesting lyrics and animations.  Your kids can grow with favorite kids songs and educational kids songs that are appropriate for our childs age, and are useful for teaching them better Indonesian and English, word pronunciation including learning to read letters. This Kids Song Collection is part of the Education Application from Dunia Anak Indonesia and can be used together with the Learning Application to read Letters and Numbers , Learn Numbers 123 and Mathematics, Kids Educational Games - Learn English , Lagu Anak Indonesia   Indonesia Kids Song List : - 4 Sehat 5 Sempurna - Anak Ayam - Aku Seorang Kapiten - Ambilkan bulan Bu - Abang Tukang Bakso - Anak Kambing Saya - Balonku ada lima - Burung Kakatua - Bintang Kecil - Burung Kenari - Cicak di dinding - Disini Senang  - Dua mata saya - Gelang Sipaku Gelang - Kebunku - Kring-kring ada sepeda - Libur Tlah Tiba - Lingkaran kecil - Makan apa - Menanam jagung - Nama-nama hari - Naik Becak - Naik Delman - Naik-naik kepuncak gunung - Naik Kereta Api - Nina Bobo - Pelangi - Pok ame-ame - Potong bebek angsa - Satu Ditambah Satu - Sayang Semuanya - Satu ditambah satu - Selamat Ulang Tahun - Semut-Semut Kecil - Tik..tik..bunyi Hujan - Topi Saya Bundar - Dll  English Kids Song List : - Are You Sleeping?  - B.I.N.G.O - Head , Shoulders, Knees and Toes - Itsy Bitsy Spider - Ten Little INdian - Row Row Your Boat  - Five Little Monkeys  - The Finger Family - The Alphabet Songs  - Ten Little Indians  - London Bridge is Falling Down - Three Little Kittens - Rain Rain Go Away - Rock A Bye Baby - Baa Baa Black Sheep  - The Wheels on the Bus  - Old Macdonald Had a Farm  - Merry Had a Little Lamb  - Twinkle Twinkle Little Star - If You are Happy and You Know It - Where is Thumbkin? - Skip to My Lou - DoReMi - Hickory Dickory Dock  ***** The copyright of all songs and lyrics in this child indonesian song app is owned by the creator, musician and music label concerned. If you are the copyright owner of the song in this app and do not want your song to be displayed, Please contact developer / developer email and notify us of your ownership status for the song. We will remove the song or lyric immediately. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.oki.babyphone.permission.C2D_MESSAGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.oki.babyphone.permission.C2D_MESSAGE']",
}