{
"name" : "Scholar-Homework Help,Math Answer,Get Scholarship",
"url" : "https://play.google.com/store/apps/details?id=com.inspilearn.scholr",
"package" : "com.inspilearn.scholr",
"category" : "Education",
"description" : "Find free solutions to classes 6 to 10 Math questions and NCERT book questions instantly on the helpful Scholar app. With Scholar app, you simply need to click and upload pictures of your queries to find instant solutions to Math, Physics, Chemistry, Biology, and History questions.You can also search solutions for questions from NCERT text books for all grades and help your peers by giving solutions to their questions from the best homework answer scanner, homework helper.   This is not all - You can get monthly Scholarships by taking short quizzes; chance to get national awards and a study trip to UK!  Features:  * Simply upload picture of your query to receive step by step solutions for classes 6 to 10 * Comprehensive support for NCERT book questions * Covers all subjects including Mathematics, Physics, Chemistry, Biology, and History * Peer-to-peer community * 100% free service * 24/7 access  Become Scholarly & Brainy by quickly solving your homework and prepare for entrance exams better with the Scholar app.  Find guided tutorials with step by step explanations from a community of peers and teachers to improve your conceptual knowledge as well as performance. Simply take a picture of any homework problem or previous year question, and get your doubts instantly resolved in Algebra, Calculus, Geometry, Trigonometry, Probability, Statistics, Math, Science and more! You will also find solutions to text book questions for CBSE curriculum from classes 6 to 10 for all subjects.  Share your knowledge to help your peers  Scholar app is a 100 per cent free and accurate way of finding solutions to your homework problems instantly. Thanks to cutting-edge artificial intelligence technology, the app instantly recognizes questions and provides step-by-step explanation.  Students can also share their knowledge by answering questions for others for better understanding of concepts. The global community of Scholar students and teachers makes every learning experience a collaborative and engaging one  With Scholar app, you can ask questions, search for answers, prepare for exams, research in various subjects such as Mathematics, Biology, Chemistry, Physics, and History. The app covers all the classes at school level, providing reliable answers and explanations that are checked by a dedicated team of moderators regularly.  This app is very exclusive for students from class 6-10 who are looking for maths homework helper or other subjects homework help? Scholar app helps you to do homework for any subject and also helps you with board paper solution and board textbooks solutions. Get more homework help across NCERT text books, state board text books and other board books with Scholar app. With instant subjects homework help for class 6 to 10 including maths, Scholar app keeps you ahead and accurate in doing your homework. Homework from any state board or board book is now easy to solve. Books are for finding problems, Scholar is for them.   Excited to know how Scholar  Homework Help, Math Answer - NCERT Solution app works?   See the steps below:  Step 1: Got stuck in doing your homework; especially maths homework with state board text books or any other board books?  Install our homework helper & solver app Scholar.   Step 2: To find solutions or answers to your homework from NCERT text books or any state board book, open the app & click Ask A Question.  Step 3: Take a snap of the question from your class 6 to 10 books & crop the question in which you have a doubt.   Step 4: Now click the submit button to get the solutions & answers for your queries. Get more homework help than any other source.  Step 5: Instantly receive step-by-step solutions from experts online.   Step 6: You can also help others by interacting in the community and answering questions which others are having trouble with.  Love Scholar? Read what others are saying about us or leave us a review. Wed love to hear from you. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'com.truecaller.permission.sdk.internal.read_account_state', 'android.permission.GET_ACCOUNTS', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.READ_APP_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.inspilearn.scholr.permission.MAPS_RECEIVE', 'com.sec.android.provider.badge.permission.READ', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.android.vending.BILLING', 'android.permission.READ_CALL_LOG', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.ACCESS_FINE_LOCATION', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.inspilearn.scholr.permission.C2D_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'me.everything.badger.permission.BADGE_COUNT_WRITE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'com.inspilearn.scholr.permission.MAPS_RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.READ_CALL_LOG', 'com.truecaller.permission.sdk.internal.read_account_state', 'android.permission.GET_ACCOUNTS', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}