{
"name" : "GRE Vocabulary builder - IELTS Vocabulary builder",
"url" : "https://play.google.com/store/apps/details?id=com.manjul.vocabulary.gre",
"package" : "com.manjul.vocabulary.gre",
"category" : "Education",
"description" : "GRE Vocabulary Builder - IELTS Vocabulary Builder app lets you learn new English words using its interactive Flashcard Quiz format and improve your English Vocabulary every day.  Vocabulary Builder app has over 5700+ important words for free and is completely offline. Vocabulary Builder apps WORD OF THE DAY feature provides you with an English Word every day so you learn a new English word every single day. Vocabulary Builder app reminds you to learn a new word every day. GRE Vocabulary Builder - IELTS Vocabulary Builder app helps you to track your progress using levels. GRE Vocabulary Builder - IELTS Vocabulary Builder app has three sections Basic, Intermediate and Advance.  Vocabulary Builder app includes the following features:  Learn new English words every day!  More than 5700+ hand-picked essential words to learn Audio pronunciation of each word in the app Fully functional in offline mode Meaning, example sentences, derivatives, synonyms, antonyms for each word Log in to save your progress and switch your device hassle free Share a word with your friends and spread the knowledge Search a word using speech Mark a word as your favorite Basic, Intermediate, and Advanced words sections Qualify a level to unlock next level new words Add new words Mark any word as your favorite word to quickly view it later. Users under control of what they see. Navigate to settings and choose which detail is imperative for you Switch between themes  With meanings, use in sentences, root, pronunciation, synonyms, antonyms, year of first use. Increase vocabulary skills. MEMORIZE WORDS. English vocabulary learning. GRE daily vocabulary. If you ever wonder how to improve vocabulary then this is the answer to it. vocab words help to ameliorate English proficiency.  This app helps to build vocabulary for CAT, IELTS, TOEFL, GRE, GMAT, MAT, XAT, NMAT, SNAP, SAT, SSC, CGL, Bank PO, CET, GATE, IAS, IBPS, IES, UPSC, JKSSB, PTE, DU JAT, TOEIC, NIFT, JBPS, CFE etc since the words are handpicked by our experts for exams like CAT, IELTS, TOEFL, GRE, GMAT, MAT, XAT, NMAT, SNAP, SAT, SSC, CGL, Bank PO, CET, GATE, IAS, IBPS, IES, UPSC, JKSSB, PTE, DU JAT, TOEIC, NIFT, JBPS, CFE etc. So if you are a student preparing for competitive exams then make sure you play this Vocabulary Builder Quiz every day, Vocabulary app, vocabulary games, chinglish.  GRE Vocabulary Builder - IELTS Vocabulary Builder app helps you to take steps towards building complex conversations. Vocabulary Builder Quiz app is designed in a manner that every level is followed by more complex words.  The Vocabulary Builder Quiz app maintains an online backup so that you never lose any progress(Login required). Vocabulary builder apps simple design helps you to learn new words anytime anywhere.  Voice Data may be needed to be download in order to use voice accents other than your device default. If you are on a Wi-Fi network, the download will be done automatically. If you are on a cellular network, go to Settings -> Language & Input -> Text-to-speech output -> Google text to speech engine settings and then disable Use Wi-Fi only. In rare cases, you may have to install the voice manually using Install voice data.  Have any questions? Please ask! If you have any questions or comments regarding GRE Vocabulary Builder - IELTS Vocabulary Builder app, please feel free to write an email using email in the developer section. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['com.manjul.vocabulary.gre.permission.C2D_MESSAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}