{
"name" : "Boating Free",
"url" : "https://play.google.com/store/apps/details?id=com.mobibress.boatingfree",
"package" : "com.mobibress.boatingfree",
"category" : "Education",
"description" : "Do you want to Acquire, Practice, Improve Boating Knowledge ? BOATING is for you!  Do You plan to attend a Boating license exam soon ? You have already passed your exam, and you want a complete application to help you practicing and improving your knowledge ? BOATING application is the one you need.  Prepare your license, improve and validate the sea rules knowledge thanks to Boating Premium. The application is for those wishing to navigate on boat, kayak, canoe or on sailing boat, because it provides the concepts of navigation.  Two modes are available to validate your knowledge and progress:  - The Training mode: You choose the topics, the number of questions and the time to respond. The application confirms instantly if the answer is correct.  - The Practice mode: At the end of the test, you will know the number of correct answers. The corrections are detailed with illustrations.  At any time, you can see the results of the last test and view statistics of your answers by topic.  Over 100 questions with detailed answers. 300 new questions are coming soon (translated from French application PermisCtier https://play.google.com/store/apps/details?id=com.mobibress.permiscotier).  The following topics are covered and fully documented: - Sea Marks (Region, Lateral, Preferred channel, Cardinal, lights, side ...) - Nautical chart (Symbols, sounding ...) - Boat lights and day marks (Sailing, towing ...) - International Navigation Rules - Sound and Distress Signals - Weather - Diving - Glossary - Radio VHF (coming soon)  The questionnaire is accompanied by 3D illustrations (over 200).  The software does not require internet connection. Questions and illustrations are installed on your mobile device.  Please feel free to send an email to mobibress@gmail.com for any question, request or comment. Hope the application will satisfy your requirements. If it is the case, dont forget to rate and add a nice comment. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CALL_LOG']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}