{
"name" : "EtoosIndia: IIT JEE,NEET,CBSE,Foundation Prep App",
"url" : "https://play.google.com/store/apps/details?id=com.etoos.india.app",
"package" : "com.etoos.india.app",
"category" : "Education",
"description" : "Etoosindia is the best online educational app for students preparing for 2020-2021 NEET, JEE Main, JEE Advanced, CBSE and Foundation examinations (KVPY, Olympiads Science, NTSE and more). All students aiming for engineering or medical, CBSE/State board exams or wishing to lay a strong foundation will find this online exam learning app as the ideal one.   What do you get in Etoosindia app   14 Days Free Trial - A option to explore the course video lectures and teaching style of faculties.   Online video courses - More than 60k+ HD quality video lectures.   Classification of Courses - Yearlong, Complete, Perfect Theory, Beginner, Topic-based, Final Revision, Rank Booster, Problem-Solving, and Crash courses.   Extensive coverage of entire Syllabus for IIT-JEE, NEET, and CBSE exams covered.   Useful tips and short tricks during lectures by experts.   Motivational videos delivered at regular intervals.   Choice of Faculty - 60+ experienced teachers. Etoos has a team of professional teachers.   Mock Test Series- Practice from 40k+ adaptive questions.   Video Mock Test Series with video solutions.   Real Time Online Exam based on the actual exam pattern.    Doubt Clearance with Doubt Clinic to clear queries within seconds   An easy, secure, and safe payment gateway to buy courses.   An easy buy of smart devices.   Hassle-free studying experience.   Saves time  and money  both.   Provides an intelligent way of preparation.    Whats Exclusive on the app?    Free Daily VMTS Test for JEE Main and Advanced, NEET.    14 Days Free Trial.   Free Practice Test Series.   Etoosindia app for IIT JEE exam    List of IIT JEE Free Trial Courses to know how lectures work.   Latest news and updates about the IIT JEE exam.   An exhaustive IIT JEE course list for Physics, Chemistry, and Mathematics.   Insights on our top IIT JEE Faculties.   IIT JEE Smart study material and best books.   All India Engineering Test Series (AIETS).   IIT JEE Exam Video Solutions to build a strategy.   IIT JEE Exam Analysis Videos to review the paper.   IIT JEE List of Exact hit questions.   IIT JEE Online Video Mock Test Series with video solutions.   IIT JEE mains and advanced answer key.   Etoosindia app for NEET exam    14-Days Free Trial video lectures for NEET   NEET Books and notes with complete theory, examples, and questions.   All India Medical Test Series for assessment (AIMTS).   NEET Exam Video Solutions by faculties.   Etoosindia app for CBSE exam for Class 9, 10, 11 and 12    14-Days Free Trial CBSE Course list.   Free download of CBSE Sample paper.   CBSE exact hit question for exam strategy.   A wide array of online CBSE courses and lectures.   Etoosindia app for Foundation exam    14-Days Free Trial Courses for KVPY, Olympiads, NTSE, and other exams.   A variety of online courses and lectures.   This app is recognized as/for   Performance predictor app with performance ranking after each mock test.   Organic - Inorganic Chemistry App   Online coaching App for IIT JEE, NEET, CBSE.   Online Test Series App for IIT JEE, NEET, CBSE.   Exam result 2019, 2018, 2017   IIT JEE Advanced app   Entrance Exam App   JEE main preparation free app   Become a  topper with the top educational app from Etoosindia. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.REAL_GET_TASKS', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.GET_TASKS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_SETTINGS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.REAL_GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.GET_ACCOUNTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}