{
"name" : "EnglishScore: Free British Council English Test",
"url" : "https://play.google.com/store/apps/details?id=com.englishscore",
"package" : "com.englishscore",
"category" : "Education",
"description" : "Get a certificate to prove your level  Looking to progress your career, or gain confidence ahead of an exam?   - EnglishScore is an accurate and free mobile English test from British Council - Take the English test and get your English level with results available for free immediately - Test your grammar, vocabulary, listening and reading skills and compare yourself to others - Earn a British Council certificate showcasing your level - Use it to demonstrate your English skills to potential employers or to prepare for high-stakes exams such as IELTS, TOEFL and TOEIC - EnglishScore is currently used by companies such as Teleperformance, Caterpillar, Gavs Technologies and Piramal Group - Get personalised course recommendations to improve your English level   Quickly understand your English level  In under 40 minutes, our English test will assess your grammar, vocabulary, listening and reading skills.  Score from A2 (Elementary) up to and including C1 (Advanced) on the Common Framework of Reference for Languages (CEFR), the globally recognised language proficiency standard.  High profile companies use the CEFR to evaluate English language skills  Research has shown correlations between English language skills and earning power. Companies such as Unilever, McKinsey, Microsoft, Samsung, Johnson & Johnson, Deutsche Bank, HSBC and hundreds more use the CEFR as the standard to judge English language abilities in their organisations.  Learn more about companies accepting EnglishScore here: https://www.englishscore.com/employer-directory/  Improve your English level with personalised course recommendations  Based on your test results, we recommend the right British Council course for you. These courses are tailored to English language learners, so whether you are looking to improve your career prospects, prepare for a high-stakes English test or just learn English for fun, well find the right course for you. Our recommended courses teach skills including Speaking, Writing, Listening, Reading, Grammar and Vocabulary.  Designed by English language experts for a result you can trust  Every year, over two million people take international English exams and qualifications with the British Council.   Our test was designed in collaboration with the internationally-renowned Centre for Research of English Language Learning and Assessment (CRELLA) at the University of Bedfordshire, UK.  Scores are linked to the Council of Europes Common European Framework of Reference for Languages (CEFR), which allows users to compare results from EnglishScore to those from other assessments (such as IELTS, TOEIC and TOEFL).  We use a number of mechanisms to prevent cheating, giving confidence that the certificate holder is the person who has taken the test and that their score is a fair reflection of their English language abilities.  Your personal data and privacy is protected  Your privacy is very important to us. British Council complies with all relevant regulatory requirements related to data protection and privacy. Learn more: https://www.englishscore.com/privacy-policy and https://www.englishscore.com/terms-of-use  Send any feedback to contact@englishscore.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAPTURE_AUDIO_OUTPUT', 'android.permission.CAPTURE_SECURE_VIDEO_OUTPUT', 'android.permission.RECORD_AUDIO', 'android.permission.RECORD_VIDEO', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAPTURE_VIDEO_OUTPUT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAPTURE_AUDIO_OUTPUT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CAPTURE_SECURE_VIDEO_OUTPUT', 'android.permission.RECORD_AUDIO', 'android.permission.RECORD_VIDEO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAPTURE_VIDEO_OUTPUT']",
}