{
"name" : "MarcoPolo Weather",
"url" : "https://play.google.com/store/apps/details?id=com.gomarcopolo.weather",
"package" : "com.gomarcopolo.weather",
"category" : "Education",
"description" : "Explore the fascinating world of weather! Create rainbows, thunderstorms, blizzards, and more as you learn about 9 major weather types.  Have fun while learning  our digital sandbox design seamlessly blends education with engaging play.   Experiment and Discover: Weather controls allow you to change atmospheric conditions such as temperature, wind speed, precipitation, cloud coverage and so much more. Every choice and combination creates a new weather experience!  Control 9 different weather conditions: sunny, partly cloudy, cloudy, rain, thunderstorm, snow, blizzard, tornado, and hurricane. Choose from 4 different wind speeds  make a pinwheel spin or even fly a kite! Adjust the temperature  see the environment change as you go from hot to cold in both Celsius and Fahrenheit. Play with 3 mini-games and 55 interactive elements. You can plant flowers and make them bloom, melt an igloo, or have a snowball fight! Interact with 3 wacky characters that respond to the weather choices you make: you can dress them in light clothes when its hot, give them hot drinks in the cold, or hand them umbrellas when theyre wet. Add flowers, birds, a snowman or a picnic basket to the scene and see how the different weather types affect them. Acquire new vocabulary and build an understanding of weather through age-appropriate narration.  Through self-directed discovery, we expose children to early skills in science, technology, engineering and math (STEM), focusing on the following concepts:  Observe and describe different weather conditions including temperature, cloud cover, and precipitation Identify ways in which weather affects daily routines, such as dress and activities Determine how weather affects the natural landscape Learn about the water cycle and how clouds are formed   Privacy Policy  We take privacy very seriously. We do not collect or share personal information about you or your child, nor do we allow any third-party advertising. You can see our full policy at http://www.gomarcopolo.com/privacy-policy/  About Us: http://gomarcopolo.com/us/  MarcoPolo t-shirts and hoodies: http://gomarcopolo.com/shop/ ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE']",
}