{
"name" : "Animal Kingdom! Smart Kids Logic Games and Apps",
"url" : "https://play.google.com/store/apps/details?id=com.arrowstar.KidsAboutAnimals",
"package" : "com.arrowstar.KidsAboutAnimals",
"category" : "Educational",
"description" : " Birds for kids & animals of the world in kindergarten learning games for kids. Here: memory training games, logic games for kids with animal games for girls and boys!   Animal Kingdom! Kids learning games for toddlers free learning games for kids in kindergarten consists of many various kindergarten learning games for your children. In our educational apps for toddlers you will find 80 naturalistic illustrations of wild animals as well as domesticated ones & their sounds. This game addresses various topics such as: animals for kids wild and domestic, flashcards for kids and rhymes for the nursery.   Animal Kingdom! Kids learning games for toddlers - kindergarten games that introduces children to the animals of the world. In our memory games for toddlers you will find 80 naturalistic illustrations of wild animals for kids as well as domestic animals sounds!   A sound of each animal accompanies each illustration. Flashcards for learning toddlers are created to educate children about animals. The Guess who! not only helps to expand childrens knowledge of animals of the world but enhances their memory and attention span.   INCLUDED free learning games for kids in kindergarten:    80 different kinds of animal games for girls and boys  80 animals name and pictures  Delightful naturalistic illustrations of animals of the forest  80 puzzles for toddlers free  Fun flashcards for learning toddlers  Unique wild and domestic animals for kids  Comfortable and simple interface   Basic skills: logic, attention, memory and thinking  Fun domestic animals sounds effects and amazing graphics for kids  Parental control   No Internet needed   We hope that our educational apps for toddlers will be enjoyable and intriguing for your children! It will teach them to appreciate the natural world!  PACKS:   Farm animals for toddler  Domestic animals names with picture for kids  Animals of the forest  Sea animals   Birds for kids  In the North   Jungle animals  In Australia  In Africa  You get one pack Farm animals with for free. To get all games, please download the full version.    Here are memory games for toddlers, animal games for girls and boys, rhymes for the nursery, animals name and pictures, flashcards for kids. The development of such skills as thinking, memory, speech development, attention and imagination - in memory games for toddlers!   About MAGE:   A lot of kindergarten games and puzzles for toddlers free have been created by MAGE, a software company which develops memory training games, interactive books and rhymes for the nursery.  Our kindergarten games and puzzles for toddlers free are distinguished by high quality content with particular attention to design. The simple and user-friendly interfaces of our apps have been especially created for little ones. Our apps contain no third party advertising and comply with the standards of Designed For Family.  There is only a part of the content available in the free version of the application. To gain access to the full version, you will need to make a purchase. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.arrowstar.KidsAboutAnimals.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}