{
"name" : "Elif Ba Oynayarak Öğren Sesli",
"url" : "https://play.google.com/store/apps/details?id=com.Gthpro.arapcahafizaoyunu",
"package" : "com.Gthpro.arapcahafizaoyunu",
"category" : "Education",
"description" : "Kuran- Kerim renmek isteyenlerin yapmas gereken ilk alma elifba okuma (Arap harflerini renme) almas olacaktr.   Bu uygulamamz ile Arap alfabesindeki harfleri duyarak ve grerek renebilirsiniz. Alfabe renme blmnde dokunduunuz harfin Latin harfleriyle yazmn grecek, ayn zamanda telaffuzunu iiteceksiniz.  Duyarak ve grerek renme (oyun) blmnde, okunuunu duyacanz harfi dokunarak gstermeniz gerekmektedir. Harfleri iiterek renmeniz ok kolaylaacak.  Deiik zorluk seviyeleri ieren hafza oyunu blmlerinde ise hem elenceli vakit geirecek hem zihninizi gelitirecek hem de Arapa harfleri renmi olacaksnz. Bu ynyle ileri yataki insanlar iin de faydaldr.  Hafza oyunu oynamak isteyenler, sadece hafza oyunu oynayarak geirecekleri zamanda ayn anda Arap harflerini de iyice tanyabilirler. Bu ekilde zihin geliimi iin faydal oyun oynam olurken, ayn zamanda Kuran- Kerim renmenin de temelini atm olabilirsiniz.  Hafza oyunu: Ayn olan 2 harfi bulmaya aln.  2 kiilik oyun blmnde (2 kiilik TEST ekran), iki kii karlkl yaracak ve sylenen harfi bulmaya alacaktr. nce doru cevap veren 1 puan alr, hatal cevap verilirse -1 puan der. lk nce 10 puana ulaan yarmay kazanr. Arapa alfabesini renmeyi elenceye dntrn.  Ve elenceli bir oyun blm daha! Okunuunu duyacanz 4 harfi, duyduunuz sra ile tekrarlamaya aln. Uygulamamz bu blmde, ekrana gelecek harflerden rastgele 4 tanesini okuyacaktr. Harfleri dikkatli takip edin. iteceiniz bu harfleri, aynen iittiiniz sra ile bulmaya alacaksnz. Hem iitsel hem de grsel hafza geliimi ile Arap alfabesini renmeyi salayn.  Aklama: Uygulamamz Arap alfabesini ve harekeleri eitli oyunlarla tantmak ve elenerek temel dzeyde retmek amacyla hazrlanmtr. Mahreleri reten ileri dzey dersler iermemektedir. The first study for those who want to learn the Quran is to read elifba (learning Arabic letters).  With this application, you can learn the letters of the Arabic alphabet by hearing and seeing. In the alphabet learning section, you will see the spelling of the letter you touched in Latin letters, and you will also hear its pronunciation.  In the learning (game) section with hearing and seeing, you need to show the letter you will hear by touching it. It will be very easy to learn by hearing the letters.  In the memory game sections that contain different levels of difficulty, you will have fun, improve your mind and learn Arabic letters. In this respect, it is also useful for older people.  Those who want to play memory games can get to know Arabic letters at the same time they will spend not only by playing memory games. In this way, while playing a useful game for mind development, you may also have laid the foundations of learning the Holy Quran.  Memory game: Try to find 2 letters that are the same.  In the 2 player game section (TEST screen for 2 persons), two people will compete and try to find the spoken letter. First, the correct answerer gets 1 point, and if the wrong answer is given, it drops -1 point. First he wins the contest, reaching 10 points. Turn learning the Arabic alphabet into fun.  And another fun game part! Try to repeat the 4 letters you will hear in the order you hear them. Our application will read 4 random letters from the screen. Follow the letters carefully. You will try to find these letters you will hear, in the same order you hear them. Provide learning the Arabic alphabet with the development of both auditory and visual memory.  Description: Our application is prepared to introduce the Arabic alphabet and movements with various games and teach them at a basic level by having fun. It does not include advanced lessons that teach Mahres. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
}