{
"name" : "Nursery Rhymes Songs - HeyKids",
"url" : "https://play.google.com/store/apps/details?id=com.heykids.nurseryrhymes.app",
"package" : "com.heykids.nurseryrhymes.app",
"category" : "Education",
"description" : "Enjoy nursery rhymes songs for kids!  The official Nursery Rhymes Songs by HeyKids app brings the same learning videos that generates millions of views on YouTube each month. This nursery rhymes songs app is designed for curious little babies, toddlers, and preschoolers to dive into our world of discovery, learning and entertainment!  Your child will enjoy popular baby rhymes, children songs, and lovely 3D animated nursery rhymes videos that will keep them entertained while learning new vocabulary.  Carefully designed for babies, toddlers and children of all ages this application is ideal for an engaging, educational, visually and audibly exciting experience. Turn up the volume and let the family fun begin!  Features  NO ADS, ensuring a safe environment for your children  OFFLINE VIDEO PLAYBACK. Watch the nursery rhymes videos anywhere you go, no internet connection required.   Over 15 famous nursery rhymes songs with 3D animated music videos!  New animated children songs and baby rhymes added every month!  Designed for kids - no unnecessary buttons, easy scrolling, and instant full-screen.  Multiple settings available for parents.  Kids songs collections that will keep your toddler entertained and educated.  Preschool videos that will make your child smile.  Nursery rhymes songs included for FREE:  If Youre Happy And You Know it  Twinkle Twinkle Little Star  Old MacDonald Had a Farm  Incy Wincy Spider  Are you sleeping? Brother John?  More childrens songs are available with a subscription:  Five Little Ducks Went Out One Day  The Wheels On The Bus  Six Little Ducks  Chicks Song  Rain Rain Go Away  Bingo  O Christmas Tree  Chicks Song  Spock-a Doodle, Chicken Noodle  and many more...  Our aim is to provide the best nursery rhymes songs, preschool videos and kids songs collections for your family.   For customer support, comments, or suggestion please contact us at contact@heykids.com  Do you like our app? Please rate us or write a review to tell us what you think. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}