{
"name" : "Pharmacy Technician 2018 Exam",
"url" : "https://play.google.com/store/apps/details?id=com.flashcardinc.pharmacy",
"package" : "com.flashcardinc.pharmacy",
"category" : "Education",
"description" : "This app contains thousands of real exam questions with IMAGES on the topic of Pharmacy Technician.   With our Advanced Smart Learning Technology, you can master the learning materials quickly by studying, practicing and playing at lunch, between classes or while waiting in line.   Pharmacy Technician Exam prep uses proven study and test-taking strategies so that youll feel confident and ready to go when you have to take the Pharmacy Technician Exam.  Main Features: +) Learning materials are prepared by EXPERTS in this field for the most current exam. +) EXAM SIMULATOR brings the real exam environment. +) Automatically FILTER your most difficult questions. +) Learn more efficiently by PLAYING games with time constraint. +) TRACK your progress on every small set youve studied.  A pharmacy technician is a health care provider who performs pharmacy-related functions, generally working under the direct supervision of a licensed pharmacist. Pharmacy technicians work in a variety of locations (usually in community, retail, and hospital pharmacies), but can also work for long-term care facilities, pharmaceutical manufacturers, third-party insurance companies, computer software companies, or in government or teaching. Job duties include dispensing prescription drugs and other medical devices to patients and instructing on their use. They may also perform administrative duties in pharmaceutical practice, such as reviewing prescription requests with doctors offices and insurance companies to ensure correct medications are provided and payment is received.  Disclaimer: The publisher of this app is not affiliated with or endorsed by any testing organization. All organizational and test names are trademarks of their respective owners. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}