{
"name" : "First Words for Baby: Animals",
"url" : "https://play.google.com/store/apps/details?id=com.androbaby.firstanimalsforbaby",
"package" : "com.androbaby.firstanimalsforbaby",
"category" : "Educational",
"description" : "Are you looking toddler games free for 2 years old or toddler games free for 3 years old? This app is one of the best toddler learning games and great to teach animals to your babies, toddlers and kids! Introduce animals to your toddler, kid or baby with this toddler learning game. Baby learning apps are good for baby education and you will find First Words for Baby series as the best in all baby learning apps and baby games.  This baby app is one of the baby learning games with more than 80 carefully selected common animals. If you need baby apps for 1 year olds you will love this baby learning game! Flash cards will help them to learn many of the lovely animals.  - Baby apps for 1 year olds and games for baby 1 years old and also games for babies for 1 to 2 year olds to. So your baby can play this baby book for more than 2 years. - Baby learning games with 8 animal flashcard categories and more than 80 animals(Baby Animals, In the Forest, Pets, Creepy Crawlies, Safari Animals, Water Lovers, Birds, Farm Animals). - Baby book with colorful high quality pictures keep your babies interest level high. - Professional pronunciation of words for childs correct learning. - Nice animations and real sounds of animals! - One of the best games for baby with a simple and intuitive navigation. - Your toddler will learn much faster with this unique app! - Animal baby flash cards can keep your kids entertained anywhere, anytime! - Toddler games for free for 2 years old and toddler games free for 3 years old! - Baby flash cards and games for babies.  This baby app is ideal for parents and children to play and enjoy together. Playing is so easy that even a baby can do it without the help of an adult. Baby first animals is a first words app for your toddlers, children and kids. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}