{
"name" : "Epic!: Kids' Books, Audio Books, Videos & eBooks",
"url" : "https://play.google.com/store/apps/details?id=com.getepic.Epic",
"package" : "com.getepic.Epic",
"category" : "Education",
"description" : "Epic! is the #1 childrens digital library for kids 12 and under, offering access to over 40,000 high-quality books for kids, learning videos, reading quizzes and more. Its an unlimited reading library your child can take anywhere!   Start your free 30-day trial today. Only $7.99 per month after the first 30 days.  With thousands of childrens books and videos, including kids audiobooks, ebooks and read along books, Epic! brings unlimited reading and learning to millions of children at home and in school.  With Epic!, kids can explore their interests in a fun, safe, kid-friendly environment with no ads or in-app purchases.  With ebooks and educational videos for kindergarten, as well as 1st, 2nd, 3rd, 4th, 5th, 6th and 7th grade reading levels, your child will unlock a world of reading, learning and discovery getting instant, unlimited access to over 40,000 high-quality books, videos and so much more.   There are two versions of Epic!, both available through this app:  1. EPIC! FOR HOME * Over 40,000 childrens books and learning videos, with more added weekly * Audio-enabled read-to-me books, audiobooks, bilingual books (Spanish, Chinese and French), quizzes and educational videos * Up to four individual, customized child profiles * Personalized book recommendations for each child based on their reading levels and interests * Online and offline reading (you can take Epic! in the car, on a plane, or camping) * A reading log to track progress, available in the app and emailed weekly to parents * No ads or in-app purchases * Use Epic! across devices, on Android, iOS or any Web browser   2. EPIC! FOR EDUCATORS * Completely free to elementary school teachers and librarians worldwide * Unlimited access to high-quality childrens books, including read-to-me, audio and non-fiction  * Ability to create personalized student profiles  * Personalized recommendations based on students reading levels and interests * Epic! is used in over 90% of US elementary schools  THE EPIC! LIBRARY   Our award-winning library includes a wide variety of high-quality books and educational videos from leading publishers such as HarperCollins, Macmillan, Smithsonian, National Geographic and many more.    Well known books and series include: * Flat Stanley * Diary of a Wimpy Kid * Goosebumps * National Geographic Kids * ...and many more  The Epic! library contains a wide variety of book types: * Picture books  * Chapter books * Books for early readers * Story books & childrens bedtime stories * Educational books * Audio-enabled read-to-me books * Non-fiction titles * Audiobooks * Graphic novels * Non-fiction titles * Spanish, Chinese and French books * and many more  Start your free 30-day trial today. Only $7.99 per month after the first 30 days.  SUBSCRIPTION DETAILS  - You can cancel your subscription anytime, no hassles or fees - You can find instructions on how to manage and cancel subscriptions here: http://bit.ly/EpicFAQMembership  CUSTOMER SERVICE  Were here to answer any of your questions about Epic!. Please send us an email at support@getepic.com and our friendly customer support team will reply shortly. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE']",
}