{
"name" : "JA Sensei - Learn Japanese, Kanji, Lessons",
"url" : "https://play.google.com/store/apps/details?id=com.japanactivator.android.jasensei",
"package" : "com.japanactivator.android.jasensei",
"category" : "Education",
"description" : "All-in-one application to learn Japanese. Hiragana, katakana, kanji, vocabulary, phrasebook, grammar, and MUCH more! Basic to advanced lessons. Smart progress tracking exercises to improve your writing, reading, speaking and listening skills. Discover surprising culture facts to think like a Japanese, and avoid embarrassing situations.   GENERAL IMPORTANT BENEFITS    On-going project since 2011, you are sure to get continuous updates and improvements  All audio clips by a native Japanese speaker for authentic Japanese pronunciation. No voice synthesis.  No Internet connection required, almost everything is downloadable  Highly customizable quizzes paired with the scientific SRS system that tracks your progress.  Adapted for beginners to advanced learners  No ads   DETAILED INFORMATION   PROGRESSIVE JAPANESE LESSONS  Ideal introduction to the Japanese language, and quick progress  For each lesson: Japanese dialogue, vocabulary, grammar, exercises, and a culture page  Take the final quiz to validate each lesson  Many entertaining and explanatory illustrations  JAPANESE KANA, KANJI, RADICALS  Phonetic information and audio recordings for each Japanese sound  Over 6,000 kanji with stroke orders, meanings, word examples, and more.  Kanji breakdown to analyze the composition of each kanji and remember it more easily  Powerful kanji search tools by radicals, meanings, on/kun readings, JLPT levels, etc.  Detailed kanji radicals information (Kangxi number, position, meaning, frequency, etc.)  Drawing tool to learn how to write kana/kanji/radicals with the right stroke order  Learn by JLPT, Jouyou, or Kanji Kentai levels  Create and manage your personal lists  JAPANESE PHRASEBOOK  Over 900 Common Japanese phrases for real life communication grouped by themes  Smart quiz to improve your Japanese expression and comprehension skills  Learn Japanese phrases with audio clips and words in context  Each Japanese phrase can be broken down to get a list of words and detailed grammar explanation  Record your voice, and compare it to a native speakers pronunciation   Create and manage your personal lists  JAPANESE AURAL COMPREHENSION  Listen to entertaining illustrated situations  3 levels of difficulty for each situation. Easy enough for beginners and challenging enough for advanced users  Take the final quiz to validate your comprehension  All words available in the vocabulary module to learn before listening to the text  JAPANESE CULTURE GUIDE  Be ready for a culture shock and avoid embarrassing situations!  Fun and surprising detailed information on various topics of the Japanese culture  Get straight into the Japanese mind to understand how they think and behave. Japanese people will feel more comfortable with you.  JAPANESE VOCABULARY  Thousands of words with audio clips grouped by themes  Take audio, writing, or even speaking quizzes  Comments explain the word when necessary  Search for any word with one easy-to-easy search box  Record your voice, and compare it to a native speakers pronunciation  Create and manage your personal lists of Japanese words  AND MUCH MORE TO DISCOVER...  Grammar: 113 easy to advanced grammar sheets with examples ordered by JLPT   Japanese Particles: 168 different usages with examples  Japanese Counters: 45 of the main counters with examples  Verbs and Adjectives: basic and advanced conjugation  Numbers: audio quiz, search tool, personal lists, etc.  An in-app paid version is proposed to support the investments for new features and contents ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}