{
"name" : "Englisch Vokabeltrainer",
"url" : "https://play.google.com/store/apps/details?id=com.superiorlanguage.vokabel.englischvokabeltrainer",
"package" : "com.superiorlanguage.vokabel.englischvokabeltrainer",
"category" : "Education",
"description" : "Der Superior Language Englisch Vokabeltrainer richtet sich an Schler, die Englisch in der Schule lernen. Die Vokabeldatenbank des Vokabeltrainers beinhaltet die Vokabeln vieler gngiger Lehrwerke. Besonderes Augenmerk habe ich bei der Entwicklung darauf gerichtet, dass das Lernen der Vokabeln mit minimalem Eingabeaufwand verbunden ist, um das Paucken nicht noch anstrengender zu machen als ntig. Dazu gehrt z. B., dass die Vokabelapp schon whrend der Eingabe berprft, ob Ihr eine bersetzung richtig eingegeben habt, und dann automatisch zur Abfrage der nchsten Bedeutung springt. Die berprfung Eurer Eingaben ist fehlertolerant, so dass Eure Antworten z. B. auch als richtig erkannt werden, wenn Ihr mal einen Buchstaben im Wort falsch auf der Tastatur erwischt habt (kann auf so einem kleinen Display ja schon mal passieren, wenn man keine hauchdnnen Finger hat). In der kostenlosen Version knnt ihr die Kernfunktionen Vokabelabfrage Englisch-Deutsch, Vokabelabfrage Deutsch-Englisch sowie Einschrnkung des Abfrageumfanges innerhalb einer Lektion nutzen. Die kostenlose Version bedeutet aber, dass ihr Werbeeinblendungen akzeptieren msst.  Darber hinaus gibt es weitere Funktionen, die nur mit einer kostenpflichtigen Premiumlizenz zur Verfgung stehen:  - keine Werbeeinblendungen - Offlinebetrieb, d. h. ohne Internetverbindung (nur solange die App nicht beendet wird)  Fr meine App solltet Ihr ber ein Smartphone mit einer Displaygre ab ca. 4 (Auflsung 480x800 oder mehr) und Android ab 4.1 (Jelly Beans) verfgen. Eine Internetverbindung ist erforderlich, auch wenn nur sehr kleine Datenmengen fr die App bertragen werden. Persnliche Daten von Euch speichere ich nicht. Was Google und Konsorten im Hintergrund treiben, wei ich nicht und kann dafr auch nicht garantieren. Aber das ist ja bei jeder App so. Beim Vokabellernen gilt: Hartnckigkeit siegt und nichts ist so schwierig wie es aussieht. Noch ein kleiner Hinweis: Wenn ihr Probleme mit der App habt, schreibt mir bitte ber meine Kontaktadresse kontakt@superior-language.com damit ich die Probleme im direkten Dialog beheben kann. The Superior Language English Vocabulary Builder is aimed at students who are learning English in school. The vocabulary base of the vocabulary trainer contains the vocabulary of many current textbooks. Special attention I have aimed to develop that learning the vocabulary associated with minimum input in order not to make the strenuous Paucken than necessary. This includes, for. B. that the Vokabelapp checked while you type if you have entered a translation correct, and then automatically jumps to the next query significance. The verification of your entries is fault tolerant, so that your answers for. As are recognized to be correct when you have time off to a letter in the word wrong on the keyboard (can happen on such a small screen before, if you have no gossamer fingers). In the free version you can use within a lesson limitation of the scope of inquiry core functions vocabulary query English-German, German-English vocabulary query as well. But the free version means that their advertisements have to accept. In addition, there are other features that are only available with a paid premium license available:  - no commercials - Offline operation, d. H. without an Internet connection (as long as the app is not finished)  For my app you should have a smartphone with a screen size from approximately 4  (resolution 480x800 or higher) and Android from 4.1 (Jelly Bean) have. An Internet connection is required, even if only very small amounts of data for the app to be transferred. Personal data of you I do not save. What Google and Co. in the background push, I do not and can not guarantee either. But this is so in every app. When learning vocabulary applies: wins tenacity and nothing is as difficult as it looks. A little hint: If you have problems with the app, please write me on my contact kontakt@superior-language.com so I can fix the problems in a direct dialogue. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'com.superiorlanguage.vokabel.englischvokabeltrainer.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}