{
"name" : "Learn R Programming full : R Programming Tutorials",
"url" : "https://play.google.com/store/apps/details?id=com.vrpmeone.LearnR",
"package" : "com.vrpmeone.LearnR",
"category" : "Education",
"description" : "R is a programming language and software environment for statistical analysis, graphics representation and reporting. R was created by Ross Ihaka and Robert Gentleman at the University of Aucklandand is currently developed by the R Development Core Team.  R programming is majorly used programming language now, it is very nice if you have decided to learn this r programmin language. there are lots of stuff available to learn it online and offline both way. we are tring to provide you the tutorials of r programming language free.   we have developed Learn R Programming full : R Programming Tutorials app and you are seeing this on play store free. it amaizing tutorials of r programming language free and offline.   we put all tutorials offline but you will not be able to access it without internet connection, because we have used online styles path to make our tutorials effective, but Learn R Programming full : R Programming Tutorials will give you the feel of offline app. just keep on the mobile data.  we have devided our Learn R Programming full : R Programming Tutorials in some points which are   1) Learn basic of r programming language 2) Learn advance of r programming language  3) learn statitiscs of r programming language  4) interview questions of r programming language  Learn R Programming full : R Programming Tutorials has not only the tutorials of learning r programming but it is having the interview questions of r programming language. and all of this is free available.  Learn R Programming full : R Programming Tutorials can help you to learn complete r programming free. wheather you are beginner of advance learner Learn R Programming full : R Programming Tutorials can be helpful in both case. so what are you waiting for start learning r programming today. best of luck.    if you liked our app then let us know, how did u like our work or if you didt like it even then let us know, why you didnt. if you love our work and if u think that it can be helpfull to other then dont hesitate to spread in your freind cercle.   thanks for your support ,... we care of your learning....  our reffrences : # www.tutorialspoint.com # www.iconfinder.com ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}