{
"name" : "Triangle Algorithm Visualizer",
"url" : "https://play.google.com/store/apps/details?id=com.thevarunshah.trianglealgorithmvisualization.free",
"package" : "com.thevarunshah.trianglealgorithmvisualization.free",
"category" : "Education",
"description" : "This app lets you discover a new way to interact with and visualize a simple algorithm called the Triangle Algorithm.   The app visualizes solving 2D cases of a significant problem in Computer Science: Is a point inside the convex hull of a given set of points? The app thus serves as a medium for education and for algorithmic art.  Use the basic mode to visualize what is happening with an arbitrary set of points when the algorithm is applied with various user entered points.  Use the more creative gradient mode to interact with different colors and visualize all of the different possibilities when a set of vertices is given by you!   You can save these images as high-res (4K) on your phone and also print them out as posters and/or use them as digital art. The possibilities are endless!   Age doesnt matter!  Children will find this app appealing because of the simple nature of the app in rendering colorful and surprising images in a matter of a few seconds.  Those interested in coloring and art will find the app interesting because it can generate so many distinct, yet beautiful, images.  Teachers, at any levels, will find it interesting in demonstrating to students not only some very important and interesting geometric and computer science problems, but a simple yet powerful algorithm and how it solves them.  Researchers can be inspired by the 2D visualizations of the underlying algorithm in solving challenging problems in arbitrary dimensions.  Yet an architect can be inspired to create 3D versions of the images and then go on to 3D printing them.  The underlying algorithm in the app is the Triangle Algorithm, an algorithm discovered by Bahman Kalantari (https://www.cs.rutgers.edu/~kalantar/), professor at Rutgers University, Department of Computer Science.  The algorithm is described in the article by Professor Kalantari: A Characterization Algorithm and An Algorithm for A Convex Hull Problem, Annals of operations Research, Volume 226, Issue 1, pp 301-349, 2014. (see http://link.springer.com/article/10.1007/s10479-014-1707-2).  This application is an implementation of the Triangle Algorithm in 2D, designed and implemented by Varun Shah (varun.shah@rutgers.edu), graduate student at Rutgers University.  Licensed under the Apache License, Version 2.0 (the License). Copyright 2017 Varun Shah. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}