{
"name" : "Sanghamitra School App",
"url" : "https://play.google.com/store/apps/details?id=com.sangamitra.slate",
"package" : "com.sangamitra.slate",
"category" : "Education",
"description" : "An interaction platform app that bridges the gap between parents, students, teachers. Teachers are recommended content to keep students engaged in a productive environment. The below features have been developed to tackle different aspects of the problem  School Board To bridge three different circles - parents, teachers and the students, we have created a School Board where teachers can showcase achievements and creative works of students and some other articles for educating parents. Sharing a students achievements and creative works will give them a productive identity among immediate peers unlike social media  Note Teachers can share resources and important notes with a class to enrich daily lessons. It is created in a student-friendly way to promote interactions and discussion by giving an option for the students to stay anonymous from the other students so that shy and introverted students may also participate.  Diary Allows teachers, students and parents to keep track of whats being taught in school on any particular day and whats to be done at home. In case a parent cant access the platform Homework an Update SMS may be sent to the parent.  Groups Teachers can create interest-based groups to cater to the needs of a specific group of students.  Discussion Allows for a conversation between teachers, students, and parents. A parent and student can raise a request and start a conversation on its approval by the teacher. The administrator can view all the conversations between parents, students, and teachers. Can also start a new conversation  Operator Dashboard Maintain school academic and administrative database. Schedule and post-school events and tasks at the same place. Plan Curriculum for all standards. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.ACCESS_NETWORK_STATE', 'com.sangamitra.slate.permission.C2D_MESSAGE', 'android.permission.VIBRATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}