{
"name" : "Mnemonic Words",
"url" : "https://play.google.com/store/apps/details?id=com.mnemonicrn",
"package" : "com.mnemonicrn",
"category" : "Education",
"description" : "Vocabulary course for beginners. Effective memorization technique. 250 glossaries on any topic. 10 exercises for memorization, vocabulary test, and games.  MEMORIZATION METHOD  Built-in interval word repetition technique, thanks to which the most disciplined users can remember up to 100%.  Interval repetition calendar, which will show and tell you when and what words need to be repeated.  Additional repetition of words in which you make mistakes in the exercises.  GLOSSARIES AND DICTIONARY More than 250 glossaries of English words and phrases for all levels and on any topic.  Beginner Level - 1000 words.  Elementary level - 1500 words.  Intermediate level - 2500 words.  Advanced level - 6500 words.  Thematic glossaries - 8000 words.  Phrasal verbs and idioms - 7000 phrases.  A COMPLETE ENGLISH DICTIONARY  VOCABULARY COURSE - MY FIRST 1000 ENGLISH WORDS The course is specially designed for users with the beginner level of vocabulary and will help you quickly and effectively learn the 1000 most necessary words in the English language. The course consists of 50 lists of 20 words and involves their consistent study by the method of interval repetition with regular testing of progress.  CREATE YOUR OWN LISTS OF WORDS Learning English words in small lists will help organize and organize a large number of words and increase the efficiency of memorization.  Creating lists is possible in several ways:  Automatic word selection for all levels.  Individual selection of words from glossaries.  Adding words from the dictionary.  Creating lists from copied text.  EXERCISES FOR MEMORIZATION 10 different exercises for the comprehensive memorization of English words and phrases. From these exercises, you can always choose those that are right for you and your level of English.  A vocabulary test to determine your vocabulary level, as well as three fun vocabulary games to help you bring to the surface all the English words you have ever learned.  ADDITIONAL WORK OPPORTUNITIES WITH WORDS  Adding your own text associations.  Ability to upload pictures (if they are missing).  Adding your own translations.  Changing the basic translation of a word.  PHRASEBOOKS More than 2500 conversational phrases on the most popular topics. Ability to repeat phrases in 3 exercises.  FAMILY ACCESS FUNCTION Users with a renewable paid subscription can join up to 4 accounts to their account, and users with a Lifetime Subscription up to 6 accounts.  OTHER USEFUL FUNCTIONS  Creating flashcards from glossaries and word lists and sending them to your email.  Ability to add English words to your lists from other applications.  Sending your lists with words to any installed messengers or email.  Section Favorites, in which you can add the glossaries, lists, words and colloquial phrases you like.  Section Your vocabulary, which stores all the learned words.  The ability to learn words on our website https://mnemonicwords.com.  After installing the application, you will have the opportunity to use all available functions without restrictions for 3 days (with the exception of the Family Access function, as well as creating Flash Cards). After this period, the application will work in a limited mode. To remove restrictions, you will have the opportunity to purchase one of the available subscriptions:  An automatically renewable monthly or annual subscription for $ 1.99 and $ 17.99 respectively.  A lifetime subscription for $ 39.99, which includes all in-app purchases. ",
"desc_perms" : "['android.permission.INTERNET', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}