{
"name" : "LingoChamp: Learn English Free",
"url" : "https://play.google.com/store/apps/details?id=com.laix.lingochamp",
"package" : "com.laix.lingochamp",
"category" : "Education",
"description" : "Learn with your personal AI tutor to speak English like a native. No matter what level you are at, practice with LingoChamp and you can speak English confidently!   HIGH-QUALITY CONTENT - LingoChamp will customize the systematic courses in accordance with your English level. Vocabulary, listening, speaking and grammar are no longer difficult. We will help you improve your English in all respects.  - Professional and high-quality learning content created by authoritative language professor and teach in research team. - Use rich and gamification questions to enhance English learning experience.  - Use your mother tongue to learn English, currently we support Spanish, Portuguese, Japanese and Korean. Speak English in an easy way!  FREE LINGO TEST - We offer FREE Lingo Test for you to fully analyze your level of English, which is just a bite-sized test, wont take long, and all you need to do is to find a quiet place to speak confidently.  - An instant report! Your level will be rated by our AI teacher scientifically and immediately.  - Take the test, estimate your level of CEFR, IELTS, TOEFL, TOEIC (for reference only ) - Accurately analyze your English language proficiency, obtain your exclusive English improvement plan so as to help you achieve the goal faster!  SPEAK CONFIDENTLY AND FLUENTLY - Customize your personal English lessons and give you a detailed pronunciation report. - Compared with Memrise, Babbel and Duolingo, EWA, Busuu, ELSA, Quizlet, Hello Talk, and 4English, we provide pronunciation report powered by worlds leading AI technology to help you locate your English speaking problems and improve your English pronunciation, besides, every time you practice your oral English, you can get instant score from your AI teacher. - Build your learning habits by using your daily study reminder to achieve your daily learning goal. - Practice your English speaking skill with AI - voice recognition technology to help you speak fluently, easily, confidently! Come and get to meet your AI teacher.  SEE YOUR PROGRESS - Scientific dashboard will help you master your learning and let you quickly identify your weaknesses.  - Track your progress and come back to practice any word youre stuck on in your prior sessions. - Enhance your English conversation skills and increase your vocabulary to get overseas expatriate opportunities or promotion chance!  - Listen to authentic English audios with subtitles in your local languages.  SUBSCRIBE LINGOCHAMP PREMIUM - You can learn all Premium courses and unlock all Premium functions after subscribing to our service.  - The subscription will automatically renew unless it is canceled at least 24 hours before the end of the current period. Your account will be charged for renewal within 24 hours prior to the end of the current period unless you change your subscription preferences in your account settings. - After purchase, you can manage your subscription through your account settings.    > LingoChamp Privacy Policy: https://www.lingochamp.world/privacy > LingoChamp Terms of Service: https://www.lingochamp.world/terms ",
"desc_perms" : "['android.vending.BILLING']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}