{
"name" : "Badanamu: Bada Rhyme",
"url" : "https://play.google.com/store/apps/details?id=com.calmid.learnandplay.badarhyme",
"package" : "com.calmid.learnandplay.badarhyme",
"category" : "Education",
"description" : "The first of our entry-level learning program focusing on building oral language through classic nursery rhymes that children will love.  Learn vocabulary, English word sounds, and basic English awareness.  Your child will love learning with Bada and his friends! Fun activities, books, songs, and interactive quizzes enable your child to learn in an exciting new way and also motivate your child to discover a new awareness of English.  The Bada Rhyme curriculum includes the following:  12 storybooks,12 songs, and 84 learning activities.  Nursery rhymes including both songs and books for learners to engage with.  Vocabulary including words from nursery rhymes to help learners build awareness.  Songs including the classic nursery rhymes in unique Badanamu style.  With Bada Rhyme, you can be sure of the following:  It is safe and appropriate for children, with no ads or improper content.   Your child will not be playing addictive games or wasting time.  The activities are structured yet interesting and dynamic.  It will provide real learning transfer and retention.  Bada Rhyme is perfect for:  Children from ages 2-6 years.  Daily interaction and microlearning.  Diverse learning content and engagement.   Preparing children for common core standards  Follow us on one of our social media accounts to hear the latest about our products and animations!  Website: https://www.kidsloop.net  YouTube: https://www.youtube.com/badanamu  Instagram: https://www.instagram.com/badanamu/  Facebook: https://www.facebook.com/Badanamu1 Badanamu: Lets learn and play together!  **Permission required to access your devices storage to save and load photos ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}