{
"name" : "Pride Sikhe",
"url" : "https://play.google.com/store/apps/details?id=com.navroop.pridesikhe",
"package" : "com.navroop.pridesikhe",
"category" : "Education",
"description" : "PrideSikhe is informative and constructive app about Sikhi also known as Sikhism for Sikhs and non-Sikhs.  This is currently under development. This is a fully functional application include concept of Sikhi, Sikh prayers, and much more things. An active internet connection (Wi-Fi or Cellular Data connection) is required for some activities and some can be seen Offline.  The app contains information about almost every end of Sikhi basics. You can see whats the Sikhism really look like. You can find more about Sikhism, search the roots of Sikhi, and see the beliefs and a lot more Stuff.   In addition to the live Gurudwara broadcasts, you can read prayers (banis) as well as full Sri Guru Granth Sahib (Current  Sikh Guru) in Multilingual Like Gurmukhi, Hindi and English with explanation too.   PrideSikhe contains the translation and transcription (Romanised Gurmukhi) of the prayers as well.  We hope this will serve you well.   Constructive criticism is welcomed But even if you are facing regular trouble with app please do contact us Rather than rating low That will moralize our spirit.  Tips:  * If you are playing audio online and audio is playing with brakes then you can pause to do buffering in advance so than playing will be smooth.  * If you are audio is not playing but app is showing play then wait for some seconds stop the channel and play again.  * More over wait after you click playing button as It will take some time to initialize buffering (playing) depending upon  Your Internet connection. * Hukamnama i.e. Daily Order will take some time to load. If its showing no network on first click even if internet is connected then just try again.  * If your Internet connection is working but app is unable to connect. Then two thing might happened: first you internet connection is not downloading Or The server is busy. The best thing in this case is to try again later for connectivity. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
}