{
"name" : "Bible Catholic",
"url" : "https://play.google.com/store/apps/details?id=com.jatapp.bibleforyoucatholic",
"package" : "com.jatapp.bibleforyoucatholic",
"category" : "Education",
"description" : "Bible Catholic is a free Bible app to help you study the Bible on your phone or tablet every day. With this quick download you can choose to read the Holy Bible in one of four different versions (the King James Version, American Standard Version, Bible in Basic English Version, or Reina Valera Version in Spanish) or change between these easily!  You will receive notifications of daily Bible verses with associated thoughts and prayers. You will learn how to apply Bible verses to your everyday life and become closer to God through the daily devotional with study and reflection. Bible Catholic allows you to easily find scripture during church services, fellowship groups, Bible study, and religious classes. Swipe left or right to easily move between chapters. Make the font larger or smaller to fit your needs.  When you find a Bible verse that speaks to you, you can easily bookmark it so you can find it quickly at a later date. Choose a different color to highlight verses for church, study group, or personal reflection. Make a list of your favorite verses. Once you have your list of favorites or bookmarks, you can share the whole list with your friends!  Share your favorite Bible verse or verse of the day with your friends through social media (Facebook, Instagram, email, SMS, WhatsApp, or Twitter to name a few)! Beautiful images that are hand selected to match the verse of the day will draw everyones attention. Your friends will be able to leave comments for you and other users to see. You and your friends can like the comments or the verse. These comments and likes are updated without refreshing your app. This can help you connect with other students of the Bible across the globe in real-time!   Are you traveling somewhere without internet access? You dont have to have internet to read this offline Bible! This is a great Bible app to share with those going on a mission trip. Since it is free you know you will be able to share it with anyone who crosses your path. Share Gods good word.   Are you a Sunday school teacher who wants to increase your students knowledge about the Bible while having fun? Use the Master of the Bible trivia game to learn more.   Are you or a loved one unable to see well? Make the font larger easily. Or, this app can be used as an audio Bible to read the Bible Catholic.   Are you a student researching a topic within the Bible? Use the easy search feature to find any word within the entire Bible and then you can filter these search results even more. Share verses with your study group. Copy the verse easily into your presentation or paper.   Having trouble falling asleep and keeping your partner awake in bed? Switch to night mode or reading mode so the screen is darker.   Do you have a recommendation to make our app better? Send us an email through the app. We are always striving to improve.  We are a great ministry of people who love Jesus and we would appreciate your support with donations and prayers.  Use Bible Catholic to study and share Gods word anywhere. Free of charge.   Features:  Free  Choose between 4 versions of the Bible (three in English, one in Spanish)  Daily Bible verses with thoughts, prayers, and inspirational pictures  Share verses through social media  See real time likes and comments from people around the globe  Use the Bible offline  Change the font easily  Use night mode or reading mode for more readability  Email us to improve the app  Use the search feature to help with research  Use the copy feature to easily transfer verses without typos  Highlight OR bookmark your favorite verses  Use the Audio Bible feature to read the Bible to you  Use drop down menus to find books, chapters, and verses quickly   Swipe left or right to see different chapters within the same book  No internet access to read the Bible. Anywhere! Anytime! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}