{
"name" : "Animals Quiz - Learn All Mammals, Birds and more!",
"url" : "https://play.google.com/store/apps/details?id=com.asmolgam.animals",
"package" : "com.asmolgam.animals",
"category" : "Educational",
"description" : "In this application, you will find 100 pictures of famous mammals, 89 photos of birds, 19 reptiles and 4 amphibians, 44 fishes, 46 arthropods from all over the world. Both wild animals and domestic animals. The whole zoo! Can you guess them all?  It is one of the best games about animals. All animals are divided into five corresponding levels: 1. Mammals: African rhinoceros and hippopotamus, Australian echidna and platypus. Is it a meerkat or a groundhog? Try to guess today! 2. Birds: small American robin and giant ostrich from Africa, flamingo and emu from Australia, even penguins from Antarctica! 3. Reptiles and Amphibians: python and alligator, Komodo dragon and giant Galpagos tortoise. 4. Fish: from sharks and piranha to salmon and sturgeon. 5. Arthropods - insects, spiders, crayfish. Can you distinguish a mantis from a scorpion?  Five game modes provide entertaining experience for everybody: * Spelling quizzes (easy and hard) - guess the word letter by letter. * Multiple-choice questions (with 4 or 6 answer options). Its important to remember that you have only 3 lives. * Time game (give as many answers as you can in 1 minute) - you should give more than 25 correct answers to get a star. Two learning tools: * Flashcards (browse through all animals without guessing). * Tables for each class of animals.  The app is translated into 20 languages. If you wish, you can test your knowledge of animals names in English, German, Spanish, and many other foreign languages. Advertisements can be removed by an in-app-purchase.  Become an expert in zoology! Make your first step into ornithology and herpetology! Guess the animal in the picture! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}