{
"name" : "English Learning For Kids",
"url" : "https://play.google.com/store/apps/details?id=com.marlustudio.englishforkids",
"package" : "com.marlustudio.englishforkids",
"category" : "Education",
"description" : "Do you want to teach your kids English? Then English Learning For Kids is a must download if you want to teach them English in a fun and engaging way. Download English Learning For Kids now to give your child the best chance to learn English for life.  The app teaches the essentials of English using a very engaging method. It adds fun to education so the kids will always be interested in learning.  Furthermore, the app contains NO ads.  Main app features: * Pop the balloons again and again to hear a repeat of the letter, number or picture. * In the numbers category, pop the small balloons to hear a count of the represented number. (requires in-app purchase to unlock all categories). * Full English alphabet. * Numbers 1 to 10. (requires in-app purchase to unlock all categories). * A big collection of animals, shapes, colors, objects and fruits and vegetables. (requires in-app purchase to unlock all categories). * A learn section and a play section in each category. * A coloring section and a puzzle section in most categories. * Floating balloons that can be popped. * A very child friendly and fun background music that can be turned on/off. * All words pronounced in a very clear, friendly and gentle female voice. * You have the ability to keep repeating the words until you or the child get it right. * Each represented word has its spelling also displayed. * Excellent for children and adults alike.  If you like the app, please rate it. If you have any requests or would like to report any bugs, please contact us using the contact form at our site: http://marlustudio.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}