{
"name" : "Learn Machine Learning Tutorials | ML Tutorials",
"url" : "https://play.google.com/store/apps/details?id=com.vrpmeone.LearnML",
"package" : "com.vrpmeone.LearnML",
"category" : "Education",
"description" : "Welcome to Learn Machine Learning Tutorials | ML Tutorials   Machine Learning (ML) is that field of computer science with the help of which computer systems can provide sense to data in much the same way as human beings do.  We live in time of Machine learning. There are very good career aportunity in ML. Many People think that, Machine Learning is to much dificult thing, but its a myth. What to worry when i am here. I always try to provide best materials to learn. because i care for your learnings..  So without wasting your time lets see what you will get in this amazing Machine learning app. I have divide all stuff in 4 part .   1) Learn Basics of Machine Learning 2) Learn advance topics of Machine Learnings 3) Other things (Some Extra important things) 4) Machine Learning Interview Questions and Answeres  In this Machine Learning app, you will find all machine learning tutorials in simple and easy to understand way. There are many machine learning books availble on play store. i am not saying that this is the best only. but usually books are not free on google play store and this is totally free. I was trying to make this machine learning tutorials offline but because of some design library issues , i couldnt make that possible.  I have explain all the things with Machine Learning codes. This app is all about Machine Learning with python programming. If you are not familier with python yet, then go through our Learn Python app first.   I made this Machine learning for beginer as well as for advance learner too. No matter at what stage of ML . You are this ML tutorials will help you to figure our what is Machine Learning in actual.   If you like this app then share with your friends and do not forget to rate us.   If you have any doubt or if you are facing any problem then just let me know..  Thanks for your support....  Our references ....  www.javatpoint.com www.tutorialspoint.com www.iconfinder.com ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}