{
"name" : "AlphaNumeric",
"url" : "https://play.google.com/store/apps/details?id=com.learnyst.alphanumeric",
"package" : "com.learnyst.alphanumeric",
"category" : "Education",
"description" : "Revolutionary mobile/tablet learning apps for iOS and Android, to help you accomplish your dreams!   Key Features:   Explore our best in class online courses for test prep  Learn on the go with our excellent & comprehensive exclusively online course, with live online classes, detailed course structure, recorded videos, discussion forums, tireless mentoring from top notch faculty available in this space. Download the apps to know more.  Learn at your own pace  No need to quit your job, bunk classes or skip your outings. Prepare on your own terms and your speed. No schedules, no classroom and no hassles of commute & traffic. That too, with no compromise on quality & content.  Class in your Pocket  Hi-definition videos now play, within the mobile apps from AlphaNumeric. However, you can continue to access the videos on web as well, the access on mobile will only make students life easier. Icing on the cake   Start where you Paused with Real-Time Synchronization  Our mobile apps now boast to have the real-time sync feature for web and mobile. Hence, you can switch from laptop to mobile to tablet and continue learning from the same point (save & return).  Personalized Mentoring/ PSP  Our mentors go an extra mile to equip you with meticulously tailored customized study plans, strategy support, doubt clearing, morale boosting OR any related support that you may need.  Student dashboard-Know where you stand  Track your progress with student dashboard to have a birds eye view of whats done and whats left to finish.  Test your aptitude anytime   Take up mock tests anytime, anywhere. Internet connectivity is not a limitation anymore. Download our tests within the app and take it up at your ease and pace.  Make learner notes on your device  Use your tablet or mobile to make class notes during the live class or while you watch the recorded videos. Feels like a real classroom, right??   Asking doubts was never so easy- Your Discussion Board is here  Clear all your doubts while a video lecture is playing or during a live class. That too, at exact points in running video using our Discussion board.  You remain informed- Notification messages  Receive app notifications for all major application deadlines, exam schedule, result declaration, Boost camp details etc. Hence, you are always aware and you can plan your actions accordingly.  Power-packed boost camps  Accelerate your preparation for CAT and other entrance exams with our powerful boost camps, which are ONE OF ITS KIND in the industry. So, need worries if you your schedule hasnt allowed you too much time to prepare.  Detailed explanation of concepts  Our teachers are passionate about your aspiration and they provide you a detailed explanation of every concept. Basics are taken care of, even if you are learning from scratch.  Multi-dimensional analysis of practice tests  We provide you with a thorough analysis of the tests you submit. Be it your accuracy levels, time allocation or your national percentile-You get to see it all!   Leader Board to view rankings   Apart from your national percentile, you also get to see your rankings. Hence you know, where you stand amongst students at AlphaNumeric. This will prove to be a clear cut motivator for you.  Expert tips from top faculty  Your course is smarter now! We will send you expert tips for exam preparation on a regular basis, on your device.  Trust us, that this is not all!!  Our apps are optimized for mobile and tablet devices. Use the web app on all kinds of devices with no change in experience. Sign-up using your Facebook, Google or Email account Install the app and avail the benefits of this outstanding ammunition, which will ensure you a right shot to your goals!! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}