{
"name" : "ABC Kids - Tracing & Phonics",
"url" : "https://play.google.com/store/apps/details?id=com.rvappstudios.abc_kids_toddler_tracing_phonics",
"package" : "com.rvappstudios.abc_kids_toddler_tracing_phonics",
"category" : "Educational",
"description" : "Looking for a fun, free, and simple educational app to help your toddler learn phonics and trace letters of the alphabet? Look no further than ABC Kids.  ABC Kids is a free phonics and alphabet teaching app that makes learning fun for children, from toddlers all the way to preschoolers and kindergartners. It features a series of tracing games to help kids recognize letter shapes, associate them with phonic sounds, and put their alphabet knowledge to use in fun matching exercises. Any toddler, kindergartener or preschool age child can learn English and the English alphabet simply by following the arrows with their finger. They can even collect stickers and toys as they complete tracing games!  ABC Kids is more than just a kid-friendly educational app, it was designed with adult participation in mind, too. The interface keeps toddlers focused on alphabet reading and writing, tucking menu commands away from moving fingers. Adults can easily access settings to engage Teacher Mode, look at report cards, or toggle tracing and phonics games to better facilitate learning.  Best of all, ABC Kids is full-featured and free from in-app purchases and third party advertisements. Toddlers and adults can enjoy learning together without interruption.  Features: - A colorful early education app that helps children learn the English alphabet. - Includes ABC tracing games, phonics pairing, letter matching, and more. - Uppercase and lowercase letters to trace, listen to, and match. - Smart interface helps kids focus on phonics and letters without accidentally exiting the game. - No third party ads, no in-app purchases, no tricks. Just pure educational fun!  Note to Parents: When creating ABC Kids, we wanted to build the best experience possible for both adults and for children. Were parents ourselves, and we know how paywalls, in-app purchases, and intrusive third party advertisements can detract from the learning experience. With ABC Kids, we put the features of a paid app into a preschool friendly package, leaving out frustrating pop-ups and microtransactions. The end result is exactly the educational experience we want for our children. We think you and your family will enjoy it, too!  - Best wishes from the parents at RV AppStudios ",
"desc_perms" : "['android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}