{
"name" : "Little Panda Earthquake Safety",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.earthquake",
"package" : "com.sinyee.babybus.earthquake",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   You never know when an earthquake will strike. So, boys and girls, have you ever known what to do when earthquake strikes?   Emergence! Earthquake strikes now in BabyBus Town! Animals are in danger now, trapped in home, school, supermarket, street! Hurry up, lets use earthquake safety tips to keep animals safe. Preparing earthquake emergency backpack, looking for safe place to hide, feed hungry animals trapped in earthquake and more! Are you ready? BabyBus Town Hero.  Earthquake Safety Tips helping kids learn to be safe: 1.Stay calm and be brave when earthquake strikes! 2.Pack up an earthquake emergency backpack with necessities. 3.It happens that you may be on street when earthquake strikes. Dont be panic! What you need to do is avoiding obstacles quickly, and looking for the open space to keep safe! 4.If you are at home, the best way of being safe is to hide under a strong table, under the bed, or in the bathroom! 5.Help! Earthquake strikes in supermarket, Help panda Kiki hide under the strong counter or the pillar to keep safe. 6.While you are at school, hiding under a strong table is a good choice. 7.Oops! The power is cutting out because of earthquake. Help Kiki turn on the flashlight and find out what you can use in earthquake. 8.Miumiu got injured in earthquake. Lets help Miumiu! Smear the wound with disinfectant, put on gauze, and bandage it. 9.Miumiu is hungry now. Feed Miumiu some cookies! 10.When earthquake strikes, temperature will be getting cold. Give Miumiu a blanket to keep warm. 11.Whistle loudly. And rescue team will come to help and find you! 12.An emergency contact card that will help you find your mom and dad when you are separated from your family by earthquake.   Features: 1. 4 similar real-life situations give kids an opportunity to experience a preview of keeping safe in earthquake! 2.Elaborated Earthquake nursery rhymes and cartoons for kids to learn Earthquake Safety Tips more easily! 3.Interesting tests make it more efficient for kids to master Earthquake safety tips. 4.The content of this game has been evaluated by earthquake specialists.  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}