{
"name" : "Learn Bengali Quickly Free",
"url" : "https://play.google.com/store/apps/details?id=com.altergyan.learnbengaliquicklyfree",
"package" : "com.altergyan.learnbengaliquicklyfree",
"category" : "Education",
"description" : "Proudly rated as one of the best apps to learn Bengali language!   Learn Bengali Quickly is one of the easiest and fastest way to learn Bengali fast and effectively. This language learning app will not only help you learn Bengali grammar, but also will enable you to learn Bengali language in detail. It has great content and is very easy to use. It is the best answer to questions on how to learn Bengali language fluently.  Learn Bengali Quickly can also work as a travel app when you visit India. It can be your own travel phrasebook with the most frequently used phrases and words on tour.  Still wondering how to learn Bengali language? Wait no more! Learn to speak Bengali today! Learn Bengali through English.   STUDY BENGALI IN AN ENTERTAINING WAY This learn Bangla application turns learning into a fun-filled experience. Learn Bangla through English using quizzes, flash cards and by recording your own phrases. You will be able to learn to speak Bengali easily and fast at home, while being entertained at the same time. Not only that youll learn to speak Bengali, but you will learn spoken/conversational Bengali as well!   CATEGORIZED WORDS If you are determined to learn a specific category of words, Learn Bengali Quickly will enable you that. It provides Bengali translation for most frequently used words and phrases across 33 categories. You can use it like an English to Bengali dictionary for 1100+ Bengali words and Bengali phrases. Its indeed a great handy tool that will get you talking conversational Bengali language fast.  The phrases are divided across 33 categories - Body, Time, Calendar, Colours, Directions, Health, Emergency, Feelings, Food, Grocery, Friendship, Romance, Fruits, General, Greetings/Introductions, Conversation, Household, Relations, Language, Expressions, Numbers, Shopping, Spices, Travel, Driving, Accommodation, Weather, Vegetables, Work/Office, Kitchen, Animals, Sports and Study.   BUILD KNOWLEDGE AND UPGRADE YOUR Bengali  Build knowledge from scratch or refresh your Bengali grammar. The app easily enables you to improve your Bengali vocabulary and pronunciation, remember new words using Bengali Flashcards, learn the alphabet in Bengali or test your Bengali language knowledge with our fun Bengali quiz. Used as an English to Bengali dictionary or Bengali learning app, Learn Bengali Quickly has several handy features that helps you with effective language learning.    LEARN BENGALI QUICKLY FEATURES:  - Carefully translated list of 1100+ most frequently used Bengali phrases and words will make sure that you learn spoken Bengali in the most effective way possible - High quality text as well as audio of Bengali translation by native Bengali speakers in a crisp and clear voice will help with your pronunciation and intonation - A good aid for spoken Bengali - Tag your favorite phrases for quick reference and study Bengali on the go - Powerful search that allows users to search within a vocab category as well as across all vocabulary categories - Study Bengali starting with the ABC - learn the basics with the alphabet in Bengali - A fun quiz that is an effective Bengali language learning aid  - Bengali Flash Cards to improve Bengali vocabulary ----------------------------------------------------------------------- If you wish to learn to talk Bengali for free, then look no more. Learn Bengali Quickly is a quick and handy translator app for beginners and for serious language learners alike. Proudly rated as one of the best apps to learn Bengali!  CONTACT: Please feel free to contact us with your feedback or suggestions at contact@altergyan.com or follow us on social media What are you waiting for? Still wondering how to learn Bengali language? Talk Bengali today with our translator app  Learn Bengali Quickly ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.altergyan.learnbengaliquicklyfree.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}