{
"name" : "Investmate - Learn to trade shares and derivatives",
"url" : "https://play.google.com/store/apps/details?id=com.capital.investmate",
"package" : "com.capital.investmate",
"category" : "Education",
"description" : "Do you have friends in finance? No? Well, now you do. Meet Investmate: a reliable and helpful education app with comprehensive knowledge of CFD trading.  Investmate has a lot to offer for beginners: courses, tips, quizzes, a glossary of terms and thought-provoking financial content. With all this handy stuff in one education app, you can start from the very fundamentals and progress to the ins and outs of investing: youll learn what a CFD is, how CFDs on stocks, commodities and indices are traded, how to interpret charts and build your own trading strategy.  Investmate is:   Professional. All of our comprehensive courses, with real-world case studies, have been developed by experts in finance to make an expert of you.   Personalised. The in-app feed provides you with tailored courses, engaging quizzes, helpful glossary categories, curiosity piquing educational videos to meet the needs and skills of a fresh investor.    Fast. It takes as little as 3 minutes to complete one lesson and there are short interactive quizzes to check your progress.   Mobile. Learn to trade on the go. Wherever you are, whenever you chose, the mobile app enables learning the market at a time and place to suit you.   Comprehensive. The detailed, jargon-free financial glossary makes complicated concepts easy.    Straightforward. Clear and plain interface with all info presented in cards. The app features a handy pin option to remember and get back to the material you most need.   Download the Investmate app for free and dive into learning finance right away.  Trading is risky and you may lose all of your invested capital.  Authorised and regulated by the Financial Conduct Authority (FRN 793714). Regulated by the CySEC, license #319/18. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.capital.investmate.permission.RECEIVE_ADM_MESSAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.capital.investmate.permission.UA_DATA', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'com.capital.investmate.permission.C2D_MESSAGE', 'com.amazon.device.messaging.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['com.capital.investmate.permission.RECEIVE_ADM_MESSAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.capital.investmate.permission.UA_DATA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}