{
"name" : "Kidsco",
"url" : "https://play.google.com/store/apps/details?id=com.esemtia.kidscoAgenda",
"package" : "com.esemtia.kidscoAgenda",
"category" : "Education",
"description" : "Kidsco Agenda 1.0  Nueva Agenda Digital : ya puede consultar desde su dispositivo mvil el da a da de sus hijos en la Escuela Infantil.   Con acceso fcil e intuitivo, le ofrece informacin actualizada de cmo ha transcurrido el da sus hijos en la Escuela.  *PRINCIPALES FUNCIONALIDADES EN Kidsco Agenda 1.0  - Agenda diaria. Informacin diaria, pudiendo filtrar para ver por das, semanas y meses. La informacin que presenta es relativa a comidas, descansos, deposiciones, temas tratados, observaciones de cmo ha pasado el alumno el da, peticiones de material.  - Notificar a la Escuela el estado u observaciones de su hijo antes de empezar el da.  - Notificaciones PUSH, ya no habr que conectarse a la aplicacin para comprobar si tenemos nueva informacin. IMPORTANTE: Para poder utilizar esta aplicacin mvil es necesario que su centro escolar utilice esta plataforma y tenga un usuario entregado por la propia escuela. Kidsco Agenda 1.0  New Digital Agenda: can already check from your mobile device everyday of their children in Kindergarten.  With easy and intuitive access, offers updated on how the day has elapsed their children in the school information.  * MAIN FEATURES IN Kidsco Agenda 1.0  - Daily Agenda. Daily information and can filter to see for days, weeks and months. The information presented is related to meals, breaks, depositions, topics, comments on how the student has passed on, requests for material.  - Report to School status or observations of your child before starting the day.  - Notifications PUSH, and will not connect to the application to see if we have new information. IMPORTANT: To use this mobile application is necessary for your school use this platform and has a user issued by the school itself. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.esemtia.kidscoAgenda.permission.C2D_MESSAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.esemtia.kidscoAgenda.permission.UA_DATA', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.esemtia.kidscoAgenda.permission.UA_DATA', 'android.permission.INTERNET']",
}