{
"name" : "Apprendre l'Espagnol parlé",
"url" : "https://play.google.com/store/apps/details?id=com.fasoftltd.FRSP.FREE",
"package" : "com.fasoftltd.FRSP.FREE",
"category" : "Education",
"description" : "Une application moderne pour communiquer efficacement en espagnol. Elle est conu aussi bien pour les dbutants que ceux qui veulent enrichir leur vocabulaire. Une attention particulire a t accorde sur la comptence linguistique la plus importante - la capacit de mener librement des conversations en espagnol. La mthode innovante de communication utilise dans cette application Vous permet de se dbarrasser rapidement des obstacles  parler et  pouvoir sexprimer dans des situations quotidiennes.  Lapplication est conue principalement pour ceux qui sintressent  une matrise active de la langue espagnole. Tous les mots, les expressions et les dialogues ont t enregistrs par des locuteurs natifs de lespagnol. La division logique en 127 sujets et catgories avec un systme de recherche rapide Vous permet de trouver instantanment un mot ou une phrase dont Vous avez besoin.  Lapplication est galement idal comme traducteur lectronique parlant lors de voyages  ltranger. Grce  elle Vous arriverez  communiquer dans toutes les situations typiques - dans un magasin, une banque, un htel, ou  laroport... Sans problme, vous arriverez  acheter votre billet au comptoir, commander au restaurant, demander des directions, ou bien prendre un rendez-vous.  Cette application est une excellente proposition pour ceux qui se prparent pour les preuves orales despagnol et  des voyages  ltranger en tant que touriste, pour le travail ou les tudies.  Les principales caractristiques: - Les enregistrements avec les Espagnols natifs - 127 groupes de discussion et catgories - Des phrases, des conversations et des dialogues pratiques - Un dictionnaire espagnol-franais, franais-espagnol - Lapprentissage de la prononciation correcte - La cration de Vos propres dialogues et des scnes de situation - Un systme innovant de mmorisation de phrases - Une recherche rapide des mots et expressions - Lenregistrement simplifi des discours - Des exemples de lutilisation de mots dans des phrases - Lespagnol fonctionel en cours - Un lecteur de mots et expressions intgr  Lapplication, qui permet rapidement et facilement de commencer  parler espagnol. Mme si Vous navez jamais rencontr un seul mot de cette langue. Il ny a pas ici dexercice ou de grammaire fastidieuse. La mthode innovante  Easy Talk  utilise dans cette application est si facile et rapide quaprs quelques minutes vous parlerez espagnol. GARANTIE.   La version gratuite de lapplication contient 800 mots et expressions, tandis que la version complte comprend plus de 4000 mots, des expressions et des phrases. A modern application to communicate effectively in Spanish. It is designed for both beginners and those who want to enrich their vocabulary. Particular attention was paid to the most important language skills - the ability to freely conduct conversations in Spanish. Innovative communication method used in this application allows you to quickly get rid of obstacles to speak and to express themselves in everyday situations.  The application is designed primarily for those interested in an active command of the Spanish language. All words, phrases and dialogues were recorded by native Spanish speakers. The logical division in 127 subjects and categories with a quick search system allows you to instantly find a word or phrase that you need.  The application is also ideal as an electronic talking translator when traveling abroad. With it you get to communicate in all typical situations - in a store, a bank, a hotel, or airport ... No problem, you get to buy your ticket at the counter, order in a restaurant, ask for directions, or make an appointment.  This application is an excellent proposition for those who are preparing for Spanish oral exams and travel abroad as a tourist, for work or are studying.  The main features: - Records with native Spaniards - 127 focus groups and categories - Sentences, conversations and practical dialogues - A French-Spanish-French dictionary - Learning the correct pronunciation - Creating Your own dialogues and scenes position - An innovative system for memorizing phrases - A quick search of words and phrases - Simplified registration of speech - Examples of the use of words in sentences - Spanish FUNCTIONAL current - A built-in player of words and phrases  The application, which allows quickly and easily begin to speak Spanish. Even if youve never met a single word of the language. There are here no exercise or tedious grammar. The innovative method Easy Talk used in this application is so easy after a few minutes you speak Spanish. WARRANTY.   The free version of the app contains 800 words and expressions, while the full version includes more than 4000 words, phrases and sentences. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING']",
}