{
"name" : "Twinkle Twinkle Little Star - Famous Nursery Rhyme",
"url" : "https://play.google.com/store/apps/details?id=com.internetdesignzone.twinkle",
"package" : "com.internetdesignzone.twinkle",
"category" : "Educational",
"description" : "Nursery rhymes are perfect way to start your kids early learning. And hence we are here with three classic nursery rhymes for your child at no cost. This app has Twinkle Twinkle Little Star, Mary Had a Little Lamb & Old MacDonald Had a Farm baby songs! A parent must choose its childs early learning very carefully and so you can start from these classic songs for kids!  Twinkle Twinkle Little Star, Mary Had a Little Lamb & Old MacDonald Had a Farm are one of the most popular, oldest nursery rhymes & songs for kids. But whats unique in this songs app? This early learning app is a 3D Baby Songs App! It is a 3D space adventure and kids can explore the colorful planets and stars on their way as kids sing the nursery rhymes with beautiful lyrics and music.  Features of 3D Songs for Kids App are:  Kids can listen to this baby songs with lyrics & Soothing music  Completely entertaining, 3D and full of fun interactive characters  It helps kids to improve their Verbal & Language skills   Colorful songs for kids help to develop kids knowledge of colors, shapes and moments.  Children become more receptive and active while they play and learn  It improves kids imaginative skills and makes them more creative  They get to learn new words, their pronunciations and spellings with this app  It also boasts children communication skills  Baby Songs App has following three songs  Twinkle Twinkle Little Star  Mary Had a Little Lamb  Old MacDonald Had a Farm  Children can Play, Listen & Repeat this Twinkle Twinkle Little Star, Mary Had a Little Lamb & Old MacDonald Had a Farm songs.Get it for kids to enjoy and learn at the same time! Download now and sing along with your little ones! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}