{
"name" : "My OTA - Online Trading Academy",
"url" : "https://play.google.com/store/apps/details?id=com.tradingacademy.M1",
"package" : "com.tradingacademy.M1",
"category" : "Education",
"description" : "The My OTA app brings the lessons to you. Access your Online Trading Academy courses, calendar, Extended Learning Track (or XLT), and live updates  anywhere, anytime (MyOTA).  For the trader on the go: -Watch video recordings of courses that you missed -Catch the latest XLT from your favorite instructors -Access Pro Picks to find instructor-chosen trades with analysis -Check the calendar for classes and events youre signed up for -Get alerts to updates on My OTA and upcoming shows -Read Lessons from the Pros and watch Hour with the Pros  My OTA features hundreds of trading and investing courses on Stocks, Forex, Futures, Options, Core Strategy and Real Estate from expert instructors  serving over 120 online sessions to 15,000 students a week from around the world.  Take classes Now you can enter our virtual classroom from your phone or tablet and or watch recorded classes at your own pace.   View XLTs and RECCs Looking for a specialist in Stocks, an award-winning authority in Forex, or a 15-year veteran in Futures? Enter live sessions and chat with your favorite instructors perform and explain live trades.  Check Pro Picks Want to see how your trades stack up against the pros? Quickly tab over to Pro Picks to check your work. Or study their trade parameters and strategy to learn from the best of them.  Gather information and Gain Knowledge  Read the latest articles from our award-winning newsletter, Lessons from the Pros  plus view webinars and shows on Power Trading Radio.  Contact us Need a hand? You can call or email Customer Care directly from the app for prompt assistance.  My OTA is free to download for Online Trading Academy students. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.WRITE_CALENDAR', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_CALENDAR', 'android.permission.CAMERA', 'android.permission.BATTERY_STATS', 'com.tradingacademy.M1.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_CALENDAR', 'android.permission.CAMERA', 'android.permission.BATTERY_STATS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}