{
"name" : "Alien Story - Fairy Tale for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.hedgehogacademy.alienstoryfree",
"package" : "com.hedgehogacademy.alienstoryfree",
"category" : "Educational",
"description" : "This game is about a small alien named Bobby who gets lost while on an exploration mission to Earth. Bobby meets human children and they help him to get back on his home planet. The game is suited for kids in elementary school (5-8 year olds), but also for gifted preschoolers and kindergarteners.  The storys plot alternates with educational and logic games. The tasks develop visual memory, logic, attention, concentration and other brain functions.  The following tasks await: Find the odd object, Find two similar ladybugs, Memory game, Analogies, Place the pictures in the correct order to make a story, Find the correct planet, Recall alien animals, Sudoku, Mazes, Jigsaw puzzles, Pick the nut of the correct size for the bolt, and other educational games.  After you complete the story you can play each of the mini-games in a separate list, on 4 difficulty levels. The tasks are generated randomly each time. Recommended for boys and girls 5, 6, 7, 8 y.o.  All the tasks are educational (train memory, logic, concentration); they were designed by a teacher and preschool education professional. Each of our apps has a free Android version. We advise you to play our games on tablets, yet smartphones with Android are also supported.  The app supports 15 languages: English, Russian, German, French, Spanish, Portuguese, Italian, Dutch, Japanese, Swedish, Danish, Norwegian, Polish, Czech, and Turkish. ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}