{
"name" : "Quran Bangla",
"url" : "https://play.google.com/store/apps/details?id=com.QuranReading.quranbangla",
"package" : "com.QuranReading.quranbangla",
"category" : "Education",
"description" : "Quran Bangla is a Smartphone application designed to facilitate the native speakers of Bangladesh with the divine teachings of Quran. This Application has embedded with authentic translation, transliteration, and audio recitation of entire 114 Surahs of Quran e Kareem.  Main screen consist of major features for the easy convenience of users, which includes:  Quran: The option of Quran provides the friendly recitation of Quran with easy to swipe features, which includes change of font size, style, change of language which is English other than Bangle, transliteration, Bangla translation, and mp3 audio recitation.  Bookmarks: Separate folder for the bookmarked chapters and verses of Quran, for easy and quick access when need to learn or recite.  Sajdas: There are 14 places in Quran where prostration in front of Allah is compulsory. All those places have separately highlighted in the Sajda feature for user convenience.  Stop Signs: Quran apart from all other books is a divine revelation and has some rules, violation of which can invalidate the recitation of Quran Kareem. Additional feature has included for the better understanding of Muslims regarding the teachings of Quran under the tab of Stop signs. These features guide Muslims to recite the book of Quran with its proper divine rules (Tajweed of Quran).  Search option: Search option has incorporated to search the desirable chapter or any particular verse of Quran.  Go To: Go To option for quick launch of chapters and verses of Quran Kareem.  Quran is complete guidance and its recitation awards innumerable bounties upon the recitor. Download this free of cost Android Application and benefit yourself with the worth downloading features of Quran. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}