{
"name" : "Kids Coloring book - learn colors",
"url" : "https://play.google.com/store/apps/details?id=com.DZELO.KidsColoringBookLearnColors",
"package" : "com.DZELO.KidsColoringBookLearnColors",
"category" : "Educational",
"description" : "Great Educational Game for Kids from 2 to 5 Years Old  Having downloaded the application Kids Coloring Book - Learn Colors, parents get a unique opportunity to organize exciting and educational leisure activity for boys and girls. Playing the game, the child will be able to learn the name of each color both in Russian and English languages. All in all, the game helps to develop memory and creativity.  The original application called Kids Coloring book - Learn Colors, teaches your young artists to paint. But this is not everything, of course. The main thing is that they will do it with real pleasure. As a rule, contemporary moms and dads appreciate the advantages of the application immediately, as their son or daughter become drawn into learning the colors with natural enthusiasm, studying the names of the colors and getting acquainted with new items of wildlife and inanimate surroundings at the same time. When your children are amazed, you may be sure that your favorite wallpaper in the apartment will remains clean and safe. Besides, you wont see any marks of felt-tip pens, pencils, and crayons on them. All in all, the parents are free to do their everyday housework, being sure that the kids are spending the time well.   Since early childhood, little boys and girls discover the surrounding world in their way. As a rule, educational kids games help to broaden horizons, doing it in an exciting, and playful way. The main task of parents is to help them, giving a gadget with a free downloaded application, which is suitable both for a tablet or a smartphone. You see, the space for practicing this type of creativity is not restricted to the walls of the childrens room. The toddler can play in the garden, at the summer house, in the subway and anytime when the parents are busy with their affairs.  Entertaining Game for the Development of Excellent Motor Skills and Sensory Perception  Since the age of 3 years old, the kid has already had his or her thoughts about life around. That is why the children can draw with enthusiasm, memorizing colors, and objects very well. Free coloring books in the gadget can help to:  learn colors;  entertain preschooler;  develop attention;  improve memory and visual color perception;  promote the development of excellent motor skills;  activate visual and sensory perception.  Application Functionality Elaborated design of the game and a user-friendly interface are not the only advantages of the game. The application has no ads that will continuously distract or disturb your small children. A significant amount of fascinating and vivid pictures for coloring (there have been over 50 of them now) will not allow your child to get bored. Two stages of difficulty for toddlers under 3 years old and older boys and girls will help to perform the task. During the game, it is possible to listen to pleasant and cheerful music, but if desired, you can turn the melody off without any difficulties. Up to the age of 5 years old, children learn to use the application themselves and even compete with friends in a quick reaction and finger dexterity. The childs diligence depends on his/her individuality, of course. However, even hyperactive scamps are interested in the application. Even the most vivid fidgets will enjoy the app Kids Coloring book - Learn colors, and you will teach them to draw and to finish the work, which has been already started. Parental praise is always significant, that is it is necessary not to forget about it and to praise the child for even the smallest successes and achievements. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION']",
}