{
"name" : "Rihla Conackriyya",
"url" : "https://play.google.com/store/apps/details?id=com.conakriyya",
"package" : "com.conakriyya",
"category" : "Education",
"description" : "GABATARWA!!!  Conakriyya! Shine sunan da aka fi sanin wannan kasidar da shi, watakila saboda yawan fadin sunan Conakry da akayi a cikinta, Shaikhu (R.A) ya wake yawaicin muhimman abubuwan da suka faru gareshi a cikin tafiyar da yayi ta tsawon kwanaki sittin wadda a cikinsu ya shiga wadansu garuruwa da suke cikin kasashen Senegal Gambia Mali Guinea da Sirre Leone. Shaikhu (R.A) ya zuba ilimai masu yawa a cikinta kamar yadda ya fadi wasu niimomin da Allah Taala yayi masa. Sau da yawa masoya suna rera wannan kasida saboda muhimmancinta, saboda haka nake son in bayar da tawa gudummawar ta hanyar fassara kalmominta zuwa harshen hausa saboda dangina hausawa masoya suyi amfani da ita. Abubuwan lura!: 1- Shaikhu (R.A) ya rubuta sunayen yawaicin idan ba muce dukkan garuruwan da ya ambata a cikin wannan kasida ba, kamar yadda ya ga dama, saboda wata hikima wadda bamu santa ba. Kamar:         A maimakon:      . Da sauransu. 2- Kalmomin da suke cikin alama kamar haka  , karin bayani ne domin fahimtar da maana, amma ba su cikin lafazin baitin da ake fassarawa. 3- Shaikhu (R.A) yayi wannan tafiya daga daren karhe na watan Zulhijjah na shekarar 1366 bayan hijira, zuwa daren karshe na watan Rajab na shekarar 1367. Shaikhu (R.A) ya zo birnin Kano Nigeria zuwan farko a watan Rajab a cikin shekara ta 1364 B.H, domin cika alkawarin da suka yi da Sarkin Kano Alhaji Abdullahi bayero (R.A) a madina, a cikin shekara ta 1355 B.H na cewa zai zo garinsa, Mutum uku suka bishi bayan tafiyarsa, sune:  (1) Shaikhu Sani Hasan Kafanga (R.A).  (2) Shaikhu Tijani Usman Zangon bare bari (R.A).  (3) Alhaji Usman Mazadu Mazan kwarai (R.A). A farko  farkon shekara ta 1366 B.H. wato shekarar da yayi tafiyar da yayi wannan kasidar a darenta na karshe, saboda haka a lokacin da yayi wannnan kasida babu wanda ya san Kaulakha a cikin mutanen Nigeria sai wadannan mutanen guda uku rak.  Yahya Nuhu Sallau (Khalifa) Sallawi Jumaa: 6  Shaaban  1434 A.H. Daidai da: 14  June  2013 A.D. Auchi, jihar Edo. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']",
}