{
"name" : "VR Speech",
"url" : "https://play.google.com/store/apps/details?id=com.edtechthailand.vrspeech",
"package" : "com.edtechthailand.vrspeech",
"category" : "Education",
"description" : "Immerse yourself in the language learning revolution. VRSpeech brings together a host of everyday contextually-driven language scenarios which allow users to learning language in an intuitive and easy way in both VR and 360-modes.  VRSpeech allows users to familiarize themselves with important vocabulary in Learning Mode, and build confidence and mastery of use in the unique Situation Mode.  Enjoy using language, building confidence, and experience the world as you see fit in one of 10 engaging and useful situations, including:  -The Restaurant: Meet with your friend Bella to enjoy a scrumptious meal.  -The Interview: Time for a new job! In the interview scenario your skills to present yourself and prove your worth will be put to the test, but dont worry, our helpful UI will push you in the right direction.  -The Presentation: Now its time to make money. Practice presentation skills while presenting your companys products, and negotiating services with customers all while playing and enjoying the setting.  - And many more!  Save time and, but dont forget to have fun with the awesome features:  - Real-time feedback through clever and understanding voice analysis with state-of-the art Speech Recognition technology, built to understand users accents and bring them to a new level! - Introductions to vocabulary and sentences based on your level. No more are the days of hard study of language, with VRSpeech, we bring practical and fast learning to you! - Gamified language learning which provides Analysis of progress and in-game prompts for quick points! - Clear native pronunciation that allows your to practice mimic and master the language of your choice! - Tested and true methods of language acquisition which rely on natural language acquisition! - Friendly AI, who provide context specific feedback and interactions based on what you say! With VRSpeech you can shape the path of your language journey so that it reflects you and your language abilities! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO']",
}