{
"name" : "Arabic For All - 2 - Lite",
"url" : "https://play.google.com/store/apps/details?id=com.IqraInnovations.AGFA2Lite",
"package" : "com.IqraInnovations.AGFA2Lite",
"category" : "Education",
"description" : "Arabic Grammar For All is the second app in a series of programs that has been specially designed to introduce and explain the fundamentals of Arabic grammar to the absolute beginner. It uses a simple, fun and innovative method to teach a subject that beginners can often find daunting and confusing. It is also an ideal way for those who want to revise and test what they have already learned.   It comprises of:  > 10 lessons!  > 10 practice sessions!  > 100 exercises to complete!  > A 1000 word built-in dictionary!  > A grammar section with common constructs!  > Conjugations for the 10 forms of Arabic verbs!  > Rules are introduced gradually in a simple and easy to follow manner in a series of lessons  > Complicated explanations and excessive detail is avoided where possible  > Each new lesson is followed by one or more practice sessions that enable you to see the rules working and build your confidence  > Practice sessions are followed by activities to test your understanding  > A dictionary is provided for you to search for words that you are unfamiliar with and build your own word list complete with notes  > All words are fully vowelized to make it easy to read  Please note: This app has been designed for screen sizes 5 and above due to the level of detail present in some of the content. Devices that have a smaller screen may not display all the content.  This is the Lite version of this app. If you like this app and find it beneficial, please consider buying the full version.  Also, visit our YouTube channel to view videos based on the content of this app:  https://m.youtube.com/channel/UCeoKvVm3S5EL5yb7NgDxS7g  All Rights Reserved - Iqra Innovations ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.SEND_SMS', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS']",
}