{
"name" : "Animal Town - My Squirrel Home for Kids & Toddlers",
"url" : "https://play.google.com/store/apps/details?id=com.iz.play.animal.town.pretend.squirrel.house.kids",
"package" : "com.iz.play.animal.town.pretend.squirrel.house.kids",
"category" : "Educational",
"description" : "INTRODUCING AN ALL-NEW ANIMAL HOME FOR YOU. Meet a NEW Rabbit family which is ready to have a super fun time with you! Enter the brand new Rabbit Home and explore 4 amazing rooms. Play in the original Squirrel Home as well as the new Rabbit Home right away!   Have you ever wanted a big dollhouse which you can decorate your way? Come and play in the Animal Town - an interactive pretend play game! Your animal friends and family are waiting for you in your imaginative dollhouse. Join them and see whats inside different rooms. There are wonderful surprises waiting for you!   You can experience a lot of things in this app like:   * Squirrel House with 4+ Different Rooms:  There are 4+ different rooms that you can share with your squirrel friends and family. Take a look around and play on each floor!   * NEW Rabbit House with 4 rooms:  Cook delicious food for your bunny friends and family and decorate the home however you want. The Rabbit family is sending you an invitation to join them right away!   * Explore the Living Rooms:  The living rooms in these houses are cozy and beautifully decorated. Go on and have a little tea party in there!   * Cook food in the Kitchens:  Check out the refrigerator which is loaded with some yummy food! Cook some delicious food for yourself and feed everybody else too!   * Discover the Bedrooms:  After a long tiring day, you need to take some rest. Put on your comfy clothes and have a good nights sleep.   * Touch and Move Everything:  Touch, drag, interact and use your creativity while you play in your huge Squirrel House! Its going to be a lot of fun!   Key features:  * 9 awesome Squirrel friends & family members to play with!  * 9 NEW Rabbit friends & family members as well!  * Perfect for curious kids of ages 6-8.  * Full of exciting surprises and interactions!  * 8+ floors of pretend play fun. Lots to play!  * No annoying ads. Completely safe for kids.  * No internet connection required. Play offline! Perfect for travel days.   The Squirrel and Rabbit families await you in your dollhouse. Show your creative streak, create your own story and play pretend! Download now! ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}