{
"name" : "English Bangla Dictionary",
"url" : "https://play.google.com/store/apps/details?id=com.shabdkosh.dictionary.bengali.english",
"package" : "com.shabdkosh.dictionary.bengali.english",
"category" : "Education",
"description" : "Fast, free and offline English <> Bangla dictionary app has one of the most comprehensive Bengali and English vocabulary you will find in the Google Play store. This app is a comprehensive English Bengali Dictionary along with English definitions, quiz game, spoken English and Bengali audio pronunciations, synonyms and antonyms.  Best of all, you can download offline dictionary in Settings screen and use this app without any data connection.   BANGLA TO ENGLISH DICTIONARY AND TRANSLATION Start typing Bengali words using Bengali keyboard, or type Bengali words in English and have app suggest you words even when you are not typing in Bengali! Tap any suggestion to get the English translation, meanings and spoken audio pronunciations. Tap the star icon to save the word for future reference.   ENGLISH TO BANGLA DICTIONARY AND TRANSLATION  Type the English word and see immediate suggestions from the huge collection of words and get to the meaning quickly by tapping any suggested word in the list. The Shabdkosh dictionary app shows exact meanings, definitions and short examples along with translations, synonym, antonym and right grammar attributes. You can also choose to listen to the audio pronunciation or see the pronunciation in Bengali - another unique feature of this app!   HYPERLINKED DICTIONARY FOR REVERSE LOOKUP Any tap on the meanings will take you to the reverse lookup any of the meanings. This helps you in understanding more of each word shown by presenting this unique cross-search feature.   SPOKEN AUDIO PRONUNCIATIONS The Shabdkosh app has spoken audio pronunciation in a pleasant Indian voice - for both, English and Bengali. Just tap the speaker icon on any word or meaning to hear the spoken audio pronunciation with a very small amount of data usage.  LEARN SOMETHING NEW EVERY DAY We have very high quality Word of the Day and Quote of the Day features to help learn something new everyday.  WORD GAMES The nifty Word Quiz Game Quiz in English and Bengali helps you pass time while learning something new! Our users are very fond of this simple and quick games - which also works without using your data in offline mode.   CONTACT & FEEDBACK For any help and support on this English to Bengali dictionary, please use the feedback option in the app.  For more information and to try it out on web, please visit: http://www.shabdkosh.com This Bengali to English dictionary is also available on mobile browsers at http://www.shabdkosh.com. We hope you will like it - and review it in the Google Play Store!  SHABDKOSH English Bangla Dictionary App by SHABDKOSH.COM ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_SETTINGS', 'com.android.alarm.permission.SET_ALARM', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}