{
"name" : "Piano Melody Free",
"url" : "https://play.google.com/store/apps/details?id=com.veitch.themelodymaster.pmf",
"package" : "com.veitch.themelodymaster.pmf",
"category" : "Education",
"description" : " Learn to play your favorite songs on the piano by playing back the melody   Over 1000 songs to learn from different eras and genres.  Highly configurable piano (multitouch, glissando, highlighting, note labels)  Resizable piano suitable for all devices and tablets.  Features  Set the size of the keys on the piano. The larger the keys, the more accurate to get the right notes, the smaller the keys you can see all 3 octaves on screen. Full support for all phones and all tablets. Focus on parts of the song to play back. Authentic digitised grand piano sounds. Highlight notes on/off to play by ear. Slow down / speed up the song. Turn up / down volume of song play, which is ideal for play along mode. Immersions Ultimate Density Control Haptic Feedback.  Become a Better Musician  Develop your ability to play by ear. Given a melody, can you play it back or play along? Start with a few notes and build up until youve mastered the song.  Suitable for all ages (kids to adults) and for all abilities (beginner to advanced).  Free  100 free songs of the full catalog are immediately available on this version. Play well to unlock all songs.  Song List  The song list is varied containing all genres such as Rock, Classical, The Latest Pop, Film Theme Tunes, TV Theme Tunes, 60s, 70s, 80s, 90s, Naughties, Modern, Alternative, Indie, Latin and more.   Details  Songs capture the main melody / chorus / intro / verse and contain upto 400 notes. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}