{
"name" : "WikiCast | Wikipedia Reader for Chromecast",
"url" : "https://play.google.com/store/apps/details?id=com.theophrast.chromecastapps.wikipediaonchromecast",
"package" : "com.theophrast.chromecastapps.wikipediaonchromecast",
"category" : "Education",
"description" : "Read Wikipedia articles on your TV.  WikiCast is an unofficial Reader for Wikipedia, specially designed for Chromecast devices.  Wikipedia is a multilingual online encyclopedia that anyone can edit, the articles are freely licensed.  The main idea is behind the WikiReader to allow user read Wikipedia articles on Chromecast device or Android Tv.    ====Features - Search and find articles - Add articles to the favorites list, read it later - Read articles in your language - Extend your knowledge every day with Todays featured article - Read Wikipedia articles on TV screen    ====How to use? Download the app, connect to your Chromecast device and search for an article. You can scroll with touchbar, and select the language of the Wikipedia.  ====Supported Wikipedia languages:   English, German, French, Spanish, Russian,Japanese,Dutch, Italian, Swedish, Polish, Vietnamese, Portugese, Arabic, Chinese, Ukrainian, Catalan, Norwegian, Finnish, Czech, Hungarian, Korean, Indonesian, Hebrew, Persian, Thai, Hindi, Bengali, Cebuano, Turkish, Romanian, Danish, Esperanto, Serbian, Lithuanian, Slovak  If you want to read Wikipedia articles on another languages, please write an email for mail.castapps@gmail.com.    ------------ *Wikipedia on Chromecast application is a custom-developed app and not related to Wikimedia foundation.  *WIKIPEDIA is a trademark of the Wikimedia Foundation. We are not endorsed by or affiliated with the Wikimedia Foundation. Content is available under CC BY-SA 3.0 unless otherwise noted.  * Google and the Google logo are registered trademarks of Google LLC. Chromecast, Chromecast Ultra, Chromecast Audio, Google Cast and their respective logos are trademarks or registered trademarks of Google LLC. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}