{
"name" : "La Liga Educational games. Games for kids",
"url" : "https://play.google.com/store/apps/details?id=com.edujoy.laliga.educational",
"package" : "com.edujoy.laliga.educational",
"category" : "Educational",
"description" : "EDUCATIONAL GAMES AND PUZZLES FOR CHILDREN - Official Game of LaLiga   Have fun and learn with this collection of free educational games for kids and learn with your favorite soccer players! This application is aimed at children between 4 and 11 years, with more than 40 games and puzzles that will help them improve reading, simple math operations, paint and color, solve puzzles, as well as train different cognitive skills through fun games in which the players of the Spanish League will appear.  Solve puzzles with images of the shields of each team and all football stadiums. A good way to learn with first division soccer players.  - COLLECT YOUR FAVORITE PLAYERS -  The goal of the game is that boys and girls can learn while getting player badgets in each game. Each time they complete a game a new image of their idols will be unlocked.   -- FEATURES --  - More than 40 educational games - Discover the entire collection of players and teams of first division from the 2018-2019 League - For 4-to-11 year old children - Puzzles and drawings to learn and color - Helps develop cognitive and psychomotor skills - Free game  These soccer games are designed to help children develop cognitive skills such as attention, memory, perception or coordination, among others. In this regard, the application offers different categories of games:  - REASONING AND PROCESSING SPEED -  Children can perform simple operations as well as solve simple problems. Learn to do calculations with your favorite players!  In these games you will find exercises to connect dots and form shapes, simple equations, more complex equations with dynamic elements, put in order numerical sequences or number crosswords.  - ATTENTION AND VISUAL ACUITY GAMES -  To stimulate attention we propose a list of games that develop the visual acuity of shapes and the perception through images and drawings.  In this way, children can play to find differences between two images, color images and mosaics, find hidden objects, play word search, mazes, association of elements, find the intruder...  - MEMORY TRAINING -  Children can perform memorization exercises: memorize pairs of elements, repeat sequences, memorize actions or associate items.  CONTACT US  http://laliga.es https://facebook.com/LaLiga http://twitter.com/laliga https://instagram.com/laliga ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}