{
"name" : "Coloring pages - drawing",
"url" : "https://play.google.com/store/apps/details?id=com.YovoGames.drawing",
"package" : "com.YovoGames.drawing",
"category" : "Educational",
"description" : "Kids coloring pages are games for girls and games for boys of all ages, from the smallest to the older children, which help to broaden their horizons, give an idea of the world around them, make them observant and attentive, develop their imagination.  Coloring for kids give a unique opportunity for your kids to try themselves in another form of childrens creativity - this is drawing.  Educational games, such as coloring pages, help kids from early on to learn to identify the main and characteristic features of objects, their color, size and shape, distinguish them and establish the simplest relationships between objects, and develop small motor skills, attention, memory, logical thinking And color perception.  Coloring allows the child to create his own unique and unique world. When a child draws or paints a picture, he reveals his inner creative potential.  When your child plays in coloring games, he begins to actively explore the world, to explore everything that is happening around, therefore they occupy the most important place in the development and life of the child.  Coloring pages for kids is a great game for every child, which gives an opportunity to learn how to fun to draw various objects and landscapes, cute and funny little animals. But the main thing that gives coloring pages for kids is the ability to create and paint your favorite pictures over and over again, change colors and leave the most beautiful option. Such an occupation will never get bored.  Coloring sheets will take the child for a long time and help you with the kid fun, exciting and with great benefit to spend your free time.  Thats why we create educational games and other applications that help them to know the world around them, reveal their potential and creativity.  You need only download coloring games for kids and start creating your first artistic masterpiece.   ---------------------- Be sure to visit our website at http://yovogames.com and also we at: Youtube: http://www.youtube.com/channel/UCZruadkJJTuD4Bgb1F6pa3A Twitter: https://twitter.com/YOVOstudio Facebook: https://facebook.com/yovogames ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}