{
"name" : "Diccionario Sin贸nimos Offline",
"url" : "https://play.google.com/store/apps/details?id=com.setegraus.sinonimosonline",
"package" : "com.setegraus.sinonimosonline",
"category" : "Education",
"description" : "El Diccionario de Sinnimos en espaol es una aplicacin muy completa y fcil de usar. La nueva app Diccionario de Sinnimos te da acceso offline ilimitado, cuando y donde quieras, a todo el contenido del diccionario. chale un vistazo!  FUNCIONA OFFLINE Siempre tendrs acceso a todo el contenido del diccionario, cuando y donde lo necesites, incluso sin estar conectado a internet. Una vez descargado, ya puedes empezar a usarlo!  SUPERCOMPLETO Busca los sinnimos de ms de 20.000 palabras y expresiones en el diccionario. El sinnimo que necesites, aqu lo encontrars!  FCIL DE USAR Consulta las ltimas palabras actualizadas, usa el buscador para encontrar sinnimos y gurdalos como favoritos para revisarlos en cualquier momento.  MEJORA TU VOCABULARIO Otra excelente herramienta del diccionario es nuestra funcin alabra aleatoria, diseada para mejorar tu vocabulario en espaol mientras aprendes nuevos sinnimos todos los das. The Dictionary of Synonyms in Spanish is a very complete and easy to use application. The new app Thesaurus gives you unlimited access offline, anytime, anywhere, to the entire contents of the dictionary. Check it out!  WORKS OFFLINE  Always you have access to the entire contents of the dictionary, when and where you need it, even without being connected to the Internet. Once downloaded, you can start using it!  super complete  Look for synonyms for more than 20,000 words and phrases in the dictionary. The synonymous you need, youll find it here!  EASY TO USE  Check the latest updated words, use the search to find synonyms and save them as favorites to review them at any time.  IMPROVE YOUR VOCABULARY  Another excellent tool Dictionary is our Random word feature, designed to improve your vocabulary in Spanish while learning new synonyms every day. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.setegraus.sinonimosonline.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}