{
"name" : "Toca Kitchen",
"url" : "https://play.google.com/store/apps/details?id=com.tocaboca.tocakitchen",
"package" : "com.tocaboca.tocakitchen",
"category" : "Education",
"description" : "Do you want to be the head chef of your very own sushi restaurant? Check out Toca Kitchen Sushi, the newest app from Toca Boca  http://bit.ly/TocaKitchenSushi_GooglePlay  Ever wanted to play with your food? Now you can! Toca Boca brings you Toca Kitchen, where you cook, play with and prepare food for four hungry characters. Pick any ingredient and prepare it in your own way. Slice, boil, fry, cook, microwave or mix! Then wait for your hungry friends response.  We created this educational app for kids to give the mud cakes a new face, a complete virtual makeover which the kids will love! The characters fearful reactions to different meals will make you giggle. Does the cat like salty fish? Will the boy eat potatoes and greens? Mix and match your own meal! With no high scores, levels or time limits the fun doesnt have to end in this cooking app.   - Four cute characters to cook for - each with their own favorite food! - 12 different ingredients that can be prepared in 180 different ways! - Slice, boil, fry, cook, microwave anything you like!  - Professional and fun kids app design! - No rules or high scores! - Kid-friendly interface - No in-app purchases - No third party advertising  What are you waiting for? Lets get in the kitchen and start cooking!  Toca Kitchen is a free cooking app for kids thats perfect for aspiring chefs. Kids will roleplay a chef in a kitchen, exploring ways to cook tasty and silly foods for hungry customers to eat. This fun cooking app is sure to deliver nothing but creativity and imagination for kids!  As with all Toca Boca apps, there are no high scores, time limits or stressful music. Rest assured this app for kids lets kids play however they want!  ***  ABOUT TOCA BOCA At Toca Boca, we believe in the power of play to spark kids imaginations and help them learn about the world. We design our products from the kids perspective to empower kids to be playful, to be creative and to be who they want to be. Our products include award-winning apps that have been downloaded more than 130 million times in 215 countries and offer fun, safe, open-ended play experiences. Learn more about Toca Boca and our products at tocaboca.com.  PRIVACY POLICY Privacy is an issue that we take very seriously. To learn more about how we work with these matters, please read our privacy policy: http://tocaboca.com/privacy ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}