{
"name" : "Learn English letters and numbers for children",
"url" : "https://play.google.com/store/apps/details?id=com.compuo.learmabc",
"package" : "com.compuo.learmabc",
"category" : "Education",
"description" : "The application helps children to learn letters, numbers, colors and shapes in English in an easy and simple way The application draws and writes color for you and pronounces correct pronunciation as well as numbers, letters and shapes This animated phonics video will help children learn the sounds of the letters in the English alphabets. This colorful phonics video also teaches three words per alphabet letter.  Learn English for children with sound and pictures and without the Internet A program that helps children to gain knowledge and concepts in an attractive manner and to train them on proper language pronunciation. In terms of language, this Application clears the language of the child and helps him to speak and correct performance and increases his linguistic and cognitive dictionary. Educational program (100%) without the need of the Internet after downloading, helps the child to learn the letters and numbers in writing and how to pronounce them with examples in words containing the letters mentioned with pictures and to ensure learning for your child in an easy and enjoyable.  The English language learning program includes a variety of activities that seek to develop the basic skills of learning Arabic, English, reading and writing, living sciences, animal and fruit names, mathematics, numbers, colors, seasons, days of the week and months of the year. A pleasant and interesting atmosphere, merging into it, gaining knowledge directly from his sensory life.  The application of learning the letters and learning the numbers for the children contributes to your childs teaching pronunciation and writing of the alphabet in a fun and smooth, in addition to learning how to write numbers and counting easily. The Childrens Letters and Numbers program will solve your childrens Application in learning the grammar of Arabic, English for children in particular, and the basics of learning in general. All you have to do is upload it to your smartphone for your baby to use !! Programs to teach letters and numbers for children English language instruction Application for children Learn English for Children Games teach letters and numbers Teaching letters and numbers English education for children English children education Application Learn the letters and numbers English Children s Education Application Application to teach numbers for children Character Education Application Learn English characters English Language Teaching Program Children education Application letters and numbers English language learning Application for children ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "[]",
}