{
"name" : "Findadmission Student",
"url" : "https://play.google.com/store/apps/details?id=com.fapanels.student",
"package" : "com.fapanels.student",
"category" : "Education",
"description" : "A simple tool that gives student seeking admission abroad access to valuable information and opportunities to communicate and submit applications to their prospective universities or colleges.   As a student, it can be a very tiring exercise searching and applying for admission to different colleges. You hope to hear from college and keep waiting for a long time. But by utilizing the platform of Findadmission, your application reaches institutions where you stand a great chance of being accepted.   At Findadmission, your profile is matched only with institutions where the probability of being selected is high. This means that you need not complete the application procedure of a college before knowing whether you will be invited by them or not.  In addition to the features available in Findadmission includes:  ADMISSION SEARCHES MADE EASY: When looking for admission, all you need is to enter your proposed study destination, budget and gain access to a number of institutions around the world that fits into your criteria with their admission requirements listed in a format you will understand. An application can be submitted through Findadmission to the institution you selected.   NEWS FEED: Through the News Feed, students seeking admission abroad will have access to a wealth of information and news about their prospective schools, academic opportunities, international student life, scholarships alerts, admission requirements and relevant application deadlines. They are able to view, comment on or like the posts and share them with others.  INTERNATIONAL EDUCATION NEWS: Findadmission EDU News is yourtrusted source for pertinent information such as new policies affecting international students in popular student destinations like UK, USA & Canada, analysis and exclusive interviews, and major headlines on international education worldwide.   PAYMENT OPTIONS: Whether you need to pay an application fee or struggling to transfer your acceptance fee to your chosen institution, Findadmission provides different payment options available in your country.  VISA COUNSELLING: Our solution does not end at helping you get admission. Using Findadmission gives you access to our certified visa counsellors, who will provide visa counselling services in other to maximize your chance of actually resuming on your chosen institution campus.  We ensure that the universities you want also want you by optimizing your application to institutions that match your background and profile.  _____________________________________________  Were always excited to hear from you! If you have any feedback, questions, or concerns, please email us at support@findadmission.com  or follow us on twitter:  https://twitter.com/find_admission ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECORD_VIDEO', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'com.fapanels.student.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_VIDEO', 'android.permission.READ_EXTERNAL_STORAGE']",
}