{
"name" : "Learn Spanish - Frase Master",
"url" : "https://play.google.com/store/apps/details?id=com.masterkeygames.frases",
"package" : "com.masterkeygames.frases",
"category" : "Educational",
"description" : "Learn Spanish vocabulary and grammar free by ordering the words to form correct Spanish sentences and sayings.   Learn Spanish - Frase Master is a fun and educational word puzzle game for kids and Spanish language students of all ages who want to learn Spanish and improve their language skills in a more entertaining way.  How do you play?  Its easy. The game consists of putting the scrambled words from each level in order to form a correct sentence and learn Spanish in a fun way. (Beginner, skilled, professional, expert)  If you make a mistake and click the Spanish word in the incorrect order, there is a time penalty.  Once you have completed the sentence you will receive a score based on how fast you were and your total number of errors.  You can share your knowledge with other players worldwide thanks to online multiplayer mode or with your friends on Google Play services.  Are you a Spanish student who wants to improve your skills? Frase Master will help you learn Spanish and organize the words in your sentences correctly.  Are you a Spanish expert who wants to show off your skills? Prove it in Competition mode on Google Play services.  Frase Master is the first game of its kind designed and developed completely by educators to help students eliminate the most common mistake among Spanish language learners, correct word order. With four levels from beginner to expert, Sentence Master is a challenge for everyone from the Beginner to the most seasoned Spanish language communicators.   These are the levels:  Beginner: Ideal for children. This level contains the easiest sentences with the fewest words to unscramble.  Skilled: This is where things start to get harder. This level is great for adults who are beginning their Spanish language learning adventure.  Professional: Great for users with a solid base in Spanish who want to keep their skills up to date.  Expert: Only for those with the most proficient Spanish skills. Are you one of them?  Do you have what it takes to become the next Frase Master? Try your luck in single player mode or against friends and other players worldwide. Learn Spanish with a smile on your face. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'com.masterkeygames.frases.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}