{
"name" : "Tutellus - Cursos Online",
"url" : "https://play.google.com/store/apps/details?id=com.tutellus.mobile",
"package" : "com.tutellus.mobile",
"category" : "Education",
"description" : "Tutellus es la plataforma de educacin online ms grande del mundo hispano. Ms de 3 millones de usuarios, ms de 600mil alumnos activos en 160 pases haciendo ms de 70.000 videocursos, nos permite ofrecerte cualquier tipo de Curso online, Carrera o Titulo Universitario.  APRENDE A TU RITMO. T CONTROLAS * Aprende lo que necesitas, con cursos online creados por profesionales. * Accede a miles de cursos gratis, de universidades, empresas y profesores. * Crea Rutas formativas para que saques el mximo partido a cada temtica. * Apntate a tantos cursos como quieras, nunca caducan: adaptamos la formacin a ti. * Haz algn MOOC de tus Universidades favoritas, pero sin los problemas de fechas para empezar o acabar. * Consigue Certificados de los cursos que acabes, nicos e intransferibles. * Certifcate con Universidades y con ttulos oficiales, con crditos ECTS incluidos.  APRENDE PARA SER MEJOR * Usar Tutellus es fcil y gratis: instlate la Aplicacin y apntate a tantos cursos como quieras.  * Los tendrs siempre disponibles desde el mvil, tablet o PC.  * Podrs contactar con los alumnos y profesores dentro de cada curso y en definitiva conseguir unas experiencias formativas extraordinarias.   MILES DE CURSOS GRATIS Y TOP SOBRE: * Programacin, Desarrollo Web, APPs, Videojuegos, Java, Ruby, NodeJS, AngularJS, Docker, HTML5, Responsive, Javascript, Swift, Phyton, Django, Ionic, C, C# y otros. * Emprendedores, Ventas, Negocio, Trading, Marketing, SEO, Social Media, Coaching, PNL y Habilidades. * Diseo, ilustracin, infoarquitectura, Unity, Maya, Photoshop, Illustrator, Indesign, Fireworks, Realidad aumentada y 3D, 3DMax y otros. * Office, Excel, WordPress, SAP, Productividad, ERP y CRM. * Ingls, francs, alemn, italiano, ruso, chino, portugus, japons y lengua de signos. * Bebs, puericultura, deportes, yoga, repostera, cocina, recetas, restauracin y moda. * Ciencias sociales, ciencias naturales y ciencias aplicadas. * Biologa, matemticas, fsica, qumica, teologa, mercadotecnia e ingeniera. * Ttulo Universitarios, Diplomas y Cursos universitarios. Con ms servicios que los cursos de pago, los Ttulos te darn acceso a un reconocimiento oficial por parte de la Universidad asociada y a crditos ECTS. Tienes tanto Diplomas como Cursos universitarios, expedidos por la Universidad Catlica de Murcia UCAM y la Universidad Rey Juan Carlos URJC, y con hasta 12 ECTS.  Recuerda que tienes MOOC en abierto y videocursos de todas las temticas: Desarrollo Web y APP, Videojuegos, Coaching, Ventas, Fitness, Repostera, Yoga... todo lo que puedas imaginar. Hispanic Tutellus is the worlds largest online education platform. More than 3 million users, more than 600 thousand active students in 160 countries by over 70,000 Video course, allows us to offer any type of online course, Carrera or Title University.  LEARN YOUR RHYTHM. YOU cONTROL * Learn what you need, with online courses created by professionals. * Access thousands of free courses, universities, companies and teachers. * Create training routes to get the most out of each subject. * Sign up for as many courses as you like, never expire: adapt the training to you. * Do some MOOC of your favorite universities, but without the problems to start or end dates. * Get certificates of the courses that youre done, unique and nontransferable. * Get Certified with universities and official titles, with ECTS credits included.  LEARN TO BE BETTER * Use Tutellus is easy and free: consider installing the application and sign up for as many courses as you want. * Thell always available from mobile, tablet or PC. * You can contact students and teachers within each course and ultimately achieve extraordinary learning experiences.  THOUSANDS OF FREE AND COURSES ON TOP: * Programming, Web Development, APPs, Video Games, Java, Ruby, NodeJS, AngularJS, Docker, HTML5, Responsive, Javascript, Swift, Python, Django, Ionic, C, C # and others. * Entrepreneurs, Sales, Business, Trading, Marketing, SEO, Social Media, Coaching, NLP and Skills. * Design, illustration, infoarquitectura, Unity, Maya, Photoshop, Illustrator, Indesign, Fireworks, Augmented Reality and 3D 3DMax and others. * Office, Excel, WordPress, SAP, Productivity, ERP and CRM. * English, French, German, Italian, Russian, Chinese, Portuguese, Japanese and sign language. * Babies, childcare, sports, yoga, baking, cooking, recipes, restaurants and fashion. * Social sciences, natural sciences and applied sciences. * Biology, mathematics, physics, chemistry, theology, marketing and engineering. * University Title, Diplomas and university courses. With more services than paid courses, Titles will give access to an official recognition by the partner university and ECTS credits. Diplomas have both as university courses, issued by the Catholic University of Murcia UCAM and the University Rey Juan Carlos URJC, and up to 12 ECTS.  Remember that you open MOOC and Video course of all topics: Web Development and APP, Video Games, Coaching, Sales, Fitness, Pastry, Yoga ... everything you can imagine. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.RECORD_AUDIO', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.tutellus.mobile.permission.C2D_MESSAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_VIDEO', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_VIDEO', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING']",
}