{
"name" : "Archaeologist - Dinosaur Games",
"url" : "https://play.google.com/store/apps/details?id=com.magisterapp.iceage",
"package" : "com.magisterapp.iceage",
"category" : "Educational",
"description" : "Have fun digging and exploring the lost world of dinosaurs with games for kids by MagisterApp  Children will all enjoy the various game modes. The most appealing of all is definitely digging. Like a true explorer, look for all the bones hidden underground to build the dinosaur skeleton.  The children who tried it could not stop digging.   They will learn about dinosaurs with puzzles and sound effects and can color the characters using a magic brush.   The game graphics are carefully designed and full of color. Animations were created for the youngest players and the game is packed with information on dinosaurs.   Plenty of fun for your children and yourself.   * Dig for all the dinosaur bones  * Assembles the dinosaur skeleton with the bones you have found  * Play and learn with puzzles, animations and sound effects  * Color all the dinosaurs with a magic brush  * Read about all the dinosaurs in the game   Try it now, you will not be disappointed. Your children will have plenty of fun.   * NOTE on title Archaeologist: we would like to point out that the science that studies dinosaurs is Paleontology.  However, the protagonists of the saga of the archaeologist will not take care only of dinosaurs.  Joe is an explorer, he likes to dig, find hidden objects; his wife, Bonnie, is a paleontologist and soon, there will be other characters and new adventures, looking for other mysterious objects. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}