{
"name" : "Molecular Dynamics",
"url" : "https://play.google.com/store/apps/details?id=com.mkulesh.mmd",
"package" : "com.mkulesh.mmd",
"category" : "Education",
"description" : "MMD is a classical molecular dynamics code implemented as an App for Android. MMD is acronym for Method of Molecular Dynamics, which is a computer simulation of particles (atoms, molecules) motion. This simulation is done with respect to the given initial and boundary conditions and a potential that describes the particle interaction.  The trajectories of the particles are determined numerically. The well known Velocity Verlet integration of Newtons equation of motions is used for a system of interacting particles. Forces between particles are defined analytically using a pair potential function that depends on the distance between two particles.  In physics, MMD is used to examine the dynamics of atomic-level phenomena that cannot be observed directly. Within the mobile devices context, it can be used as a small mobile laboratory to understand the basics of the particle physics. Furthermore it can be used to produce nice dynamical pictures that are suitable as a live wallpaper.  Application features:  - The application can be set as a live wallpaper that visualizes the current experimental set up. - In the live wallpaper mode, the active static wallpaper can be used as a background. You can mix your favorite background picture with particles flying in front of it. - The changes made in main application will be applied to live wallpaper daemon to make the wallpaper tuning easier. - Generation of an initial structure of the particles use diagonal or square grids with given dimension - Possibility to select a boundary condition (full energy is constant, kinetic energy is constant, or no constraints) - If kinetic energy is constrained, it is possible to apply thermal change that simulates heating/cooling of the system - Possibility to change the gravity value. The gravity vector can be also changed by rotating of the device. - Possibility to select and visualize selected potential. Currently, three common potentials are available: Lennard-Jones, Morse and Born-Mayer. - The particle skin can be selected from build-in clip art. - Multi-touch interface is used to zoom and drag the experimental area.  Note: since the application implements a numerical integration method, it generates a significant CPU load. Therefore, the live wallpaper mode is not suitable for low-power devices.  Keywords: live wallpaper, HD wallpaper, physics, molecular dynamics, atom simulations, experiment  The app is 100% open source. Please feel free to download, explore, fork or contribute to it on https://github.com/mkulesh/molecularDynamics  Languages: English, Russian. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}