{
"name" : "My Diary",
"url" : "https://play.google.com/store/apps/details?id=com.college.school.management.mydiary",
"package" : "com.college.school.management.mydiary",
"category" : "Education",
"description" : "MY DIARY application is user friendly application. Features of this app students communication, homework, assignment, exam time table, class, exam results, declaring holiday, lock features, Lock Classes , events, data privacy with in management and much more.  MY DIARY application is application which can help school/institute management to build a smart school by providing a complete cloud based school management app and school system that simplifies the routine tasks for a teacher and enables communication between teacher and parents.  MY DIARY app is a one stop solution for institute & parents to monitor students as well as childrensstudies. It is suitable for graduate and under graduate college, coaching centers, Tuitions.   Why MY DIARY is best?  Institute administration: Institute administrator can create & modify classes as per requirement.  Attendance: Administrator can feed class attendance same shall be sent to parents automatically.  Homework: Administrator can update students home work on need basis. Same shall be communicated to parents immediately with each home work subject wise.  Exam Time Table &Results : Administration can feed/modify exam time table & students marks in app, which can be viewable by parents through app.   Communication: Parent, teacher communicates via instant messaging through Mobile App, views information as per permission by the school. Send a message, Images, Documentsto one parent or entire group with single click.   Fee due alerts: Administrator can send monthly/annual fees dues alerts via message.    Announcements: School administrator can send Invitations and announcements to parents at a time with a small click. Holiday settings: Administrator can set list of holidays month wise easily, the same holidays list can be viewable for parents.   Privacy and permissions: Administrator can set permission for individual staff. Data security and backupis available.  Backup: Periodically cloud backup will be taken to avoid data loss this option will help administrator to restore the data.  For parents: Parents can check their childrens attendance, home work, exam schedule, Marks, Personal messages, Announcements, holidays and other information. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}