{
"name" : "Quran with Urdu Translation",
"url" : "https://play.google.com/store/apps/details?id=com.QuranReading.urduquran",
"package" : "com.QuranReading.urduquran",
"category" : "Education",
"description" : "Urdu Quran is a smart android application, which is intended for Urdu speaking people offering an easy to use interface with Urdu Translation, Transliteration, and Audio (MP3) Recitation of all Surahs of the full Quran Kareem. The application is embedded with several features that are beautifully designed to ensure a pleasant Quran reading experience.  Features: Some of the main features of this mobile application are:   Urdu Translation: Helps in better understanding the concepts and revelations of Quran by interpreting the meaning of Arabic language in Urdu   Audio Recitation: Lets one listen to the complete narration (Qiraat al Quran) of all Chapters in MP3   Urdu Translation: Prayer timings has been introduced with accurate Salah timings according to your location with Azan alarm and notification.   Transliteration: Makes pronunciation of Arabic text easy with its similar reading option in English   Language: Besides Urdu, Quran Translation in other languages (English Spanish, French, Chinese, Persian, Italian, Dutch, and Indonesian ) is also included    Search Bar: Facilitates in choosing the desired Surah of the Holy Book   Go To: Allows app consumer to jump to any Ayah of the present Surah   Bookmarks: Allows the user to favorite or save a particular part of the recital process in order to continue from the same place where it left   Stop Signs: Various kinds of pauses that repeatedly come in the Sacred Volume of Allah are included which lets one know about their interpretation and action   Sajdahs: 14 places in the Holy Quran where one has to perform prostration in front of the Almighty are also separately mentioned in Settings.   Font Size: Allows the user to customize font size as per chosen preferences   Font Style: 3 unique Print Modes are also added into main Settings for variation in outlook of Quranic text.   Urdu Translation: New script with improved font has been added. Now you can easily Recite Quran with more clarity.  Download this free of cost Quran application now to benefit from its easy to understand presentation and other attributes especially Urdu Translation option to eventually identify with the Holy Quran effectively. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}