{
"name" : "Chinese Vocabulary",
"url" : "https://play.google.com/store/apps/details?id=com.mmswdev.chinesevocab.hsk",
"package" : "com.mmswdev.chinesevocab.hsk",
"category" : "Education",
"description" : "For those learning or brushing up their Mandarin Chinese, this app can be used to learn vocabularies. The vocabularies are grouped into six levels based on Hny Shupng Kosh  (the official Chinese proficiency test). The Hny Shupng Kosh is standardized by China where simplified Chinese characters are mainly used.  There are two modes: study and flashcard.  Study section pinyin pronunciations and definitions for each word.  For the flashcards, only the words are displayed. Its up to the user to reveal pronunciation and definition.  Each word includes Chinese characters, pinyin in two methods for tone marks so that it works fine for those who are learning in either using numbers or the characters for tones.  Text-to-speech feature of the Android System is used to generate audio for the words. If Text-to-speech for Chinese language does not work, please check the settings on the phone. If changes to Text-to-speech settings are not effective, please close this app in recent app list and try again.  A button is added for each word to easily look up it up on http://dictionary.pinpinchinese.com using web browser. It requires internet access to work.  Note: The content for this app was acquired from http://data.hskhsk.com/lists/  This app uses Google\s AdMob advertising service and Firebase analytics. Google\s privacy policy is available at https://www.google.com/intl/en/policies/privacy/ ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.mmswdev.chinesevocab.hsk.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}