{
"name" : "Baby Panda's Carnival - Christmas Amusement Park",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.amusement",
"package" : "com.sinyee.babybus.amusement",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!  Merry Christmas! Baby Pandas Christmas Amusement Park is coming soon, can you give a hand to panda Kiki and help him make some Christmas preparations and hold various theme parties? Come on, join Baby Pandas Carnival!  Jingle bells, jingle bells, Jingle all the way! Childrens long-awaited Christmas is coming! Look! Santa Claus is appearing with amazing Christmas gifts! Come and find Santa Claus, joining the carnival of wonderful Christmas parties! Decorate your own Christmas tree with Christmas balls, ribbon, bells, the gingerbread man and other decorations! Little friends, are you ready for the Christmas party?  Awesome! Christmas Amusement Park is filled with Christmas decorations, colorful lights, other Christmas decorations and more! Baby panda Kiki and his friends are playing interesting Christmas games here! Come and join them! Poke a mole, catch dolls, make yummy spun sugar, Ferriswheel,shatter golden eggs and many other amusement rides would blow your mind away. Which one do you want to start with?   Funny Christmas Amusement Park &Carnival games: *New! Look for Santa Claus to get mysterious Christmas gifts: funny dolls, toys, bow knot, Christmas greeting card and more! *New! Decorate your own Christmas tree with best friends: Christmas balls, ribbon, bells, the gingerbread man and more!  *Aim at the rats that run out of the ground and hit them quickly. Dont hit the bomb! *Move the rocker, aim at the Christmas toys you like, click the button, and grab the dolls. Bingo! You did it! *Various flavors of popcorn: mango, blueberry, chocolate and more! Choose your favorite flavor, start the machine and make popcorn on your own! *Whats in the gold egg? Try to open it!Surprising Gifts are waiting for you! *Help! The little ducks cant find their home! Move the water gun around and help them go home! *Fishing in the Christmas Amusement Park is a fun thing! Drag the fishing rod, pointing the hook at the small fishs open mouth, and surprise! Youll catch various cute fishes!  Features of Baby Pandas Carnival: - New Christmas decorations and strong Christmas atmosphere for kids to feel! - 9 fun carnival games to brighten up your day! - Enjoy the carnival of amusement park indoor. No more waiting, no money cost. Awesome! - Design yummy snacks and food of various flavors all by yourselves! - Well-designed scenes, dynamic nursery rhymes and dreamy Christmas Amusement Park will feast your eyes!  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}