{
"name" : "Student Calendar - Remember tasks ToDo & Timetable",
"url" : "https://play.google.com/store/apps/details?id=com.claudivan.agendadoestudanteplus",
"package" : "com.claudivan.agendadoestudanteplus",
"category" : "Education",
"description" : "Student Calendar was made to help students get organized and have, consequently, better performance in studies.  The objective of using this app is to perform tasks within the combined deadlines, divide better the time between academic and personal life, conduct the day-to-day with more calmness and less stress.  On Student Calendar, important information about tests, homeworks, appointments and timetable will always be available on your smartphone to checks and new schedulings, wherever you are. There are also the reminders, that will help you dont forget important activities.   Student Calendar lists the events as a To Do List or Check List where you should mark the events as completed so that they are no longer highlighted. In addition, it groups by past and future events, and it is possible to see when some activity is late.  These features are adequate for school, for college, for your day-to-day... The goal is to make student life more organized, managing appointments that cant be forgotten.  The app was developed to be simple and easy to use. To start, you can simply add your subjects, your timetable and your tasks..  Main features:   Simplicity and lightweightness;  Timetable;  Scheduling of events (exams, homeworks/tasks, and returning books to the library and other);  Notification schedule (reminder) for events;  Check events as completed;  Events ordered by day, week and month;  Timetable of the week;  Calendar;  Management of marks;  Timetable and events widgets; ",
"desc_perms" : "['android.permission.READ_CALENDAR', 'android.permission.INTERNET', 'android.permission.WRITE_CALENDAR']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}