{
"name" : "Superstar Makeup Party",
"url" : "https://play.google.com/store/apps/details?id=com.libiitech.superstarmakeupparty",
"package" : "com.libiitech.superstarmakeupparty",
"category" : "Educational",
"description" : "Are you ready? Put your hands up in the air! The stars are about to come on stage!  Wanna make your star the most shining one? Then, eye shadow, brow powder, blusher... dont you miss any of these parts. Now, the question is: how do you want your star to look like today, rock-style, punk or elegant? You are the boss! Just release your imagination and creativity, and youll find your undiscovered talent in makeup.  Features: - Tons of cosmetics for your free choice Countless cosmetics of different colors, flavors and shapes make you feel like youre in a paradise. Yes, it is a paradise for girls! - Two makeup modes offer more fun-filled and easier experience Free creation or simple selection? Do what you want! Youre absolutely a free stylist here! - Three kinds of skin tones require different styling skills Make different colored girls look their best. Do you have that confidence? Actually, we have faith in you! - Freeze all wonderful moments and join the show Besides sparkling on the stage, why not capture the most dazzling moments and show them to everyone in the show?  About Libii Game: With over 600 million downloads and growing, Libii is committed to creating innovative games for kids. Well keep working on establishing a good relationship with both parents and their children and bringing a healthy, happy atmosphere for them. Visit us: http://www.libii.com/ Like us: http://www.facebook.com/LibiiGame Contact us: Got any ideas? Suggestions? Need technical support? Please feel free to contact us 24/7 at WeCare@libii.com  Need You Know: This app is totally free to download and play, some basic items are also free to use, but some additional items need you to purchase and pay to unlock. Therefore, if you do not want to use these items, please turn off the in-app purchase in your settings. Thanks. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.asus.msa.SupplementaryDID.ACCESS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.asus.msa.SupplementaryDID.ACCESS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}