{
"name" : "Brown Bear - Animal Parade",
"url" : "https://play.google.com/store/apps/details?id=com.storytoys.brownbear.free.android.google",
"package" : "com.storytoys.brownbear.free.android.google",
"category" : "Education",
"description" : "* Childrens Technology Review Editors Choice Award* * Tech With Kids Best Pick App Award * * Teachers With Apps Best Pick Award*  Marking the 50th anniversary of Eric Carles classic best-selling book Brown Bear, Brown Bear, What Do You See?, Brown Bear is brought to life in a stunning 3D interactive app.   Join the lovable Brown Bear as he explores his world and encounters new friends. Meet Red Bird, Yellow Duck, Green Frog and other characters. Color the animals and have fun creating your own unique sounds and music. Children will love recording their voices as they sing along and make their own animal noises.  Discover hidden surprises in a magical 3D world. The more you play, the more surprises youll find.  Brown Bear, Brown Bear is part of the StoryToys Jr. line and lovingly crafted by the creators of the hugely popular My Very Hungry Caterpillar. Its a world of music and color youll return to again and again.   Designed for preschoolers and Eric Carle fans of all ages, it includes the following features:    Amazing 3D Brown Bear interactive character   Encourages a love of music and nature  Discover magical interactive activities  Non-competitive individualized play  Beautifully-illustrated scenes based on Eric Carles bright, colorful hand-painted collage illustrations  Intuitive, child-friendly and easy to use  Charming musical effects and comforting soundtrack  Record your own animal sounds and create unique musical harmonies. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'com.sec.android.iap.permission.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.sec.android.iap.permission.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
}