{
"name" : "Second Grade Learning Games",
"url" : "https://play.google.com/store/apps/details?id=com.kevinbradford.games.secondgradefree",
"package" : "com.kevinbradford.games.secondgradefree",
"category" : "Educational",
"description" : "18 fun and educational games to help your child learn 2nd Grade lessons! Teach Second Grade lessons like multiplication, money, time, punctuation, STEM, science, spelling, suffixes, the human body, states of matter, cardinal directions and more. Whether they are just starting Second Grade, or need to review and master the subjects, this is a perfect learning tool for kids aged 6-9. Math, language, science, STEM, and critical thinking skills are all tested and practiced in these games.  All 18 lessons and activities are designed using real second grade curriculums, so you can be sure these games will help give your child a boost in the classroom. And with helpful voice narration and exciting games, your 2nd grade student wont want to stop playing and learning! Improve your childs homework with these teacher approved lessons, including science, STEM, language, and math.  Includes 2 games provided for free, unlock all 18 through a simple in-app purchase.   Games:   Odd/Even Numbers - Learn the difference between odd and even  Greater and Less Than - Teach kids how to compare numbers, a critical second grade skill  Place Values (Ones, Tens, Hundreds, Thousands) - Reinforces how to identify place values  Alphabetical Order - Sort words correctly in a fun game, important for 2nd grade  Spelling - Spell hundreds of second grade spelling words  Telling Time - Learn how to set a clock and tell time  Multiplication - Fun and interactive way for your 2nd Grade student learn how to multiply numbers  Positive/Negative Numbers - Learn how numbers can be less than zero  Verbs, Nouns, and Adjectives - Teach your child the different types of words and how to identify them  Punctuation - Drag punctuation to the correct place in a sentence  Counting Money - Count money uses nickels, dimes, quarters, and bills  Synonyms and Antonyms - Fun game to learn the difference between synonyms and antonyms  Missing Numbers - Fill in the missing number to complete the equation, a perfect introduction to pre-algebra  Suffixes - Build new words using a suffix and have fun blowing up asteroids  Human Body - Learn about the parts and systems that make up the human body  Cardinal Directions - Follow directions to navigate the pirate around the treasure map  States of Matter - Identify types of matter and their phase transitions  Seasons - Understand what causes seasons and how they differ  Oceans - Learn about our oceans, the importance of them, and how to protect them.  Calendars - Read a calendar and understand days of the week  Perfect for 2nd grade kids and students who need a fun and entertaining educational game to play. This bundle of games helps your child learn important math, money, clocks, coin, spelling, multiplication, language, science, and problem solving skills while having fun! Second Grade teachers around the country use this app in their classroom to help reinforce math, language, and STEM subjects.  Ages: 6, 7, 8, and 9 year old children and students.  =====================================  PROBLEMS WITH THE GAME?  If you are having any issues please email us at help@rosimosi.com and we will get it fixed for you ASAP.  LEAVE US A REVIEW! If youre enjoying the game then wed love for you to leave us a review! Reviews help small developers like us to keep improving the game. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}