{
"name" : "KidSpace",
"url" : "https://play.google.com/store/apps/details?id=com.Zainiq.kids",
"package" : "com.Zainiq.kids",
"category" : "Educational",
"description" : "KidSpace provides your kids with a safe environment and the best educational apps for kids up to 6 years old. Join KidSpace and enjoy apps and games hand-picked by experts and more than 200 TV shows on your tablet or smartphone. The content is regularly updated so your child will never get bored!  The app is designed to look like the average household: - The Loft: apps and games available on the shelf.  - The Kids Room: Allows you to see the most and last used apps by your kids in addition to the most popular apps. Every day on the main floor theres a little present for your child: just click and discover the App of the Day.  Videos:   In the TV room, you can browse more than 200 videos organized by characters. New episodes and new popular TV shows are added every month.   All the videos are also available for download, so you can watch them offline whenever you arent connected to the internet.   Art, Pictures and Music:  - Selfie Wow: shoot and decorate pictures with funny gadgets - Art Attack: paint and unleash your creativity  - Piano: play your first melodies  - Sing and Dance: popular songs and exclusive music videos.  Stickers: In the kitchen, your kids can play with lots of animated stickers with different scenarios.   Educational Activities:  Toddlers can improve their abilities in the English alphabet by playing memory games, puzzles, crosswords and more games.   Choose among the educational apps selected by experts in education:  - Writing and reading in English - Logic, math, measuring  - Creativity, emotions, arts - Civism, nutrition, hygiene - Environment, society, science.  Kids Safety - No hidden in-app purchases - Totally AD Free.  Parent Dashboard - Child profile: create your kid or kids profile(s) to personalize the app. - Your videos: download and watch entire cartoon series offline. - Your album: drawings and pictures of your child is saved in his/her personal gallery. - Settings: set WI-FI on to avoid consuming mobile data  We Value Your Privacy We safeguard the confidentiality of the information provided using our app. Please read our complete privacy policy at http://www.zainkids-iq.com/#!/terms/privacy Zain Customer Support: info@iq.zain.com ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'com.Zainiq.kids.permission.C2D_MESSAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}