{
"name" : "Explain Everything Whiteboard",
"url" : "https://play.google.com/store/apps/details?id=com.explaineverything.explaineverything",
"package" : "com.explaineverything.explaineverything",
"category" : "Education",
"description" : "Teach, present, sketchnote, record videos, and work together, all in the Explain Everything Whiteboard.  Explain Everything Whiteboard is a part of Googles Creativity Apps collection for Chromebooks.  Explain Everything is the Swiss army knife of whiteboarding apps. Due to its unique versatility, it opens up countless new possibilities to express knowledge, breaking down the boundaries of time and distance, allowing you to sketch, talk and share across a new landscape, digitally reimagining how you can explain anything.   Make the process of creating quality explainer videos a breeze. Share your whiteboard presentation either on site or from a distance. Open up an infinite digital space to visually brainstorm complex ideas and share invaluable feedback.    Bring in media directly from Google Drive and Dropbox, and export back to them when youre done.    Capture your interactions and voice to create just-in-time video messages and stories.    Whiteboard together in real time with voice chat on any device, anywhere. Invite guests with a link or project CODE to join you. Record everything and share it later as a video.    Turn your infinite canvas into a mixed-media playground of videos, images, documents, and sketches that captivate, engage, and inspire others.    Share your projects as images, PDFs, MP4s or editable Explain projects. Share as a web video link so others can stream your Explainer videos.    Centrally manage your group or institutions access to the whiteboard and its functionalities with ease and comfort.     Present, teach, and inspire   Lead your audience with a flexible interactive tool. Add documents, images, video, audio, sketches, and more to engage all learning styles. Organize your materials on an infinite canvas and never run out of space.    Record and share whiteboard videos   Record animations, annotations, and voice, and make edits using the timeline. Explain Everythings infinite canvas and recording tools make creating explainer videos a breeze.    Meet and collaborate   Meet, work, record, and share your videos all in a single app. Invite anyone to your Explain Everything Whiteboard and collaborate in real time on our infinite canvas with voice chat. Record the whole thing or pick out the good bits, edit the video, and share it as a link. All of this in one package.   Explain Everything is used and loved by tutors & consultants, trainers & teachers, storytellers & visual learners, business communicators & professionals, and anyone with the drive to explain or present complex concepts and truly connect with their audiences.   Features Available in the Free Plan    All creative tools and recording features.  200 MB of Explain Drive storage.  Join and collaborate with others.  Create up to 3 projects.  Export videos up to 60 seconds long.  Projects limited to 1 slide.   Subscribe in the app. If you choose to subscribe, you will be charged a price according to your country. Prices will be shown in the app before you complete payment. Subscriptions renew every month/year unless auto-renew is turned off at least 24 hours before the end of the current subscription period. Your account will automatically be charged within 24 hours prior to the end of the current period. You will be charged for one period at a time. You can turn off auto-renew at any time from your Explain Everything account settings. No cancellation of the current subscription is allowed during an active subscription period. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_CREDENTIALS', 'android.permission.RECORD_AUDIO', 'android.permission.BLUETOOTH', 'android.permission.GET_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}