{
"name" : "Sweet Home Stories - My family life play house",
"url" : "https://play.google.com/store/apps/details?id=com.playtoddlers.sweethomestories.free",
"package" : "com.playtoddlers.sweethomestories.free",
"category" : "Education",
"description" : "Wake up and get ready! There are lots of things to do in Sweet Home Stories! A fun and safe educational doll house game for kids, about daily life in a household, where everyone is welcomed and the only rule is to use your imagination to create amazing stories with your new family.  On this cozy playhouse, you are in charge of everything: hanging laundry, mopping floors, or making breakfast with this adorable family. With 7 different rooms, including dozens of different activities and hundreds of items available to explore and play, theres no time to be bored.  Designed for children aged 2-8, Sweet Home Stories will foster their imagination and creativity while learning and reinforcing daily routines and improving their language skills through story creation.   CREATE YOUR OWN FAMILY HOUSE STORIES!  Join a family of 6 lovely characters in their day to day life and create your own home stories. Play, explore and have fun doing funny chores in this cozy house: Make tasty meals, diaper the little baby, dress the kids, brush their teeth in the morning, or read to them before sleeping at night.   DISCOVER AND PLAY WITH EVERYTHING!  There is a whole new adventure every time you play with this playhouse. With tons of toys, different equipment and thousands of possible interactions in 7 different rooms, full of surprises and chores to do. Remember, there are no rules, so dont be afraid to interact with everything you see!   REINFORCE DAILY ROUTINES  Parents can play Sweet Home Stories together with kids, to have some fun and healthy laughter with them or helping them to learn new routines and vocabulary. Do you want to encourage them to tidy up their rooms? Suggest them to it in the game, and then apply it to their daily life. Brushing their teeth every day? Remind them to it in the game when the characters wake up. While playing, kids can learn basic home rules and explore daily routines without noticing.    KEY FEATURES:   7 rooms, representing different areas of a household: A living room, a kitchen, the childrens room, the parents room, a bathroom, the front yard and the backyard.  Every room is filled with items youd expect to find in a real house.  A happy family with 6 different characters: A mom, a dad, two kids, a little baby, and their lovely cat.  Hundreds of items available for explore and play.  Dozens every day chores: Preparing meals, putting kids to sleep, clothing, growing veggies in the garden, possibilities are truly unlimited.  Without rules and goals, just fun to create your own stories.  Set the time of the day at any moment to represent different routines, from waking up to bedtime.  Kid safe environment for children aged 2 to 8, no third-party ads, pay once play forever.  Specifically designed to be played by children from 2 years of age, but detailed enough to captivate and amuse children up to 8 years. Sweet Home Stories will foster their imagination and creativity and will keep them fascinated for hours for less than the price of a cup of coffee.  The free trial includes 3 rooms so you can test the endless possibilities of this game. Once you are sure, you can buy the full version through a single purchase within the application, which will unlock the 7 rooms forever.   About PlayToddlers  PlayToddlers games encompass different areas of toddlers personal growth and have been specifically designed to be used by babies and kids, with a simple and attractive interface that allows them to use the application by themselves, improving their development and self-esteem. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'com.android.vending.CHECK_LICENSE']",
}