{
"name" : "3D Anatomy for the Artist",
"url" : "https://play.google.com/store/apps/details?id=com.catfishanimationstudio.AnatomyForTheArtistLite",
"package" : "com.catfishanimationstudio.AnatomyForTheArtistLite",
"category" : "Education",
"description" : "Free access to the skeletal system and drawing gallery Muscular system (in-app purchase)  Depth study of anatomy has been a critical step for any great artist. This app allows artists to display the skeletal and muscular system through highly detailed 3D anatomical models. The shape of each bone and muscle will be clear and understandable. An essential tool for any artist to use alongside the best artistic anatomy books.  HIGHLY DETAILED ANATOMICAL 3D MODELS (MALE ONLY)  Skeletal System (free)  Muscular System (in-app purchase)  Accurate 3D modeling  Surfaces of the skeleton with high resolution textures up to 4K  SIMPLE AND INTUITIVE INTERFACE.  Rotate and Zoom every model in the 3D space  Division by regions for a clear and immediate visual of each structure  The muscles are grouped into layers, from the superficial to the deepest  Visualization of the muscle layers in multi or single mode  Possibility to hide every single bone or muscle  Filter feature to hide or display every system  Intelligent rotation, automatically moves the centre of rotation for easier navigation   Interactive Pin allow visualization of the term relative to every anatomical detail  Hide / Show interface, ideal for use on smartphones  Muscles descriptions (origin, insertion, action), in english  MULTI-LANGUAGE  The anatomical terms and the interface are available in 11 languages: Latein, English, French, German, Italian, Portuguese, Russian, Spanish, Chinese, Japanese and Korean  The language can be selected directly from the interface of the app  The anatomical terms can be shown in two languages simultaneously  ***Anatomical 3d models are of the male musculoskeletal system only. There are no anatomical 3d models of the female musculoskeletal system. Anatomical models are static and you can rotate them to view from any angle but it is not possible to pose them.*** ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
}