{
"name" : "French to English Speaking - French to English",
"url" : "https://play.google.com/store/apps/details?id=com.englearner.frenchtoenglishspeaking",
"package" : "com.englearner.frenchtoenglishspeaking",
"category" : "Education",
"description" : "* This application helps you to learn English easily.  * You can learn spoken English in just a few hours.  * This is an English speaking course for learning English easily.  * English conversation can be easy if you go through the chapters properly.  * And if you are wondering how to learn English, this app on the English language can help you do so.  * This app has a chapter on English vocabulary as well.  * If you are looking forward to learning English online it is better that you initially start with this application. * There is also a chapter on English pronunciation. * There are simple English words as well, in one of the lessons which you can find helpful. * Learn English phrases and idioms easily. * This application is, in fact, a French to English speaking tutorial. * If you are seeking to talk English the right way, this can be a good beginning. * Learn English using French with effective English listening. * You can learn how to speak English fluently. * Speaking English with French was never easier. * This can also be useful for those who are seeking to join BPO or Call center. * Also if you want to participate in English discussions and debates, you can begin with this application. * This application uses both text and voice audio to teach English the proper way. * Learning English grammar could be easier if you initially get to know these basics. * Learn to speak English fluently with French. * Also if you are preparing for an English interview, spend some time learning the tools provided here. * An excellent beginning for a French-speaking person. * Start learning these English lessons and improve your English knowledge with this application which is for beginners. * These English practice lessons and tutorials will make you comfortable in improving your English skills. * Learn English using the French language and acquire the skills which are looking to achieve. * You will learn some basics of English which is important to understand before you start learning professional English. * This application is not a mini English dictionary. Rather it is for those who want to improve their spoken English. * This application helps you get prepared for exams like IELTS, and SAT. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'android.permission.USE_FINGERPRINT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}