{
"name" : "Baby Panda Care",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.care",
"package" : "com.sinyee.babybus.care",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!  Children love to engage in all sorts ofpretend playand imitating parents is one of the most enjoyed. Caring for a baby is an experience they arefamiliar with happening to themselves. Its fun for children to switch role and take on some caring responsibilities. BabyBus gives children the chance of caring for another baby, a cute baby panda. You might be surprised to find how much your children will enjoy caring this new baby!  DRESSING BABY  Magician outfit, dinosaur outfit, birthday outfit...A variety of surprising outfits for your children to choose! Dress up the cute baby panda!  FEEDING BABY  Baby panda is hungry and wants to a delicious meal. Prepare 4 different types of food and feed him! The little baby will tell his preference through his reaction.  WASHING BABY  Its a big challenge for your children toremove various pieces of clothing, help baby panda take a bath, and drythebody. Look, the baby panda is clean now!  ...  Its a great opportunity for your children to get a firsthand experience in baby care. Take care of our baby panda who is in need of care. Your children will be incrediblyexcited about the cute new baby and cant wait to take on the role of being a big sister or brother!  FEATURES: - Interact with an adorable baby panda; - Cute animations in a stress-free setting; - 5 playful scenes with fun tasks and actions; - Learn general knowledge through various caring tips  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}