{
"name" : "Learn Languages in Augmented Reality - Mondly AR",
"url" : "https://play.google.com/store/apps/details?id=com.atistudios.mondlyar.languages",
"package" : "com.atistudios.mondlyar.languages",
"category" : "Education",
"description" : "Mondly AR is the first Augmented Reality language learning app which provides you with your own virtual language learning assistant. Anytime. Anywhere.  With Mondly AR you can learn 31 languages: Spanish, American English, British English, French, German, Portuguese, Italian, Turkish, Russian, Dutch, Danish, Swedish, Norwegian, Arabic, Japanese, Korean, Finnish, Romanian, Hungarian, Czech, Polish, Ukrainian, Bulgarian, Hebrew, Vietnamese, Greek, Indonesian, Afrikaans, Croatian, Farsi, and Hindi, all in Augmented Reality.  Bringing language learning to life into your living room using Augmented Reality (AR)  We are excited to introduce you to Mondly, your new language teacher that will guide you through a captivating world where virtual creations magically appear in your living room.  Powered by chatbots, Mondly AR takes learning a step further by engaging into spoken conversation with you and giving instant feedback on your pronunciation. The result is a truly immersive experience that makes learning happen naturally. Please ensure your device is AR-enabled in order to use Augmented Reality features.  Learn languages outside the books  Exploration is learning. Using augmented reality, we created a new world within your own. Just as real looking, only more spectacular. Your phone works as a lens. It will allow you to explore, discover, and interact with this new world. And the best part? You will learn a new language along the way. Not because you have to, but because its genuinely fun.  Discover the power of artificial intelligence by downloading the most revolutionary app in language learning.  Mondly AR is the first augmented reality app with chatbot and speech recognition. Here are the key features that make Mondly AR an unconventional AI teacher for you:  Lifelike conversational partner The complete language-learning journey should allow you to learn but also practice. Mondly offers just that. Using the latest speech recognition technology, your new virtual language learning assistant understands and answers to anything you say, giving instant feedback on your pronunciation.  Smart and seamless interaction The chatbot experience Mondly offers you is the closest thing to real communication. Mondly will reply with a human voice to help you develop a strong sense of language, she will change her outfit to match the topic of discussion and will use gestures and facial expressions to create dynamic dialogues.  A captivating language learning journey Using interactive visual lessons, real conversations and an adaptive character, Mondly AR offers a complete language learning experience that is easy to use and access anytime, anywhere. Learning a new language has never been so fun and interactive!  Continue learning with Mondly:   Facebook: https://www.facebook.com/mondlylanguages/  Twitter: https://twitter.com/MondlyLanguages  Instagram: https://www.instagram.com/mondlylanguages/ ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}