{
"name" : "French Phrasebook – Learn Free",
"url" : "https://play.google.com/store/apps/details?id=com.hellopal.android.pbapp.fr",
"package" : "com.hellopal.android.pbapp.fr",
"category" : "Education",
"description" : "Learn how to read & speak French in minutes: The best offline phrasebook with audio guide that teaches you the correct grammar and pronunciations of words and phrases in the French Language!   You can listen to audio recordings of native language speakers and learn to understand AND speak French - anytime, anywhere!   Just download Hello Pals free French Phrasebook, and start developing your French vocabulary and language skills by using phrases from the phrasebook as you need them in real life!   The French Phrasebook app is a comprehensive French dictionary with vocabulary building tools and translations that help you practice and learn French in an easy way. This app takes language learning to a whole new level! It provides pre-recorded audios from native French speakers for commonly used words and phrases that are part of day-to-day conversations. You can listen to these recordings and repeat them to get your pronunciation right. The phrases also help you understand how sentences are formed so you can perfect your French grammar!    APP HIGHLIGHTS ****************  Dictionary of over 2,000 commonly-used phrases, organized neatly into categories and sections, useful for everyday conversation and building your language vocabulary  Customizable phrases lets you insert vocabulary words that you really need (For example: I am from [England] can be changed to I am from [France])  Audio recordings by native speakers which you can use to practice speaking. Comprehensive audio guide for you to get the pronunciation right.  The audio recordings have two types  a normal-speed version and a slow version, to make it easier to follow when you are trying to go for the perfect pronunciation  Each phrase has a regular translation, but also includes a LITERAL translation so you can better understand how each phrase is put together in the French grammar, word for word  Access your Hello Pal Phrasebook anywhere: even OFFLINE   HOW DOES IT WORK? **************** Learning with our free mobile app is like having a native speaker tutor you through applying your new language: youll get audio recordings from native speakers from the audio guide which you can mimic, along with translations and explanations on how each phrase has been put together, creating a deeper understanding for your new language. This will enable you to get the correct grammar and pronunciation for every word and phrase.  Discover the benefits of learning a language through practice and real-life application.  Other available languages:  Arabic  English (American)  Chinese (Mandarin)  Dutch  Filipino (Tagalog)  French  German  Hindi  Italian  Japanese  Korean  Portuguese (Brazil)  Russian  Spanish (Spain)  Thai  Turkish  The French Phrasebook by Hello Pal provides an easy way for you to practice your grammar and build your vocabulary in French by including a handy dictionary which can be used to search for different words and phrases that will help improve your conversational skills.   This app goes much beyond a regular language translation app that translates words and phrases for you. With Hello Pal, we enable you to become a fluent speaker of any language you want!    ABOUT HELLO PAL **************** Hello Pals mission is to bring the world closer together by helping eliminate the language barrier. By creating a platform where it is easy to instantly interact, and creating the tools to communicate with each other, we hope to do our part in fostering understanding between all citizens of the world.  For more information, visit HelloPal.com.   FOLLOW US ON: *****************  Facebook: https://www.facebook.com/hellopalchat/  Twitter: https://twitter.com/hellopalchat  Google+: https://plus.google.com/116731178310818772286  Instagram: http://instagram.com/hellopalchat ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}