{
"name" : "Kriyo - Preschool & Daycare Management App",
"url" : "https://play.google.com/store/apps/details?id=com.littlesoldiers.kriyoschool",
"package" : "com.littlesoldiers.kriyoschool",
"category" : "Education",
"description" : "Kriyo - Preschool and Daycare Management App is one-stop destination for Preschools and Childcare / Daycare centers. Key features are Enquiries and Admissions management, Easy to Use Teacher - Parent - Teacher communication specifically designed for different activities, Digital Notice Board, Events & Holiday Calendar, Comprehensive Invoicing & Receipts module, a smart School Bus tracking system with live alerts. You can mark Attendance of Children and Staff, share Photos and Videos, send One-Click Updates to Parents. Kriyo also gives all the Analytical Reports needed for you to grow your Business.  Kriyo is fast becoming the choice of Educators and is rated highly by Teachers and Parents alike.  Owners can manage their Schools, Teachers can save valuable time and Parents can better engage with their Childs Learning. It is the most powerful & easy to use software in early education.  Feature Details:   Affordable: You can download Kriyo App and signup for a FREE TRIAL. We also have a FREE version for all the basic needs of the Preschool / Childcare centre. Explore all the powerful features we built for you with the advanced PRO package. Licensing is on Pay-per-Use basis - No upfront commitments.  Your Data is safe with us: We understand the importance of Privacy and Security that your precious data needs. We store everything related to children, staff and parents in secure Cloud storage. Login information is safely secured with Encryption  Manage multiple branches: From the same Kriyo app, you can manage multiple branches/centers of your school. Flipping between schools is now just a click away.  Customized Staff Permissions: As a School Owner(or Head), you can grant/restrict access to any Teacher/Staff for any feature or program based on your need. It can be changed any time.  Enquiries & Admissions Management: Never miss out on a prospective admission. Add an enquiry, assign status using customisable labels, get followup reminders, send SMS/Email campaigns and much more.  Check-In/Out: Mark attendance of one or more children/staff in a click. No need to maintain a separate attendance log books.  Photos and Video sharing: Click photos, record video and then tag students with one click to share these happy moments with parents.  Activity Updates: Teachers can now send different activity updates in just a few taps. Parents will get instant updates with a notifications as soon you send an update.  Observations: Make note of progress, achievements, and activities of a child with customizable tags and save them for Schools use.  Child Daily Report: Parents get a personalized feed with live notifications as you send the updates through the day. Teachers also have exact same view of what a parent can see in their mobile app.  History: Its your digital log book. See what updates you or your teachers have sent to the parents so far.  Digital Notice Board: You can now digitally manage your Notice board. You can have notices specific to one or more programs. Archive or Delete it when its no longer relevant.  Parent Communication: Receive and Respond to parent requests from the same app  Calendar: View Birthdays of All Children & Staff and Create/Share Events and Holidays with Parents.   Invoices & Receipts module: Send Fee bills to parents. Parents can pay the bills* from their mobile app and Receipts are auto created on their app itself.  And many more exciting features getting added to the app soon!!!  KRIYO is THE No. 1 Early Education Management Platform, that is committed to continuous improvements and new features.  Preschool, Daycare, Childcare, Creche, Playschool, Education, Parent Communication, Children, Management software, Management app, Management system, Communication app, School communication, Daycare providers, FREE daycare app, FREE childcare app, FREE preschool management app, attendance tracking, Childcare apps for android, Teacher Parent communication app ",
"desc_perms" : "['android.permission.READ_CALENDAR', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}