{
"name" : "Plants Quiz - for botanists",
"url" : "https://play.google.com/store/apps/details?id=com.raru.plantsquiz",
"package" : "com.raru.plantsquiz",
"category" : "Education",
"description" : "Test your knowledge about the plant kingdom.  Recognize the Ruellia, Safflower or a Hechtia in a picture.  More than 5000 plants are waiting to be discovered by the botany expert and plant-lover. Mark your favorites in the slideshow. Use the filter symbol within the titelbar to filter plants either by favorites or by similar ones. Searching for a specific plant is also possible.   Choose the correct plant name out of four choices. Use hint to get further information on the searched plant. Use 50:50 to reduce from four to two choices or take a joker to skip a question.  Learn more about the plants in Wikipedia.  At the end of your knowledge question and answer session you will be evaluated.  Select number of questions in preferences menu. There you can also set filter on a certain plant class. By deactivating the expert mode the questions are a bit easier (but still they are challenging!).  A fast internet connection is required so that the pictures can be streamed smoothly onto your device. You can activate high image resolution within the settings menu. This increases data traffic.  About permissions :  - INTERNET, ACCESS_NETWORK_STATE : used for getting data from wikipedia  There is also a premium version available.  The Biology Quiz  - includes the plant kingdom - includes the animal kingdom (Zoology Quiz) and the fungi kingdom - contains more than 10000 species    Please use the feedback option within the settings in case you have some question, problem or suggestion on the Plants Quiz. We are happy to hear from you.  What are you waiting for. Improve your knowledge with the Plants Quiz. RARU Software ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}