{
"name" : "My First Animals ~ Animal sounds games for babies",
"url" : "https://play.google.com/store/apps/details?id=com.amayasoft.my.first.animals.toddler.games.farm.animal.sounds",
"package" : "com.amayasoft.my.first.animals.toddler.games.farm.animal.sounds",
"category" : "Educational",
"description" : "What will your child learn today? In the app there are 6 different categories: more than 90 kinds of animals, insects, fruits and vegetables.  Kids will encounter the world of nature and learn many new words!   FARM  Meet the lovable residents of the farm  a pink pig, a cuddly goat and a friendly puppy!   SAVANNAH  Go on a journey into the endless savannah. The kingly lion, spotty giraffe, stripy zebra and other animals want to meet you!   FOREST  A brown bear, a gray bunny and a fluffy squirrel are living in the forest together and waiting for you!   GARDEN  Be sure to look around the garden, because creatures are hiding there: a green caterpillar, a gorgeous butterfly, a little ant and many other insects!   FRIDGE  Fruits and vegetables are concealed in the kingdom of ice and cold! Juicy tomato, crispy carrot and sweet apple - find them all!   BONUS GAME  SHOW WHERE?  Choose between the images that the speaker says and watch the fun animations!  Did your child learn all the words? Now learn them in a foreign language!  Press the Language button on the Options screen to try them out: - English - Spanish - German - Russian - Italian  Key features:   More than 90 sounds and animations. Due to the quality speakers voice the child will remember every words. Colorful animation and funny sounds amuse your little one!   Learning in a game form. Bright illustrations and interesting missions will attract the childs attention, helping to develop fine motor skills, memory, attention and perseverance   Easy to control. A user-friendly interface will allow your baby to use the application without help. Purchases and settings are reliably protected from accidental clicks of a curious toddler!   We play offline and with no ads! The game works fine without the Internet! Play at any time and anywhere - on a long journey or in a long queue. And no intrusive advertising!  A few words about us:  Our friendly team AmayaKids has been creating applications for kids for more than 10 years! We consult the best childrens educators, create bright, user-friendly interfaces and develop the best applications for your children!   We love to make kids happy with entertaining games, and also like to read your letters!   Dont forget to rate our app and leave feedback :) ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}