{
"name" : "Cook Donut Maker - Unicorn Food Baking Games",
"url" : "https://play.google.com/store/apps/details?id=com.funpop.android_donut",
"package" : "com.funpop.android_donut",
"category" : "Education",
"description" : "Cook Donut Maker - Unicorn Food Bakery food games for Kids is a fun free baking games.So many sweet unicorn food for girls to make in this amazing donut game. DIY colorful unicorn food&cute cronuts in the sweet baking game. Now baking the cronuts and coloured donuts in our donut games. Become the best sugary unicorn chef with fun Cooking Donut Game- Food Making Game for girls and boys,kids and toddlers.In the donut game,little kids can cook kinds of colorful sweet donuts!Build your own bakery empire in this baking game.Unicorn rainbow donuts with colorful wings bring children like in the fairy tale;Cute pet donuts include yellow duck donut,black white cow donut,pink pig donut,lovely panda donut and so on;Also festival donut is very popular among girls and boys,so you can make Christmas donuts in this free girl games to design as Santa,deer,and any other Christmas decorations! Wanna to be a best little chef as donut maker?Be the donuts maker and play the baking doughnuts for kids right now. Now start the fun kitchen food maker game and baking games now.   Bakery Food Games Features:  1.Look! Donut dush!A super fun cronuts bakery stands here!The donut shop sells sweet unicorn food,coloured donuts and even Christmas donut!Such a sweet maker game and bakery food games.  2. Wow, donut tap.Little unicorn chef in baking games. Go crazy with cooking unicorn food first!Add some rainbow color to the food mixing batter for good donuts in our bakery games. That is the best creative games for kids.  3.Be the best chef n our baking game!Donut dush!Unicorn food baking time!Learn baking doughnuts with the glitter rainbow unicorn decorated oven for children. You are the best sugary chef! Now make cakes and bake a cake, donut in kitchen game for girls&boys! 4.Donut dush!See what a colored donut you have cooked!Make it a trendy unicorn rainbow donut right now!Add glitter horns,colorful sprinkles,colorful candies,fun faces,sparkly wings, sweet cream on it.The good donuts look so beautiful! Now eat cakes and donuts! 5.Be the sugary chef,DIY donut sounds exciting!I want puppy donut,cat donut ,bunny donut,pig donut....lots of unicorn donuts in making games kids.  6.Baking doughnuts and bake cakes now!Roll donut dough for making food like pet donuts.Then cut the doughnut to fry in the grease.Wow!You cook the best donut food in the cake baker and baking games for girls.  7.Jingle bell,Santa,Reindeer,Christmas Stockings,Christmas tree,and piles of colorful Christmas surprise gift boxes over there show that we will make Christmas donut in this cake bakery games.  8.Donut shop is open.The best Christmas gift would be your DIY Christmas donut! You will be the best sweet maker in the christmas game for girls. 9.The smell of tasty donuts,the beautiful colors of designs, all the sweet donuts that you made, take your first bite for the unicorn kid in our baking game.  10.Time to let your colorful imagination run wild when you make and decorate the finest donut around the cake making games.  11.Try strawberry frosting with sprinkles and colorful candy or maple with chocolate.You will learn lots of dessert making in the food make game with lots of fun . 12.Play this baking game&make cakes and share with your friends and family. 13. Best Childrens games and chef food maker ever and play free children games now.  There so many unicorn food for girls.It is so much fun to make sweet and good donuts in the donut game. Download this cronuts game and baking doughnuts games for girls TODAY!   ABOUT FunPop  FunPop are specialize in kids games on mobile platform. We are aiming to provide innovative & educational game for the whole family. We help them to learn the basic life skills and good habits through our games.  Visit us:http://www.funpop.com.cn Watch us: https://www.youtube.com/c/FunPopMedia  CONTACT US Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@funpop.com.cn ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.funpop.android_donut.permission.C2D_MESSAGE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}