{
"name" : "Ben and Bella - Games",
"url" : "https://play.google.com/store/apps/details?id=com.witsindia.benandbellaatzoo",
"package" : "com.witsindia.benandbellaatzoo",
"category" : "Education",
"description" : "Developed to be played on the iPhone and iPad, this entertaining app encourages children aged 3 to 7 to discover English and expand their language-learning skills. Approved by teachers, parents and youngsters alike, the app focuses on ease of use. Children are plunged into a complete English-language environment that is lively, varied and  above all  fun.   With this app, your childs knowledge is boosted by  - learning the English names for many different animals, objects and colors - learning to read numbers and count to 10 - learning about size, distance, patterns and grouping - learning about concepts such as smallbig, nearfar and odd one out - enhancing problem-solving skills - improving fine motor skills  Features and advantages:  - a full English voice-over - an interface that preschoolers will find simple and intuitive - a read-aloud function that helps in pronunciation of words and numbers - colorful high-resolution artwork and lively music - interactive stickers that allow children to create their own scenes, which can be shared with friends via social media - a reward screen showing a childs achievement and motivating him/her to perform better  The app features 10 different games, each of which can be played with 6 different groups of words:   Find the Object: After hearing their names, children must find the right objects or animals. This game teaches English words while encouraging concentration and correct pronunciation.   Matching Pairs: Search among the hidden objects or animals and find the matching pairs. This game teaches English words and the concept of grouping, while training childrens memory.   Find the Color: Pick the right color on a multi-colored animal or object. While teaching the names of colors, this game encourages children to listen and look carefully.   Pick the Odd One Out: Find the odd animal or object in the group. Children must concentrate in order to distinguish one from the others.   Find the Biggest/Smallest: Children must identify the biggest or smallest among groups of animals or objects. This game teaches vocabulary and trains children to focus.   Count the Number: This games read-aloud function allows children to count the number of animals or objects, enhancing their number learning and counting skills.   Find the Farthest/Nearest: Children must identify farthest or nearest among groups of similar animals or objects. This game teaches word names and how to distinguish distances.   Complete the word - Drag the correct letter to complete the word by looking at the object. This games teaches to learn spelling of objects.    Match the Objects with their names - Drag and drop the names against the correct object. This game teaches object recognition from each other.    Choose the Objects highlighted - Pick the correct object whose names are highlighted in blue color. This game teaches object identification by reading the correct letter.   Engaging, entertaining and easy to understand, the Ben & Bella  Games app enhances young childrens English learning while they are having fun. Dont let your child miss out! ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.GET_ACCOUNTS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.group.STORAGE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.witsindia.benandbellaatzoo.permission.C2D_MESSAGE', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_INTERNAL_STORAGE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.group.STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING']",
}