{
"name" : "Coloring Book For Kids",
"url" : "https://play.google.com/store/apps/details?id=com.Papumba.KidsColoringWorld",
"package" : "com.Papumba.KidsColoringWorld",
"category" : "Education",
"description" : " FEATURES - Get ready to have fun coloring the farm completely free of charge! A single purchase within the app unlocks six other amazing worlds, including the beach, the city, the amusement park, the house, the museum and the fantasy land. - Five completely free coloring tools: crayons, paint brushes, sprays, sparkles and patterns... It has more coloring tools than any other app in the world! - We care a lot about your childs well-being, which is why the gaming experience includes no pressure, time limits, limited attempts, or ads. - Available in 15 languages, including English (USA) and English (UK). - Find out what your child has colored in the parents section, where you can view their usage statistics and their entire collection of drawings. - Constant updates with new improvements.  Seven fascinating worlds with hilarious characters are waiting to be discovered by your children and become their best companion. Every childs fantasy of having their drawings come to life has finally become a reality.  Developed with the help of early childhood education specialists, this game is ideal for helping children from 2 to 6 years old cognitively develop their creativity and imagination, as well as their fine and gross motor skills.   Completely safe for children of all ages, this app will become the favorite activity of the youngest members of your household, as well as the adults!  In addition, there is a section designed to allow parents see all of the colored drawings, as well as other surprises based on suggestions that parents have sent us from our previous apps.  If you have an idea to make Coloring Book For Kids a better app, please contact us. All ideas and suggestions are welcome!  Our website: www.papumba.com Email: info@papumba.com Download it now for free and enjoy a super fun coloring experience! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}