{
"name" : "AULA esemtia",
"url" : "https://play.google.com/store/apps/details?id=com.esemtia.eprofesores",
"package" : "com.esemtia.eprofesores",
"category" : "Education",
"description" : "esemtia Aula 3.0  Nueva versin esemtia Aula 3.0: ya puede realizar desde su dispositivo mvil las principales funciones de su gestin acadmica diaria.   Con esemtia Aula 3.0 tendr conexin directa a la informacin de edu. Con acceso fcil e intuitivo, le ofrece informacin en tiempo real, actualizada y de gran utilidad para la comunicacin con todos sus contactos y la gestin acadmica y pedaggica.  *PRINCIPALES FUNCIONALIDADES EN Aula 3.0  -Introduzca calificaciones. Ya puede crear criterios y pruebas desde esemtia Aula para su posterior evaluacin. Tambin puede aadir observaciones a las calificaciones.  -Asigne tareas a los alumnos (seguimiento por profesor). Notificaciones en pantalla de inicio para realizar el seguimiento de las tareas pendiente de entrega.  -Pase lista desde la pantalla de inicio.  - Acepte o rechace de la justificacin de faltas de los alumnos de los que es tutor.  -Reciba notificaciones PUSH, ya no habr que conectarse a la aplicacin para comprobar si tenemos nueva informacin (al recibir un mensaje, justificar una falta por parte de un familiar, etc.)  - Aadida funcionalidad para aadir o sustituir en el seguimiento de infantil. - Aadida funcionalidad para modificar el usuarios y contrasea desde la aplicacin. - Aadido soporte para guardar usuario y contrasea al iniciar sesin.  - Aadido multi-idioma: Ingls, poco a poco iremos aadiendo mas idiomas. - Mejoras en la mensajera. - Renovacin esttica y mejoras notables en el rendimiento de la aplicacin.  IMPORTANTE: Para poder utilizar esta aplicacin mvil es necesario que su centro escolar utilice edu de esemtia como plataforma de gestin escolar.  Ya utiliza edu en su gestin diaria?  S, soy usuario de edu. En este caso, puede acceder a la aplicacin esemtia Aula 3.0 a travs de las claves de usuario y la contrasea con las que accede desde su ordenador habitual.  NO soy usuario de edu. Si su centro escolar no utiliza todava edu de esemtia como plataforma para la gestin escolar, puede recomendarla ponindose en contacto con nosotros a travs del siguiente mail info@esemtia.com o bien visitando la pgina del desarrollador. esemtia Classroom 3.0  Classroom esemtia new version 3.0: now you can do from your mobile devices main functions of their everyday academic management.  With esemtia Hall 3.0 will have direct access to information edu. With easy and intuitive access, it provides information in real time, date and useful for communicating with your contacts and academic and pedagogical management.  * KEY FEATURES IN Classroom 3.0  -Enter Qualifications. You can now create and test criteria from esemtia Hall for further evaluation. You can also add comments to the ratings.  -Asigne Students tasks (tracking teacher). Home screen notifications to track the pending delivery tasks.  Come in list from home screen.  - Accept or reject the justification of absences of students who is guardian.  -Reciba PUSH notifications, you should not have to connect to the application to see if we have new information (when receiving a message, justify a failure by a family member, etc.)  - Added functionality to add or replace in monitoring child. - Added functionality to change the password from the user and application. - Added support for saving username and password to login. - Added multi-language: English, we will gradually adding more languages. - Improved messaging. - Facelift and significant improvements in application performance.  IMPORTANT: To use this mobile application is necessary for your school edu esemtia use as a platform for school management.  Do you already use in their daily management edu?  YES, Im using edu. In this case, you can access the application esemtia Hall 3.0 through keys and password with which to access from your regular computer.  Im not user edu. If your school does not use yet esemtia edu as a platform for school management, you may recommend contacting us through the following mail info@esemtia.com or by visiting the developer. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.esemtia.eprofesores.permission.UA_DATA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.esemtia.eprofesores.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.esemtia.eprofesores.permission.UA_DATA', 'android.permission.ACCESS_FINE_LOCATION']",
}