{
"name" : "Car Patrol Hide & Seek: Preschool Animals Safari",
"url" : "https://play.google.com/store/apps/details?id=com.minimango.games.hideseek.animals",
"package" : "com.minimango.games.hideseek.animals",
"category" : "Educational",
"description" : "Look over there behind the bush! Is it a horse or a zebra? Perfect for kids aged 2 to 5, investigate alongside the Car Patrol and learn about the animals living right next door or in remote jungles. Discover the worlds wildlife from the biggest and tallest giants to the tiniest of tiny creatures!   A fun journey for kids to discover the natural world and animals: full of fun surprises, travel all over the world from France to China to find out what cute and furtive animals are hidden in the bamboo jungles, torrential rivers, sandy dunes, moonlit nights, frozen icebergs and busy cities!  FEATURES: - Find and play with 130+ animals  - Travel to 12 interactive environments  - Packed with amusing surprises!  - Difficulty adapted to young children  - Fun sounds and animations  - For ages 3 and up  - NO ADS  To the parents: we want to make sure once your kids enter the app, it is only to encounter fun & happiness. Accordingly, we require a parental code for any in-app purchase or external link. You can also purchase the apps full version to access all the games and exclude any in-app purchase redirection.   Mini Mango is a French app developing company devoted to create fun and interactive games specially designed for toddlers and preschoolers. We encourage kindness, autonomous exploration and experimentation. We would love to hear from you! Do not hesitate to contact us, follow us on Facebook at @MiniMangoApps or leave us a review - if you feel like it :) ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_COURSE_LOCATION']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}