{
"name" : "Awoken - Lucid Dreaming Tool",
"url" : "https://play.google.com/store/apps/details?id=com.lucid_dreaming.awoken",
"package" : "com.lucid_dreaming.awoken",
"category" : "Education",
"description" : "Do you want to learn Lucid Dreaming and understand your dreams better? Awoken is the tool to do that.  FEATURES:  - Dream Journal with optional pin-protection: Have a silent notification ready each morning to start recollecting your dream. Keep your journal entries in a searchable list and protect your dreams if needed.  - Reality Checking: Reminders to analyze your surroundings, so you can learn to check if you are dreaming.   - Dream Clues: low audio cues that can trigger your lucid dreaming by playing a special Totem Sound you choose.  - Cloud backup of your dreams! Create an optional cloud account to backup your dreams if you want to.  - Dream Patterns: The most common words and themes from your journal can be viewed in a list so you can analyze your dreams better.  - Pausing your training: Learning lucid dreaming takes some time. Sometimes you want to pause your training for just a few days.  - Oneironaut Achievements: An explorer of dream worlds is called an Oneironaut. Follow you progress and keep track of your stats.  - Dark theme across the whole app is now available as a premium feature.  - Continuous Speech-To-Text in the dream journal, for when youre just awake enough to start collecting your subconscious adventure, but not awake enough to want to use the keyboard.   ----  Lucid dreaming is learning to know you are dreaming, while you are dreaming. Becoming aware that you are dreaming allows you to shape, influence and direct your dreams with clarity, instead of being uncritically controlled by them. This app will train you to achieve lucidity in your dreams and understand them better by revealing their patterns.  When you are aware of being in a dream, you can also learn to master experiences that arent possible in waking reality. You can fly, breathe under water or whatever else you put your mind to. With the sensations as real as in waking life. Your mind is the only limit.  It is reported that lucid dreaming can also help to overcome nightmares, be used to rehearse success for real life scenarios and be used train creativity.  Become awoken - Start dreaming for real!  ----  SECONDARY DESCRIPTION:  Awoken is a lucid dreaming guide with a free dream diary, cloud sync, lucid dreaming info and techniques to achieve clear dreams. It can help you master lucid dreaming, achieve lucidity, and act as a trainer and helper. When you wake up, the app can have a silent notification ready, so you can write down your dream. Theres an optional dream cloud module, that can sync your dream entries to Googles app engine. Dream back up can be useful if you loose your device .Theres also a premium feature dream pattern analyzer.You can also protect our journal with password in the form of a pin. The dream analyzer takes the words and hashtags from your journal/diary and gathers them in an nice overview. So you can explore your dream patterns and dream themes better.  ----  PERMISSIONS EXPLAINED:  android.permission.ACCESS_NETWORK_STATE: to determine synchronizations if you have cloud backup activated.  android.permission.GET_ACCOUNTS: When you choose cloud backup, you must choose an account to attach it to.   android.permission.READ_EXTERNAL_STORAGE: A requirement to use Googles backend cloud system. No personal information is being gathered or saved on the external storage.  android.permission.READ_PHONE_STATE: A requirement to use Googles backend cloud system. No personal device-information is being gathered or saved.  android.permission.RECEIVE_BOOT_COMPLETED: For resetting reality checks and such on a restart.  android.permission.RECORD_AUDIO: Only used for speech-to-text in the dream journal if/when the user activates it.  android.permission.USE_CREDENTIALS: A requirement to use Googles backend cloud system.  android.permission.WRITE_EXTERNAL_STORAGE: A requirement to use Googles backend cloud system. No personal information is being gathered or saved here.  com.android.vending.BILLING: To upgrade to premium version. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'android.permission.USE_CREDENTIALS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.GET_ACCOUNTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO']",
}