{
"name" : "Learn Spanish words free with uLexicon",
"url" : "https://play.google.com/store/apps/details?id=com.LostByteGames.uLexicon",
"package" : "com.LostByteGames.uLexicon",
"category" : "Education",
"description" : "uLexicon is a convenient and effective Spanish self-teaching guide. Balanced sets of Spanish words arranged according to the frequency of use can help you to enrich your Spanish vocabulary, as well as to improve your listening comprehension of the Spanish language. The most common and popular Spanish words studied at the initial levels of the application will allow to make quick visible progress in learning Spanish.  Why Spanish?  Spanish is the third most common language of communication in the world. Learning Spanish will open up a vast world of literature, theatre, music and cinema, help you to communicate directly with people in Spanish-speaking countries while traveling. Many Spanish words are familiar and clear even to those who do not speak Spanish.  How to learn Spanish?  If you decide to learn Spanish, first of all you need to enlarge your vocabulary, because Spanish words are the basis of knowledge of the Spanish language. Memorizing Spanish words is the main exercise throughout the entire period of learning the language. The more words you learn, the better you understand Spanish, read Spanish texts, speak.  Which Spanish words to learn?  There are more than two hundred thousand words in the Spanish language, but most people use a few thousand at best. These most common and popular Spanish words must be learnt.  How to learn Spanish words?  The key to effective learning of Spanish words is a bunch of methods of memorizing and repeating learnt words. In order to remember new words quickly, it is recommended to alternate written and oral tasks. Repetition of the studied words is necessary for transferring the gained knowledge into the long-term memory. The best results, according to Ebbinghaus, are achieved by repeating the studied words in increasing periods of time.  How does uLexicon teach?  The application has an extensive vocabulary created on the basis of the frequency dictionary of the Spanish language - a set of words sorted by frequency of use in speech, where the most common and popular Spanish words are located at the top of the list. For convenience of study the entire vocabulary is divided into groups of words (levels) balanced by the number of parts of speech. The teaching process consists of several stages: 1. At the familiarization stage you are suggested to read new Spanish words, listen to the pronunciation and remember the translation. Familiarization with new words is automatic and resembles video and audio lessons for Spanish words learning. 2. At the learning stage, it is suggested to choose the correct translation of a Spanish word among several possible options. The application stores answers for each learnt word and generates the necessary sequence and frequency of occurrence of words in the learning. As you study words, Spanish word listening comprehension exercises are added. There is an opportunity in the application to perform only oral exercises (Comprehension mode) to learn spoken Spanish. Separate progress indicators for reading (orange) and listening (blue) help to control the process of Spanish word learning better. 3. In the course of time the application gradually reduces the achieved results of study, reminding to repeat learned Spanish words. The rate of reduction depends on the time and results of previous repetitions of words and decreases as the learned Spanish words become fixed in the long-term memory. This mechanism forms a repetition stage consisting of 5 intervals of repetition of the studied words - in 3 days, a week, a month, 3 months, half a year.  uLexicon learning modes: 1. Familiarization - listen and memorize. 2. Learning - the main mode of learning Spanish words, includes reading and listening. 3. Comprehension - Spanish word listening comprehension exercises.  uLexicon features: - No Ads! - Works without Internet. - Customizable interface (Color scheme, font size).  Start learning Spanish words with uLexicon right now! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}