{
"name" : "Happy Daycare Stories - School playhouse baby care",
"url" : "https://play.google.com/store/apps/details?id=com.playtoddlers.happydaycarestories.free",
"package" : "com.playtoddlers.happydaycarestories.free",
"category" : "Education",
"description" : "You are in charge of this daycare, a small and fully interactive world where everyone is welcomed and the only rule is to use your imagination to create amazing stories. Explore 7 different rooms, with tons of toys and thousands of different interactions, and play with 5 playful characters .  CREATE YOUR OWN STORIES!  Let your imagination fly exploring and playing with the daycare center, where every room is an adventure itself. Prepare delicious meals in the kitchen, create a musical band, put the children to bed, or bathe them after a hard day of play. In this daycare, you decide!  EXPLORE THE DAYCARE!  With tons of toys, different objects and thousands of possible interactions. Water the plants, mix ingredients from the fridge into the pot, or throw toys into the bathtub. You will find surprises everywhere!  DISCOVER AND PLAY FREELY!  Discover all the different rooms, full of surprises and hidden treasures. Remember, there are no rules so dont be afraid to interact with anything!   FEATURES  + Explore and play in 7 different rooms full of activities. + You will be in charge of 5 charming children eager to play. + Lots of toys and objects, and thousands of possible interactions. + Without rules and goals, just fun to create your own stories. + Kid safe environment for children aged 2 to 8, no third party ads.  Specifically designed to be played by children from 2 years of age, but detailed enough to captivate and amuse children up to 8 years. Happy Daycare Stories will foster their imagination and creativity, and will keep them fascinated for hours for less than the price of a cup of coffee.  The free trial includes 3 rooms so you can test the endless possibilities of this game. Once you are sure, you can buy the full version through a single purchase within the application, which will unlock the 7 rooms forever.   About PlayToddlers  PlayToddlers games encompass different areas of toddlers personal growth, and have been specifically designed to be used by babies, with a simple and attractive interface that allows them to use the application by themselves, improving their development and self-esteem. ",
"desc_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}