{
"name" : "English Indonesian Translator",
"url" : "https://play.google.com/store/apps/details?id=com.bktranslator.enlishindonesian",
"package" : "com.bktranslator.enlishindonesian",
"category" : "Education",
"description" : "This application can not only translate English to Indonesian but also convert Indonesian into English with very high accuracy at high speed. In addition, its user-friendly interface makes it an easy-to-use translation app. English Indonesian translator app is the number-one tool that users can use to stranslate words, sentences, text and theirs voice. It is widely-used in many fields such as daily communication, study, tourism, labour export.  As the app applies cloud computing and artificial intelligence, the performance of translating process is improved in terms of accuracy as well as the softwares capacity is reduced.  Outstanding characteristics of English Indonesian Translator app   THE ABILITY TO TRANSLATE WORDS , SENTENTCES AND TEXTS  With this app, users can easily look up words like traditional dictionaries. Besides, people can translate a sentence, or even a whole paragraph within a very short time. This feature will definitely help users a lot interpreting materials which are written in English; for example: email, product instruction,....   HIGH ACCURACY  We are continually seeking and applying the lastest technologies with a view to enhancing our apps translation accuracy as much as possible.   THE ABILITY TO TRANSLATE VOICE, IMAGES AND DRAWINGS  The application is also able to understand spoken language, images and handwriting, then translate them into Indonesian.   POPUP TRANSLATION  While surfing the Internet, users can directly translate a text by copying the content of it to clipboard. The app automatically opens a pop-up window showing the converted text while users do not need to switch to translating application.   WORD SPELLING AND PRONUNCIATION  While looking up words, users can also find out how to pronounce them correctly by listening to native speakers.   LOW CAPACITY  The app will take only 2 MB of your storage but still serves full of the needed functions and provides an user-friendly inferface.   FREE OF CHARGE  This application costs nothing to install and it will be always free in the future.  If you like English Indonesian translator app or if you find anything unsatisfied with our product, please write us your comments or contributive ideas for those flaws. Thank you ",
"desc_perms" : "['android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}