{
"name" : "Qeasily My School's Smart Learning App",
"url" : "https://play.google.com/store/apps/details?id=com.app.qeasily",
"package" : "com.app.qeasily",
"category" : "Education",
"description" : "Get and enjoy success with your CBSE, SSC (English, Semi English) Board studies with extremely powerful Smart Study app for Std. 5th-12th. Major Features of App and Website: - Download CBSE, SSC Board Syllabus Aligned content once and use it to forever*.  Study in offline mode after downloading content - Covers Major CBSE, SSC Subjects of Math, Science And Social Science for Grades 6th to 10th - Website + Android App with 200+ Features where students can do CBSE, SSC Smart Learning Anytime, Anywhere and on Any Device - For CBSE, our study material confirms to NCERT books & offers NCERT Solutions as well. - Easy to Learn & Tough to Forget Audio, Video, Graphics, Images, Text Content For Complete Learning Experience - Extremely Clean And User-friendly Interface Without Clutter Of Marketing Garbage - Single Package That Provides Unlimited Access To All Content Across Website + Android App - No Advertisements, No Gimmicks  - Safe For Children - Designed And Developed By Global Team  Qeasily.com gives you comprehensive curriculum aligned chapterwise best study material in various learning sections of- - Study Material with rich multimedia content - Activities & Experiments - Practice Flashcards - Summary Notes - Textbook Solutions - Multiple Chapter Tests/Quizzes - Hot Questions for Mathematics - Long Answer Questions - eTextBook - SSC Board Solved Question Paper  In addition, with Qeasily.com you can - Generate Your Own Quizzes and Test Series for Unlimited Practice to Perfection - Prepare Study Planner - Take Study Notes - Ask an Expert to get your answered your queries or questions - Provide Feedback  Qeasily.com comes with QFunny, complete homework help & exam prep with sample papers, revision notes & more.  Currently Qeasily.com has curriculum aligned study material for Classes 5-10 for subjects of Science, Maths, Social Science, Economics, History, Geography, Political Science, Civics. Other Language Art subjects of English, Hindi, Marathi, Sanskrit are in making and will be available FREE to any already existing student at no-extra cost.  Separately Qeasily.com has Class Management Solution for SmartClassroom. It allows Schools, Class Owners, Teachers, Tutors to- - have SMS and email based Student-Parent Communication - Generate Your Own TEST SERIES from Our Vast Curated Question Bank with Model Answers - Record and Communicate Attendance to Parents - Create or Integrate with Your Website - Communicate Homework/Assignments along with completion/grading to Parents - Prepare and Send SMS based Report Card as needed - Send Notices and Timetable through Notice Board, Class and Institution Planner + Calendar - Manage Your Institute Structure in Branches, Batches, Classes etc.  About Brixellent- We are Digital India inspired StartUp focused on providing Best Possible Digital Learning to Everyone at Most AFFORDABLE PRICE with exceptional n unbelievable features. We are Global Team spread across continents of Kids, Toddlers, Teenagers, Parents, Students, Principals, Professors, Management Consultants, Technocrats, Developers, Designers, Education Consultants, Class Owners, School Admins & Trustees; all working towards one goal of providing Best Possible Digital Learning to Everyone at Most Affordable Price. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.CALL_PHONE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.app.qeasily.permission.C2D_MESSAGE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.SEND_SMS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.READ_PHONE_STATE']",
}