{
"name" : "Learn Colors for Toddlers - Educational Kids Game!",
"url" : "https://play.google.com/store/apps/details?id=com.oki.colorsnew",
"package" : "com.oki.colorsnew",
"category" : "Educational",
"description" : "Learning Colours is one of the best educational games for kids. In which your children play and acquainted with eleven colors. Also, they do interesting tasks: memory and matching colors, paint coloring sheets. Color splash is a cool game for little boys and girls from 2 to 5 years old. Why download our funny painting games: 1) Your kid learns 11 colors - red, yellow, blue, green, orange, purple (or violet), brown, pink, black, white, gray while playing the coloring apps; 2) Learning colors is available in 20 languages such as English, Spanish, Russian and many others. Its really cool that your baby can learn, pronounce, writer color names in so many languages! 3) Playing interesting baby games your preschooler gets acquainted with many new items and words. Learning games broaden your babys horizon and enrich his vocabulary; 4) Our kids games consist of 4 levels. The first stage is remembering colors. The second and third stages are 2 funny games to fix the received knowledge. The fourth stage is interesting games to apply the knowledge of colors for toddlers 5) Coloring books are one of the most favorite occupations so we added color sheets with 10 bright pictures. This fun game will be interesting for both little boys and girls 2, 3, 4, 5 age; 6) You can download painting games free. It will save your family budget without compromising quality. Apps with learning colors are an excellent way to entertain and educate your children.  There are often troubles identifying and naming colors for toddlers. These learning baby games allow preschoolers memory colors and also match them with different objects. If you are looking for drawing games for kindergarten boys and girls then download our funny interesting game. Cool games like matching colours will be very useful as preschool activities!  Such learning apps like drawing games can be recommended as preparation for school. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}