{
"name" : "Minglings",
"url" : "https://play.google.com/store/apps/details?id=com.playshifu.minglings",
"package" : "com.playshifu.minglings",
"category" : "Educational",
"description" : " Shifu Minglings   Minglings are cute, minglings are naughty, but we ensure they will be your childs best pals! Wooden figurines reimagined through Augmented Reality - mix-match and create new Minglings and bring them alive with the app. Hours of endless fun!  To cultivate your childs versatility, Minglings is what you need. Foster skills like innovation, original thinking, and unrestrictive imagination through its entertaining gameplay at every step.  Check out www.playshifu.com to get your own Minglings and other Shifu games.     Fun learning   Shifu Minglings is all about making your child smarter, better and sharper as he learns how to memorize, teach, create and play in the Mingling universe.   Zone 1: Create new Mingling monsters and name them  Zone 2: Give them superpowers or jazz them up with cool accessories  Zone 3: Feed your buddies at the arenas favorite eating spot   Zone 4: Mischievous Minglings love to play with you  Zone 5: Use your intelligence and memory to solve some puzzles  No 3rd party advertising. No bluetooth required!     Holistic Intelligence    Improves coordination and gross motor skills  Fosters balance between positive and emotional intelligence   Boosts creative awareness and reasoning  Increases literacy competence  Encourages analytical and critical thinking     How It Works    Download the Minglings app   Login to personalize  Sync the variant you purchased (Monsters or Animals)  Mix-match and create new Minglings  Scan your creation and bring it alive  Learn, play and have loads of fun     About Team Shifu  We are a passionate team of parents, early learning experts, storytellers and technologists that fit together like puzzle pieces. Our aim is to make every experience exciting and meaningful for kids, and we strive to give the best!     Contact us  Your feedback is very important to us. If you have any questions, comments, feedback or need any help, please contact us at reachout@playshifu.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
}