{
"name" : "Badam Singh Classes",
"url" : "https://play.google.com/store/apps/details?id=com.badamsinghclasses",
"package" : "com.badamsinghclasses",
"category" : "Education",
"description" : "Badam Singh Classes is a most popular institute and Top Potential Training Institute for SSC/ Banking/ Railway exams in India. Badam Singh Classes aims to develop amongst its students a competitive attitude along with sound academic base with quality teaching and individual attention as its hallmark. Today we are an established and leading institute which is continuously guiding the students to achieve their goals. Our Faculties have created a Splendid Study Material which shall facilitate students to study the Course Content of all Competitive Exams in a easy way and shall enable them to score good marks. Our renowned faculties are best in class and have yielded great results. We have a zest to provide best in class education and to create a concrete base for students to develop their knowledge in a skillful manner and ensure their success. At Badam Singh Classes, we focus on building a strong foundation of knowledge and concepts in students for their success and provide an excellent platform for the preparation of competitive exams. The best academic support and personal care which we provide to the students helps them meet their career goals and objectives. Our highly qualified and most experienced faculties are dedicated and committed to students overall success. Regardless of your background, Badam Singh Classes provides a strong platform in preparation. Our focus is on developing in each student a strong academic foundation, critical problem solving ability, and providing competitive environment. To our students, we impart value-based career education, abundant resources, and individual attention. Apart from being just a coaching centre, Badam Singh Classes also focuses on the all round development of the students through expert guidance and unmatched study materials.  App Features List: -User can download all Tests onto mobile phones. -Internet connection is not needed, after test download. -Application also has Current Affairs in Hindi and English as well. -Application will work online as well as offline after downloading the tests. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.badamsinghclasses.permission.RECEIVE_ADM_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.badamsinghclasses.permission.C2D_MESSAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.amazon.device.messaging.permission.RECEIVE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.badamsinghclasses.permission.RECEIVE_ADM_MESSAGE']",
}