{
"name" : "Magnus Alumini",
"url" : "https://play.google.com/store/apps/details?id=com.magnus.android.occa",
"package" : "com.magnus.android.occa",
"category" : "Education",
"description" : "The 6th Regiment Massachusetts Volunteer Militia was a peacetime infantry regiment that was activated by the Union army in the American Civil War. On April 19, 1861, the regiment was on its way to Washington, D.C. in response to President Abraham Lincolns initial call for troops when it was attacked by a crowd in Baltimore, Maryland, during the Baltimore Riot. Private Luther C. Ladd of the 6th Massachusetts was wounded and later died, becoming the wars first Union soldier to be killed in action. April 19 was the anniversary of the battles of Lexington and Concord, which began the American Revolution in 1775, and the men of the 6th Massachusetts (some of whom were descended from soldiers of that war) were often called the Minutemen of 61. After proceeding to Washington, the regiment returned to Baltimore to guard locations within the city as well as the Baltimore and Ohio Railroad station at Elkridge, Maryland. In April and May 1863, the regiment saw action near Suffolk, Virginia, in the Siege of Suffolk and the Battle of Carrsville. (Full article...) ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}