{
"name" : "English Listening Training with Videos: RedKiwi",
"url" : "https://play.google.com/store/apps/details?id=com.hayanmind.mimiking",
"package" : "com.hayanmind.mimiking",
"category" : "Education",
"description" : "RedKiwi is specialized in English Listening! Youre supposed to Listen then Talk  1. Learn with the favorite video of your choice!  Choose learning videos that perfectly suit you! Enjoy studying YouTube videos with RedKiwi! You cant resist learning English with these fun videos! (RedKiwi tips: You can even request a YouTube video to RedKiwi.)  2. Improve your LC skills with our Listening Quiz  Ever find yourself staring blankly at the screen while studying English? That wont be the case with RedKiwi! Complete the sentence by tapping the words and listening repetitively With constant practice, youll enhance your listening skills! Listening is the key to conversations!  3. Enjoy learning English with videos with the right difficulty  Dont you hate it when youre trying to learn English and cant understand a thing? That wont be the case learning with RedKiwi, as we sort the videos into 3 difficulty levels New to English? Dont worry! RedKiwi covers everyone from beginners to experts!  4. RedKiwi is your personal English teacher! Learn more with the RedKiwi Q&A  Got a question while watching the video? Feel free to ask. Our RedKiwi English experts will do their best to answer your question! Well give you an extra insight into the culture, expressions, and vocabulary through our response. RedKiwi  will be your personal English tutor!  How to make the bestof RedKiwi   - Business English: Learn words and phrases that you might need to use often in the office. (How to read charts, discussing business, etc)  - Travel English: Before you travel abroad, you should at least memorize these words and phrases! Learn how to check your reservation, ask for directions, check-in to your flight, and more with RedKiwi.  - Daily English: Are you going as an exchange student? Or on a working holiday? Or to study abroad? So you dont panic in your new environment, lets study English words and phrases you can use in daily conversations and prepare for living abroad.  - English for children:  We have content set to the eye-level of children as well. It will help not only children but also English beginners to have fun while learning English.  - Preparing for an English test?: To ace your English speaking test you will need to be able to speak fluently about a specific subject. By studying with all the diverse content we have on RedKiwi, youll be sure to think of the perfect subject to talk about on the test! Find expressions you can use on your test and save them, so you can review them later.  Who should download RedKiwi?  - People who want to geek out while learning English - People who want to learn with English dramas, movies, interviews, and Pop songs (lyrics) but are too lazy to look them up. - People who dont get along with Grammar and Voca books - People who want to learn English during their free time - People who dream of watching YouTube without translation or subtitles  Please let us know if you are experiencing inconvenience or have a feature  ==================================  Privacy Policy: https://goo.gl/c2BNx6 Terms of Service: https://goo.gl/v9FPgB Release Note(Update letter): http://bit.ly/redkiwi-app-release-note-en ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'android.permission.BLUETOOTH', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}