{
"name" : "Earthquake Safety Tips 2",
"url" : "https://play.google.com/store/apps/details?id=com.sinyee.babybus.earthquakeII",
"package" : "com.sinyee.babybus.earthquakeII",
"category" : "Educational",
"description" : "Search for BabyBus for even more free panda games for you to try!   What if our houses were destroyed by a natural disaster. What should we do? Park, gym, plaza, hospital...Which one can be a safe shelter? Download Earthquake Safety Tips 2, learn how to stay safe in a natural disaster with baby panda! Use safety tips to find a safe shelter, build evacuation facilities, purify contaminated water, extinguish a fire and more! By doing so, you can learn what you need to know emergency evacuation.  A fun and practical emergency evacuation game: 1. Plug the air pump into the tent inlet and blow the air inside to install the tent. 2. Unscrew a manhole and set up an emergency toilet. 3. The emergency supply truck has come. Please organize the supplies! 4. Time to distribute the supplies! Queue people up and give them the supplies they need. 5. Set up an X-ray scanner and defibrillator, and sort out a first-aid kit. Lets build an emergency medical treatment center for animals who got injured in earthquake! 6. Turn on the machine switch and do a water quality inspection. 7. Urgent! The water quality is unacceptable! Filter out the germs and dirt in the water. 8. Oh no! There is a fire in the warehouse. We need to move the water pipe to extinguish the fire! 9. When you are separated from their families, dont worry, ask for help at an emergency control center!  What to do when a natural disaster happens - earthquake safety tips for kids: 1. Follow the sign to find the nearest emergency shelter! 2. When you arrive at the shelter, show your ID and register. 3. Remember the key features of your family members appearances and their cell phone numbers. 4. You shouldnt eat or drink any contaminated food or water.  Features: 1. Learn how to evacuate from a dangerous place safely. 2. Learn the signs of emergency evacuation. 3. Restore disaster-affected areas. 4. Real themes for kids to experience, simple games for kids to operate, neat scenes and more!  About BabyBus  At BabyBus, we dedicate ourselves to sparking kids creativity, imagination and curiosity,and designing our products through the kids perspective to help them explore the world on their own.   Now BabyBus offers a wide variety of products, videos and other educational content for over 250 million fans from ages 0-8 around the world! We have produced more than 150 childrens educational games, 700 childrens songs, and animations of various themes spanning the arts, health, and science.   Contact us: ser@babybus.com Visit us: http://www.babybus.com ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}