{
"name" : "Zoo Bubble Pop",
"url" : "https://play.google.com/store/apps/details?id=com.chronoglyphinteractive.zoobubblepop",
"package" : "com.chronoglyphinteractive.zoobubblepop",
"category" : "Educational",
"description" : "Zoo Bubble Pop is an entertainment and educational compendium of activities to teach and keep your toddlers and young children happy while learning.  Activities allow them to have fun hearing animal sounds and learning their names. Dinosaurs have recently been added to add a bit of prehistoric fun into the mix.  All the different activities on offer look to reinforce learning in different ways. From helping with hand eye coordination, memory training, learning common colors, letter, and numbers, reactions, and having fun with sounds.  Many different animals are here for your child to explore, dogs, cats, chicks, elephants, and many more.  When your child looks away; take a stab at Minute Pop and challenge your other half to a Pop-Off!  Activities:  Casual Pop, pop bubbles to free the animals and hear their sounds.  Dinosaur Pop, pop bubbles to free dinosaurs and make them roar.  Find the Animal, pop the named animal (voice and text supported to aid learning)  Minute Pop, a frantic game of popping as many bubbles as you can to earn a high score. Remember to just try and pop the green bubbles!  Pop An Animal, select your favourite animal and go on a popping frenzy!  Colors pop, helps teach a variety of common colors.  Shapes pop, helps teach a variety of common shapes, Circle, Square, Triangle, Diamond...  Numbers pop, teaches the numbers zero to twenty.  Alphabet pop, teaches all the letters of the alphabet.  Phonics pop, help your children to read and speak by learning the phonetic sounds of letters.  Find the Letter, simple game to reinforce the learning of letters.  Find the Number, simple game to reinforce the learning of numbers.  Find the Colors, simple game to reinforce the learning of colors.  Matching Pairs, help develop your childs memory by looking for matching animals hidden behind an arrangement of bubbles. This mode now supports both animals and dinosaurs.  Hide and Pop, help develop your childs hand eye coordination is this game where they must click on animals as they pop out of holes found around the screen.  Leaf Sweep, a game of mystery as your child must sweep the leaves out of the way to try and find the animals hiding beneath.  Snap, a two player game you can enjoy with your child. An animal is shown in the centre of the screen and each player has to try and press their bubble displaying their animals when it matches.  Animal Piano, select the animal you would like to use and play their sounds with an illuminating piano for some musical fun.  Some activities are fully unlocked when you install the app, but some are in a trial mode so that they can be tested. Available is a single unlock purchase that will unlock everything in the app, and this is behind a question lock screen so that your little ones cannot accidently do this without you.  Settings: The settings menu is question locked to stop little ones going where only adults should. Audio settings let you turn off various audio cues/music so that you can concentrate on whats important to you, animal sounds, animal names.  Feedback: If youd like to get in touch to say how we could improve our App, or to tell us about an issue, please feel free to contact us at:  contact@chronoglyphinteractive.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_COARSE_LOCATION']",
}