{
"name" : "Learn English Vocab: VocApp English Flash cards",
"url" : "https://play.google.com/store/apps/details?id=com.vocapp.en",
"package" : "com.vocapp.en",
"category" : "Education",
"description" : "What is the best way to learn English? The most efficient method is with flashcards! They help you quickly build up your vocabulary and English skills. It has been proved that they by far outperform traditional English courses, that are often boring and tiring, and do not bring the results you were hoping for.   Flashcards are constantly rising in popularity, due to the fact that they combine entertainment with learning. If you aim to know and speak English fluently, for studies, work or in order to impress native speakers with your knowledge during the next trip - this app is perfect for you!  VocApp was created in order to share an amazing product that offers the possibility to learn easy and fun. We are sure it will help you achieve all of your English language goals and ambitions. The product was made for everyone to enjoy. Whether you are a beginner or a master in English, you will find our app useful.  Why are our flashcards special? The secret is in the combination of more elements that help you learn: the image, the pronunciation, examples of English sentences, definitions and hints, that explain the meaning of a word and show how can you use it in day-to-day life. Our method combines audio and visual memory to help remember forever. Also, we have created a Repetition System that reminds you the needed words at the right time, so you will not feel the need of dictionaries and subtitles anymore!  Our courses are created by professionals in linguistics, so you can trust the material that is included in them. Besides, hundreds of users, most of whom are native English speakers, create daily lots of lessons to help others in learning English. Our database is unique! You can find something to learn on any topic you are interested in, whether its the basics of the language or hard financial terms.  Our flashcards will help you prepare for well-known proficiency tests such as CPE, TOEFL, IELTS and others. These courses have been created especially for developing your English vocabulary in order to prove your good level of knowledge. Fortunately, English grammar is quite simple. Knowing the basics is sufficient enough and it is not worth spending more time learning it, as all of it will come naturally.  All you need is to type a word! We will do the rest! The image and sentence will be generated automatically by the system. You will be able to add this (with pronunciation and exemplar usage) to your own flashcards.  In this way, you cannot only check meanings of words but also learn and memorize them forever (as if it were there all along). Our methods will remarkably expand your English vocabulary and in the future you will no longer need to bother about unknown words.  Motivation and discipline are the key to learning any language successfully and we are here to help you say on track. While life gets busy, our app will help achieve a systematic approach to learning. For example, you can set the widget for English after unlocking your mobile screen. We will remind you that you planned to study at that moment and you will not skip this task.  We really appreciate users opinions, that is why we constantly work on improving our app and making it a product that people love. We encourage you to leave your mark too!  Our methods actually lead to positive results, that is why he are leaps ahead of of our competitors. Words are not only familiar, but they stay locked in your memory and are at your disposal to wield and create sentences in fluent English.  Our application is a free product - you can try all of our courses and create your own flashcards, that can be downloaded in MP3 format to listen to them on the go! Everything you need for learning is in our app. Download VocApp and enjoy our resources right now! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION']",
}