{
"name" : "Bangla Dictionary Offline",
"url" : "https://play.google.com/store/apps/details?id=com.dic.bn",
"package" : "com.dic.bn",
"category" : "Education",
"description" : "Bangla <> English Dictionary offline and free. You can search both English and Bangla words. You can search words directly from Internet Browser or other Applications by using Sharing option. In the sharing option you will find Bangla Dictionary and choosing Bangla Dictionary will open the dictionary with the shared word so you need not type. Exiting from the dictionary will return you to Internet Browser or other Applications again. This is not only a Dictionary but also a learning tool. You can use this dictionary when you have no Internet connection. MCQ (Multiple Choice Question) option is available. There is autosuggestion so you need not type full words. You also can use Speech to text feature. You can add words to the study plan and remove words from the study plan. When you start typing, you will see some words starting with the letters you typed. The dictionary searches in a database for the matching words. This can slow down typing in small handsets. Therefore in settings there is an option to turn that off. So low profile mobile handsets can turn off Auto search to type quickly. You will see a Dictionary icon on the notification bar to start the app quickly. On sharing text you will find the Bangla Dictionary. This will be helpful to find out the meaning of any word.  Features of the Dictionary:  Bangla To English  English To Bangla  No internet connection required   Search From Web  Search by Sharing  Auto Suggestion  Pronounce & Voice Search  Antonyms (Opposite words)  Synonyms  Backup and Restore  History & Study Plan  Word Game  Share Words  Copy Words ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}