{
"name" : "Prakash Nepali Barnamaala",
"url" : "https://play.google.com/store/apps/details?id=com.momobites.prakash_barnamaala",
"package" : "com.momobites.prakash_barnamaala",
"category" : "Education",
"description" : "Prakash Nepali Barnamaala lets you learn and understand basic Devanagari/Nepali language using reading, writing and listening. Designed for all ages, this app has Devanagari/Nepali vowels, consonants, words, numbers, and phrases; along with basic Nepali adage, idioms, and proverbs along with few classic Nepali poems.  -- Beginners * Read, pronounce and write Nepali with vowels and consonants in Devanagari script. * Illustrated Images related to alphabets helps learning more fun. * Understand complex Nepali with - Barhakhari, (ka, kaa, ki, kii) compound/mixed (tra, pra, ndh) and legged letters (k, kh, g). * Select your favorite color to write, draw characters and draw pictures. * Drawing app shortcut opens up to clean white board, with color selection menu. * Read Devanagari/Nepali numbers from 1 to 100. * Read multiplication tables from 1 to 100 in Nepali and English * Understand basic Nepali Unit measurement of weight, area, notations.  -- Intermediate Learning * Words with audio file, for anyone interested in reading and listening to Nepali words. * Learn words associated with days of week, months, seasons, time in Nepali * Learn words of family, friends, relatives and important post/position in Nepali. * Learn major colors, emotions, animals, birds, and food in Nepali Language.  Features for Travelers and Non Nepali speaker * Phrases with audio recordings for easy understanding. * Learn phrases associated with travel, lodging, emergency, technology, health and food.  Features for School Children learning Nepali * Lyrics and Audio to Nepali National Anthem. * List of lyrics to simple Nepali baby songs. (some with song audios) * Read and Understand 100 most popular Nepali adage (Gaon Khane Katha),  * Read and Understand 50 most popular Nepali proverbs (Ukhaan) and idioms (Tukka). * List of Nepali National - (like - bird, animal, color)  [NEW] * New - Read prominent poems, by few select prominent Nepali poets like Laxmi Prasad Devkota, Bhanu Bhakta, Moti Ram Bhatta. * New - Multiplication tables from 1 to 100 in Nepali and English.  [Exceptional Features] * Requires no internet, after initial download. * Most of the Devanagari/Nepali script can be copied to clipboard for sharing. * No Advertisement   [Comprehensive Nepali learning app, that will only grow with time] ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS']",
}