{
"name" : "Kids Coloring Pages 1",
"url" : "https://play.google.com/store/apps/details?id=com.forqan.tech.KidsColoring",
"package" : "com.forqan.tech.KidsColoring",
"category" : "Education",
"description" : "A wonderful and free application for coloring mainly for preschool kids. The application contains 60 images for coloring. The images are very attractive for all ages. This game Coloring is full of animals such as horse, dinosaurs, kids, food, toys, aliens, vegetables, space, rockets and vehicles.  It so easy that even toddler can play, paint & draw. This coloring game is a coloring game where kids and adults can color animals and other images, they can also draw their own drawing for example. Both, boys and girls will love this coloring game. In this coloring game you can find many images of kids, animals, dinosaurs, toys, aliens, food, vehicles.  Whats this coloring game is about?  The application contains 60 images for coloring: animals, kids, food, vehicles, dinosaurs, aliens and toys.  You can easily fill out an entire region, draw with a pencil or brush and use an eraser  Both girls and boys will love it  20 beautiful colors.  You can paint, draw or doodle whenever they want to. Doodling, painting and drawing was never so easy and funny. It is the time to be more creative by downloading this free app: many pictures which can be drawn, painted or doodle their own.   We, at Forqan Smart Tech, have always sought to provide the best for your family through applications designed, and directed each age group separately, our belief in the feature each evolutionary stage passes by your son, but in order to lend life skills and the mentality to learn and grow and play correctly and properly, and to communicate with his peers and the environment surrounding it. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_FINE_LOCATION']",
}