{
"name" : "French - German : Dictionary & Education",
"url" : "https://play.google.com/store/apps/details?id=com.eflasoft.fradeufree",
"package" : "com.eflasoft.fradeufree",
"category" : "Education",
"description" : "Save time and money while learning French/German with this app. A quick dictionary, effective translation, frequently used phrase sentences, tests and games... Everything you need to learn French/German quickly...  Dictionary:   No need Internet connection. It works offline.  You can access hundreds of thousands of words and sentences in the database very quickly.  Suggests suggestions as soon as you start writing.  You can make voice calls with Speech recognition feature.  Sorts the meanings of the word according to the frequency of usage and gives percentage information.  You can see and listen to the usage of the word in the sentence with examples.  You can learn words more easily with example sentences.  In the database; French  German 94,000 words and phrases, German  French 99,000 words and phrases.  You can turn off one-way dialing and dial in either direction.  Your searches are sorted back to old and added to the History.  You can reach words faster by adding them to Favorites.  You can learn your favorites more permanently with tests and games.   Translator:   You can translate from French to German or from German to French.  You can make voice translation with Speech recognition feature.  You can listen to your translations.  Your translations are saved in History.   Phrases:   You can find and listen to 1,750 common phrases used in daily life.   Flashcard:   You can view the list of words by listening in order. If you wish, you can mark the ones you memorize. Thus, you do not come across words and tests you know.   Test:   Test yourself with the classic multiple choice test.   Dual Game:   You can learn by having fun in your spare time by trying to find the 16 words mixed in a table and their equivalents.   Matching Game:   An educational game played by matching the words given in the tables.   Writing:   A test that asks you to type the meaning of the desired word.   Mixed Game:   A test that asks you to complete the missing letters of the given word.   True or False:   A game where you compete against time, waiting for you to find out whether the relationship between word and meaning is true or false.   Listening Test:   A multiple-choice test that asks the meaning of the word you are listening to.   Listening and Writing:   A test that asks you to spell the word you are listening to.   Speech Test:   A test to improve your pronunciation.   Falling Game:   This is a fun game where you compete against time and gravity, while you must accurately mark the meaning of falling words.   Gap Filling:   It is a multiple-choice test that asks the missing word in the given sentence.   Finding Words:   A puzzle waiting for you to find a word by selecting the first and last letters of the mixed letters.   Widget:   You can learn without opening the app with the customizable widget.   Were working for more... ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}