{
"name" : "Baby english - English for kids & English learning",
"url" : "https://play.google.com/store/apps/details?id=com.LightningStudio.EnglishForKids",
"package" : "com.LightningStudio.EnglishForKids",
"category" : "Education",
"description" : "STEP-BY-STEP LEARNING  Guided by a learning path designed by experts in early childhood education  IMMERSIVE LEARNING Content rich in vocabulary taught in the natural way children learn best: through play!  How can a baby start learning English? Babies have great phonemic awareness. This means that they can easily distinguish and learn the different sounds that compose a language. Parents can take advantage of these learning skills to teach English as a second or foreign language.  English Learning Milestones for Babies Since babies go through many different cognitive stages and changes in their firsts months of age, its important to make sure to know these various learning stages in order to make sure to pick the best activities to learn English during infancy.  Best English Learning Activities for Babies Taking all these milestones and learning stages into consideration, parents can choose the best activities for their little ones to learn English at home.  Just now! Lets Learn English with our topics Download the app and enjoy its content!  In Baby English, youll find the best English picture for children, the most fun animations with its characters, audiobooks, printable worksheets for each topic, interactive exercises, and an endless supply of activities to learn over 12 topics in English.   Topics:   Numbers - Learn the numbers in English and their pronunciation.   Alphabet - Writing and grammar games aimed to teach sounds, pronunciation, phonics, and intonation of the words when talking and how to write them in English.   Colors - Learn how to write and pronounce the colors.   Shapes - Describe and help memorize geometric shapes.  Animals - Name spelling and pronunciation of all sorts of different animals.   Up to 12 topics to learn to communicate in English and to become bilingual.   Features - Constant updating of contents: new activities each month.  - Offline Mode: Download the activities to your device and learn without an internet connection.  - Adaptive Learning: The learning method adapts to the childs English level, creating lessons customized through multi-image cartoon and beautiful.  - Printables: Theres additional study material included in each topic.  - 100% Safe environment for children, since it complies with the COPPA regulation (Childrens Online Privacy Protection Act).  The app works on both Tablets and Phones.  --- Do you like our application? ---  Help us and take a few moments to write your opinion on Google Play. Your contribution helps us to improve and develop the application! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.LightningStudio.EnglishForKids.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}