{
"name" : "Little Kitty Town - Collect Cats & Create Stories",
"url" : "https://play.google.com/store/apps/details?id=com.tutotoons.app.littlekittytown.free",
"package" : "com.tutotoons.app.littlekittytown.free",
"category" : "Educational",
"description" : "NEW! Even more cool surprises, fun locations and cute cats! Become friends with a robot kitty! Visit brand new music and car shops. Play basketball and have fun with a bubble machine! Find a piata and discover more secrets of Little Kitty Town!  Little Kitty Town is a purrfect game for boys and girls who love cute animals, surprises and experiments. Explore this meowtastic city and find adventures on every corner! Create your own stories with the fluffy citizens of Little Kitty Town!  In Little Kitty Town kids can:  Collect more than 40 unique cats  from cute chubby kittens to panda cats to even unicorn kitties! New cats are always arriving at the airport!  Find hidden cat creatures: a superhero cat, meowmaid, robot cat, purrgasus and kitty ghosts!  Create crazy pet hairstyles and fun outfits for cats. Mix and match clothes and accessories as they want!  Show off your musical talent in a brand new music shop!  Harvest crops, go fishing and cook food!  Care for, wash and feed the cats!  Try out a magic teleport!  Visit a car shop and drive fun cars and boats  even a police car or a firetruck! Fly a helicopter!  Dance to pawsome music with the party cats!  Clean up the cat city and keep it tidy!  Interact with 40+ characters, 15+ locations and 100+ objects freely!  Make up their own unique stories as they play!  Play Little Kitty Town  a cute and simple game for kids that sparks curiosity, encourages creative thinking and lets little ones become visual storytellers!  - - - - - - - - - - - - - - - - - - - - - - - -  About TutoTOONS Games for Kids Crafted and play-tested with kids and toddlers, TutoTOONS games foster kids creativity and help them learn while playing the games they love. Fun and educational TutoTOONS games strive to bring meaningful and safe mobile experience to millions of children worldwide.  Important Message to Parents This app is free to download and play, but there are certain in-game items that may be purchased for real money. By downloading this app you agree to TutoTOONS Privacy Policy and Terms of Use.  Discover More Fun with TutoTOONS!  Subscribe to our YouTube channel: https://www.youtube.com/c/tutotoonsofficial  Learn more about us: https://tutotoons.com  Read our blog: https://blog.tutotoons.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_COURSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.vending.CHECK_LICENSE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.CHECK_LICENSE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
}