{
"name" : "CCI Student - CA Student app for CA Final IPC CPT",
"url" : "https://play.google.com/store/apps/details?id=com.interactivemedia.students",
"package" : "com.interactivemedia.students",
"category" : "Education",
"description" : "CA student connect by offline apps India provides students in CA foundation, CPT, IPCC inter, CA final old course and new course with access to latest ICAI updates and notifications.   You can read Articles, Q&A from CA students & Finance professionals in India and discuss your exam queries with experts in India. You can also receive latest CA student related ICAI news and updates on the go. Access the file section to get latest and updated CA IPCC notes, CA inter notes, CPT notes, Foundation notes and CA Final notes for old and new course along with ICAI notifications. Join the most downloaded app in the Indias finapp space and become a part of Indias largest community for CA Students. The app acts as a one stop destination for all CA, CS, CMA and other finance students providing solution to their queries through a single finance app for the first time in India. Download to join thousands of other CA, CS, CMA students and professionals on the ca student app by offline apps India.  Our CA online coaching classes app offers CA Cart feature where you can buy test series by Super Professors and study at home clear concept ca and target study with Apna Course. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}