{
"name" : "Download MP3 Quran 30 Juz",
"url" : "https://play.google.com/store/apps/details?id=com.alquran.quranmp3.quranrecitation",
"package" : "com.alquran.quranmp3.quranrecitation",
"category" : "Education",
"description" : "This application contains recitation of the Holy Quran by 120+ famous Qori:  Abdul-Munim Abdul-Mubdi AbdulAzeez al-Ahmad quran AbdulBari ath-Thubaity quran mp3 AbdulBaset AbdulSamad al quran AbdulKareem Al Hazmi al-quran Abdullah Ali Jabir Abdullah Awad al-Juhani Abdullah Basfar Abdullah Khayat Abdullah Matroud AbdulMuhsin al-Qasim AbdulWadood Haneef Abdur-Rahman as-Sudais Abdur-Rashid Sufi Abdur-Razaq bin Abtan al-Dulaimi Abu Bakr al-Shatri Adel Kalbani Ahmad al-Huthaify Ahmad Nauina  Ahmed ibn Ali al-Ajmy Akram Al-Alaqmi Al-Hussayni Al-Azazy Ali Abdur-Rahman al-Huthaify Ali Hajjaj Alsouasi Aziz Alili Bandar Baleela Dr. Shawqy Hamed Fares Abbad Hamad Sinan Hani ar-Rifai Hatem Farid Ibrahim Al Akhdar Ibrahim Al-Jibrin Idrees Abkar Imad Zuhair Hafez Khalid Al Ghamdi quran recitation Khalid al-Qahtani quran download  Maher al-Muaiqly quran pak Mahmood Ali Al-Bana Mahmoud Khaleel Al-Husary Mishari Rashid al-`Afasy Mohammad Al-Tablawi  Mohammad Ismaeel Al-Muqaddim Mostafa Ismaeel Muhammad Abdul-Kareem Muhammad al-Luhaidan al quran mp3 Muhammad al-Mehysni al quran online  Muhammad Ayyoob al quran digital Muhammad Hassan koran karim Muhammad Jibreel alquran  Muhammad Khaleel holy quran Muhammad Siddiq al-Minshawi coran mp3 Muhammad Sulaiman Patel mp3 quran Mustafa al-`Azawi quran in hindi  Nabil ar-Rifai quran audio Nasser Al Qatami koran online Saad al-Ghamdi the holy quran Sadaqat `Ali Sahl Yasin Salah al-Budair Salah Al-Hashim Salah Bukhatir Saleh al Taleb Sa`ud ash-Shuraym Sudais and Shuraym Tawfeeq ibn Sa`id as-Sawaigh Wadee Hammadi Al Yamani Yasser ad-Dussary  Translation in language: English Translation French Translation Germany Translation Italy Translation Spain Translation Indonesia Translation Urdu Translation Hindi Translation Tamil Translation Telugu Translation  A light application quran recitation to facilitate anyone islam who wants to learn and also to listen to the Holy coran in holy month ramadan. This application contains recitation of the Holy Quran sung by dozens of famous Qori.  - You have the choice of either listening koran karim via audio streaming quran mp3 from the internet or you can download the files to your device. - All files quran karim are streamed from the internet connection - You can download each coran download MP3 file by using the download icon in the top - If file is quran download, the app will serve the audio file quran online directly from your device (no internet connection needed) to islamic finder. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}