{
"name" : "Advanced English Dictionary: Meanings & Definition",
"url" : "https://play.google.com/store/apps/details?id=com.orangeannoe.englishdictionary",
"package" : "com.orangeannoe.englishdictionary",
"category" : "Education",
"description" : "English to English Dictionary is handy for all English Speakers & Learners. It contains 500,000+ words with meanings and definitions with examples.  The number 1 Dictionary is useful for learning new words, education and for learning advanced words. You can easily search meaning, definitions offline by using English to English dictionary application.  The Advance English Dictionary is offline version which can be used to get meaning, Definitions and Thesaurus of the words you want without Internet.  With a huge database of words and their meaning this English dictionary is certainly rated among the top Offline English Dictionaries by users.   This dictonary is Loaded with the features like:  Word of the day Thesaurus History of the words searched recently Very Easy dic in eng. Favorites words, for future reference. Words Translate to English.  Very simple to use eng dictionary for kids.  Free dictionary comes with lot of words.  Diction Definitions.    Makes this pocket diction one of the best on the play store. This App can be used as online dictionary too. This Online Translator will help you translate lot of words with ease and comfort.   This App contains more advanced features i.e. word of the day, spelling suggestions, advanced learners vocabulary, history of the searched words and save favorite words easily.   It has a very simple and user friendly layout with its clear definitions and chosen vocabulary makes it more functional. English to English Dictionary is the best choice for businessman, tourist, student, teachers and learners.  If you want to get meaning of the most difficult and unique words, you have come to the right place. Download Now to Get Started.  Now you can search word with voice search option. Voice search feature is added in this latest update. Word Pronunciation and speech to text feature is also added.  Themes added. Now you can select theme color of your liking to give app customized look. In app Purchases are also added to remove ads.  Update Version 2.9:  Voice Translator added, with voice translator you can translate any thing you want and that also with your voice. After Voice translation feature this dictionary has become more useful then ever. No it is covering all what a user needs. You can translate from any language to any language you want. Advance English Dictionary and Translator supports both typing and voice input methods.  Along with Voice Translation you can now scan text from any page or screen and translate it too. This serves the purpose of hard copy translation as well as text scanner. (you may need to give extra permission to access this feature). ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.orangeannoe.englishdictionary.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}