{
"name" : "Times Tables Multiples - 3rd Grade Math Games Free",
"url" : "https://play.google.com/store/apps/details?id=com.mylearningpet.mobilaxy.kids.education.mynumberdrop",
"package" : "com.mylearningpet.mobilaxy.kids.education.mynumberdrop",
"category" : "Educational",
"description" : "Take your multiplication table and 3rd grade math skills to the next level with an advanced, multiplication facts game!  Feel confident with most of the times tables up to 12?  Move to the next level with advanced 3rd and 4th grade math concepts like factors / multiples and prime numbers. This 3rd grade math game is designed to help kids perfect their multiplying speed and prepare them for division and fractions. Learn fast and have fun!   Times Tables Multiples features:   Enjoy 12 fun, themed levels!   Learning with rewards: Earn coins and get cool features!   Play with up to 24 funny, animal characters!   Learn 3rd and 4th grade math quickly on smartphone and tablet.    Access all content for free!   Prepare for division and fractions!   How to Play Times Tables Multiples:  Quickly run and collect the numbers that drop before they hit the ground. Be careful though! Pay close attention to the instructions and make sure to only catch the correct numbers. For example: multiples of 5. Collect numbers such as 10, 25 or 65 which you can divide by 5. All other numbers which you can not divide by 5 (without a remainder) should be avoided. You gotta be quick though! The numbers drop faster over time!   Get in the division mindset! Is this number a multiple of 4? is like asking Can this number be divided by 4? For this reason, multiples are the perfect topic for transitioning students from learning multiplying to dividing.   Get ready for fractions These fun, yet challenging learning games help kids develop a stronger understanding of numbers and how they relate to one another.   As students move forward from multiplication facts into division and fractions, multiples become increasingly more important for success in 3rd and 4th grade math. Times Tables Multiples helps students calculate fraction greatest common factors (GCF) and lowest common denominators (a.k.a., lowest common multiple) quickly and confidently. Working with fractions can be one of the most challenging topics for 3rd and 4th grade math students. Make sure your kids are ready!  All Times Tables Multiples topics:   Positive and negative numbers  Odd and even numbers  Greater than and less than  Multiples / Factors (2, 5, 10, 3, 4 & 6): Learn to multiply fast and identify fraction denominators.   Prime numbers: Fun and learning for 4th graders and adults! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'com.mylearningpet.mobilaxy.kids.education.mynumberdrop.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}