{
"name" : "Unicaf Scholarships | Online and on-campus Degrees",
"url" : "https://play.google.com/store/apps/details?id=com.app.unicaf",
"package" : "com.app.unicaf",
"category" : "Education",
"description" : "Unicaf is a global educational organisation based in Europe, offering scholarships to eligible candidates to pursue academic qualifications with its partner universities, currently the University of Suffolk in the UK, the Liverpool John Moores University also in the UK, California University, Riverside Extension in the USA and multi-campus Unicaf University in Africa.   Other than the fully online programmes offered through the partner universities Unicaf offers several taught programmes at the Unicaf University campuses.  The Unicaf Scholarship Programme has awarded so far over $100 million worth of scholarships to more than 30,000 eligible applicants in 156 countries around the world. The scholarships are awarded to talented individuals who are financially challenged to reduce considerably the cost of tuition fees; the remaining fees are paid in easy instalments, as part of tailor-made, affordable payment plans.  Unicaf facilitates the global online delivery of study material for Bachelor, Masters or Doctoral degrees through its state-of-the-art digital platform, and Virtual Learning Environment (VLE). Online learning is gaining ground as an efficient way to impart new knowledge, skills and qualifications, which is suitable for people living away from urban centres, for family carers and homemakers, for people with disabilities and for working professionals who cannot give up their careers and salaries to earn new qualifications, to get a promotion or to find a better job.   The Unicaf VLE, which is available through any mobile or desktop device, enables access to study materials 24/7, regular contact with tutors, access to extensive e-libraries, and networking with students and professionals in many different countries and cultures. Online delivery of course material through the Unicaf VLE employs modern technologies and methods, (like audio podcasts, videos, quizzes, group projects and more), which assist learning by making it more enjoyable and interesting.   Unicaf operates rolling admissions, which means that students can register for any programme offered through Unicaf throughout the year. Teaching is in modules, which allow students to explore in-depth one topic at a time before moving to the next, and to take some time off, if needed, to deal with pressing work or family matters.   The four main advantages of studying through Unicaf are Affordability, Flexibility, Accessibility and Credibility.  Unicaf is physically present through learning centres or university campuses in 12 African countries (Egypt, Ghana, Kenya, Malawi, Morocco, Nigeria, Somalia, Uganda, Zimbabwe, South Africa, Zambia and Rwanda) and also has offices in Europe. Unicaf scholars can use the facilities at the learning centres to study and to meet fellow students. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'com.app.unicaf.permission.C2D_MESSAGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.READ_PHONE_STATE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.VIBRATE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.CALL_PHONE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.htc.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}