{
"name" : "Zoment",
"url" : "https://play.google.com/store/apps/details?id=com.ufony",
"package" : "com.ufony",
"category" : "Education",
"description" : "Zoment, makes parent-school communication easy, engaging and effective.    Zoment - is a mobile-first platform that enables parents to receive timely updates (school or class alerts, daycare updates, event reminders), to track childs progress (activity pictures, homework, attendance reports) and to monitor child safety (bus tracker) while kids are in transit on their smartphones.   For a School, Zoment eliminates paper wastage, provides one window for all their communication needs (instead of schools using print, diary notes, SMS, email, web portals for different messages) & improves staff productivity. More than 250 schools/pre-schools across the world are leveraging Zoment.   The key features of Zoment are -  a. Summary of key activities for the day.   b. Instant & private messaging. Messages can be sent one to one or in a group of parents. Push notifications are instantly sent to parents informing about incoming messages.   c. A multimedia messaging platform that enables schools to engage parents at right moments; Messages can be text, pictures, PDFs or voice messages. So the school can now share classroom activity pictures, audio of child singing & important announcements with parents instantly on their phone.   d. A calendar that not only allows parents to view the roadmap but also reminds them of key activities at the right moments.   e. Attendance that helps schools easily capture and share attendance with parents   f. A scheduling option that schools can use to send pre-composed messages to parent. They can just select the schedule for every message and see those messages delivered at their scheduled time to the selected parents.   g. Daycare module to keep parents informed about their childs daily progress & activities.   h. Transport module that helps parents track the bus, get route and ETA to their stop.   i. Fees module to track each childs fees payment status and receipts.   And much more...  * Zoment is only available for registered schools. Please check with your school admin or contact us at app@ufony.com if your school is not registered yet.  * Parents can get in touch with their school admin for login and other details. ",
"desc_perms" : "['android.permission.READ_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'com.ufony.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}