{
"name" : "Educational Games for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.miniklerogreniyor.gamepack",
"package" : "com.miniklerogreniyor.gamepack",
"category" : "Educational",
"description" : "Educational Games for Kids offers eight educational games together which is very useful for toddlers, kindergarten kids and preschool kids.  This game is a lovely and fun way of teaching the shapes, numbers, letters, colors and sounds to the kids.  It has been carefully designed and developed for the preschool kids at the ages of 2, 3, 4, 5 and 6.  Educational Games for Kids consists of the most liked games for the boys and girls.  Kids will love these educational games and will play with fun for a long time.  It is easy to play. The children can play with this game whenever and wherever they want on their own.  The entertaining sounds and visual effects emerging once the game is ended reward the success of children and motivate them.  Now download and play for free!  It has been designed suitable for both the smartphones and the tablets.  Languages: English, Czech, French, German, Italian, Polish, Portuguese, Russian, Spanish, Turkish.  We develop educational games designed for toddlers, preschoolers and kids.  8 educational games included in the app are as follows:  Connect the Dots Game  Connect the Dots Game is a fun application teaching the correct sequence of numbers and letters to children.  The points can be connected with the numbers in sequence of 1-2-3 or with the letters in sequence of ABC.  When the points are connected in a correct manner then sometimes a cute animal and sometimes a snowman appears.  The ocean animals, farm animals, astronauts, rockets and clowns are some of the surprising objects in the game.  Animal Sounds  Animal Sounds is a fun and educational application that teaches the sounds of animals to children.  Kids will have fun by listening to the sounds of their favorite animals.  The farm animals, wild nature animals, pets, birds, mammals and marine animals are waiting to be discovered by your children.  The game includes the sounds of lovely animals such as cat, dog, cow, horse, sheep, rooster, chicken, goat, turkey, bird, donkey, duck, dolphin, chick, camel, bee, monkey and elephant.  High quality and natural animal sounds are used.  Coloring Book  Coloring Book consists of coloring pages to develop childrens creativity and enrich their imagination.  Kids can easily select the colors they want and they can easily make coloring.  The variety of colors and beautiful graphics provide creative and inspiring coloring activity.  Airplane, doll, car, bee, helicopter, cow, ship, crab, train, fish, race car, dolphin, duck, goat, shark, sea turtle, turkey and donkey are the pictures to be colored.  Matching Game  In Matching Game, the children complete the game by matching the same objects among those in mixed sorted ones.  The animals, shapes, fruits and toys are the objects which their visuals are to be matched.   Memory Game  In Memory Game, kids try to find the same objects by reversing the memory cards.  The memory cards consist of images for animals, shapes, fruits and toys.  Puzzle Game  The children complete the picture leaving scattered puzzle pieces to their right places.  The puzzle themes with high visual quality such as farm animals, ocean animals, vehicles, circuses and spaces are present in the game.  The car, race car, motorcycle, ship, airplane and train are present in the vehicles puzzle theme.  The horse, cow, rooster, chicken, turkey, chick and sheep are present in the farm animals puzzle theme.  Shape Puzzle  In Shape Puzzle, the children bring together the pieces of puzzle picture and reveal the whole picture.  Shadow Puzzle  In Shadow Puzzle, the children complete the game by matching the real image of an object with its shadow image.  There are many puzzles consisting of the vehicles, farm animals, ocean animals, fruits and shapes in the game. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}