{
"name" : "Learn Greek. Speak Greek",
"url" : "https://play.google.com/store/apps/details?id=com.atistudios.italk.el",
"package" : "com.atistudios.italk.el",
"category" : "Education",
"description" : "Learn Greek with 5 minutes of practice daily. Mondly is the quick fix that will teach you core Greek words and Greek phrases for conversation, just like a phrasebook. If you want to learn beyond the basics, there are also Greek grammar lessons available. Its even great for kids!  With Mondly you can learn Greek sentences and expressions FREE with daily Greek language lessons online. This app is the effective way for beginners to study verbs, pronunciation and how to speak like a native with daily practice.  The secret path to language learning Remember the Greek language classes in school? You started with hundreds of basic words and expressions, continued with tons of Greek grammar lessons and at the end of a full semesters language course you could barely translate a sentence or say Hello! to a local. Does it sound familiar? Thats the traditional way to learn a language. But its not the fastest and not the most efficient way. Mondly has a different approach, thats opposite to the average language course.  This is how the future of language courses looks like The App gets you started with a basic conversation between two people. You quickly start memorizing core words, use them to build sentences and phrases, and at the end of a 45-minutes module you are able to reconstruct that conversation with your own voice. Its an effective way to learn Greek phrases. State-of-the-art Natural Speech Recognition and Spaced Repetition Algorithms make the app effective for learning languages.  Here are the key features that make Mondly a great tutor for you:  - Crystal-clear audio and professional voice actors. Learn the right Greek pronunciation from conversations between native speakers.  - State-of-the-art Speech Recognition. Mondly knows exactly how to listen to your Greek words and phrases. You will only get a positive feedback if you speak Greek clearly and correctly. This will improve your pronunciation.  - Useful phrases for real situations. Memorizing hundreds of words is not the way to go when it comes to learning Greek. Mondly teaches you Greek vocabulary by offering you core words and phrases. The app breaks the learning process down into bite-size chunks and puts them into themed packs of lessons.  - Learn conversational Greek. Unless you plan on reading science books, conversation is the main reason to take this free course. It will help you build a core Greek vocabulary with widely-used nouns and verbs and speak Greek clearly.  - Verb conjugations. Conversations are fun, but the foundation of a foreign language is grammar. If you want to learn more during this course, just tap the Greek verbs and get the full conjugation on the screen, including the translation. Its faster and better than a dictionary.  - Statistics that make sense. The App uses intelligent reporting, so you can always follow your progress. Build your vocabulary step by step and become better daily.  - The Leaderboard. We made learning easy and fun, so why not throw in some more game elements, such as score? See how your friends are doing and compete with people from all over the world to become the best learner in the Mondly family. Take the Weekly Quiz to become even better.  - Adaptive Learning. We wanted to craft Mondly in such a way that it will suit every learners needs, even complete beginners. Along the way we noticed that learning Greek is different from person to person. So we taught the app to learn from your way of learning. After little time spent together, Mondly will understand what suits you best and it will become your own guide and customized teacher.  Before you know it, at the end of these Greek lessons, you will master the most useful 5000 words and phrases and you will be on the fast lane to learning a new language. Kids will love it as well. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.USE_CREDENTIALS', 'com.amazon.device.messaging.permission.RECEIVE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.READ_APP_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.atistudios.italk.el.permission.C2D_MESSAGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.android.vending.BILLING', 'android.permission.BLUETOOTH', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.ACCESS_WIFI_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.atistudios.mondly.languages.permission.RECEIVE_ADM_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'me.everything.badger.permission.BADGE_COUNT_WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'com.atistudios.mondly.languages.permission.RECEIVE_ADM_MESSAGE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}