{
"name" : "LinguaTV Language Learning",
"url" : "https://play.google.com/store/apps/details?id=com.linguatv.apps.android",
"package" : "com.linguatv.apps.android",
"category" : "Education",
"description" : "Learning English, German, Spanish, French or Italian is much more fun with LinguaTV!  Our proven teaching methods combined with entertaining materials help you to speak a foreign language more quickly and simply than you did at school. Great videos show you how native speakers use their language in realistic situations (e.g. when travelling, in a restaurant or at work). You can extend your knowledge with our vocabulary trainer, grammar tutorials, interactive exercises and games. At the end of a course you will also receive our certificate so that you can prove to others how well you can speak your new favourite language. With LinguaTV you will make much faster progress than with any other course you have used so far.  Try LinguaTV for yourself. The first lesson is free.  Learning Languages with LinguaTV offers you many functions and advantages:  For the learner: - a comprehensive programme of language study with a wide variety of courses at all levels (A1-C1 CEFRL) - videos with authentic conversational settings help you practise your communication skills - interesting stories motivate you to keep learning - the offline availability of the courses enables you to learn any time, any place - you learn correct pronunciation from native speakers at the same time as practising your listening skills - there are many supplementary features, such as subtitles and a vocabulary trainer, which help you to learn the language - your progress is synchronised on all your devices - the modular presentation of the materials enables you to learn in a flexible way, ideal for bite-sized learning  - be inspired by our innovative approach, developed by committed and experienced language teachers  Functionality and advantages for teachers:  - LinguaTV can also be used in classroom teaching (Blended Learning) - Our Teachers Guides facilitate the seamless integration of private study with classroom teaching  Award-winning product: World Summit Award Mobile (United Nations) Samsung App Challenge Eltons (British Council) Comenius EduMedia  Customer Service: We would like to hear from you. Please send us your questions or feedback to: mobile@linguatv.com ... or keep in touch via Twitter, Facebook, Pinterest, Xing, LinkedIn  ... and take a frequent look at our YouTube channel.  About LinguaTV: LinguaTV is a leading provider of multi-media language courses and has already received many rewards for its didactic approach and multi-media teaching materials. LinguaTV is used around the world by private customers, leading companies, universities and language schools for the teaching and learning of foreign languages.  Important information: You need a subscription in order to receive access to all our available courses, languages and levels. The range of course content can vary from language to language and from level to level, as can the available pairing of target and source language.  You can choose from four different lengths of subscription (1, 3, 6 and 12 months).  Your subscription will automatically renew if you do not cancel it before your current subscription period expires. You can administrate and cancel your subscription at any time via your personal account settings in the Google Play Store. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION']",
}