{
"name" : "Speexx – Empowering Communication",
"url" : "https://play.google.com/store/apps/details?id=com.speexx.speexxapp",
"package" : "com.speexx.speexxapp",
"category" : "Education",
"description" : "Please note, this app requires access to an active Speexx user account.  The award-winning language learning and testing solution   Join over 8 million users and study anytime, anywhere. Boost your career with improved language skills in Business English, French, Spanish, Italian, and German.   Improve your cross-cultural communication skills, vital for success in todays workforce  Learn through fun and engaging microlearning activities for grammar, video and audio comprehension, reading, writing, and vocabulary building   Enjoy the freedom to learn on-the-go at your own pace  Excel in your learning goals through a personalized learning journey based on your needs and preferences  Learn quicker through Speexx user-centric approach, empowered by intelligence-based tools   Improve your conversational skills on trending topics by practicing with your peers in the virtual classroom  Receive reliable support from native-speaking trainers  Enjoy a smooth learning experience across all devices  Speexx helps professionals worldwide to drive productivity by empowering communication skills across borders. We offer an award-winning range of cloud-based online language learning solutions with ongoing support in 13 languages. More than 8 million users in 1,500 organizations  including UNHCR, Adecco, Mazda, and Saint-Gobain  trust Speexx on their journey to smarter language learning. Speexx was founded in 1994 and is headquartered in Munich with offices in London, Madrid, Milan, Paris, Sao Paulo, New York, and Shanghai. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.RECORD_VIDEO', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.VIBRATE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECORD_VIDEO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO']",
}