{
"name" : "tonestro for Flute - practice rhythm & pitch",
"url" : "https://play.google.com/store/apps/details?id=com.tonestro.flute",
"package" : "com.tonestro.flute",
"category" : "Education",
"description" : "tonestro, the one and only music practice app, is your personal flute companion and pocket music teacher. It provides immediate feedback on pitch & rhythm, guarantees constant motivation and is the ideal instrument tutor for you.  Enjoy a variety of digital music scores, an exciting game-like practice experience and finally have fun while practicing with your flute.  Boring practice is a thing of the past. Try it out now, improve your skills on your instrument and grow beyond yourself.  MAIN FEATURES   Interactive live-feedback on your performance: Play on your instrument and practice pitch (intonation) & rhythm  Large collection of sheet music: You will always have your music sheets with you  Campaign mode: Play & master a variety of assignments and prove that you have what it takes to raise from an underground musician and become a legend  tonestro for flute is the perfect addition to your music lessons or even music school/music teacher and is available for smartphone and tablet.  BENEFITS   Improve your pitch (intonation)  Improve your rhythm  Always have your sheets of music with you  FREE AND FUN  It has never been more fun to study a musical instrument. Revise your mistakes and quickly enhance your abilities on the flute!  SHARE YOUR SUCCESS  Share your activities on Facebook, Instagram, WhatsApp & via email.  THE APP FOR EVERY FLUTE PLAYER: BEGINNERS, INTERMEDIATES & EXPERTS Do you want to learn how to play your instrument like a Greek god? Then download tonestro, and learn the flute with us!  tonestro.com tonestro is all about wind instrument apps! Do you play or want to learn a wind instrument, or simply want to add another one to your repertoire?  Recorder  Flute  Clarinet  Saxophone (Alto Saxophone, Tenor Saxophone, Soprano Saxophone)  Trumpet  Euphonium, Baritone  French Horn  Trombone  Tuba No problem, we got you covered. Check out more of our apps to help you reach your musical goals. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'com.tonestro.flute.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}