{
"name" : "MagicIWB Agent with KNOX",
"url" : "https://play.google.com/store/apps/details?id=com.samsung.iwbagent",
"package" : "com.samsung.iwbagent",
"category" : "Education",
"description" : "MagicIWB Agent with KNOX is a companion client application of Samsungs proprietary MagicIWB software solution. This solution can be used by both Enterprise and Education sector to have enhanced interactive session experience during Class room lecture or Business meeting. MagicIWB solution has following component- 1. MagicIWB Board I: The Interactive Whiteboard is a solution that allows user to draw freely and use multimedia content over a large touch screen with touch gestures. 2. MagicIWB Manager: It is an application that allows user to control and monitor the participant devices (MagicIWB Agent with KNOX application). It also allows screen sharing among participants, remotely controlling device and many more features for Class/Meeting management. 3. MagicIWB Agent with KNOX: It is an application to be used by participants of the interactive session. MagicIWB Agent with KNOX application has following features- - Join the Class/Meeting opened by the MagicIWB Manager/Board I - Question: Send a question to MagicIWB Manager with text/annotation and file attachments - Upload file: Send multimedia files from MagicIWB Agent device to MagicIWB Manager/Board I. - Document Viewer: To view documents shared by MagicIWB Manager/Board I. Participant who has authority can perform annotation remotely over the currently opened document and share with all the participants. - Quick Memo  MagicIWB Agent can send memo with text/annotation to MagicIWB Manager/Board I. - Shared Folder  MagicIWB Agent can share file(s) locally on the device, these files can be accessed from Board I PC for Add, Delete and Update operation. How to use:  - Network Environment: To attend a Class/Meeting, ensure that MagicIWB Manager/Board I PC and MagicIWB Agent device(s) are in the same wireless network. - Connect to MagicIWB Manager/Board I: In Device search screen you can see currently hosted Class/Meeting list. Select a Class/Meeting to join in the session.  Note:  1. MagicIWB agent with KNOX application is developed for  Android OS Android OS - 4.4.2 (Kitkat) onward KNOX SDK  5.0 onwards 2. This app will require a mandate setting to activate the Device administrator mode. 3. This app will require a mandate settings to turn on Usage data access permission for our application on Marshmallow devices 4. This app will require KNOX license activation which will require internet connectivity.  MagicIWB Manager Link:  http://v3.samsunggsbn.com/ ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.sec.MDM_REMOTE_CONTROL', 'android.permission.sec.MDM_KIOSK_MODE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_SURFACE_FLINGER', 'android.permission.ACTION_MEDIA_SCANNER_SCAN_FILE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.sec.MDM_APP_MGMT', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.PACKAGE_USAGE_STATS', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.sec.MDM_REMOTE_CONTROL', 'android.permission.sec.MDM_KIOSK_MODE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_SURFACE_FLINGER', 'android.permission.ACTION_MEDIA_SCANNER_SCAN_FILE', 'android.permission.sec.MDM_APP_MGMT', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}