{
"name" : "Grammar Checker, Check Spell & Sentence Correction",
"url" : "https://play.google.com/store/apps/details?id=com.grammar.checker.corrector",
"package" : "com.grammar.checker.corrector",
"category" : "Education",
"description" : "The app is developed after the strong collaborative efforts of our professional writers, developers, and designers where you can run a spelling check on any of your content. Essays or stories, letters or leaves, no matter what you give it to fix, it will because no mistake can escape from this Grammar checker app. It not only is the fastest way to eliminate typographical errors but also can assist you in educating yourself. Grammar is the structure of a language, or you can say the fundamental rules which can create perfection in a sentence.   Anyone who loves writing or its a part of their life, they know the power Grammar holds. Students/grown-ups who have English as their second language and dont have the right place for practicing it. You no longer have to be weak at Grammar because this is the app where you will find sublimity in your articles and will aid you in proposing your presentation with confidence. Take care of all the tiny errors you are afraid that others can notice, plus you no longer have to carry your laptop where ever you go for writing and fixation of mistakes. Its a Grammar corrector that can re-arrange your sentences and find suitable synonyms if required.  So, wouldnt it be great to have an app that can find and take care of your slips on the go?    App Features: - Articles - Adverbs - Adjectives - Active or Passive Voice - Auxiliary Verbs - Conjunctions - Conditionals - Determiners - Interjections - Idioms - Nouns - Pronouns - Phrases - Prepositions - Question Tags - Quantifiers - Reported Speech - Tenses - Verbs and many more.    Some extra features the Grammar Checker app include: - The Grammar checker is available for free - It will enable you to learn from your typographical mistakes - The user interface is extremely friendly  - The app has a support for all Android platforms - This Grammar checker or reader assists in revamping your English Grammar.  The best way to get better at English is right in the palm of your hand. As people do not like sharing articles that have poor Grammar this app will boost your contents sharing potential as well. You can rectify your errors while enjoying a cup of coffee at home or when you are on the move. Download the app, use its features to their fullest and learn as much from your mistakes as you can.  --------------  If you enjoyed using the Grammatically Grammar Checker app, then feel free to provide a rating and share with all your friends and family because your reviews matter a lot to us! And dont forget to leave a comment if our app can become any better wed love to hear from you. Our team is working on providing you with the best user experience, and also we are waiting for your feedback. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}