{
"name" : "Learn Months and Days",
"url" : "https://play.google.com/store/apps/details?id=com.mbd.learnmonthsdays",
"package" : "com.mbd.learnmonthsdays",
"category" : "Education",
"description" : "Learn months and days is a free educational app for kids and preschoolers. We understand that kids find it difficult to learn the name of days of week and months in serial order. Also, they have trouble memorizing the spellings of month name and weekday names. Our aim is to educate the little minds where they can learn and remember all the important things which need to be learned at an early age.   This app is all about learning for kids where kids learn how to spell all the days in a week and months in a year. All the days and months have their own flashcards and sound. This learning for child app provides the best way to learn and recognize days of the week and months in the most interactive and interesting manner.  Learn months and days is a two-in-one app that teaches the kids names of days and months at any time of the day. The beautiful audio-visual illustrations grab the attention of the child, as kids memorize the things which they learn by hearing, seeing and touching.   Modes of Learning  Learn Mode - This is the learning mode which displays the names of days in a week and months in a year. Click on the day/month name to listen to the spellings and the number of the day/month in the sequence.  Quiz Mode - This mode is to check the knowledge by answering the different quizzes available in the quiz mode. Simply drag and drop the missing alphabets to complete the name.  IQ Test - This is also similar to the quiz mode where questions would be asked based on the previous learning.   Features  - User-friendly - Clean and simple design - Quiz for fun learning - Designed for kids with simple navigation - Colorful and attractive illustrations for kids to enjoy while learning - All the months and days name presented beautifully with their spellings and pronunciation.  Our aim is to provide an excellent service in terms of quality of work. We will try our best to address any suggestion or feedback. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}