{
"name" : "Apprendre : Informatique, Ordinateur & Développeur",
"url" : "https://play.google.com/store/apps/details?id=com.williems.linformatique",
"package" : "com.williems.linformatique",
"category" : "Education",
"description" : "Avec cette application, apprenez linformatique et lancez vous dans le monde fascinant des technologies. Lisez des dizaines de cours et testez votre connaissance informatique avec les quiz interactifs.  Plus de 500 000 Tlchargement  Vido demo : https://youtu.be/7KEipk_qOAc   Plus    Aucun pr-requis ncessaire  crite en franais facile  dbutant et des enfants  Illustrations en couleur et HD   Recommande Pour    Dbutants en informatique  Etudiants  seniors  chercheurs   professeurs  Personnes avec faible niveau en informatique  Enfants, Momes et Ados  Personnes avec un bas niveau de langage   Retrouvez Les Sections    Composant de bases de lordinateur  Les dtails sur Internet  Les Logiciels  Histoire de lInformatiques  Personnalits Cls  Inventions  Dveloppement web  Programmation  ...  Bien plus  With this application, learn computer science and launch yourself into the fascinating world of technology. Read dozens of courses and test your computer skills with the interactive quizzes.  Over 500,000 downloads  Demo video: https://youtu.be/7KEipk_qOAc   Plus    No pre-requisites required  Written in easy French  beginner and children  Color and HD illustrations   Recommended For    IT beginners  Students  seniors  researchers  teachers  People with low computer skills  Children, Kids and Teens  People with a low level of language   Find The Sections    Basic computer component  Details on the Internet  Software  History of Computing  Key Personalities  Inventions  Web development  Programming  ...  Much more  ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.williems.linformatique.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}