{
"name" : "Saudi Driving License Test - Dallah",
"url" : "https://play.google.com/store/apps/details?id=com.esealed.dallah",
"package" : "com.esealed.dallah",
"category" : "Education",
"description" : "This app is for people, planning to take computer exam for driving license in KSA (DALLAH). Using this application you will be familiar with traffic signs quickly. You can access all the features of this app without connecting to internet: At office, while traveling, at classroom and anywhere you like. This app has all the list of KSA traffic signs. These signs play a vital role in directing, informing and controlling road users behavior in an effort to make the roads as safe as possible for everyone. This makes knowledge of traffic signs essentials. Not just for new drivers or riders needing to pass their computer test, but for all road users, including experienced professional drivers.  This app is available in 9 languages,  English  Arabic  Urdu  Hindi  Tamil  Malayalam  Bahasa Indonesia  Bengali  Sinhala  Application Features:- Road Signs:- List of different types of road signs categorized properly. Points Table:- Lists all the traffic violation points up to date. Computer Questions:- This list some of the common computer questions as available at the Dallah schools of KSA.  Hints for the driving test:- Contains the very important tips better to be known before you go for driving test. This really helps a lot for passing driving tests.(All hints available only in paid version).  Mock Test:-  We have around 15 mock tests, each test comprising of 20 questions each. This test is almost similar to the computer test you will take at any driving schools in KSA. At the end of the test you will know about the result of your test. This will train you to get more confident to pass the computer test (All tests available in paid version only). ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'com.esealed.dallah.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'com.android.vending.BILLING']",
}