{
"name" : "Current Affairs GK for SSC, Railways, Banking, IAS",
"url" : "https://play.google.com/store/apps/details?id=com.hinkhoj.questionbank",
"package" : "com.hinkhoj.questionbank",
"category" : "Education",
"description" : "OnlineTyari is Indias No.1 FREE exam preparation app for government job exams like SSC CGL and CPO, Railways RRB NTPC and Group D, FCI Recruitment, IBPS PO and Clerk, IAS Prelims and state level government exams.   *** Get Unlimited Mock tests for government jobs using TyariPlus Program ***   Popular Exams in 2020 whose content is available : - RRB NTPC - RRC Group D - SSC CHSL (10+2) Exam - SSC CGL 2020 - SSC CPO 2020 - FCI Recruitment 2020 - TET Exams - Bank PO and Clerk 2020   It includes free Current Affairs 2020, GK, E-Books/Magazines (PDF) and online mock tests available in Hindi (), English and Marathi languages. We provide mock tests covering each topic as per the latest exam pattern.   Why OnlineTyari is No. 1 exam preparation App?   - Daily Current Affairs, News Articles and Exam/Job Alerts: Best way to prepare for current affairs 2020 and GK (General Knowledge / Samanya Gyan) by practicing our daily questions and quizzes. You can select by month and topic as per your need.   - Online Mock Tests & Live All India Tests based on latest exam pattern, real exam simulation, and full solution keys: We have several free full-length mock tests and sectional mock tests as well.  - Exam/Job alerts availableat one place. We provide timely exam information, exam pattern, and important dates so that you dont miss anything. - Question Bankto practice questions and answers for each exam covering all topics and difficulty levels. OnlineTyari cover questions for Computer Knowledge, Quantitative Aptitude, Maths, English Learning, Reasoning and Logic, History, Polity, and General Science.  - All study material available inHindi and Englishlanguages. Now prepare in your language of choice.  - Get answers to exam related questions and doubts by thousands of other students and experts in ourstudent community  - Getguidance and preparation tips and tricksfrom experts and toppers on upcoming exams.  How successful aspirants benefit from this App?  - Many of the current affairs and GK topics covered by OnlineTyari have come in the real exams.  - Compare your rank and performance with thousands of other aspirants with practice mock tests. Identify your weak areas and get personalized guidance and recommendation for improving your chances of success.  - Real exam simulation. Improve your timing and accuracy with real exam like the experience of giving online mock tests.  Exams Covered:  SSC and Railways Exams Most popular app to prepare for SSC 2020 exams. SSC CGL, CHSL (10+2), CPO, MTS, Scientific Assistant, Delhi Police Constable, Stenographer, JHT (Junior Hindi Translator). Prepare for SSC and RRB (ALP, Group D and RPF) in Hindi Medium here with topics like English Learning, Quant, Reasoning in the app and covered in free mock tests.    Banking Exams Best app to clear banking exams  IBPS PO and clerk, SBI Clerk, SBI PO, and other banking exams. Bank specific topics like Economy, Reasoning, English Tests and Banking Awareness covered in daily free banking digest.    IAS (UPSC Civil Services)  Crack your IAS Pre and Mains 2020 with guidance from experts and IAS mock tests. IAS specific topics like Ethics & Governance, Optional papers, Case studies available. Chapter wise notes from NCERT for History, Geography, Polity subjects.   State Level Exams Only app providing study material for state level exams We cover exams like RAS and REET, UPPSC, Bihar SSC and BPSC (Bihar), Haryana PSC, MPPSC (Madhya Pradesh), Maharashtra (Police and MPSC). Prepare for Maharashtra State Level exams in Marathi medium.    Extra Features -Works without Internet too. Prepare anytime, anywhere -Prepare for multiple exams with a single app -Bookmark all important questions, articles, job alerts to view later Visit https://onlinetyari.com for details. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.READ_PROFILE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.GET_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'android.permission.READ_SYNC_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.GET_TASKS', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.NETWORK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_DOWNLOAD_MANAGER']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.NETWORK', 'android.permission.SEND_SMS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_DOWNLOAD_MANAGER', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}