{
"name" : "Colorful Cotton Candy Maker - Rainbow Sweety Games",
"url" : "https://play.google.com/store/apps/details?id=com.funpop.android_cottoncandynew",
"package" : "com.funpop.android_cottoncandynew",
"category" : "Education",
"description" : "Colorful Cotton Candy Maker - Rainbow Sweety Game is the most fun free sweet game for girls. Sweet cotton candy is a kind of famous food and snack among fair food, street food, and circus food. Girls, now lets make cotton candy art to satisfy your personality and creative design in the cotton candy shop! Unbelievable! You can DIY rainbow cotton candy with yummy flavors on the candy spinner! AND, design the surprise cotton candy arts you like in this treat shop! Little chef, what are you waiting for forMake sweet candies in the cooking games for kids right now!   Cotton Candy Store Game Features:  1.Undoubtedly, most children like a candy store! Whatever boys or girls! Cause there are kinds of flavored candies in the candy shop! Like candy corn, candy cane, rock candy and so on. But most kids buy cotton candy in free kids games for girls. 2.Fluffy sugary cotton candy is the most popular candy desserts sold in candy store around the carnival! Everyone loves sweet cotton candy in candy games. 3.Fantastic! You can make and design your cotton candy art in girl games for free! Trust meYou havent seen such cute sweet maker in any other cotton candy shop yet! 4.Little white bunny cotton candy, Yellow duckling cotton candy, and Green frog cotton candy are all here!!!DIY rainbow design by the cute sweet maker in this candy games for girls! 5.Now, you can pour colorful sugar into cotton candy maker to design creative cotton candy art. Make sweet cotton candy with colorful candies right now! 6.Many kids shout I want candy and rush into the cotton candy store! Such a sweet sale! Pink, blue, yellow, purple, unicorn rainbow.....so many sweet sugars on the candy spinner! 7.While glitter cotton candy maker works, candy flying around the rod. OMG, you make the best sweet cotton candy art even better and sweeter than that sold in a chocolate candy shop!  8.Time to DIY sweet dessert art! Candy eyes, cookie mouth, lollipop rod, glitter candy stick, cute bow ties...design your cotton candy art in the cooking games for girls! 9.SO FUN!DIY candy cheek, cookie cheek, fruit cheek for all the sweet cotton candy art! Your cotton candy food stand is the most popular food maker in this food street. And your sweet street food is also the yummy carnivals treats in the street food game. 10.Surprise! Tons of sweet decorations and glitter outfits are here for lovely kids to create sweeter sparkly cotton candy art! It is so amazing! 11.Bring your shining cotton candy arts in the funfair, show your creation to every candy shop and cotton candy maker! Your cotton candy is a unique and sweet one in the candy world!  12.Not only sweeten your mouth, but cotton candy also brings your life color, and happiness. Sweet girl, be a good candy maker, DIY and design sweet cotton candy in the girl games for kids free right now!  Enjoy the sweet cotton candy game and download the candy games for girls. Be a shining designer to DIY the best cotton candy arts! Play the fun free girl games with your whole family!  ABOUT FunPop FunPop specializes in kids games on the mobile platform. We are aiming to provide innovative & educational games for the whole family. We help them to learn basic life skills and good habits through our games.  Visit us: http://www.funpop.com.cn Watch us: https://www.youtube.com/c/FunPopMedia  CONTACT US  Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@funpop.com.cn ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'com.funpop.android_cottoncandynew.permission.C2D_MESSAGE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}