{
"name" : "Build & Learn Korean Vocabulary - Vocly",
"url" : "https://play.google.com/store/apps/details?id=com.simyasolutions.vocly.ko",
"package" : "com.simyasolutions.vocly.ko",
"category" : "Education",
"description" : "Vocly - Build, Test, and Improve Your Vocabulary  Vocly is the quicker, easier way for you to learn vocabulary in 50 languages - all in one app. Put the fun back into language learning as you learn hundreds of important words and phrases using games, quizzes, and tests that will help you on your way to fluency. Looking to travel abroad or just interested in learning something new? Go with Vocly.  Test Yourself Learn words from over 100 different topics using a variety of different techniques that will help you to remember. From Flash Cards to Listening Games to Quizzes, Vocly will keep you on your toes.  Structure Your Learning Keep yourself focused by setting reminders that motivate you to learn. As your vocabulary grows, Vocly lets you track the progress you have made and review what you have covered in the past for optimal learning.  Choose from 50 Languages Vocly lets you learn vocabulary for 50 different languages, including Chinese, Japanese, Thai, Tagalog, Vietnamese, Serbian, Khmer, German, Korean, and more!  Vocly helps you to:  - Access 50 Languages from 1 App - Test Your Speaking and Listening Skills - Train Your Memory with Flash Cards - Improve Pronunciations Using Transcriptions - Review and Track Your Progress - Get Motivated with Learning Reminders - Enjoy Your Time Learning with Interactive Games  This is more than a translation app, this is your opportunity to learn a new language by building your vocabulary.  Available languages in Vocly:  Thai - Japanese - Korean - Chinese - Vietnamese - Spanish - German - Tagalog - Khmer - Russian - Afrikaans - Arabic - Bengali - Bulgarian - Burmese - Cantonese - Croatian - Czech - Danish - Dutch - English - Estonian - Farsi - Finnish - French - Greek - Hebrew - Hindi - Hokkien - Hungarian - Indonesian - Italian - Kannada - Lao - Lithuanian - Malaysian - Mexican - Mongolian - Nepali - Norwegian - Polish - Portuguese - Punjabi - Romanian - Serbian - Slovak - Swahili - Swedish - Tamil - Turkish - Ukrainian - Urdu - Brazilian Portuguese ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}