{
"name" : "Visual Physics - IIT JEE Main & Advanced / NEET",
"url" : "https://play.google.com/store/apps/details?id=com.visualphysics",
"package" : "com.visualphysics",
"category" : "Education",
"description" : "BE CURIOUS, GREAT RANK WILL FOLLOW. Plan, Learn, Solve.  500+ Theory Videos with Powerful Visualisation for Crystal-Clear Understanding 1800+ Selected Problems with Video Solution to Master Problem Solving Access Videos Offline, Learn without online distractions (*Internet connection once in a week will be required).  Just Watch videos, make Notes, Try Problems, Understand Solution, Practice some more and you are done for your exam.  Do you find IIT-JEE / NEET Physics hard to learn? Do you think that you have learnt the concepts but not able to solve the problems?  Then this course is for you. Physics is Easy with Visual Physics..  It is a revolutionary video lecture course to grasp the concepts easily, with in-depth understanding and to be able to solve questions faster, even the tough ones.  How it will help?  Cracking exams like JEE Main & Advanced, NEET, etc. is 30% learning and 70% practice. Simply, you need to invest most of your time in practice.  But what happens in general? You keep trying to learn the theory for most of your time and very less time is left for practice. And you just wont be able to solve the questions, if you havent grasped the concepts first.  Visual Physics can teach you concepts in less than 30% of your time.Then you can directly go to first understanding video solution of different types of problems and then to solving other others yourself. Once you complete a chapter with Visual Physics, there is no question you cant solve.   Features.  1. Comprehensive course with segregated chapters.  2. Powerful visualisation for in-depth & crystal-clear understanding.  3. Basic and advanced questions for practice, with video solution.  4. Online doubt support, ask questions from any book/question bank.  How it is different from other IIT JEE/NEET Video lectures?  In leveraging the technology and improvised learning process.  Other types of video lectures are mostly the classroom recordings which do not provide you any extra benefit; other than, that you can study and revise anytime. And if you are already enrolled in any JEE/NEET Coaching Institute, then they are just more of the same class, and they are not going to help if you are already finding it difficult to clear your concepts at your coaching institute.  We have used technology to provide you with powerful visualisation; so you can understand, whats really happening. Teaching method has been improvised, to make it easier for you to grasp and remember theory. You will really need to try it, to realize the difference.   Does visualisation really helps?  Yes, it does. Physics is a subject of visualisation; those you can visualise better, understand better.  When you read the concepts from books or learn from the blackboard in class, your mind tries to make a picture of whats happening on its own. Sometimes you get the picture, sometimes you dont.  And it is absolutely necessary to get the picture if you really want to understand the concept first hand.  Visual Physics gives you a clear-cut picture of each and every concept, plain & simple.  How online doubt support works?  We are pretty much sure, that you will get very few doubts once you start using Visual Physics. And when you have them, you just need to post them at in-app chat.  Our experts will attend to your query and provide the response. We focus on discussing the problems rather than simply providing the solution so that you can understand the underlying concepts more clearly and be able to solve the problem on your own.  Web: https://www.nlytn.in/  Sample Videos on YouTube: https://www.youtube.com/user/Visueaz  Happy Learning :)  *This is a paid course. You get 7 days of free trial to assess the course first. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.visualphysics.permission.C2D_MESSAGE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS']",
}