{
"name" : "Colors & Shapes - Kids Learn Color and Shape",
"url" : "https://play.google.com/store/apps/details?id=com.rvappstudios.shapes.colors.toddler",
"package" : "com.rvappstudios.shapes.colors.toddler",
"category" : "Educational",
"description" : "When you look out the window, what do you see? Colors and shapes, green trees, square windows, a whole world of things to identify! Colors and Shapes is a fun and educational game for preschool children that helps teach object matching and color recognition skills. Its a beautiful world out there. Help your children learn to recognize and draw it!  Color and Shape focuses on basic tracing, matching, and building skills kindergarten kids need to train. It features a number of unique mini-games designed to increase a childs ability to recognize and match shapes, identify and pair up colours, and even solve puzzles through simple touch screen interactions. Its incredibly easy to use and provides a fun learning environment kids will love.  Colors and Shapes includes the following mini-games:   1. Painting - Kids love colouring games! Fill in the blank objects with all kinds of fun paint, then identify the objects one by one. A fun way for children to recognize colours and shapes.  2. Collecting - A fun and challenging game where children tap the correct colored objects and gather them in a basket!  3. Look-alikes - Match up the different items by picking the ones with the same colour. A challenging but fun way to learn colours and drawing skills.  4. Matching - Outlines are at the top of the screen, and a handful of shapes are at the bottom. Challenge your kids to match them up!  5. Tracing - Help your kids trace shapes by following the outline on the screen. Great for teaching shape patterns and recognition.  6. Building - Drag and drop animated pieces on the screen to create a shape in the middle.  Colors & Shapes - Learn Coloring For Toddler Kids is a great learning experience for toddlers, preschoolers, kindergarteners, and children of all ages. Parents will appreciate the customizable difficulty settings. Kids will have a great time learning to recognize different colors and shapes, completing all of the mini-games, and earning sticker rewards!  Best of all, Colors and Shapes is absolutely free! No annoying third party ads, no in-app purchases, just pure educational fun for you and your family.  Note to Parents: When creating Colors and Shapes, we wanted to create the most entertaining and educational game possible for both parents and their children. Were parents ourselves, and we know how frustrating intrusive third party ads and in-app purchases can be. Thats why we decided to release this game for free. You and your child can enjoy an uninterrupted learning experience without having to worry about micro-transactions and the like. Just sit down and start learning. Its exactly the sort of educational experience we want for our children, which is why we know your family will love it, too!  Best wishes from the parents at RV AppStudios ",
"desc_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}