{
"name" : "Tally Certification Content",
"url" : "https://play.google.com/store/apps/details?id=com.tallyeducation.ereader",
"package" : "com.tallyeducation.ereader",
"category" : "Education",
"description" : "Tally Certification Content app by Tally Education is a platform where you can access latest Tally content created by subject matter experts based on the syllabus of Tally certifications.  Simply launch the app, download the content and start learning on the move. The enriched experience of learning through videos and eBooks would brush-up your Tally skills - leading to a better performance in the certification exams and making you job-ready.  Who can access the Tally Certification Content app? Tally Certification Content app is available exclusively for users who have enrolled for Tally Certification at one of the Tally Educations empanelled centres. To get the app login details, enrolled users first need to access the e-Content web platform from Tally Education Portal.  Not yet enrolled for Tally Certification? Contact your nearest empanelled centre to get enrolled!  How can I log in to the app? Log in to Tally Education Portal and click the E-Content tab. Once you access the e-Content web portal, you will receive your app login details. The app library will display content based on the certification you have enrolled for.   Here are some of the app features available exclusively for users enrolled for Tally Certification:  Latest Tally Content:  Access authentic and latest content based on the syllabus of Tally certifications such as TallyACE, TallyPRO, TallyGURU, GST using Tally, Financial Accounting using Tally and so on.  Get periodic content updates based on the latest Tally release.  Be up-to-date and compliant with the market changes by learning about GST, e waybill, current tax and accounting structures and so on.  Enriched Learning Experience:  Learn Tally content prepared by subject matter experts in a variety of formats such as eBooks and videos.  Add highlights, bookmarks, notes, jump to a page/topic, and search for a topic within the eBook for a great reading experience.  Stream animated videos on important Tally concepts and revisit them anytime.  Sync content access and pick up where you left across devices.  Offline Content Access:  Download eBook content on your app for viewing it offline and learn anytime, anywhere.  Improve your performance grades in the certification exams to get a verifiable Tally certificate.  Improve Job Prospects:  Get recognized and certified for your Tally knowledge and be the front-runner for Tally and accounting related jobs. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.BROADCAST_STICKY', 'com.tallyeducation.ereader.permission.C2D_MESSAGE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.INTERNET', 'ANDROID.PERMISSION.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.RECORD_AUDIO', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'ANDROID.PERMISSION.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}