{
"name" : "Offline Advanced English Dictionary and Translator",
"url" : "https://play.google.com/store/apps/details?id=com.fsapps.offline.english.dictionary",
"package" : "com.fsapps.offline.english.dictionary",
"category" : "Education",
"description" : "Are you waiting for offline advanced Dictionary? There are thousands of Dictionary Apps you can find on Play Store but offline Advanced English Dictionary is the leading and user trusted English Dictionary Now you can download. Offline English Dictionary is a free offline dictionary (Vocabulary). Advanced English Dictionary contains 148,000+ words with Free Multilingual Paragraph Translators Apps. if you studying English and you want to know the meaning of word. this app has huge offline database of English so no matter you can search and find the meanings of your respective words. it is 100% free and complete offline English Dictionaries. There is auto suggestion so you need not type full words. you can also enter a word using Speech to text feature.   English to English Detail  The app is it find meanings of English in English with full detail. Translator Apps - Translate whole paragraph to any language that you want using this Translator app (with translate offline feature).  Features of the Dictionary:   More than 148000+ Words with Meanings and Examples.  Free Multilingual Translator (with translate offline feature) from any language.  Detailed word Definitions.  Antonyms (Opposite words).  Synonyms (Same words).  Nearby Word (Related words).  Hyponym (More Specific Meaning).  Hypernym (Broad Meaning).  Enter Word from your Voice.  No internet connection required (for dictionary).   Fully Offline Dictionary.   Auto show Daily Word of the Day.   Auto Suggestion Word for Searching.  Pronounce Words and Voice Search.   British & American English Speaking Words.   Maintain History and Favorite word.  Easily Share, Copy Words or Definition.   Very simple and is user friendly.  Added English Learning feature.  Added English Grammar and English Tenses.  Added MCQs Quizzes related to English Learning.  More then 100 of topic of English is added.  Added translate offline and OCR feature.  Scan and translate any Image (contain text).  Read and translate any Text (using share feature).  Its the Best offline advanced English Dictionary and Translator app for students, teachers, professionals, travelers, learners, Kids, boys and girls, business mans, players.  Note:   English Dictionary app is a free and have some minor ads, so you will not need to worry about that.   The Dictionary App is already in development phase. In case of any problem, please contact and send us an e-mail and review briefly with the problem.  Permissions: Internet permission: is required for text translation, for online dictionary, and ads which are supported by trusted vendors. Mic permission: is required for voice dictation feature. Storage permission: is required for read image and text file and then translate.  Learning English and Share English Dictionary app with your friends via WhatsApp, Facebook, Skype, we-chat, Viber, and as Text etc. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}