{
"name" : "Correct Speak - English Language Grammar Check",
"url" : "https://play.google.com/store/apps/details?id=com.speak.better.correctspelling",
"package" : "com.speak.better.correctspelling",
"category" : "Education",
"description" : "Short list of a language application features:  Contextual spelling checker - always write without errors! Immediate correction of your speech - nice, quick and simple! Verification of spoken language - speak at the level of native speakers!  Download the Correct Spelling english and other languages app right now on your smartphone or tablet and demonstrate to all around you impeccable knowledge of the foreign language!  Actually, it doesnt really matter, what was your reason to start training: you want to get a raise and you need to speak good English to be able to communicate with your new colleagues? Maybe you are training Spanish to become better in school or university? You just moved to another country, where the native language is English, French or Italian? Or you are going to visit someplace, where people mostly speak English or German? Is the reason for your brainstorm - the invitation from your Russian friend to visit Siberia, and now you need to learn some basic Russian to be able to speak with new people? Maybe you are interested to read the English books in original or wondering to check the global news on the Internet? What if you play the online game, where are foreigners from all over the world, speaking Spanish, French, Chinese, German, Portugal, and Italian? Basically, you may have every one of these reasons one by one to start to learn a foreign language!  The main menu of the training app suggests four options. Lets take a quick look at them:  The first tool is designed to help you check your pronunciation of foreign words. Tap on the micro and spell the word or a phrase in the foreign language and the application will show it for you. Pay your attention: this function needs Internet access to work correctly!  There is one more thing you can do in this tab: choosing one of the twenty-eight available languages to study, including English, Spanish, Bulgarian, French, Japanese, German, Italian and even Hindi! Can you receive this kind of epic language training in school?  The second tab is devoted to helping you fix the pronunciation if its needed. Tap the micro button and spell the word or the phrase, and the language app will remember it. Then tap the second button, and check how you speak it out: whether the intonation right or do you have an accent? Train your brain and memory, comparing the results and feel yourself more and more confident, while doing you learn!  Going to the third tab, you get one of the most required instruments to learn a new language: writing and spelling. Lets check out, how it works: for example, you have discovered the new English word, but you dont know, how to read and pronounce it correctly. You type this English word in the top window, and the application speaks it for you out of loud!  As a bonus: you will be gratefully surprised, how clear in the pronunciation: the Spanish, French and Italian languages are emotional, Russian and german are clear in spelling, and the English have neither the American accent nor the British. Check this awesome training tool on your own, and you will make sure, that not a single school or language course will be able to teach you to speak foreign languages so fast, simple and perfect!  The last, but not least tool is settings. Over there you can check and tune the speed of your pronunciation. Make the training of foreign languages comfortable and suitable exactly for you!  Thus, the Correct Spelling Application is welcoming you to enjoy the process of training your brain and studying foreign languages together. Learn every language you want at any time and any place, dont be afraid to speak with your friends and colleagues, feel yourself skilled enough to watch the favorite series. And be pretty sure: if you want to speak the foreign language fluently, nevermind whether it is English or Hebrew, Russian or greek, you will not find a better application to start the process of studying then this one! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
}