{
"name" : "Learn English - Listening Master",
"url" : "https://play.google.com/store/apps/details?id=com.masterkeygames.listeningmaster",
"package" : "com.masterkeygames.listeningmaster",
"category" : "Educational",
"description" : "English Listening Master will help you understand English better, improve your English language skills and help you learn real English spoken in everyday situations.   English Listening Master is the first application of its kind to make a game out of improving your English listening skills through dictation using real English conversations in a fun, enjoyable and educational way.  Learn real English and practice your English listening skills by typing the letters of the words you hear or tapping the words of the audio to form the sentences.   English Listening Master is a fun and educational game for kids, seniors and English language students of all ages who want to learn English and improve their listening skills in a more entertaining way.  Perfect classroom audio listening recordings dont prepare you for listening in the real world.   English Listening Master uses audio from thousands of different native speakers in real settings complete with background noise to make the task more realistic, more practical, and more effective.  How do you play?  Its easy. Listen to the audio, and tap or type the words you hear to form the correct sentence.  With this entertaining dictation game, you will learn English and practice listening in a fun way.   With three modes of difficulty to write the sentences and four levels of sentence difficulty, Listening Master is great for everyone from the elementary level right up to the most seasoned and skilled English ears.  What options are there to write what you hear?  Dont worry, you can choose between three options depending on how much help you need.   In Easy mode, you have the words written for you on the screen and you just have to tap the words you hear in the correct order.  In Competent mode, you will only have the letters of the words, and you have to spell out each word you hear by typing the letters in the correct order.  In Expert mode, you wont have any help, and you will have to put your listening skills to the maximum test.  Which one will you choose?  The Levels:English Listening Master has four levels: Beginner, Competent, Professional, and Expert  Beginner: Ideal for children. This level contains the easiest sentences with the fewest words to tap or spell.  Competent: This is where things start to get harder. This level is great for students who are beginning their English language learning adventure.  Professional: Great for students with a solid base in English who want to keep their skills up to date.  Expert: Only for those with the most proficient English skills. Are you one of them?  Do you have what it takes to become the next Listening Master?  With Listening Master youll improve your real English listening and conversation skills while you play and have fun testing your English.   With single player and multiplayer mode, you can practice alone, challenge your friends or classmates as well as challenge other players from around the globe.  Whos got the best ear for English in the class, family or among your friends? Learn English with a smile on your face with English Listening Master ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'com.masterkeygames.listeningmaster.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}