{
"name" : "Améliorez votre français (sans connexion)",
"url" : "https://play.google.com/store/apps/details?id=com.francais.archigenie.ameliorez_francais",
"package" : "com.francais.archigenie.ameliorez_francais",
"category" : "Education",
"description" : "Cet ouvrage de la collection **des leons GRAMMAIRE - VOCABULAIRE - CONJUGAISON avec Exercices** sadresse  des tudiants adolescents ou adultes, de tous les niveaux en Franais Langue trangre, pour un travail en classe ou en autonomie.  Lapplication est destine  vous aider  amliorer votre orthographe, votre grammaire et ventuellement dcouvrir de nouveaux mots en franais. Cet ouvrage contient tout ce quil faut pour amliorer votre franais tout en vous amusant. Venez perfectionner votre matrise du franais grce a ses exercices interactifs!  Cet ouvrage comporte plus de 169 leons et 170 exercices avec corrections.  Les leons: Temps de lindicatif Aperu des temps verbaux Prsent Pass compos Imparfait Imparfait/Pass compos Pass rcent Pass simple Plus-que-parfait Pass antrieur Futur proche Futur simple Futur antrieur Verbes irrguliers Verbes Avoir/tre Infinitif Participe/Grondif Verbes pronominaux Passif Impratif Conditionnel Subjonctif Noms Genre Pluriel Articles Dterminants et pronoms Pronoms personnels Dterminants et pronoms possessifs Pronoms rflchis Pronoms relatifs Dterminant et pronoms interrogatifs Dterminants et pronoms dmonstratifs Dterminants et pronoms indfinis Pronoms adverbiaux Adjectifs Terminaisons de ladjectif Comparatif et superlatif Place de ladjectif Adverbes Types dadverbes Drivation Degrs de comparaison des adverbes Place des adverbes Prpositions Structure de la phrase Phrase affirmative simple Phrase ngative simple Phrase interrogative Discours indirect Phrases complexes Proposition relative Propositions compltives Interrogation indirecte Propositions circonstancielles Proposition conditionnelle Proposition participiale Mots  ne pas confondre Homophones grammaticaux Homonymes Paronymes I-4 Autres  cause de/grce  aller/venir allumer/illuminer amener/emmener an/anne apporter/emporter avant/devant bien/bon comme/comment/combien comprhensif//comprhensible connatre/savoir cours/classe devoir/falloir dcade/dcennie coute/entendre emprunter/prter en/dans encore/toujours il y a/depuis magasin/magazine mettre au jour/mettre  jour mieux/meilleur neuf/nouveau parler/dire pleurer/pleuvoir pouvoir/savoir puis/depuis  rentrer/revenir/retourner se rappeler/se souvenir visiter/rendre visite voir/regarder Les conjonctions Nombres, date et heure Les nombres cardinaux Les nombres ordinaux Les fractions Lheure La date Les saisons le printemps Le printemps: Expressions Lt Lautomne Lautomne: Expressions Lhiver Lhiver: Expression Jours de ftes Le carnaval Lanniversaire : Expressions Halloween Halloween : Expressions Nol Nol: Expressions En ville Au restaurant Au restaurant: Expressions Au parc Au parc: Expresions Sur le chantier Sur le chantier: Expression Chez le coiffeur Chez le coiffeur: Expression Le corps humain Le corps humain (1) Tte, main, bras Ventre, jambe, dos Le corps humain (2) VII-2-1 Doigt, paule, cheville Pied, pouce, cou La tte Cheveux, barbe, oreille Oeil, bouche, nez Le visage Dent, langue, lvre Sport Les jeux olympiques dhiver Jeux olympiques dhiver: Expressions Le football Football : Expressions Le tennis Le tennis : Expression Les checs Les checs : Expressions Voyage  laroport Lhtel Lhtel: Expressions La visite guide La visite guide: Expressions La gare La gare : Expressions La ponctuation La virgule Le point Les points dexclamation et dinterrogation Les deux points Lapostrophe Le point-virgule Le tiret Le trait dunion Les guillemets Tableau rcapitulatif des espaces Figures de style Point de vue narratif Les registres de langue Dcrire une image  Lapplication contient un Conjugueur regroupe environ 7500 verbes, vous permet de conjuguer tous les verbes franais de manire autonome sans connexion Internet.  Lapplication fonctionne galement sans connexion internet. *Test conjugaison  Cet ouvrage est un livre de poche, meilleur application apprendre franais gratuit, francais facile. Contient grammaire definition, This book from the ** GRAMMAR - VOCABULARY - CONJUGATION with Exercises ** collection is intended for teenagers or adults, of all levels in French as a Foreign Language, for work in class or independently. The application is intended to help you improve your spelling, grammar and possibly discover new words in French. This book contains everything you need to improve your French while having fun. Come and improve your French skills thanks to interactive exercises!  This book contains more than 169 lessons and 170 exercises with corrections.  The lessons: Indicative time Overview of verbal times present Perfect tense Imperfect Imperfect / Past compound Recent past Simple past More than perfect Past Near future Future tense Future Irregular verbs verbs To have to be Infinitive Participle / gerund Reflexive verbs Passive Imperative Conditional Subjunctive names Kind Plural goods Determinants and pronouns Personal pronouns Determinants and possessive pronouns Reflective pronouns Relative pronouns Determinant and interrogative pronouns Determinants and demonstrative pronouns Determinants and indefinite pronouns Adverbial pronouns Adjective Terminals of the adjective Comparative and superlative Place of the adjective adverbs Types of adverbs Derivation Degrees of comparison of adverbs Place of adverbs prepositions Structure of the sentence Simple affirmative sentence Simple negative sentence Interrogative sentence Indirect speech Complex sentences Relative preposition Complementary proposals Indirect questioning Circumstantial proposals Conditional Proposal Participatory proposal Words not to be confused Grammatical homophones namesakes paronyms I-4 Other because of / thanks to go ahead turn on / illuminate bring bring year / year bring / take before very good as / how / how much understanding understandable // know / learn course / class need / have to decade / decade listening / hearing to borrow to lend inside yet / ever there is / since store / Magazine to update / update better new / new speak / say cry / rain Can know then / from go / back / return remember / remember visit / visit to look to see The conjunctions Numbers, date and time The cardinal numbers Ordinal numbers Fractions Time The date Seasons spring Spring: Expressions summer Autumn Fall: Expressions Winter Winter: Expression Holiday days The carnival Birthday: Expressions Halloween Halloween: Expressions Christmas Christmas: Expressions In the city At the restaurant At the restaurant: Expressions At the park At the park: Expresions On site On the building site: Expression At the hairdresser At the hairdresser: Expression The human body The human body (1) Head, hand, arms Belly, leg, back The human body (2) VII-2-1 Finger, shoulder, ankle Foot, thumb, neck The head Hair, beard, ear Eye, mouth, nose The face Tooth, tongue, lip Sport Winter Olympic Games Olympic Winter Games: Expressions Football Football: Expressions Tennis Tennis: Expression chess Failures: Expressions Trip At the airport The hotel The hotel: Expressions The guided visit Guided tour: Expressions The train station Station: Expressions The punctuation The comma Point Exclamation and interrogation points The two points The apostrophe The semicolon Dash The hyphen The quotation marks Summary table of spaces Figures of speech Narrative point of view Language registers Describe a picture  The application contains a Conjugator gathers around 7500 verbs, allows you to conjugate all French verbs independently without an Internet connection. The application also works without internet connection. * Conjugation test  This book is a pocket book, best application learn french free, french easy. Contains grammar definition, ",
"desc_perms" : "['android.permission.READ_CALL_LOG', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}