{
"name" : "Mimo: Learn coding in HTML, CSS, JavaScript & more",
"url" : "https://play.google.com/store/apps/details?id=com.getmimo",
"package" : "com.getmimo",
"category" : "Education",
"description" : "Learning to code has never been so easy and fun! Download Mimo, the most popular coding app with millions of users, and learn to code with the Best Self-Improvement App of 2018 on Google Play!  With Mimo, you can learn programming and build websites and apps in just five minutes per day. You will learn programming languages like Python, JavaScript, Java, HTML, CSS, Swift, Kotlin, C++, SQL, PHP and more! Our programming courses and lessons are suitable for everyone, even with no prior coding knowledge and experience.  Mimo makes learning to code and diving into computer science as fun and easy as possible. With the Learn to Code curriculum, youll dive into building websites with HTML, CSS, and JavaScript. With the Data Science with Python curriculum, youll learn how to analyze data with Python and SQL, and even learn how Google and Netflix use big data to recommend websites or movies.  Coding for beginners and advanced coders  By setting aside just five minutes per day, youll go through the code classes and learn the basics of JavaScript, HTML, CSS, Python, and SQL. Along the way, youll build websites and apps by writing real code. Your curriculum will consist of bite-sized exercises that make it possible to start without any prior knowledge but are at the same time also suitable and interesting for advanced coders.  No need to be afraid of coding: you can code, too! And we will be happy to guide you along your personalized coding journey if you join millions of coders who are already learning programming and data science with Mimos courses!  TechCrunch and The New York Times agree that, with Mimo, everyone can learn to code   This way you can work learning to code into your daily routine, whenever you have a few minutes of downtime.  TechCrunch   The apps lessons are bite-size to make it easy to squeeze coding into your busy day.  The New York Times  Master the most popular programming languages in the world. Learn to build websites and apps with:  HTML, CSS, JavaScript, Python, Java, Swift, C++, SQL, PHP and lots more!  Learn at your own pace  Mimos interactive curriculum and bite-sized code lessons make it as easy as possible to learn at your own pace: coding tutorials and coding challenges are there for you to discover whenever you have a few minutes.  You can write real code on our mobile code editor that works like an IDE and helps you run code wherever you are, compete with the Mimo coding community, solve coding challenges, learn a programming language, and much more at your own pace!  Does that sound like a lot? No worries! Well help you figure out where to start and where to go. Along the way, you can keep track of your progress, collect achievements and badges, and join a community of millions of learners.  You can code, too! ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.getmimo.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
}