{
"name" : "Robot game for preschool kids",
"url" : "https://play.google.com/store/apps/details?id=com.iabuzz.Robot",
"package" : "com.iabuzz.Robot",
"category" : "Educational",
"description" : "Get creative and make your own cartoon Robots by adding and matching odd objects from the house and garage.   This free puzzle and maze style app can be educational or simply extra fun. You will be learning or improving skills such as problem solving; quick decision making; creative and flexible thinking; fine-motor and working-memory skills; and hand-eye coordination.  You can make a heart out of a fan, head out of a light bulb, face out of a radio, head out of a tin can, hair out of broom, heart out of a clock, legs out of springs, body out of building blocks, heart out of animal dog bone, body out of soft toy, head out of a helmet, body out of dart board, horns out of animal antennae, etc. With your imagination and over 200 parts (garden tools, rusty gear, toys you play with, common home objects) to combine, the build possibilities are endless. Join the legs, body, arms and head - and bring the mechanical robot to life!  Then race the Bot in a childs room, finding your way through the building blocks, toy cars, bouncing balls, musical instruments, etc. Fly, jump, bounce, change directions, speed up - make sure your Robot is built perfectly. On your way collect the 3 stars and find the red door to meet your friend robot.  Or you can choose the Solar System, but be careful of the obstacles in the form of spaceships, comet, astronaut, satellite, etc. Move up and down, right or left and catch the stars. And if you hit any of the obstacles then your robot parts can break. So look out for the shield and get it to have a protective layer around and nothing can hit the robot then.  The Blueprint theme is the newest addition to our game. Fly your cartoon Robot around the maze to reach the trophy and collect three stars o your way. But do not get too cozy as you have some rocks, planets, rockets, spaceships and UFO to stop you from reaching your goal.  Then we also added the Racing game. Four tracks, three stars and many robot obstacles is what you will get. Fly high in the sky and change lanes by simply placing your finger where you want to go. There are other Robots racing with you and so be careful not to bump into them.  This educational puzzle game is action packed with funny animations, cute graphics, robo-balloons to pop, unique background music, etc. - all to make you have great fun while you are playing and learning.  Privacy Disclosure:  As parents ourselves, iAbuzz takes childrens wellness and privacy very seriously. Our app, does not collect personal data or connect to social media websites.  Feedback Please: If you have any feedback and suggestions on how we could further improve the design and interaction of our apps and games, please visit our website www.iabuzz.com or leave us a message at kids@iabuzz.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}