{
"name" : "Ayatul Kursi with Translation and Audio Recitation",
"url" : "https://play.google.com/store/apps/details?id=com.ayatulkursiwithtranslations",
"package" : "com.ayatulkursiwithtranslations",
"category" : "Education",
"description" : "Ayat al Kursi app is one of the beautiful applications in the Islamic apps. This beautiful Ayat al kursi app has many beautiful features in it. Audio, transliteration and most importantly there is a facility of the translation of all languages in it.   Ayat al kursi is the most esteemed and dignified verse of the holy Quran. Ayat al kursi is the 255th verse of the second Surah of Quran. This verse speaks about that nothing is comparable to Allah almighty. Ayat al kursi is widely memorized throughout the all Muslim world. It is often recited by the Muslims before setting out on a journey ore before going to sleep. Ayat al kursi is considered as one of the most powerful verses of the holy Quran, because when it is recited, greatness of Allah almighty is believed to be confirmed. There are many more benefits of Ayat al kursi which cannot be confined in a few lines.   Above said facts urged us to develop a beautiful application after the name of Ayat al kursi to help the Muslims of the world. There are following main features of this beautiful application.   Features   Translation: - In Ayat al kursi application, we have included translation of the main languages of the world (English, Urdu, Hindi, Bengali, Turkish). Muslims can recite Ayat Al Kursi and can get the meaning of them at the same time.   Transliteration: - There is another beautiful feature in this application. That is transliteration which will help people in pronouncing the pious words of Ayat al kursi. This will largely help those people who are new Muslims or whom basic language is not like that Arabic alphabets.   Audio: - In Ayat al kursi app, audio of the Ayat al kursi has also been included. Sometimes, people prefer to listening Quran or holy things like Ayat al kursi rather than reciting by themselves. This audio feature will help them a lot.   Share: - you can share this beautiful application with your beloved once through twitter, Facebook, what Sapp, messenger and via other social media channels to get the blessings of Allah Almighty.   Download this beautiful application and pray for our efforts to do the same activities in future. Your suggestions and feedback will be appreciated. Thanks. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.ayatulkursiwithtranslations.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}