{
"name" : "Guitar 3D - Basic Chords",
"url" : "https://play.google.com/store/apps/details?id=com.polygonium.basicchords",
"package" : "com.polygonium.basicchords",
"category" : "Education",
"description" : "Easy visual learning in vivid detail! Learn chords strums and arpeggios in 3D very easily with an amazing graphic detail. This is a GUITAR LEARNING APP, NOT A GUITAR GAME!  Feel like a real guitar teacher is in front of you!  Train yourself! Observe correct hand and finger movements in 3D. Learn how to play guitar in a very short time with quizes and composing your own music!  This app is just for guitar education from the creators of Guitar 3D - Final Guitar to guitar lovers who have trouble finding a real guitar teacher in their location.  Hard to learn guitar chords with photos or videos? Need to see the finger positions from different angles?... Then come and enjoy learning basic guitar chords with real-time 3D interactivity. Observe the correct finger movements between chord changes. All animations and real guitar audio samplings are made with academic musicians.  Features of Guitar 3D Basic Chords trainer:   3D Camera to observe finger positions (fingerings) from different views.  3D Hand and fingers to demonstrate correct positions on guitar.  Finger transitions between chord changes (chord progressions).  Strum patterns and strumming animations.  Arpeggios patterns (finger style) and p-i-m-a animations.  Left Hand option for 3D view & also for chord charts.  Option to change chord names to A-B-C-D etc or La - Si/Ti - Do - Re etc.  Lessons and Quizzes for guitar chords.  Guitar chords on staff.  Guitar chords on chart.  Basic and common guitar chords for beginners.  Bar (barre) chords.  Example chord progressions.  Save & Load your chord progressions.  Real guitar samples for each chord.   Guide for strumming & arpeggios patterns  Speed control  Auto play & loop  Timeline for chord chains     Basic chords demonstrated on guitar   Am (A min, A minor, La minor)  A (A maj, A major, La major)  A7 (A Dominant Seventh, La Dominant Seventh)  B7 (B Dominant Seventh, Si Dominant Seventh)  C (C maj, C Major, Do Major)  C7 (C Dominant Seventh, Do Dominant Seventh)  Dm (D min, D minor, Re minor)  D (D maj, D major, Re major)  D7 (D Dominant Seventh, Re Dominant Seventh)  Em (E min, E minor, Mi minor)  E (E maj, E major, Mi major)  E7 (E Dominant Seventh, Mi Dominant Seventh)  F (F maj, F major, Fa major)  G (G maj, G major, Sol major)  G7 (G Dominant Seventh, Sol Dominant Seventh)   In All Keys  Major Chords   Minor Chords  Seventh Chords  Major Seventh Chords  Minor Seventh Chords   Sus4 Chords  Sus2 Chords   7sus4 Chords     Guitar Lovers! Please Follow us on: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ https://www.facebook.com/Guitar3D https://www.facebook.com/PolygoniumGames http://www.polygonium.com/music ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}