{
"name" : "Teacher - Gradebook / Class Manager / Attendance",
"url" : "https://play.google.com/store/apps/details?id=com.edevolearning.edevoteacher",
"package" : "com.edevolearning.edevoteacher",
"category" : "Education",
"description" : "Edevo Teacher is a gradebook and organizer for managing your groups, classes, students, attendance, grades and more. Class manager, attendance register, home for your student and parent contact details, and general teaching organizer.  *** Download the Teacher App that will simplify your teaching life! *** - Designed by qualified teachers, who understand the demands of teaching, this app is designed to be easy-to-use and intuitive - no more complicated and lengthy video tutorials!  Our teacher organizer aims to simplify your workflow and streamline the data you deal with on a daily basis, making common tasks like sorting your groups, recording assessments/attendance, and contacting students and parents quick and easy, leaving you more to time to do what you do best: teach!  Some key features of Edevo Teacher are:   Gradebook - create assessments and assign to your groups, with letter grading, percentage, points and more. Label with different assessment categories. Entering grades is quick and simple (as it should be).  Final Grade Calculation - you can optionally display a final grade, either an average of all assessments, or configured from the student grades in each category. You can even apply weightings on the category for a truly customized final grade, as well as displaying the category averages in your gradebook.  Attendance - one touch registering, with simple icons that cycle with just a tap. The quick register that many teachers have been asking us for.  Convenient homescreen - access the most important items from the first screen, the groups or classes you teach, or a responsive student search.  Create your students or import from file - get up and running quickly, either create a new student in the app, or import from a CSV file on your device/cloud storage. (In your file, the columns can be in any order. Edevo Teacher lets you match the data as you import and does the rest for you.)  Clean looking tables with quick sort - all the data on your students is side by side and to sort students by a particular column just give the column header a tap.  SMS or email your students and/or parents - select one student, several students, or the whole group, and quickly launch a new text or email to students, parents, or both.  CSV file export - export the data in your student table, gradebook and attendance register however you like. Sort the columns in any order, and the app will export exactly what is on your screen ready to share via email, to the cloud, or any app that can receive a CSV file.  We aim to stand out from other teacher apps by being easy-to-use, quick and beautifully designed. If you are looking for a class manager or a home for your grades to use on the move, or during a parent evening, then this app has been designed for you!  We listen to your feedback, new features are added frequently and never while detracting from the apps simplicity and ease-of-use. Tell us what you think of our gradebook or our attendance system - it is designed for you! You may have an idea for what you want to see in a gradebook, or may have seen attendance done differently but found it too complicated. Get in touch and tell us what features you want to see.  Our teacher app is completely FREE, with no adverts, so download now and get your class and student management organized today!  The Edevo Teacher Team ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.edevolearning.edevoteacher.permission.C2D_MESSAGE', 'com.google.android.apps.photos.permission.GOOGLE_PHOTOS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['com.google.android.apps.photos.permission.GOOGLE_PHOTOS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}