{
"name" : "Next English - English Grammar Test + Explanations",
"url" : "https://play.google.com/store/apps/details?id=com.nextfunc.englishgrammartest",
"package" : "com.nextfunc.englishgrammartest",
"category" : "Education",
"description" : " English grammar test with explanation.   More than 2000 questions with detailed explanations.   More than 20 English grammar topics.   3 levels from beginner to advanced.   Learn together, ask questions & share knowledge with global learners.   Next English app is brought to you by Nextfunc Co., Ltd with the hope to bring out a new method of learning and practising English. The app will assist you in the path of achieving grammar usage whether you are new to English or have years of studying this language.  Main features:   Questions of each topic are classified and arranged into 3 levels: beginner, intermediate and advanced. Users can challenge themselves by choosing tests of higher level of difficulty.   The answer to each question is followed by a detailed explanation that provides users with adequate understanding to apply that grammar point in similar contexts.   There are 2 types to practice: tests per topic and mixed tests including random questions within the chosen level.   Once you are in the middle of taking a test, go back or leave the app will not record the current result. This step will ensure your 100% focus on completing the task and avoid distraction.   NEW: You now can ask your questions and share your knowledge with other learners on our Forum. It is a social network for English learners to post questions and answers, where you consolidate your knowledge effectively.  Next English - Bring YOURSELF to the next English level. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}