{
"name" : "Learn Colors",
"url" : "https://play.google.com/store/apps/details?id=com.kidscademy.colors",
"package" : "com.kidscademy.colors",
"category" : "Education",
"description" : "Learn Colors helps learning colors by name and associate with objects. It combines images, voices and games for fun and easy colors learning. Current version implements Touch Color, Match Color and Guess Objects games but development is ongoing.   Learn Colors is completely free. Free of annoying ads, no misleading in-app payment, no spy-ware.   Learn Colors by Playing 1. LEARN: Learn while listening and touching colored objects. Associate color with its name.  2. PLAY: Touch, match and guess colors while collecting colors score.  3. ANALYZE: Uses colors score to reveal lower achievement percent and guide learning process accordingly.   Baby Mode There is a baby mode for toddlers with simplified games and user interface. Into baby mode palette contains fewer colors, games are into full screen and color names are not displayed. Colors score is still updated. Switch between baby and standard modes from application settings.   Learn Explore colors catalog page by page or quick jump to desired color using colors grid. A color page has the name and related objects. When tap on objects their name is played. While paging colors catalog color name is played. This automatic playback can be disable using speaker notes button.   Baby Learn Learning interface for baby mode has no paging. There is a single page where all colors are displayed. Pressing on colored rectangle will play the color name while displaying a colored splash. Baby mode learning is in full screen. Palette contains fewer colors.   Touch, Match, Guess Touch the color played by name. A colored object is displayed if right color was selected. Drag the colored object to match the colored splash. Guess all objects of the played color. There ca be one to four objects of the right color.   Analytics While playing games colors score is update. Colors score is kept on device private storage. Analyze colors score list to reveal lower percents and guide learning process to improve. Reset colors score to have a fresh image about last period progress.   Settings Use Settings / Colors Palette to adjust user interface colors to your style and device screen. Also from settings you can switch between baby and full operation modes.   Support Development Please support development effort. This application is completely free. We need your help to sustain development. Rate and share this app! It is important for store rank so that this application to be easier found. Read No Ads Manifest and agree with it. There is also the option to not agree. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}