{
"name" : "Learn English for Kids - First Words in English",
"url" : "https://play.google.com/store/apps/details?id=com.TooFunnyArtists.LearnEnglishForKids",
"package" : "com.TooFunnyArtists.LearnEnglishForKids",
"category" : "Education",
"description" : "When it comes to learning a new language, the younger your kids are the easier it is to teach them a second, or even a third, language. Learn English for Kids - English Language is an educational game designed to introduce your kids to everyday vocabulary. This game is designed to teach your child new words through sound, animation, and flash cards. Its fun, free, and perfect for children between the ages of 1 to 7.   *Categories include: Animals, House Items, Bathroom and Bathing, Vegetables, Fruits, Food, Body, Outside, Vehicles, Numbers, Shapes, Feelings, Actions, and Clothes. All words are in English.  All the words are recorded professionally with a correct accent. It has already been established that children who learn a language when they are very young have a much better chance of not having a foreign accent when speaking another language.  Turn your smart phone or tablet into a fun educational tool for your toddlers, and children! Introduce English to your kid and teach them their first words in English! Free!  Young children enjoy learning. This same approach is true for children learning a new language. This app is actually the best way to go about it because it makes language learning so much fun and easy. It is amazing how quickly children will pick up a new language (English) while having fun!  Learn English for Kids - English Language includes more than 150 words and all words are in English. There are 15 flash card categories. It is simple to use. Select a category, review flash cards, and interact with the animations. Animal flashcards and Vehicle flashcards have sound and animations for babies/toddlers to discover new sounds. This educational flashcard game is great to teach new words to your kids. Building a strong vocabulary, learning language and pronunciation skills have never been so easy and exciting for kids, toddlers, and preschoolers!   *Categories include: First Animals, House Items, Bathroom and Bathing, First Vegetables, First Fruit, First Food, Body, Outside, First Vehicles, First Numbers, First Shapes, Actions, Feelings, and First Clothes. All words are in English.   - High quality, bright, real-life pictures make learning new words fun  - Fun animations and sounds  - Interactive, helpful voice narrating pronunciation of words for kids correct learning  - Engaging Voice-overs  - Swipe or click arrows to switch from one flashcard to another  - Learn at your own pace  - Multi-sensory learning tool  - Easy to use game environment  - FREE!  - No disturbing pop-up ads between sections   *Categories include: First Animals, First House Items, First Vegetables, First Fruits, First Food, First Vehicles, First Numbers, First Shapes, First Actions, First Clothes and more  Play and learn together with your kids. Asking guiding questions, and interacting with our children while playing together, can also have a major effect on kids learning experience and increase the educational value of this game.   Hope you and your kids love this educational game. If you like it, please rate us 5 stars. We love getting feedback from our users. If you have any questions or suggestions, please email us: toofunnyartists@gmail.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}