{
"name" : "Kids Construction Puzzles: Puzzle Games for Kids",
"url" : "https://play.google.com/store/apps/details?id=com.kidsappbox.mrbearconstruction",
"package" : "com.kidsappbox.mrbearconstruction",
"category" : "Educational",
"description" : "Who doesnt want to help such a cute bear in fun puzzle games for kids? Join the journey of Mr. Bear and his friends and help them to construct a wonderful town in forest! Learning has never been so fun!  Mr. Bear and Friends is a puzzle game, an educational adventure, for toddlers of age 2 and up. Games for kids help to practice the concept of searching, matching, and classifying.   As role models in daily routine, characters in this animal puzzle game guide kids to obtain empathy, meanwhile learn how to help others in a joyful way! Our cute friends, who live in the forest, have all kinds of tasks; building nests, setting up houses, planting flowers, and gardening. In the meantime, they never forget to celebrate their hardworking with ice-creams and jokes. As well, they enjoy their rest of day on a roller-coaster ride!  Features of educational puzzle games for children: - 12 deliberately designed interactive mini-game boards - Games for kids with 100% age proper environment - Animal puzzle with fascinating story lines - Engaging cartoon graphics and endearing characters - Kids puzzles with developmental levels in game boards - Educative fun games for toddlers and preschool learning games  Strengthening following skills: - Sorting and pairing objects by size with fun puzzles - Fine motor skills and coordination - Concentration and visual perception ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}