{
"name" : "Chinese Character Hero - HSK 1",
"url" : "https://play.google.com/store/apps/details?id=com.handtechnics.hsk1hero",
"package" : "com.handtechnics.hsk1hero",
"category" : "Education",
"description" : "*** Used by countless Chinese language learners worldwide, Chinese Characters - HSK 1 Hero is the most effective Chinese word and character learning app!  The Hero Method allows you to quickly master Chinese characters by enforcing a recall and recognition process, essential for long-term memory.   HSK 1 Hero covers the most basic 150 words in the Chinese language, which are based on the Chinese level 1 proficiency exam (HSK 1). Audio for all words is available at the tap of a button.  This app supports both simplified (mainland China) and traditional (Hong Kong, Taiwan) Chinese characters.   SIMPLE DEISGN  Learning Chinese characters is now made fun and easy. You will actually forget that you are learning when using this app. It will feel like youre playing a cute phone game as you improve your . This app provides just the right combination of fun and well-timed Chinese character recognition functionality, and will greatly help you both recognize and write Chinese characters, using the simple and effective Hero Method. Studying for the HSK with this tool instead of the classic flashcard method.   MASSIVE VOCABULARY  HSK Hero will greatly improve your vocabulary, as well as help you learn new characters. It is a very effective and efficient way for learning Chinese characters. The app focuses on helping you quickly identify characters for reading and gives you a good grounding for development in writing skills. It is the perfect tool to practice your character recognition. It cant get any easier than this!   PLAY EVERYDAY  Keep playing everyday and youre sure to perfect your learning. Open the app several times each day to reach your next Chinese level. You will not only learn Mandarin Chinese but have a fun time doing so. This creative study game is great for any age, and is a great way to test and train your Chinese. This app is an excellent bridge between learning the spoken language and learning the meanings of the words by focusing on just RECOGNIZING the words.    PRACTICE EVERYWHERE YOU GO  HSK Hero is the perfect way to learn Chinese during your commute, in line at the grocery store or bus stop, or for long study periods in your home, library, or coffee shop. Its a quick and easy way to refresh your memory while out and about. The simple and fun Hero Method can be done anywhere without books and paper and the need to have study space, and is convenient to use anywhere. It is amazing how easy it is to use and you can practice everywhere you go.   FRIENDLY AND ADDICTIVE  The game format makes it user friendly and addictive, which is a plus when studying Mandarin Chinese. You will definitely enjoy the challenge of trying to keep the wrong clicks to a minimum. HSK Hero is designed to be very motivating and presented in a fun format. It is the perfect way to master Mandarin Chinese. Reviewing flashcards to memorize characters can be tedious and monotonous. The Hero Method makes it easier and more fun to study Chinese!   THE PERFECT STUDY COMPANION  Uses will find this app to be a more productive and easy way to get a quick dose of Chinese studying. Also, no sign in is required. HSK Hero makes learning the characters, pinyin, and vocabulary so much easier. You can use it throughout the day and keep learning and progressing. The interface is clear and simple, and provides an excellent way to review your knowledge. The random and repetitious game style will carry you progressively through the HSK levels. HSK Hero is very good app for practicing the Chinese characters based on the HSK levels, and is user-friendly and engaging.  Enjoy the fun of trying to pick out the characters among other similar ones. This app is challenging but not in the least bit stressful. This is game-based Chinese Mandarin learning, and in short, you will never get bored.   --------------- Please contact Mike at handtechnics@gmail.com if you have any questions or comments. Have fun learning! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}