{
"name" : "Complete Biology",
"url" : "https://play.google.com/store/apps/details?id=com.toscanyacademy.completebiology",
"package" : "com.toscanyacademy.completebiology",
"category" : "Education",
"description" : "Complete biology app is among the best biology app in the market. It focuses on secondary / high school students, undergraduate students and biology teachers.  With more than 35 topics in Biology, students will learn everything they need in preparation for their exams.  The app has around eight categories that deal with tutorials, formula, possible exam questions, biology practical and dictionary.  If you are a biology lover, you will definite like this app. For students writing exam like WAEC, NECO, JAMB, KCSE, Post JAMB and GCE, this app is for you.  The following topics are covered in this app:  Concept of living thing Organization of life Cell and its environment Cell Structure Cell as a living form Cell Properties  Tissue System Excretory System Homeostasis Respiratory System Hormonal Coordination Central Nervous System Human Sense Organ Animal Nutrition Reproductive System Transport System Plant Nutrition Micro-organism and Man Biology of Heredity Basis of Heredity Probability in Genetics Genetics in Medicine Physiological Variations Morphological Variations Evolution and Adaptation Theory of Evolution Component of Eco system Eco system Ecological Management Ecology of Population Ecological Factors Food Webs and Trophic Levels Energy Transformation Natural Resource Conservation of Resources  Disclaimer: The question and solution section uses Past WAEC exam questions and solutions which were provided by WAEC for students planning to sit for WAEC exams  We are always in the look out on how to improve our apps. If you have any suggestion or question about this app, please kindly use the email below to get in touch with us. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.GET_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}