{
"name" : "Amazing Car Wash For Kids FREE",
"url" : "https://play.google.com/store/apps/details?id=com.mcpeppergames.freeAmazingCarWashGame",
"package" : "com.mcpeppergames.freeAmazingCarWashGame",
"category" : "Educational",
"description" : "This app is super cute. Made for Toddlers and preschoolers with love. If youre looking for a great and funny cars app that will allow your toddler or preschooler to play independently, Amazing Car Wash is the best app for you. This top app is one that is engaging and fun and your child will love it. Perfect for toddlers, kindergarten kids and even first-, second- and third-graders adore the game.  Please note this version contains child friendly ads, so it can be 100% free to play. If you dont want ads in the game you can remove them with an In-App purchase or you can play the alternate lite version.  Download Amazing Car Wash now!! We did our best to create a great fun car roleplaying kids app.  Its the first unique interactive role play washing game for kids where you can use unique cleaning tools with cross functionality! And for the first time ever: In this game you can use Special Actions to make your cars dirty!  Features: + 100% safe game for kids! + No push-notifications! + Free content! + Action tools can be used all the time! + Amazing unique McPeppergames graphics, animations, music and sound effects! + A lot of cool car wash actions and special dirt actions! + Multiple functionality for actions! + Blend out your Tools to only see your car on the screen! + A lot of cool cars and vehicles to wash! + Contains Things not from this world! ;)  The funny children game was made to be an educational app to play role play sim while children can learn to finish a cleaning job to earn rewards and stars. The high quality easy accessible graphics, music, sound and animations are all created to give kids a great time while playing.  As parents of children we created the funny cars cleaning action with love. Most can be activated in the game during role play by finger click and tap. This app is super cute and easy to play. The washing actions are made for Toddlers and preschoolers with love. It is easy to use and not hard to play. ...sometimes you just need to play an app for the fun of it and this app is exactly that app. Kids will love the vibrant colors and cute characters. Amazing Car Wash will provide hours of play learning for your children.  Engaging and cute even for second-grader and third-grader! Summer water physics effects and particle effectsaction for all ages!  The cars include transport vehicles and special transports like trucks. There is a firetruck, a police car (which will change its appearance for the countries United States and Germany) in the game also. You can clean a farm tractor, city garbage truck, racing car to only name a few. And if you like Aliens you also will love the app!  The special actions in the f2p game are funny and can be used after collecting enough stars with washing cars to make cars dirty. The action buttons in the levels include a flying dragon spreading fire when touched, an aquarium effect showing swimming fish, an oil shower with liquid particle physics effects, balloons to pop and splash effects and confetti sticking on the car and vehicles. By popping bloons kids also have the chance to collect a star. Easy to play, cute graphics, lovely design and the perfect summer water actions.  For support please write to support@mcpeppergames.com and tell us your feedback.  If you really like the game please rate it in the Store! This helps us a lot developing new updates, automobile and content!  The free cars washing game is made for children and tots while keeping in mind what kids love: discover how things work and playing. Explore the world of cars and get the role playing game now. Kids can tap, use foam and soap toilet actions.  The lovely cute game was created for both boys and girls! It is aimed at Kindergarten kids and a top pick game for School Kids alike! One of our best kids games!  More Google Play Apps: https://play.google.com/store/apps/dev?id=5029755957860459217  Website: http://www.mcpeppergames.com  Our contact: support@mcpeppergames.com  Your McPeppergames team! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION']",
}