{
"name" : "Picmonic: Nursing school RN LPN NP NCLEX AANP ANCC",
"url" : "https://play.google.com/store/apps/details?id=com.picmonic.androidapp",
"package" : "com.picmonic.androidapp",
"category" : "Education",
"description" : "Ridiculously efficient. Unbelievably effective. Make Studying Fun & Remember More in Less Time with Picmonic, the worlds best mnemonic video & spaced repetition quizzing study tool thats research-proven to increase memory retention 331%!   10,000+ quiz questions & 1,000+ entertaining mnemonic videos covering all major subjects. Used by over HALF A MILLION STUDENTS in Medical, Nursing, NP, PA, PT, OT & PharmD school.   Ditch boring textbook memorization, recall information faster and retain it longer to ace your courses, clinicals & board certification exam with less study time using unforgettable images and stories...its Cliff Notes meets Saturday morning cartoons!  Every day for FREE you can watch one Picmonic video of your choice and do 20 quiz questions plus the Daily Quiz with Spaced Repetition. Get unlimited access with an affordable subscription.   Program Options: Nursing RN, Nursing LPN, Nurse Practitioner ***MEDICAL/PA/PT/OT/RX & College students click (https://play.google.com/store/apps/developer?id=Picmonic+Inc) for specific apps for Medical (MD/DO/NMD), Physician Assistant, Pharmacy, Physical Therapy, Occupational Therapy, Pre-Health / MCAT, Medical Terminology, and college sciences.    Nursing Courses: Fundamentals, Pharmacology, Pathophysiology, Med-Surg, Microbiology, Biochemistry, Anatomy, Critical Care, Psych, Peds, OB and more  Body System course organization & an NCLEX Study Guide   Textbook mappings: Elsevier & Lippincott books like Saunders NCLEX, Lewis, Pottery & Perry, Lilley, Lehne, Jarvis, Adams, Taylor, Brunner & Suddarth, Ignatavicius, Wong, Lowdermilk and Ricci!)   ***Nurse Practitioner Students 1,400 NP Picmonics & 11,000 quiz questions covering all major subject areas for your FNP, ANP, GNP, or A-GNP courses and the AANP or ANCC board exam, you can even follow along with the Fitzgerald or Leik review books!  I am so excited and HAPPY that I passed the ANCC Board examination for FNP!! I definitely feel that using Picmonic was SO HELPFUL to remember many of the facts that I needed to know! Mary B. @ Chamberlain Nursing  ***Nursing Students Start memorizing Lab Values. Stop confusing acids and bases.  Pass the NCLEX in 75 questions then go be a great nurse!   All the critical info you need to know as a nursing student is turned into 1,000 Picmonics & 10,000 quiz questions preparing you for nursing school, HESI ATI Kaplan exams, and the NCLEX RN or NCLEX PN.  I struggled in my Fundamentals class, then found Picmonic and made a 95 on my fluid and electrolytes exam! My first A ever in nursing school! Rene S. @ Bevill State Nursing  Pure memorization can be hard, but Picmonic has helped me to ACE my pharmacology class in nursing school. 1000x thanks! Michael B. @ Valencia Nursing  Struggling to actually retain what youre learning? Use the Picmonic study tool starting day one to learn nursing smarter. Assigned reading lol follow along by textbook chapter watching these cartoon mnemonics to show up to class prepared, then use the Daily Review Quiz thats better than Quizlet or any pharm flashcards or Mosby flashcards to prep for that HESI or ATI Nursing exam. Youll remember all the details and stop referencing Nursing Drug Handbooks / Scrub Cheats.   Get an NCLEX Qbank quiz question wrong in NCLEX RN Mastery, UWORLD NCLEX, NRSNG, Osmosis or Kaplan NCLEX Qbank? Hop back to Picmonic so it sticks! Our characters become your very own ATI Mentor and bond together to act as your Saunders NCLEX RN review book choir, singing you the sweet answers. Dont settle for free sketchy nursing or sketchy medical resources, use whats PROVEN to work! Now thats some simple nursing school for you with Picmonic as your RN mentor.  https://picmonic.com/pages/terms-of-use ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.INTERNET', 'android.permission.FOREGROUND_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
}