{
"name" : "Learn Spanish Free: Spanish Lessons and Vocabulary",
"url" : "https://play.google.com/store/apps/details?id=com.mosalingua.esfree",
"package" : "com.mosalingua.esfree",
"category" : "Education",
"description" : "So, you want to Learn Spanish in no time? You need MosaLingua!  Innovative and effective, our applications have helped more than 8,000,000 people all over the world learning languages in only 10 minutes per day - with actual results!  Learn more about MosaLingua by watching the demonstration video on https://mosalingua.com/en.  Feel free to try our smartphone application to learn Spanish vocabulary for free: youll see for yourself how well it works! Its a powerful and effective tool - ideal for people who want to learn Spanish Vocabulary and Speak Spanish in no time, without taking long, boring language courses or using a Spanish dictionary or a Spanish translator.  Its useful in any situation: our SRS-based method can help you while you travel to Spain or Mexico, in the workplace, and in everyday life with Spanish lessons and Spanish words that suit your language and conversation needs.  THE BENEFITS OF MOSALINGUA:  1) Useful, practical Spanish lessons online Dont waste your time with notions, courses or a Spanish dictionary that wont help you. Instead, learn the 20% Spanish words that youll use 80% of the time in Spain or Mexico. MosaLingua is Better than a Spanish translator!  2) An innovative method based on scientific research Our international team is made up of expert polyglots whove used the most modern and proven learning, memorization and consolidation techniques (SRS, active recall, metacognition, etc.) to help you learning Spanish.   3) Coaching throughout the online learning process To succeed, you can count on our review sessions that consolidate what youve learned, our mini Spanish lessons, and our advice for better understanding Spanish vocabulary, Spanish words, and improve your conversation.  4) Learning Spanish words and having fun at the same time Achieve great results and have fun doing so: your progress will boost your MOTIVATION, which is key to any learning plan.  Our Learn Spanish App includes all these features and add-ons:   +3000 flash cards: useful Spanish words and phrases for communicating and making yourself understood.   Audio pronunciation: Spanish words and phrases pronounced by native speakers.   37 dialogues: improve your oral comprehension with our integrated dialogues and Spanish lessons.  Tips for Studying: our app include useful tips and tricks for faster progress.   Personalized learning program: get a tailored experience focusing on your specific learning goals (travel, work, everyday life, exams)   Using MosaLinguas highly effective and addictive method, you will be able to memorize an impressive amount of Spanish vocabulary, Spanish words and key phrases in record time.   Improve your Spanish words with our free app even when your time is limited! To learn Spanish vocabulary, download MosaLingua now - you wont regret it! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'android.permission.GET_ACCOUNTS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.mosalingua.esfree.permission.C2D_MESSAGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}