{
"name" : "Make Fluffy Slime Jelly  DIY Slime Maker Game 2019",
"url" : "https://play.google.com/store/apps/details?id=com.tt.makefluffyslime",
"package" : "com.tt.makefluffyslime",
"category" : "Educational",
"description" : "Lets have fun together. Have you ever think about to make slime at home? Its a good chance for all slime lovers. The slime making is easy to follow, First You collect all ingredients like glue, starch, water, color, etc. And mix all the ingredients together in a bowl. After mixing all ingredients in a bowl, let it heat in the slime maker. When slime will ready, then you can play different slime. You can make slime in different colors. You can decorate your slime with glitters. Choose the glitter you like most, Red, orange, green, blue, purple, yellow etc, whatever you like: The slime fluffy game offers various shapes to make from the slime making jelly alongside delectable hues, so you can appreciate making your very own brilliant slime jelly in various vivid shapes! This isnt only the end; you can appreciate the breaking impact of the slime jelly shapes by tapping a couple of times and afterward revamping the slime jelly once more!  Features: Slime Maker Game!  Instructive slime maker game.  The slime DIY game has very interactive graphics.  Different kinds of ingredients.  Full Detailed game play.  Beautiful colors and amazing shapes.  Amazing play different slimes.  Good sound impacts.  Free to play fluffy slime making game. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
}