{
"name" : "Qui est Jésus ?",
"url" : "https://play.google.com/store/apps/details?id=com.topchretien.topbible.toplumo",
"package" : "com.topchretien.topbible.toplumo",
"category" : "Education",
"description" : "Nous vous proposons de dcouvrir lEvangile sous une forme originale sans aucun filtre. Une occasion de dcouvrir par vous-mme qui tait Jsus.   Vous aurez la perspective de 4 personnes qui ont ctoy Jsus de prs :  - Luc tait un mdecin qui a dcid denquter sur ce qui sest vraiment pass auprs des personnes qui ont connu Jsus. Il utilise vraiment la mthode dun historien.  - Marc tait lassistant de Pierre qui tait galement lun des douze compagnons de Jsus. Il tait lun des plus proches. - Matthieu tait lun des douze compagnons de Jsus, il tait collecteur dimpts. - Jean tait galement lun des douze et probablement le plus proche de Jsus.   Lexprience unique que nous proposons, et qui sera peut-tre nouvelle pour vous, est dexplorer chaque jour, pendant 90 jours, un chapitre de lun des 4 vangiles sous la forme dune courte vido.  En fil rouge, vous aurez 4 points qui touchent des thmatiques par lesquelles nous sommes tous concerns. Vous serez invits  y rflchir.  Il y a tout dabord lAmour. Cest ce qui a de plus important dans la vie : aimer et tre aim.  travers la vie de Jsus, vous dcouvrirez un nouveau standard de lamour.  Ensuite, nous avons le Bien et de Mal. Vous trouverez plusieurs scnes de lEvangile qui interpellent, o Jsus propose une nouvelle perspective sur ces questions.  Le troisime lment est le Pardon, car le pardon est une cl fondamentale pour vivre les relations essentielles dans notre vie.  Et enfin la Libert, vous verrez que cest un sujet galement central. Qui naimerait pas vivre libre et librs du mal ?   => Il ny aura pas de correction de vos rponses, limportant est de savoir ce que vous en avez retenu.  Si vous dcidez de suivre ce dfi 90 seul, vous pourrez changer sur ces rflexions avec un ami de confiance avec qui vous pouvez facilement changer de votre exprience et qui pourrait rpondre  vos questions sur ce qui vous interroge. Il est possible de faire ce dfi en groupe, o chacun regarde les mme vidos le mme jour. Vous pourrez ainsi quand vous vous retrouvez partager les uns aux autres vos questions et vos dcouvertes.    Nous voulions vous informer que lappli Qui est Jsus a obtenu la classification PEGI18 sur GooglePlay car les scnes illustrant la crucifixion de Jsus peuvent tre assimiles  des images violentes, sur lesquelles on y voit du sang. We invite you to discover the Gospel in an original form without any filter. An opportunity to discover for yourself who Jesus was.  You will have the perspective of 4 people who have been close to Jesus: - Luke was a doctor who decided to investigate what really happened to people who knew Jesus. He really uses the method of a historian. - Mark was Peters assistant who was also one of the twelve companions of Jesus. He was one of the closest. - Matthew was one of the twelve companions of Jesus, he was a tax collector. John was also one of the twelve and probably the closest to Jesus.  The unique experience that we propose, and that may be new to you, is to explore each day, for 90 days, a chapter of one of the 4 Gospels in the form of a short video.  In red thread, you will have 4 points that touch themes that we are all concerned. You will be invited to think about it.  There is first Love. This is the most important thing in life: to love and to be loved. Through the life of Jesus, you will discover a new standard of love. Then we have good and bad. You will find several scenes of the Gospel that challenge, where Jesus offers a new perspective on these issues. The third element is Forgiveness, because forgiveness is a fundamental key to living the essential relationships in our life. And finally Liberty, you will see that it is a central subject too. Who would not like to live free and free from evil?  => There will be no correction of your answers, the important thing is to know what you have retained.  If you decide to follow this 90-only challenge, you will be able to share these thoughts with a trusted friend with whom you can easily share your experience and who could answer your questions about what is questioning you. Its possible to do this group challenge, where everyone watches the same videos the same day. You will be able to share your questions and discoveries with each other.    We wanted to inform you that the Who is Jesus app obtained the classification PEGI18 on GooglePlay because the scenes illustrating the crucifixion of Jesus can be likened to violent images, on which we see blood. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.sec.android.provider.badge.permission.READ', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.READ_APP_BADGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
}