{
"name" : "Operational Research",
"url" : "https://play.google.com/store/apps/details?id=com.swastik.operationalresearch",
"package" : "com.swastik.operationalresearch",
"category" : "Education",
"description" : "This app is Solver or Calculator for Operational Research(Industrial Management) problems like Assignment Problem, Transportation Problem, Linear Programming, Sequencing Problem and Game Theory.  INTRODUCTION: Welcome to Operational Research app. This app is Solver or Calculator. It is useful to solve following problems:(1)Assignment Problem (2)Transportation Problem (3)Linear Programming (4)Sequencing Problem (5)Game Theory. This app will solve all variety of these problems as well as shows STEP BY STEP solution.  FEATURES: -Simple and easy user interface. -Beautiful design. -Calculates multiple answers, minimization and maximization, balanced and unbalanced all. -View all steps of solution along with marking and assigning steps in Assignment problem. -View all steps of initial solution and optimization steps along with marking and looping in Transportation problem. -Least cost, North-west corner, Vogel, Row-minima and Column minima method for Initial solution in Transportation problem. -View all iterations in Linear programming Simplex Method. -Solves infeasible, unbounded, minimization, maximization all in Linear programming. -Shows all steps and time and idleness calculation in Sequencing problem. -Solves problems arithmetically in Game Theory. -Calculates all solutions in case of multiple solution. -Saves history of solved problem. So, problem can be viewed any time. -Matrix can have numbers of row and columns from 1 to 10.   What is Operational Research? Operations research is an analytical method of problem-solving and decision-making that is useful in the management of organizations. In operations research, problems are broken down into basic components and then solved in defined steps by mathematical analysis.  What is Assignment Problem? -The assignment problem is one of the fundamental combinatorial optimization problems in the branch of optimization or operations research in mathematics. It consists of finding a maximum weight matching (or minimum weight perfect matching) in a weighted bipartite graph. -The problem instance has a number of agents and a number of tasks. Any agent can be assigned to perform any task, incurring some cost that may vary depending on the agent-task assignment. It is required to perform all tasks by assigning exactly one agent to each task and exactly one task to each agent in such a way that the total cost of the assignment is minimized.  What is Transportation Problem? The transportation problem is a special type of linear programming problem where the objective is to minimise the cost of distributing a product from a number of sources or origins to a number of destinations.  What is Linear Programming? Linear programming (LP, also called linear optimization) is a method to achieve the best outcome (such as maximum profit or lowest cost) in a mathematical model whose requirements are represented by linear relationships.  What is Sequencing Problem? Sequencing Problem is the selection of an appropriate order in which a number of jobs (Operations) can be assigned to to a finite number of service facilities (Machines or equipments) so as to optimize the outputs in terms of time, cost or profit.  What is Game Theory? Game Theory is the branch of Operational Research concerned with the analysis of strategies for dealing with competitive situations where the outcome of a participants choice of action depends critically on the actions of other participants. Game theory has been applied to contexts in war, business, and biology.  SUPPORT: If you like this app, Rate it on Play Store.Share this app with your Mechanical Engineering Friends.  DEVELOPER: Ketan Chauhan Mechanical Engineer. Swastik Apps From: Surat,Gujarat,India. E-mail: swastikappssolution@gmail.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.swastik.operationalresearch.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}