{
"name" : "Lolabundle - ABC Party 2: Kindergarten Practice",
"url" : "https://play.google.com/store/apps/details?id=com.beizoy.bundle.lolaspicnic",
"package" : "com.beizoy.bundle.lolaspicnic",
"category" : "Educational",
"description" : "NOTE ! This application is intended for use with Lolas Learning Pack PRO app. You can try out the application two times for free. Lolas Learning Pack PRO can be downloaded from Play store Lolas Learning Pack PRO   Kindergarten practice!  Help your children learn to read with Lolas ABC Party 2! This game teaches spelling, word construction and word recognition to children ages 5-7. Begin with short vowels and in the end master spelling of 160 words. Reading practice made exciting and interactive!  ** Please note that in the other 11 languages, this game is also designed to teach English. **  What professionals say about this game:  As a former 1st grade teacher I wholeheartedly can approve of this beautiful game app for your child! - My Un Entitled Life What we liked: the concept. Good range of activities. Spoken instructions and visual clues. Ease of use. Simple graphics and animations. No distracting elements. - Appysmarts.com  Key Features of the game: - START with short vowels - LEARN phonetic spelling - MASTER spelling of 160 words - MEANINGFUL learning: Word recognition and construction - CUSTOMIZED to the childs learning pace - VOICE OVER feature: Spoken and easy to understand instructions - CHILD FRIENDLY usage experience: No in-app purchases or third party advertising  Lola Panda invites you, and all of her friends, to an outdoor adventure - join the Party and let the reading fun begin! Children get to build their favorite sandwich, choose their favorite fruit, and even create their own ice cream sundaes! At the end, the party goodies are shared and enjoyed with Lola and her friends! This game encourages the learning progress by rewarding children with fun surprises when they achieve success, which engages them in the learning process. The fun theyre having motivates them to continue, and to learn even more! For smaller (3-6 year old) children, check Lolas ABC Party!  Try also our other Lola Panda games: - I Spy with Lola (Editors Choice Award 2013) - Lolas Math Train - Lolas Alphabet Train - Lolas Beach Puzzle - Lolas Math Ship  Find Lola Panda on Facebook, Twitter and www.lolapanda.com ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}