{
"name" : "Teacher Gradebook",
"url" : "https://play.google.com/store/apps/details?id=com.apolosoft.cuadernoprofesor",
"package" : "com.apolosoft.cuadernoprofesor",
"category" : "Education",
"description" : "100% FREEMIUM APP. With ads to fund my work. You can remove ads by going to premium.  I am a teacher that develops the app in my spare time.   WHAT IS TEACHER GRADEBOOK?  Teacher Gradebook is a friendly, powerful and great Android app for teachers to manage students grades. It is a digital notebook for teachers. Keep your students and grades organized and auto calculate the final grade.  Teacher Gradebook is a grades notebook that will SAVE you lot of TIME.  Teacher Gradebook is 100% free with no limitations and funded with ads. It has ads to pay my work. You can remove them going to premium.   FEATURES:  - Manage grades - Powerful and customizable teacher notebook - Different types of grades:  * Numeric grades * Counter grades * Free text grades * Icon grades * Calculated grades * List of values * Rubrics - Rubrics assessement - Authomatic final grade calculation  - Attendance list - Attendance statistics - Auto sync between devices - Team work assessment - Class map with quick attendance  - Manage students and their info  - PDF and CSV export - Schedule/Timetable - Charts - Encrypted database. - Conditional grade colors - Configurable grade symbols: A, A+, F, etc... - Icons - Manage groups. - Manage terms/trimesters - Manage different tabs - Reports - Backups: manual, auto, cloud backups. - Import students from a CSV file. - Classroom diary - Specially designed for Tablets - .... much more...  Translated to 14 languages!  Teacher Gradebook is a good complement to other teachers apps like: ClassDojo, Classcraft, Kahoot!, Moodle, Edmodo, Socrative, Schoology, Remind or Google Classroom.  Feel free to try teacher gradebook, I am pretty sure it will save you time.   APP PERMISSIONS  - Photos/Media/Files: to select a picture for the student - Storage: for backups and export reports - In-app purchases: to remove the ads. - View networks connections: to make auto backups in Dropbox or Google Drive, for auto sync and check Internet availability  ** Web: http://apps4edu.org ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}