{
"name" : "Sweet Princess Hair Salon",
"url" : "https://play.google.com/store/apps/details?id=com.libiitech.sweetprincesshairsalon",
"package" : "com.libiitech.sweetprincesshairsalon",
"category" : "Educational",
"description" : "Hurrah! The great hair salon is open for our sweet princesses! Get ready to style the girls and make them stand out in a sea of faces.  We know its easy-peasy for a talented hairstylist like you to create custom looks for the royal sweeties. Well, the long-haired princess is a big fan of curls and accessories. Youd better prepare something special to blow her mind. Theres another girl who plans to color her hair and pair it with perfect makeup to make herself glow! Oh, the shy cutie just wants to style her bangs in a different way and surprise her love. And dont forget the photo wall! Lets fill it up with amazing pictures of the chic princesses.  Features: - 18 levels to show your talent for hairdressing Build the look according to the offered picture and try your best to challenge the 18 levels - Release your creativity in free mode Just make full use of your imagination and inspiration to give the girls a trendy look - Tons of accessories will take the look to a whole new level Except for the various cutting and curling tools, tons of headwear, outfits and makeup are ready to elevate the look - Freeze the beauties in the photo wall Taking pictures is always a good way to store memory. Let the beautiful pictures fill up the photo wall and make the hair salon unique  About Libii Game: With over 500 million downloads and growing, Libii is committed to creating innovative games for kids. Well keep working on establishing a good relationship with both parents and their children and bringing a healthy, happy atmosphere for them. Visit us: http://www.libii.com/ Like us: http://www.facebook.com/LibiiGame Contact us: Got any ideas? Suggestions? Need technical support? Please feel free to contact us 24/7 at WeCare@libii.com  Need You Know: This app is totally free to download and play, some basic items are also free to use, but some additional items need you to purchase and pay to unlock. Therefore, if you do not want to use these items, please turn off the in-app purchase in your settings. Thanks. ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.asus.msa.SupplementaryDID.ACCESS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.asus.msa.SupplementaryDID.ACCESS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}