{
"name" : "Free mock test RRB NTPC, Group D, SSC, SBI, IBPS",
"url" : "https://play.google.com/store/apps/details?id=com.sarkaricircle",
"package" : "com.sarkaricircle",
"category" : "Education",
"description" : "Sarkari Circle is a free test series app for sarkari exams like Railways NTPC, Group D, SSC, Banks etc.   Our test series are created by experts from KOTA and JAIPUR, with 90 days free Mock Test series for each exam we also provide deep analysis and solution for each question.  Exams we prepare you for:  Railways NTPC Group D SSC-CHSL SBI PO & Assistant & Many More!   Sarkari Circle makes your mission to score in competitive government exams a success. From the makers of Witcircle, we present this well-designed and comprehensive, dedicated app to prepare you for all the important government examinations.  We have detailed tests and question sets to make sure you succeed. Sarkari Circle is totally free of cost, so you can be assured of a quality preparation tool without spending any money.  In-depth questions, well-structured tests, extensively-researched study material  Sarkari Circle makes it easier for you to ace your exams and secure your future and make your aspirations a reality.  Our exam preparation app is bilingual, so that you can benefit from the online platform, whether you want to take the test in English or Hindi. We present a comprehensive database of questions, tests and quizzes in English and Hindi, as well.  User-Friendly App that is designed keeping the requirements of students in mind. Easy access, quick load times and excellent 24/7 support.  Excellent Results: We offer amazing results and our proven track record has scored the highest rating on Playstore where our app is available for downloading.  Comprehensive Question Sets and Tests For Each Recruitment and Competitive Exam to make your preparation simple. Theres no scope for error with this app!  100% FREE!!! Our app is totally free because the aim is to help our students. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}