{
"name" : "Miga Town: My Store",
"url" : "https://play.google.com/store/apps/details?id=com.miga.mystore",
"package" : "com.miga.mystore",
"category" : "Education",
"description" : "You can define the dress-up, hairstyle and magical makeup in the game depending on your preferences. Show your unique charm and write down your own story!  Creation  Show off all your creative ideas in the Miga Store . You can change your clothes, dye your hair into any color, or create your best friend and explore unknown places together with him/her. Tens of billions of changes allow you to make any combination you want.  Feature  - 6 scenes: Apartment, sports store, supermarket, clothing store, fashion store, hair salon  - Apartment: Two apartments in different styles may let you experience different moods  - Sports store: Head towards the sports supermarket to buy golf supplies or take part in the boxing training  - Supermarket: Spend some time on food and enjoy the enticing delicacies  - Clothing store: You can find a large collection of the latest clothes here to dress yourself up. Dont leave in a hurry. Take a photo to memorize this moment!  - Fashion store: Take time to pick out cute or cool glasses. Rich accessories are ready for you to choose  - Hair salon: More beautiful hair styles and more DIY tools are waiting for you to create your own characters  --Give full play to childrens creativity --Tens of billions of customized modes --No third-party advertising --No time limit or score ranking list  contact ussupport@xihegame.com ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
}