{
"name" : "EQ Mighty",
"url" : "https://play.google.com/store/apps/details?id=com.qmighty.eqmighty.socialstories",
"package" : "com.qmighty.eqmighty.socialstories",
"category" : "Education",
"description" : "Studies have proven that emotional intelligence predicts future success in relationships, health, and quality of life.  EQ Mighty was designed to educate children on soft skills that are often not taught in classrooms, but are now understood to be instrumental in their social development.  The core of the EQ Mighty app consists of interactive video stories that allow kids to make their own decisions in social situations. By seeing how their decisions impact others, they will learn valuable lessons on how managing their emotions can lead to positive outcomes.  Key Features  The EQ Mighty program is designed and backed by experts in social language and pragmatics. Created with all children in mind but also serves well as a supportive tool for schools and clinics implementing PBIS and other behavioral or social programs.  * Animated video stories in categories such as Working with Grownups, Making and Keeping Friends, and Being Safe and Respectful * Accompanying worksheets for each interactive video lesson. * Coloring pages featuring our star students. * Video Modeling - EQ Mighty allows kids the opportunity to practice what they learn by video recording themselves and playing it back. Research shows that this exercise is beneficial in replicating appropriate social behaviors. * Fun profile badges that students can earn as they play through the lessons.  EQ Mighty supports SEL (Social and Emotional Learning) practices being implemented by thousands of schools today. SEL is the process through which children and adults acquire and effectively apply the knowledge, attitudes, and skills necessary to understand and manage emotions, set and achieve positive goals, feel and show empathy for others, establish and maintain positive relationships, and make responsible decisions. Improving SEL skills complements the goals of the Positive Behavioral Interventions and Supports (PBIS) framework that school districts use to promote and celebrate good behavior in the classroom.  Download EQ Mighty today to try out our free sample lessons! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}