{
"name" : "UPSC IAS CSAT 2020",
"url" : "https://play.google.com/store/apps/details?id=com.tabexam.upscfree",
"package" : "com.tabexam.upscfree",
"category" : "Education",
"description" : "UPSC/IAS CSAT Quiz  Questions and Answers supported in English and Hindi.  * All previous year question paper sets in Quiz format (including latest 2019) * Eight Mock exams for General & CSAT separately * Current affairs in study format as well Quiz for UPSC exams * History, Geography, Biology, Indian Polity, Physics, Chemistry, Maths, GK, General Awareness, etc  * Over 1000 hours of quiz with carefully compiled and well-arranged question sets * More than 20,000 QA well categorised under subjects and chapter formats * Explanatory notes for Question sets * Revise fast, cover more syllabus, save time on your device.  Features included in the App :  1. Favourite option for you to add your choice of QA and revise later 2. Voice read-out facility that reads out questions/answers  3. Text Zoom, On click Image Zoom 4. Sharing of contents with your friends  5. Instantaneous review of right and wrong answers 6. Practice mode tests OR timed-mode quiz 7. Languages supported: Hindi and English. Users can dynamically switch between languages and study. 7. Pictorial graph of your results  8. Organised results according to subjects 9. Themes and Background configurations 10. Bug reporting feature in case you find some errors   Applicable for CSE (Civil Services Exams), IFS (Indian Forest Service), UPSC (Union Public Service Commission), CSAT (Civil Services Aptitude Test), UPSC IAS Exams and State level PSC exams, Staff Selection Exams, RRB and all Government exams conducted in India for Civil servants.   Detailed syllabus and UPSC notification sections added. One stop UPSC preparation for all your exam needs. Save time and lead ahead of others with quality educational apps from Sana Edutech.  120,000+ happy users doing UPSC CSAT exam preparation with our app !   Though you might have enrolled in some coaching classes like Byjus, Aakash or others, we still assure you that this app will provide you a unique learning experience via QUIZ helping you in increasing the success probability.  Try it today, use it daily and secure success in upcoming IAS exams. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}