{
"name" : "Learn Languages with Niavo - English, Spanish&More",
"url" : "https://play.google.com/store/apps/details?id=com.niavo.learnlanguage",
"package" : "com.niavo.learnlanguage",
"category" : "Education",
"description" : "NIAVO is the best choice to learn Spanish, French, German, Japanese, Chinese, Italian, Korean, and Portuguese, Russian, Arabic, Dutch, Turkey, Polish, Hindi and even English.  NIAVO is the most powerful and user-friendly app to learn languages, we wanna help you learn languages faster.   We offer 10 minutes free lesson a day, Its not painful to learn a language if you learn it incrementally.  Vocabulary is the basis to learn language. It is found by research that a mastery of 1000 words of a language will enable one to understand 80% of the language content around.  NIAVO chooses around 1800 high-frequency words which are classified according to their scenes and attributes, to make you memorize them more efficiently. Learn 15 new words everyday for 2 months, and you will master around 1000 words!   Example sentences are critical for words. NIAVO provides useful and authentic examples to make you have a better command of the words usage, and the explanation and pronunciation of each word is just a click away!   For Spanish, French, Italian, and Portuguese, NIAVO also makes a distinction of the words gender (as many words have both masculine and feminine forms), which is an exclusive function of our product!  There is another cool and special function of NIAVO, that is, you can have the translation of a word in numerous languages in a single page. And you will find some interesting connections, for example: Spanish, French, Italian, and Portuguese are similiar, English is more similar to German, German is similiar to Dutch, Turkey is similar to Arabic in pronounciation, Japanese is similar to Chinese in Kanji, Korean is similiar to Chinese and Japanese in pronounciation, Polish is similiar to Russian in some grammar, etc  The functions of review and self-test are critical for a language learning app. NIAVO provides a powerful, visualized review method, help you gradually memorize the words. We support the following six quiz mode(Suppose learn Spanish through English): 1) Based on the English word, choose the correct Spanish word,  2) Listen Spanish pronunciation, choose the correct Spanish word 3) Based on the English word, put together the broken Spanish alphabet blocks 4) Listen Spanish pronunciation, put together the broken Spanish alphabet blocks 5) Listen Spanish pronunciation, then choose the correct Spanish voice 6) Listen Spanish pronunciation, then choose the correct English word  Main features: - You can learn Spanish, French, German, Japanese, Chinese, Italian, Korean, and Portuguese, Russian, Arabic, Dutch, Turkey, Polish, Hindi and even English. - It categorizes 1800 words into 70 categories, and you can refer to a word according to its category and listen to its pronunciation.  - It offers sample sentences for words, and the explanation and pronunciation of every word in the sentence can be referred to. - It supports powerful and versatile review functions, including 6 test modes, help you memorize the words faster. - It exclusively supports translation of words in multiple languages at the same time. - It exclusively supports gender distinction of words, applicable for Spanish, French, Italian, and Portuguese. - It supports romaji display in 6 languages, including Korean, Japanese, Chinese, Russian, Arabic and Hindi. - It supports search function, you can search word and sentence from the word bank. - It supports adding words to your favorites for ease of viewing. - It supports offline mode, so you can study even without network connections.  We will make continuous improvement of our products. If you have any questions or suggestions, welcome to send emails to the address androidhelp@smartlingoapps.com , and we will reply to you as soon as we receive you email.  Niavo supports localization in 17 languages, including English, Spanish, French, German, Japanese, Chinese, Italian, Korean, Portuguese, Russian, Arabic, Thai, Vietnamese, Dutch, Turkey, Polish and Hindi. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_CONFIGURATION', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.CHANGE_CONFIGURATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}