{
"name" : "Capitals of All Countries in the World: City Quiz",
"url" : "https://play.google.com/store/apps/details?id=com.asmolgam.capitals",
"package" : "com.asmolgam.capitals",
"category" : "Educational",
"description" : "Do you know that the capital of Canada is Ottawa? Or that Ankara is the capital of Turkey? What city is the capital of North Korea? Now you can learn the capital cities of all 197 independent countries and 43 dependent territories of the world. Test your knowledge in one of the best geography games.  All capitals are now divided by a continent: Europe - 59 capitals from Paris to Nicosia; Asia - 49 capitals: Manila and Islamabad; North America and the Caribbean islands: 40 capitals of such countries as Mexico and Jamaica; South America - 13 capitals - Buenos Aires, the capital of Argentina, among them; Africa: all 56 capitals, including Ghanas capital Accra; and finally Australia and Oceania where you can find 23 capitals, for example, New Zealands Wellington.  In this useful app, the capitals are also divided into three groups according to the level of difficulty: 1) National capitals of more well-known countries (Level 1) - such as Prague, the capital of Czechia. 2) Capital cities of exotic countries (Level 2) - Ulaanbaatar is the capital city of Mongolia. 3) Dependent territories and constituent countries (Level 3) - Cardiff is the capital of Wales.  The final option is to play with All 240 Capitals: from Washington, D.C. to Vatican City.  Choose the game mode and find the capital of your country:  1. Spelling quizzes (easy and hard) - guess the word letter by letter. 2. Multiple-choice questions (with 4 or 6 answer options) - Its important to remember that you have only 3 lives. 3. Time game (give as many answers as you can in 1 minute) - you should give more than 25 correct answers to get a star. 4. New game mode: Identify capital cities on the map. Two learning tools: * Flashcards (browse of cities in the game without guessing; you can mark which capitals you know poorly and want to repeat in the future). * Table of all capitals where you can search for a specific city or country.  The app is translated into 30 languages (including English, Spanish, German, etc.), so you can learn the names of the countries and capitals in any of them. Advertisements can be removed by an in-app-purchase.  Join millions of other people in studying geography of the world and become a pro by answering all questions correctly and getting all stars! ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}