{
"name" : "Lolabundle - Learning World",
"url" : "https://play.google.com/store/apps/details?id=com.beizoy.bundle.lolasworld",
"package" : "com.beizoy.bundle.lolasworld",
"category" : "Educational",
"description" : "NOTE! This application is intended for use with Lolas Learning Pack PRO app. You can try out the application two times for free. Lolas Learning Pack PRO can be downloaded from Play store Lolas Learning Pack PROi   Lolas Learning World is a comprehensive math game with dozens of tasks for hundreds of hours of child-friendly educational fun with Lola Panda. The tasks are developed with top educators to help improve school readiness for children ages 3-5. Correct answers earn more challenging tasks.  Lolas Learning World is a recipient of the prestigious Moms Choice Award.  LEARN:  - Measurement: Size, amount and number comparisons.  - Patterns & Sorting: Match groups and amounts. Compare objects. - Counting & Numbers: Number recognition. Count objects and numbers.  - Basic Operations: Addition with numbers and objects. Number sequencing.  - Geometry & Colors: Recognize shapes and colors.  Kids choose their favorite avatar and hop on the air ship to travel around the world! Educational math tasks teach fundamental skills, while other fun content and in-game rewards provide even more entertainment for the young adventurer.  There is no need to choose what level to play. The game automatically adjusts the difficulty level and rotates tasks in a logical way  starting from the easiest tasks and moving on to different or more challenging activities as the child gets the answers correct.  Lolas Learning World includes the entire curriculum with 102 engaging math tasks at all difficulty levels, to help get your child school-ready and math-confident. Kids love the choice of all seven avatars and all the fancy clothing items, fun accessories and toys, tasty in-game treats and 15 drawings to color.   This one-time purchase gives you access to all the content for an unlimited time.  Learning fun with Lola for the best math adventure ever! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}