{
"name" : "CompuLearn - Curso de computacion",
"url" : "https://play.google.com/store/apps/details?id=com.KeiverTorres.compulearn",
"package" : "com.KeiverTorres.compulearn",
"category" : "Education",
"description" : "Esta aplicacin fue diseada para un pblico en general que desee adquirir conocimientos sobre computadoras. La aplicacion consta de una documentacin detallada acerca de los componentes de una computadora y de algunos extras que interactan con esta. Sumado a esto la aplicacin incluye un juego que pone en prctica los conocimientos adquiridos durante el uso de la informacin dada por la plataforma.  Qu contiene la aplicacin?    Descripciones  Tips en caso de algunos errores en nuestras maquinas  Videos  Juego  Preguntas  Temporizadores Limita el tiempo de respuesta  Puntajes  Configuracin o Ajustes   Descripciones: contienen informacin cada artculo seleccionado.   Videos: son videos correspondientes a cada una de las descripciones dadas que sirven de apoyo y complemento.   Tips en caso de algunos errores en nuestras maquinas: Son diversos consejos o sugerencias en caso de tener algn problema con nuestros ordenadores y darle una solucin al problema.   Juego: sirve para afianzar un poco ms el conocimiento obtenido mediante la plataforma.  Preguntas: todas las preguntas relacionadas con la arquitectura de computadores y basadas en las descripciones dadas en la aplicacin.   Temporizadores: estn aplicados a las preguntas para dar un lmite al tiempo que puedas estar respondiendo las preguntas.   Puntajes: cada pregunta acertada sumara puntos esto para llevar un progreso y darle el toque de un juego de auto superacin.   Configuracin: Permite hacer unas pequeas configuraciones a la aplicacin This application was designed for a general public that wants to acquire knowledge about computers. The application consists of a detailed documentation about the components of a computer and some extras that interact with it. Added to this the application includes a game that puts into practice the knowledge acquired during the use of the information given by the platform.  What does the application contain?   Descriptions  Tips in case of some errors in our machines  Videos  Game  Questions  Timers Limit response time  Scores  Settings or Adjustments   Descriptions: contain each item selected.  Videos: are videos corresponding to each of the given descriptions that serve as support and complement.  Tips in case of some errors in our machines: They are various tips or suggestions in case of having a problem with our computers and give a solution to the problem.  Game: it serves to reinforce a little more the knowledge obtained through the platform.  Questions: all questions related to the architecture of computers and based on the descriptions given in the application.  Timers: are applied to the questions to give a limit to the time you can be answering the questions.  Scores: each successful question will add points this to take a progress and give the touch of a game of self improvement.  Configuration: Allows you to make some small configurations to the application ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}