{
"name" : "Cookie Calls",
"url" : "https://play.google.com/store/apps/details?id=com.sesameworkshop.cookiecalls.play",
"package" : "com.sesameworkshop.cookiecalls.play",
"category" : "Educational",
"description" : "This is an app full of fun phone calls from Cookie Monster, which will help teach your child about life skills and milestones.  Ring Ring, Cookie Monster here! Sesame Streets blue, cookie-loving monster wants to video chat with you! Receive video calls and voice messages, and when you call Cookie he is always there to answer.   FEATURES   Receive video calls from Cookie Monster, or dial Cookie yourself!   Receive voicemail from Cookie regularly and listen to the messages any time.   See live video of yourself in the corner of the screen while youre chatting with Cookie.   Grown-ups can activate calls or schedule calls for a variety of situations, such as nap time (more calls for getting ready to go, time to wake up, bedtime, brushing teeth and getting dressed available with additional call packs).   LEARN ABOUT  Cookie Calls encourages children to engage in a variety of healthy habits, from washing your hands to eating fruits and vegetables. This app also helps parents establish daily routines for their children.   CALL PACKS  Three calls from the Cookie Calls Sampler pack come unlocked. These calls give a taste of all the fun things Cookie wants to tell you about, like healthy eating, math and more. For even more calls you can unlock the remaining Sampler calls and buy additional packs easily right within the app.    Fortune Cookie: Cookie Monster shares ancient wisdom thats found inside of fortune cookies. (FREE)   Eat Your Colors: Cookie Monster calls to talk about, and eat, some of his favorite healthy foods like apples, avocados, and cauliflower!   Healthy Habits: Cookie Monster cant wait to tell you about the joy of exploring nature, the importance of getting exercise, and lots of other healthy habits!   Parents Helper: Daily routines are easier when Cookie Monster calls to talk about getting dressed, getting ready for bed time, and more!   Laugh with Cookie: Cookie Monster just wants to make you laugh!   Sing with Cookie: Sing along to classic kids songs with Cookie Monster, or just listen!    ABOUT US Sesame Workshops mission is to use the educational power of media to help kids everywhere grow smarter, stronger, and kinder. Delivered through a variety of platforms, including television programs, digital experiences, books and community engagement, its research-based programs are tailored to the needs of the communities and countries they serve. Learn more at www.sesameworkshop.org.  ABOUT IDEO IDEO is a human-centered design and innovation firm ranked independently among the ten most innovative companies in the world. Learn how our team of child-development experts, veteran toy designers and interaction designers approach the creation of award-winning kid apps at www.ideotoylab.com.   PRIVACY POLICY  The Privacy Policy can be found here:  http://www.sesameworkshop.org/privacypolicy   CONTACT US Your input is very important to us. If you have any questions, comments or need help, please contact us at: sesameworkshopapps@sesame.org. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_FINE_LOCATION']",
}