{
"name" : "Robots Coloring Pages",
"url" : "https://play.google.com/store/apps/details?id=com.forqan.tech.RobotsColoring",
"package" : "com.forqan.tech.RobotsColoring",
"category" : "Education",
"description" : "The application contains 60 images of robots, monsters and other creatures for coloring. The images are very attractive for adults and kids. Robots coloring is game full of robots, monsters, UFOs and space creatures. Color the robots coloring on your phone or tablet in this virtual coloring game and painting book. It so easy that even toddler can play, paint & draw. This coloring game where you can color animals. In this coloring game you can find many types of Robots.  Whats this Coloring Robots game for is about?  The application contains 60 images for coloring: Robots, Monsters, Space Creatures & UFOs.  You can easily fill out an entire region, draw with a pencil or brush and use an eraser  Both girls and boys will love it  20 beautiful colors.  You can paint, draw or doodle whenever they want to. Doodling, painting and drawing was never so easy and funny. Be creative by downloading this free app: robots coloring with many pictures which can be drawn, painted or doodle their own Robots and Monsters.  We, at Forqan Smart Tech, have always sought to provide the best for your family through applications designed, and directed each age group separately, our belief in the feature each evolutionary stage passes by your son, but in order to lend life skills and the mentality to learn and grow and play correctly and properly, and to communicate with his peers and the environment surrounding it. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_FINE_LOCATION']",
}