{
"name" : "Fortify – Quit Porn For Good",
"url" : "https://play.google.com/store/apps/details?id=com.ftnd.fortify",
"package" : "com.ftnd.fortify",
"category" : "Education",
"description" : "Fortify is an app combining a vibrant online support community with cutting-edge, research-oriented training and tools to help you move decisively in the direction of lasting, sustainable freedom from pornography.  We believe the journey toward lasting freedom can be a grand adventure involving courage, compassion, and incredible learning, involving trusted companionship along the way.   How do we know that? Because weve already seen over a million people rise up and insist that turning away from pornography is, in fact, a bold, strong, sexy and rebellious thing to do.  FORTIFY ORIGINS & FEATURES After hearing from tens of thousands of individuals asking the same question: Can you help me get this stuff out of my life? the creators of Fight the New Drug teamed up with researchers, neurologists, therapists, and other mental health experts to develop an educational platform offering a series of innovative training videos, an open community forum, a detailed battle tracker and analytics, and much more. Subsequently, 75,000 people in 155 different countries signed up to receive support. Based on feedback from early users, the entire training, platform, and experience has been updated, revised, and expanded with extensive opportunities for interaction and growth. These updates includes:  *Updated Battle Tracker: Track your daily victories and setbacks to help you find patterns allowing you to make adjustments and improvements.  *Messaging With Your Allies: Send and receive secure and private messages back and forth from the people in your life you trust most and who are helping you overcome this struggle.   *Real-Time Online Support Groups: Adult users (18+) can join a small group of other men or women in (gender-specific) support groups led by trained facilitators with experience in finding freedom from pornography. Message with group members 24-7  anytime you need.   *Messaging With a Coach: For adult users (18+) seeking more individualized support, they can access personalized guidance with a trained coach.   RISE AND RISE AGAIN No matter what youve faced in the past, this can be a new moment.   Your freedom and your happiness are worth it. Quitting porn has been shown to boost connections and improve sexual intimacy. Fortify users report an 85% decrease in depressive symptoms and an 88% reduction in porn use. And over 90% also reported that Fortify helped move them toward longer-term changes.  More than simply managing or coping for a few good days, are you ready for something more sustainable and lasting? Are you ready to join with tens of thousands of people ready to do whatever it takes to get there? ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}