{
"name" : "Stage: Whiteboard and Camera",
"url" : "https://play.google.com/store/apps/details?id=com.belkin.stage",
"package" : "com.belkin.stage",
"category" : "Education",
"description" : "Stage combines the convenience of a document camera with the power of an interactive whiteboard to bring your presentations to life. Create, present, and share directly from your tablet or phone. Set your ideas free with Stage.  Stage is an exciting teaching and demonstration tool for sharing ideas, creating rich lessons, and interacting with dynamic content. Use the device camera to display live video of objects, textbooks, student work, and other projects, and sketch, write, label, or laser point in real-time. With options like storing labels, screenshot capture, and wireless connection to a projector via Miracast (where available), Stage makes your presentations fully interactive, collaborative, and engaging.  HEAD OF THE CLASS  Sketch, take notes, and add labels over live video   Add photos from your photo library for picture-in-picture action  Save screens with one-click screen snapshot and recall from your photo library in the app  Dynamically present wirelessly using Miracast (if available for your device), or via a wired second screen/projector connection  Store and share labels for later usegreat for quizzes or whole-class review  Annotate, mark-up and save existing photos, screen captures, and document images   Easily switch backgrounds from video to picture to whiteboard/blackboard canvas  Insert and transform shapes (feature available as an in-app purchase)  Select from multiple pen colors and widths  Simple and accessible interface, especially for novice users.  EXTRA CREDIT Collaborative: Sharing ideas has never been easier. Stages live video and interactive tools let you showcase real-time problem solving and experimentation.  Portable: Stage makes wireless sharing quick and easy. With the added flexibility to move around the room, educators can truly engage and involve students and presenters are no longer tethered to the podium.  Easy-to-use: Unlike interactive whiteboards, Stage requires no additional training. Users familiar with touchscreens will be able to use the app instantly and efficiently.  Cost-efficient: More economical than secondary technology, such as interactive whiteboards and document cameras, Stage maintains the functionality of that same technology without the price tag and cost of integration.  Meaningful: Purposeful integration of tablets in the classroom creates opportunity for effective and rich learning for students at every level.  RAISE YOUR HAND At Belkin Education, everything we do is based on thoughtful innovation. For more information, visit us at www.belkin.com ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_LOGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_LOGS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
}