{
"name" : "English Grammar Advanced",
"url" : "https://play.google.com/store/apps/details?id=com.rj.quickenglish",
"package" : "com.rj.quickenglish",
"category" : "Education",
"description" : "1. Basic English Grammar Topics and Tests  - Basic terms like noun, pronoun, adjective, verbs, adverbs, etc. - Tenses : Simple Present Tense, Present Continuous Tense, Present Perfect Tense, Simple Past Tense, Past Continuous Tense, Past Perfect Tense, Future Tense, etc. - How to use Do, Does, Did  - How to use Be, Being, Been - How to Use Wh Questions like Why, How, What, Which, Whose, Where - difference between Who and Whom - difference between What and Which - difference between This and That / These and Those - difference between Much and Many - difference among In, At, and On - Type of Degrees of comparison or Use of Degrees of comparison - How to use Question Tags and Question Tags Rules - difference between Should and Could and Would - difference between May and Might  2. Advanced English Grammar Topics and Tests (Quiz) - difference between Between and Among - difference between Beside and Besides - difference between Since and For - difference between Until and Unless - difference between So and Such - difference between Some and Any - Use of Used to  - Use of However - Use of Having, Use of Having Said That, Use of Having To - Use of word The Hell  3. Basic and Advance English dialogues  4. Most used Phrasal Verbs like Pick Up, Hang Out, Break Down, Look Forward, Take Off, Take On, Take Over, Get By, Get Across and many more useful Phrasal Verbs.  5. List of opposites, words in pair, proverbs, etc.  6. Grammar tests collections for checking your grammar skill.  7. Random exercises for basic and advance English grammar topics.  8. Preparation for IELTS, TOEFL, SAT, MCAT, LSAT, GMAT, GRE.  9. Too many examples of all the basic and advanced English learning and speaking  10. Learn English quickly by highlighted points. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}