{
"name" : "Baby First words Flashcards - Kids Learning games",
"url" : "https://play.google.com/store/apps/details?id=com.baby.kidsgames.babyfirstword",
"package" : "com.baby.kidsgames.babyfirstword",
"category" : "Educational",
"description" : "The game is designed to help babies, toddlers and preschool kids expand their vocabulary and learn new sight words, discover new sounds while they play. Your child will love these educational baby games.  Baby first words includes 150 words in 7 Languages - English, Italian, German, French, Chinese, Korean & Japanese. Baby flashcards will help them to learn everyday objects.   The Baby learning game has 10 baby flashcard categories and 150 words (Zoo Animals, Fruits, Vegetables, households appliances and electronics, Vehicles & transport, Food, Outdoor & Park, Bathroom & toilet, eating & tableware, Toys). Includes animal flashcards and Vehicle flashcards that children can touch to hear the sound they make & tap touch swipe to play. This flashcard app is great to teach new words to your babies, toddlers and kids.   Turn your smart phone or tablet into a fun toy phone for kids  - Improve their memory with sight words - Colorful graphics & pictures keep your babies happy - Fun sound effects and amazing graphics, free games for toddlers - First words for baby has learning games for kids - Sound effects and Animations when your baby/toddler touches each image - Fruits and Vegetables for Kids - Food flashcards with delicious fruits and tasty vegetables - Perfect for children between the ages of 1 and 5 - It helps with communication skills (talking, listening, understanding) of babies and toddlers - Childrens games for 2 yrs old. Animal for kids is a great learning game for children - Baby flashcards can keep your kids entertained anywhere, anytime & help your kids learn alphabets, spelling & animals - Baby learning games for kindergarten children - Match puzzle game for kids   Best Kids game for Preschool and Kindergarten Learning - Game for babies   Kids learning games is ideal for parents and children to play and enjoy together. Playing is so easy that even a baby can do it without the help of an adult. Baby first words is a first words app for your toddlers, children and kids. You can use this app as baby flash cards or flash cards for toddlers. We cover all basic vocabulary for toddlers 1 year old, 2 years old, 3 years old and even older if English is your kids second language  Our free App for Kids help little kids to learn and increase the educational value derived from this game. Baby First Words. Kids Preschool games for little kids are fun educational games & offers learning games for 2 year olds to 5 year olds  Use this app as a baby first words app for toddler, kids, children. Furthermore, it can be also used as story books for kids and children app for kids educational purposes. First grade free kids learning game! These educational apps for toddlers have been created by GunjanApps, who develops interactive children learning games for toddlers age 3 to 5 yrs old.   With our educational games child will learn the alphabet, letters, numbers and phonics. Our games for preschoolers comply with the standards of Designed For Family. Explore smart kids games: fine motor skills games! Totally kindergarten learning free apps! Keep your child busy with educational games for kids!  Baby First words flashcards are the best learning games for kids & best toddler games. Baby phone games help with the Vocabulary Builder of letters of alphabet & before they read books or ride school bus even before they complete potty training. Word games for kids helps Kids learn to read. Best learning games for toddlers age 2 & preschool games for little kids.  Toddler games free for 2 year olds also act as a memory trainer for all the family! A fun toddler games free for 3 year olds with fun baby games and kids learning apps.   The app can be used as a supplementary teaching aid in foreign language instruction. Supported languages: English, Italian, German, French, Chinese, Korean & Japanese ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}