{
"name" : "Quiz Maker (Create Quiz, Questionnaire & Test)",
"url" : "https://play.google.com/store/apps/details?id=com.devup.qcm.maker",
"package" : "com.devup.qcm.maker",
"category" : "Education",
"description" : "Quiz Maker is a Mobile Application that allows you to play, create and share quizzes in a simple and intuitive way.  The questionnaires created using QuizMaker app are in the form of interactive tests quizzes that may contain pictures and sounds with automatic scoring. Thus, you can create your own quiz, play it and share it for self-evaluation or even for entertainment gaming purpose.  The Quiz Maker application offers the possibilities to: -Make your own quiz by creating:  multiple choice questions  single answer questions  open-ended questions -Share your creations easily as a (*.qcm file) -Receive, and play quizzes shared or received from your contacts as a simple portable and shareable file with extension *.qcm.  >What is a *.qcm file? Qcm file is file format that aims to supports interactive quizzes including pictures & sounds with automatic scoring. A *.qcm file is a compressed file that contains a set of questions, proposals, and answers. The structure of the files * .qcm makes it possible to embark among others multimedia contents such as images and sounds. Each * .qcm file is structured so that it is interpreted automatically by any compatible application.  > How does it work? Quiz Maker is a reader and an editor for file with *.qcm extension. It thus makes it possible to read and execute quiz / questionnaire files which are on your storage disk. Moreover, from its editing feature; it allows to edit questionnaire files through a simple and intuitive interface so that you can easily create your own questionnaire file from scratch or modify an existing one. When you edit a quiz, you can choose to export it as a shareable *.qcm file so that anyone with Quiz Maker or a compatible *.qcm reader can easily read and execute it.  Note that: QuizMaker app as a simple reader and editor for file with extension *.qcm, when you share a quiz as a simple shareable and portable *.qcm file, the receiver needs to have the QuizMaker app installed (or any other compatible *.qcm file reader) in order to play your shared Quiz file (*.qcm file)  If you look for more features you can use professional version of this sofware that will give you more configuration options with up to 8 types of questions-and-answers. Professional version is available here : https://play.google.com/store/apps/details?id=com.qmaker.qcm.maker  NB: The application comes with a single embedded questionnaire file demo.qcm that will allow you to discover and experience the possibilities offered by the application. Then you will be able to create your own or receive new quiz files (*.qcm) from your contacts to play or re-edit them.  > Extras -It is possible to import Q & A from a text file edited from your computer and which should be structured as defined here: https://github.com/Q-maker/document-qmaker-specifications/blob/master/file_structure/en/txt_question_answers_structuration.md  -You can import Q & A from any other *.qcm file received, edited, or downloaded.  -You can choose between two play modes: Exam mode or Challenge mode (Quiz-Game/Flashcard)   With Quiz Maker, play, create and share MCQ, quizzes & test easily.  ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'com.android.vending.BILLING', 'android.permission.GET_TASKS', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}