{
"name" : "Masha and The Bear: Xmas shopping",
"url" : "https://play.google.com/store/apps/details?id=com.psvnMaB.SupermarketNY",
"package" : "com.psvnMaB.SupermarketNY",
"category" : "Educational",
"description" : "New Year and Christmas are the most awaited holidays, all the families couldnt wait them to come. Kids write letters to Santa Claus, and parents decorate a Christmas tree and prepare New Year presents. Masha and the Bear has also prepared something special for you. We are not talking about new cartoons, but about funny interactive stories collected to a New Year fairytale! Today Masha and the Bear invite you to the forest, full of New Year magic and miracles, where snow is shining, your favorite animals are running, a Christmas tree is growing and the very Santa Claus live! A lot of fun is waiting for us!  Santa Claus is the main character of our story. Winter has come, New Year and Christmas are on their way. Thats why all the animals are waiting for their New Year presents. Every character from the cartoon Masha and the Bear has written their special letter to Santa Claus. We are going to help Santa Clause to collect these letters and then to read them. Then Santa Claus is going to a fairy forest supermarket and collect there all presents, which animals ordered. But this is not going to be the end of our adventures. Santa Claus has a lot to do before New Year and Christmas, and thats why he needs help. And, of course, Masha and the Bear are ready to help! They are going to have a walk through the winter forest, and deliver all the presents to the animals, which are waiting so much for them. At the very end of the game, Masha will make a holiday firework and salute. Welcome to the New Year fairy forest, where there are white snow, Christmas tree and Santa Claus which will give you a lot of fun!  Masha and the Bear invites everybody, who likes cartoons and adventures, to the New Year fairytale! Take care that everybody has its own Christmas magic present and watch our firework and salute. You will remember these fairytale winter and New Year holidays forever! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}