{
"name" : "Bunpo: Learn Japanese",
"url" : "https://play.google.com/store/apps/details?id=com.bunpoapp",
"package" : "com.bunpoapp",
"category" : "Education",
"description" : "Learn Japanese offline with free, fun lessons. Start learning Japanese now!  Bunpo is a free, fast and easy way to learn Japanese.   This free Japanese learning app provides grammar explanation and lessons for learners of any levels, from JLPT N5 to JLPT N4, JLPT N3, JLPT N2 and JLPT N1.  Get JLPT ready with interactive lessons.  The app offers over 1700 example sentences and 8000 Japanese grammar quiz questions. All comes with English-Japanese translations.  Key features: Learn Japanese Alphabets (Hiragana and Katakana): Study both hiragana and katakana easily  Hear how kanas are pronounced   Japanese grammar: Learn Japanese grammar. Detailed grammar notes in all lesson. The app contains explanation and exercises for all the grammar points of JLPT N5, JLPT N4, JLPT N3, JLPT N2, JLPT N1. All Japanese grammar are organized by its JLPT level.  Japanese Vocabulary: Learn Japanese words in each lesson. Tap on Japanese words to bring up the smart dictionary. (This feature makes you Japanese learning journey easy)  Learn Kanji: Improve your kanji recognition by reading Japanese sentences. Tap on kanji to bring up the smart dictionary. (Works as Japanese translator or dictionary) Study kanji grouped by JLPT levels. The app contains over 2500 kanji.  Read Japanese: Learn to read Japanese language sentences in each lessons. Great supplement for minna no nihongo (minano nihongo, minna) textbook. Smart tap function will work as Japanese translator or dictionary.  JLPT: Japanese grammar notes and exercises for any JLPT level N1 ,N2 ,N3 ,N4 ,N5   Offline mode: Learn Japanese offline  SRS(spaced repetition system): Enhance your studying with a personalized Japanese flash cards powered by SRS (spaced repetition system)  Subscription of Bunpo Plus Subscribe to Bunpo Plus and get access to the complete Bunpo courses, which has hundreds of premium contents, listening training and review system (spaced repetition system) to help you learn Japanese language anywhere, anytime. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}