{
"name" : "Zest: Discover Pro Marketing Content",
"url" : "https://play.google.com/store/apps/details?id=com.zestenlight",
"package" : "com.zestenlight",
"category" : "Education",
"description" : "Zest helps you learn marketing skills with community-curated news and content, handpicked and personalized specifically for your interests.  < 1% of all content is curated  Every marketing content piece is curated by a community of digital marketing experts who handpick only content that helps them learn at a senior level. Once submitted, the content is filtered and classified with Machine Learning to ensure it helps you learn and grow.  Zest is known for the < 1% acceptance rate for all marketing topics: social media marketing, SEO, affiliate marketing, branding, content marketing, email marketing, social media news and trends, and more  Only the news you need with AI  Zests adaptive content match engine ranks top curated content and news for you and delivers the amount of marketing content you need.  Every day you will be able to learn marketing from fresh and advanced content to support your project goals: whether it be optimizing your ecommerce site, getting buy-in for Instagrams influencer marketing, catching up with the news of Googles algorithm changes or taking your first steps to learn how SEO and blogging play together to amplify your content marketing efforts.  Explore the marketing library  Explore over 100,000+ marketing articles, news, podcasts and videos to learn marketing material you need to excel in your projects.  How you can research: Sort by marketing topics and learn to achieve short-term goals Discover the freshest news or most trending digital marketing content Search up marketing concepts: from Amazon affiliate marketing tactics, to distribution planning for your Medium blog. Follow community members who contribute advanced marketing content or news that you love the most  Grow your personal brand  Contribute content to Zest and grow your exposure and marketing credibility. You can also follow other Zesters to make new connections and learn marketing together by sharing the news.  Zest only accepts marketing content that can help other senior marketers learn or keep a pulse on the industry (news related content). That means content that is not about social media, affiliate marketing, product marketing, SEO, community growth, marketing news, paid advertising, email marketing, mobile marketing and more will be rejected. Form of content can vary from gated, to marketing whitepapers, podcasts, videos, ebooks, articles, PDFs and other forms that help you learn.  You can find Zests content guidelines online  What content you will find on Zest  Our community members learn the most from 32 different marketing topics, of which some are:  - Branding: learn how and when branding is done, how to maintain and build a strategy. - eCommerce: learn how to leverage buyer behaviour on scale. - Blogging: Discover master distribution tactics to drive traffic to your blog. - SEO: Complete guides on keyword research to generate organic traffic - Affiliate: Find the dos and donts for affiliate marketing campaign success - Social Media: Discover ultimate guides on how to improve social engagement - Email: learn how to structure bullet-proof drip email campaigns - Content Marketing: learn how to drive tangible ROI from your content distribution - Influencers: learn what it takes to create an effective influencer program - Mobile: be the first to know upcoming trends that will shape mobile marketing - News: Freshen up on the most up-to-date ideas and changes in marketing  And plenty more topics to help you learn as a professional and increase your productivity.  We would love to hear your feedback anytime, so make sure you message us at community@zest.is if you encounter any issues we should know about. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.zestenlight.permission.C2D_MESSAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAMERA', 'com.android.vending.BILLING']",
}