{
"name" : "Gujarat Forest 2020",
"url" : "https://play.google.com/store/apps/details?id=com.bharti.forest.forestbharati2018",
"package" : "com.bharti.forest.forestbharati2018",
"category" : "Education",
"description" : "Gujarat Forest Guard bharti 2020 exam give you very important question that according all type of Forest Guard exam syllabus. we have try to add all type of question with new patternt that ask in previous Gujarat Forest Guard Bharti 2020 and also you read it with Gujarati Language.   Feature of this app   Important Question and Answer according to forest class-3 syllabus.  Best Question and Answer Collection with best accuracy of answers.   Best app for Gujarat Forest Guard Exam preparation.  Quiz And Oneliner Two Mode for Test and Preparation.  USer also Take Screenshot and share it with social Media.  User can Report inaccurate Question and Answer.  User can Share with Social Media.     Most Important Question with this subject :   General Knowledge Question Test  Computer Test Exams   Psychology Test Exams   Gujarat History Exams Test  India History Exams Test  Science Exams Test  Gujarat Bhugol Exams   India Bhugol Exams   Gujarati Sahitya Exams   Constitution of India Exams    Whats Differant between MCQ(Multiple Choice Question) and One Liner.    MCQ (Multiple Choice Question) is gives you for choice option that according to best practice MCQ based paper.   One Liner is gives you better remembering of all questions answer. that show only question and answer for best  remembering practice.  Gujarat Forest Guard bharti exam 2019-20 give you to great opportunity for preparation of Forest Guard bharti and exam test that grow your knowladge and your confidence so Gujarat Forest Guard bharti exam 2018 install now and ready for success journey.  this is best Forest Guard bharti exam app for clark, assistant, peon etc online test and preparation of Forest Guard bharti exam 2019-20.  Forest bharti exam is best app for forest Guard clark, assistant and etc and Forest exams for other posts Test preparation  Now try this app for your success. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.bharti.forest.forestbharati2018.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}