{
"name" : "Flashcards maker: learn languages and vocabulary",
"url" : "https://play.google.com/store/apps/details?id=com.lexilize.fc",
"package" : "com.lexilize.fc",
"category" : "Education",
"description" : "Just imagine that learning of foreign language can be like a game and has nothing to do with boring memorization.  Lexilize Flashcards  the application, which make the learning process much easier. You can quickly make your dictionary with transcriptions, samples and an associative images and easily learn new vocabulary with 5 different games. Now available the auto translation function, which is powered by Yandex Dictionary API.  Learn every day for 10 minutes and it will be enough! Check for yourself. The app is free! It works without Internet and doesnt contain any ads.  You can learn English, German, French, Spanish, Italian, Chinese, Korean, Japanese and 102 more languages.  A full list of languages you can find by this link: http://lexilize.com/index_langs.html  The application ideally will suit you, if:  1. You are a student or a schoolboy. You need to memorize material and quickly learn a lot of foreign words. Build your words list in Excel file, import and study words between lessons. Share your cards with others.  2. You are a teacher. Prepare a list of words (phrases) in Excel and distribute the file to all your students by email or Telegram.  3. You are studying a foreign language on courses. After each lesson, make a list of new words(phrases) and learn them when you have a minute: in the subway, tram, staying in queue or even outside the city. Yes, this is also possible, since the application works without Internet.  4. You already know a foreign language, but want to expand your vocabulary. Write interesting and unfamiliar words, translate them automatically and learn words cards when you have time.  5. You are an expert of foreign language and with pleasure seek out any interesting nuances. Your goal is to create your own dictionary! Record all the interesting moments in Lexilize Flashcards and you can always find them in a second.  Why Lexilize Flashcards? - No ads - Training with 5 different games - Ability to repeat already learned material - Auto player mode - Works without Internet (learn words in subway, in shop or outside the city) - Associative images from Internet - Fields for transcriptions, genders, samples - Words colouring in genders color - You can add your own words and phrases - Auto translation function powered by Yandex Dictionary API - Pronunciation all your words and phrases with TTS - Customisable notifications - Import and Export files from Excel files - Support for 118 languages - Predefined categories for 41 languages - Ability to operate with words, phrases, dates, terms, formulas - Dictionary mode (You can quickly find your translations) - Learning statistic - Night mode  If you like the app - help other people to find it! Tell about the app in your review.  We are happy also to get your ideas.  You can send us your purposes and questions by email: feedback@lexilize.com or directly in Telegram.  To become a BETA tester, please follow by this link https://play.google.com/apps/testing/com.lexilize.fc ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_COURSE_LOCATION']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}