{
"name" : "XVI ENO VI CANCOA",
"url" : "https://play.google.com/store/apps/details?id=com.xvieno",
"package" : "com.xvieno",
"category" : "Education",
"description" : "Como el anterior XV ENO-VI CANCOA 2017 realizado en la ciudad de Bucaramanga; El encuentro est diseado para socializar las ltimas innovaciones y resultados de investigacin realizados en la Academia y la Industria Andina y el Caribe. El evento est diseado para la articulacin y la creacin de redes de investigadores de la academia y representantes de empresas para encontrar intereses comunes en Amrica Latina, as como socios para la colaboracin, adems de invertir en oportunidades.  Empresas-expositores interesados en los mercados de la regin de los pases latinoamericanos estn cordialmente invitados a presentar sus productos, servicios y tecnologas, y participar en la sesin de lanzamiento, especialmente diseada para aumentar el inters de todos los asistentes a eventos de empresas expositoras. Existe una tasa de descuento aplicada para las empresas que apoyan la investigacin en ptica en Latinoamrica. Esto es econmicamente razonable y poder utilizar esta opcin. Las reservaciones se hacen por orden de llegada. Para ms detalles, utilice los contactos que se enuncian a continuacin.  Este ao planeamos recopilar los puestos vacantes disponibles en las universidades colombianas y latinoamericanas (miembros y socios de la red ptica colombiana: RCO) y anunciarlos a los estudiantes e investigadores. Adems, planeamos recopilar las solicitudes de los estudiantes e investigadores para satisfacer las necesidades de la industria. Like the previous XV ENO-VI CANCOA 2017 held in the city of Bucaramanga; The meeting is designed to socialize the latest innovations and research results carried out in the Andean Academy and Industry and the Caribbean. The event is designed for the articulation and creation of networks of academy researchers and business representatives to find common interests in Latin America, as well as partners for collaboration, as well as investing in opportunities.  Companies-exhibitors interested in the markets of the region of Latin American countries are cordially invited to present their products, services and technologies, and participate in the launching session, specially designed to increase the interest of all attendees to exhibitor company events. There is a discount rate applied for companies that support optical research in Latin America. This is economically reasonable and can use this option. Reservations are made by order of arrival. For more details, use the contacts listed below.  This year we plan to collect the vacancies available at Colombian and Latin American universities (members and partners of the Colombian optical network: RCO) and announce them to students and researchers. In addition, we plan to collect applications from students and researchers to meet the needs of the industry. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE']",
}