{
"name" : "Clear Pitch Perfect Pitch Pro",
"url" : "https://play.google.com/store/apps/details?id=com.clearpitch.ClearPitch",
"package" : "com.clearpitch.ClearPitch",
"category" : "Education",
"description" : "Designed and created by Blake Kearney. Please see our website for detailed information at: https://www.clearpitch.net/  Clear Pitch explains and teaches perfect pitch, also known as absolute pitch. A user can expect to develop absolute pitch using this product, as well as improving other pitch coding abilities such as pitch memory, perfect piano and relative pitch.  Clear Pitch is suitable for children, adults, musicians and non musicians. Anyone can use Clear Pitch for its cognitive and tonal benefits.  The mechanics and algorithms of Clear Pitch are complex, but the usage is simple: Just press play and listen. You will develop better clarity in pitching and tonal hearing, and you will find your musical ability related to hearing will improve dramatically.  Perfect / absolute pitch ear training is explained clearly for the first time so you will learn and understand:  1) What it is, 2) How it works, 3) What you are trying to achieve,  4) How to achieve it.  This approach is entirely different to all other products that attempt to give a user perfect pitch but provide no explanation as to how the brain actually processes and learns the skill, and no system to do so.  Clear Pitch is the final chapter in ten years of academic research and vast quantitative and qualitative research, and includes the application of the findings of academics such as Dr. Daniel J. Levitin and Professor Diana Deutsch, leading exponents of absolute pitch theory. In short, Clear Pitch works differently.  In our research of all perfect pitch applications available they divide into three types:  1) Most (99%) are simply testing devices to see if you have the ability and with the hope that the user may possibly improve with repeated testing.  2) A few attempt to guide the listener toward hearing the unique quality of a pitch with claims that some pitches sound twangy or mellow. This approach is interesting but has no labelling component and consequently hasnt produced any convincing results.  3) The third group uses mnemonic cues such as colours to hopefully stimulate recognition of the chromas. This is probably the closest match, but is too esoteric and still doesnt institute the simple labelling required. When you hear C you want to think C, not blue.  All these systems overlook the actual mechanism required to develop the ability, which is the neural installation of a C.L.R. or chroma-label relationship. A C.L.R. is a neural association between a pitch and its name. Clear Pitch installs a C.L.R. in memory. CLEAR stands for Chroma Label Encoding and Retrieval. A chroma is the sound colour of a pitch, and a Label is its name. Encoding means to learn, and Retrieval means to remember. Clear Pitch is a chroma labelling system which results in a user being able to identify the name of all chromas or pitches in the chromatic scale by sound alone without reference. This is perfect pitch (absolute pitch / A.P.)  Clear Pitch contains a tutorial and on board instructions throughout the application of learning algorithms, that will explain and create a C.L.R. as you listen, and which leads to the perception of musical notes along with their names, or to be able to name a pitch without reference.  The C.L.R. is installed via mnemonic memory devices called tonal linguistic cues that stimulate the association of the chroma and its label. T.L.Cs are delivered via 4 central modes: Active Encoding, Passive Encoding, Active Retrieval, Passive Retrieval. Encoding creates the C.L.R. going in to your mind and retrieval stimulates the C.L.R. going out. Passive modes dont require any particular attention so you can listen while day dreaming or sleeping. Active modes are most effective when used interactively, but can also be listened to passively.  There is simply nothing available to date that comes as close to effecting absolute pitch as Clear Pitch does. Happy pitching with Clear Pitch. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING']",
}