{
"name" : "Urja Learning App",
"url" : "https://play.google.com/store/apps/details?id=com.magespider.urjalearningapp",
"package" : "com.magespider.urjalearningapp",
"category" : "Education",
"description" : "Urja is a revolutionary learning app that helps 10th, 11th and 12th Science students from Gujarat Board to prepare for their board and competitive exams effectively. The app offers complete learning programs for 11th and 12th science Maths, Physics, Chemistry and Biology and 10th Math and Science through high-quality expert video lectures and MCQ-based questions and their solutions.  Urja is the only app that provides complete learning programs in Gujarati language, addressing the need of students who prefer to learn in native language. Our video lectures and question banks are specially developed through collaborations with expert teachers in their fields, ensuring high-quality education for students in a smarter way.  The apps interface and the features are designed to make learning fun and smart.  Key App Features: Video Lectures: Each subject consist chapter wise videos to help students grasp the concepts quickly. The videos are recorded by some of the best teachers in the country to make sure learning remains effective for all.  Read: The Read module is designed for students who wish to go through all set of possible questions for each chapter in the subject and determine their solutions. This section helps in gaining more knowledge about possible questions asked in exams and prepare for it thoroughly.  Practice: With Practice module, students can start testing their knowledge by answering questions for each chapter in the subject. They can check the correct solution for each wrong question and improve their skills further.  Test: The Test module is where students can take the test from a set of pre-defined objective test or can create their own new test with timer settings to gauge their performance on how well they are doing for each subject.  Results: At the end of each test, students get the results based on the correct and wrong answers.  With Urja, our aim is to empower students from Gujarat Board with great quality educational material and eliminate the language barrier associated with learning.  Learn on the go, learn the smarter way. Learn with Urja.  Download the app today! ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.magespider.urjalearningapp.permission.C2D_MESSAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}