{
"name" : "The Ultimate Knowledge (TUK)",
"url" : "https://play.google.com/store/apps/details?id=com.tuk.education",
"package" : "com.tuk.education",
"category" : "Education",
"description" : "The Ultimate Knowledge is a dynamic e-learning portal, created simply to address the ever-growing need for information. The mantra of a successful individual or professional is a well-informed and well-spoken personality and this is where TUK steps in. TUK aims to create awareness among children from an early age. The portal contains a plethora of articles of different genres; technology, exotic travel destinations, discoveries, health facts and myths, amazing information, current affairs, busters, quotes, interactive worksheets and brain teasers. The articles are extensively researched and educative in nature. The various categories on TUK are: Technology: Technology is the keyword and TUK contains information on trending as well as upcoming technology.  Inventions and Discoveries: TUK has tried to accumulate and assimilate information on the most diverse and the most mundane findings. Science: Discover the world of science at TUK through simply written articles, stating the truth and discarding the myths.  A Glimpse and Inspiration: TUK offers a peek into the lives of stars who have carved a niche for themselves through their biographies. Creating an Alert and Sharp Brain: Sharpen your cognitive skills with the wide array of riddles, puzzles, jumbles and crosswords at TUK. These are just a few of the features on TUK. It offers much more along with the promise of something new every time the subscribers visit the portal. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}