{
"name" : "Colors and Shapes for Kids app free Preschool",
"url" : "https://play.google.com/store/apps/details?id=com.zodinplex.abc.kids.letters.colorsshapes.sounds.baby",
"package" : "com.zodinplex.abc.kids.letters.colorsshapes.sounds.baby",
"category" : "Education",
"description" : "Educational games for toddlers. Learn colors with fun! A great way to learn to recognize letters, numbers, colors, and shapes. Kids Preschool ABC Letters.   Features: early development, educational games, learning games, learn colors.  Learn shapes. Learning shapes. Learn geometrical shapes.  Learning geometrical shapes. Kids, children, toddlers, preschoolers. Games for kids, apps for kids, educational apps for kids. Educational apps.  Learning colors: red, pink, gray, brown, purple, blue, green, yellow and orange. So, your baby will learn 9 colors for kids in total. All the colors for babies are illustrated by three images with the objects of the same color.  Each flash card is highly illustrated and an animated picture flashes up with the associated shape and sound. Alphabet and numbers flash cards help children develop memory and listening skills. Children will get to know phonics and be able to connect letter sounds with objects, for example: A is for Apple.  Geometry (Ancient Greek: ; geo- earth, -metron measurement) is a branch of mathematics concerned with questions of shape, size, relative position of figures, and the properties of space. A mathematician who works in the field of geometry is called a geometer.   Color or colour (see spelling differences) is the visual perceptual property corresponding in humans to the categories called red, blue, yellow, green and others. Color derives from the spectrum of light (distribution of light power versus wavelength) interacting in the eye with the spectral sensitivities of the light receptors. Color categories and physical specifications of color are also associated with objects, materials, light sources, etc., based on their physical properties such as light absorption, reflection, or emission spectra. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}