{
"name" : "Colors and Shapes for Toddlers",
"url" : "https://play.google.com/store/apps/details?id=comm.apps.pic4kids",
"package" : "comm.apps.pic4kids",
"category" : "Educational",
"description" : "Colors and Shapes for Toddlers is a set of educational and development games. Basic colors and geometric shapes.  ***How to play?*** The game features 4 main learning modes: - teach geometric shapes ( rectangle, circle, etc) - teach the colors (all the colors of the rainbow) - teach the kids toys (cars, dolls, etc) - a main test(check the knowledge of the child). Depending on the game of the child will be able to see and remember what are those, or other objects and forms. Kid may play with the shapes and see how they interact interact with each other. For fixing of knowledge in the game there is a global test. You will then need to specify the issues at once on all the subjects in a random order.  ***Features of game*** - Your child become familiar with geometric shapes, learn how to find objects in the complex. - A little will study the colors and try to affect in the subjects. - The child learns the words, learns what are his toys. - The game will give you a few minutes of rest to mom and dad. - The opportunity to get acquainted with other languages (If you change the language of the game) - Learn names of the toys and how they sound - Game Improve abstract thinking, develop logic and memory - All the objects, shapes, and colors announced - The original of the test for the fixation of knowledge - A general review on each of the three themes - Training in the form of the game - All levels are clear to the child, the game is ideal for self-learning - The game is suitable for children from 2 years old. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}