{
"name" : "Learn computer keyboard shortcut keys",
"url" : "https://play.google.com/store/apps/details?id=computer.shortcut.keys.app",
"package" : "computer.shortcut.keys.app",
"category" : "Education",
"description" : "This application helps you to learn computer shortcut keys, every computer shortcuts are contained simple descriptions and this is the best computer shortcut app.  In this application have totally 7000+ shortcut keys with its simple descriptions.  Most of the user like the computer photoshop shortcut key, shortcut key excel, shortcut key in the computer, tally shortcut key and all are categorized in a to z computer shortcut key order.  Also, this application 100% working offline, no need internet connectivity, so this is the best computer shortcut keys offline app. Instead of computer shortcut key books free, we can use this application. All the computer shortcut command are described details.  Whole ms word shortcut keys and all the keyboard shortcut keys. Also, you can learn all types of windows keyboard shortcuts, Microsoft office key, keyboard shortcuts, all shortcut keys, windows shortcuts, computer sort key Also all keyboard shortcuts are aligned with control key shortcuts, basic computer shortcut keys, keyboard commands, ctrl shortcuts.      We have the following software shortcuts details 1) Windows Shortcut keys 2) mac shortcut keys  3) Microsoft Office a) Microsoft Word shortcut keys b) Microsoft Excel shortcut keys c) Microsoft powerpoint shortcut keys d) Microsoft access shortcut keys e) Microsoft outlook shortcut keys f) Microsoft frontpage shortcut keys  4) Adobe package a) Adobe photoshop shortcut keys b) Adobe illustrator shortcut keys c) Adobe indesign shortcut keys d) Adobe flash shortcut keys e) Adobe flash builder shortcut keys f) Adobe dreamweaver shortcut keys g) Adobe bridge shortcut keys h) Adobe encore shortcut keys i) Adobe after effects shortcut keys j) Adobe premier shortcut keys k) Adobe fireworks shortcut keys l) Adobe audition shortcut keys m) Adobe prelude shortcut keys n) Adobe speedgrade shortcut keys o) Adobe lightroom shortcut keys p) Adobe pagemaker shortcut keys q) Adobe coreldraw shortcut keys q) Adobe XD shortcut keys  5) Internet a) Chrome shortcut keys b) Firefox shortcut keys c) Internet Explore shortcut keys  6) Editors a) Notepad shortcut keys b) Notepad ++ shortcut keys c) Visual studio code shortcut keys  7) Media player a) VLC player shortcut keys b) MX player shortcut keys c) AIMP player shortcut keys d) Windows media player shortcut keys e) Real player shortcut keys f) KM player shortcut keys g) Winamp shortcut keys h) iTune shortcut keys  8) Basic shortcut keys a) Paint shortcut keys b) MS-DOS shortcut keys  9) Accounts a) Tally shortcut keys ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.VIBRATE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.READ_APP_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'computer.shortcut.keys.app.permission.RECEIVE_ADM_MESSAGE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.amazon.device.messaging.permission.RECEIVE', 'com.google.android.c2dm.permission.RECEIVE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.ACCESS_NETWORK_STATE', 'computer.shortcut.keys.app.permission.C2D_MESSAGE', 'com.oppo.launcher.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['computer.shortcut.keys.app.permission.RECEIVE_ADM_MESSAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}