{
"name" : "VR cyklista",
"url" : "https://play.google.com/store/apps/details?id=cz.bezpecnecesty.vrcyklista",
"package" : "cz.bezpecnecesty.vrcyklista",
"category" : "Education",
"description" : "Jak jezdit na kole bezpen a jak jsou pravidla pro mal i velk cyklisty. Aplikace obsahuje vechny nejdleitj rady a tipy pro cyklisty vech vkovch kategori. Dti a mlde jist ocen virtuln realitu, dospl a senioi monost jak 3D, tak klasick informace (texty, fotografie a videa).  Aplikaci je mon pouvat nkolika zpsoby:   VR reim  virtuln realita pro mobiln telefon a 3D brle Cardboard  3D reim  pro pouit bez 3D brl Cardboard  2D reim  texty, fotografie, videa a aplikace z oblasti bezpenosti cyklist  Disclaimer: Aplikace slou pro seznmen uivatel se zkladnmi pravidly bezpenosti na kole. V praxi je nutn ve procviovat s dosplmi osobami. Aplikace nenese odpovdnost za ppadn chyby a nesprvn pouit. Za bezpenost dt vdy ru rodii, ppadn zkonn zstupci.  Aplikace VR cyklista vznikla v rmci projektu Bezpen cesty, kter se dlouhodob sna o zlepen bezpenosti v doprav. Partnery projektu jsou KODA AUTO, Policie R a Horsk sluba R.  Projekt VR cyklista je financovn z fondu zbrany kod esk kancele pojistitel. How to ride your bike safely and what are the rules for small and large cyclists. The app contains all the most important advice and tips for cyclists of all ages. Children and young people will appreciate the virtual reality, adults and seniors the possibility of both 3D and classic information (texts, photos and videos).  There are several ways to use the app:   VR mode - virtual reality for mobile phone and 3D Cardboard glasses  3D Mode - for use without 3D Cardboard  2D mode - texts, photos, videos and applications related to safety of cyclists  Disclaimer: The application is used to familiarize users with the basic rules of bicycle safety. In practice, it is necessary to practice everything with adults. The application is not responsible for any errors and misuse. Parents and / or legal guardians are always responsible for the safety of children.  The VR cyclist application was developed as part of the Safe Routes project, which has long sought to improve transport safety. The project partners are KODA AUTO, the Police of the Czech Republic and the Mountain Rescue Service of the Czech Republic.  The VR cyclist project is financed by the Czech Insurers Bureau. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}