{
"name" : "Svět energie - 3D elektrárny",
"url" : "https://play.google.com/store/apps/details?id=cz.simopt.svetenergie.fyzikaenergetika",
"package" : "cz.simopt.svetenergie.fyzikaenergetika",
"category" : "Education",
"description" : "Aplikace Svt energie - 3D elektrrny umouje ve 3D realit nahldnout do rznch typ elektrren a prostednictvm nzornch 3D model prozkoumat jejich nejvznamnj technologick zazen, vetn jejich konstrukce, zkladnch princip, parametr a multimedilnch doplk. Aplikace je pedevm urena pro stedokolky, ale zajmav informace si zde najdou i zvdav ci druhho stupn Z a obsah je atraktivn i pro irokou veejnost.  Technologie uhelnch elektrren je prezentovna na modelu modernho Novho zdroje Elektrrny Ledvice, vodn elektrrny jsou zastoupeny akumulan a peerpvac elektrrnou ve tchovicch. V vodu kadho zdroje se mete seznmit s dispozinm eenm cel elektrrny, vbrem zvraznnch objekt se dostvte stle hloubji pes technologick celky a k jednotlivm zazenm, tvocm klov uzly v technologickm zapojen elektrrny. Tato informan rove obsahuje detailn 3D model vybranho zazen a mnostv doplujcch informac. Krom konstruknho hlediska a vizualizace funknosti zazen jsou to informace, tkajc se teoretickch podklad, konkrtn instalace zazen, galeri a rozhovor s obsluhujcm personlem nebo monost vyzkouet si een praktickch loh a interaktivnch pklad.  Vechny 3D modely celk i zazen jsou real-time vykreslovan, oten a zoom objekt je ovldno uivatelem. K pehlednosti a lepmu pochopen funknosti pispv i monost filtrace zobrazen jednotlivch st zazen.  Podrobnj informace jsou u koncovho modelu zazen rozdleny na nkolik skupin (informanch oken):  Vklad (Teorie)  pedstavuje krtk popis historie, konstruknch variant a zpsob vyuit energetickho zazen, jeho role v technologickm komplexu elektrrny. Jsou uvedeny praktick typy zazen podle rznch kritri, pouvan materily na vrobu nebo osobitosti energetickch instalac.  Fyzikln principy  informan okno seznamuje uivatele se zazenm z hlediska vyuit zkladnch fyziklnch princip a dj. Soust fyziklnch princip jsou i zkladn vzorce charakterizujc dan dj.  Parametry  informan okno s pehlednm vtem vech hlavnch parametr zazen. Pehledn tabulka obsahuje popisy a jednotky parametr, jejich obecn rozsah a konkrtn hodnoty pro popisovan energetick zdroj.  Fotografie  okno tvo galerie vybranch fotografi zazen v rznch pohledech a ezech, nzorn pedstavujcch skutenou podobu objektu, jeho velikost, tvar i msto (napklad ve strojovn nebo v koteln). Do fotogaleri jsou zalenny i uniktn dokumentrn zbry z vstavby.  Video z praxe  praktick vklad a seznmen se zazenm pmo na mst instalace v elektrrn.  loha  pro uivatele, kter problematika zaujala, jsou pipraveny matematicko-fyzikln lohy, k jejich zdrnmu vyeen jsou potebn vdomosti zskan v teoretick sti popisu konkrtnho zazen.  Interaktivn pokus  pro nkter zazen je dostupn i interaktivn pokus, kter pomoc uivatelskho nastaven ovldacch prvk na panelu simuluje reln chovn zazen. Vsledn (vypoten) parametry jsou prezentovny na obrazovce a kolem eitele pokusu je splnn pedepsanho zadn.  Testy  zvrenou soust podrobnho popisu kadho koncovho modelu jsou zkuebn testy, ve kterch si uivatel ov, co se o zazen nauil.  Ochrana osobnch daj  Aplikace ukld data do internho uloit zazen (intern pam nebo pamovou kartu) a proto vyaduje povolen pro prci s daty v zazen.  Aplikace odesl statistiky pouvn do Google Analytics.  Komunikace se serverem probh zabezpeenm protokolem. The World Energy - Power 3D in 3D reality allows insight into the various types of power plants and through vivid 3D models explore their most important technological devices, including their structure, basic principles, parameters, and multimedia accessories. The application is primarily intended for high school students, but interesting information here will also find explored by pupils of primary schools and the content is attractive to the general public.  The technology of coal-fired power plants is presented on the model of the modern New Ledvice power, hydropower plants are represented by storage and pumped storage power plant in tchovice. At the beginning of each source you can get acquainted with the layout of the entire plant, selecting the highlighted objects is getting deeper and deeper through technological systems to individual devices forming the key nodes in the technology elektrrny involvement. The information level contains detailed 3D model of the selected device and the amount of additional information. Krom structural point of view and visualization functionality of the device are information concerning the theoretical bases, concrete installation, galleries and interviews with service personnel or an opportunity to try to solve practical problems and interactive examples.  All 3D models of plants and facilities are real-time rendered, rotate and zoom objects is controlled by the user. For clarity and better understanding of the functionality also contributes to the possibility of filtering the display of individual parts.  More information is at the end of the model are subdivided into several groups (information window):  Interpretation (theory) - is a brief description of the history, design options and ways of using power equipment, its role in the technological complex plant. They show practical device types according to various criteria, materials used to manufacture or personality energy installations.  Physical principles - an information box gives users the facility in terms of utilization of basic physical principles and processes. As physical principles are the basic formulas characterizing a storyline.  Parameters - Information window with a clear list of all the major parameters. Overview table contains descriptions and units of parameters, their general scope and specific parameters for the energy source.  Photos - The window consists of selected photos gallery facilities in various views and sections, clearly representing the true nature of the object, its size, shape and location (for example, in the engine room or boiler room). Photo galleries are integrated into a unique documentary footage of the building.  Video from the practice - a practical interpretation and understanding of the machine directly on site at the plant.  Task - for users who are interested in the issue are prepared mathematical-physical tasks whose successful resolve required knowledge gained in the theoretical part of the description of a particular device.  Interaktivn attempt - for some devices is available on an interactive experiment that uses a custom control settings on the panel simulates the real behavior of the device. The resulting (calculated) parameters are presented on the screen and the task of the researcher is attempting fulfilling a prescribed task.  Tests - the final part of the detailed description of each end model, the test trials, in which the user verifies that what is learned about the device.  Protection of personal data  The application stores data in the internal storage device (internal memory or memory card) and therefore requires a permit for working with data in the device.  The application sends usage statistics to Google Analytics.  Communication with the server is a secure protocol. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}