{
"name" : "Levebee: Your Teaching Assistant",
"url" : "https://play.google.com/store/apps/details?id=cz.vcelka.androidapp",
"package" : "cz.vcelka.androidapp",
"category" : "Education",
"description" : "Levebee is an educational app used by language schools, private tutors and students.  Exercises available in the app are a combination of innovative technology and modern methods of teaching. Entertaining and engaging activities are suitable for all classes at any level. The app was created in cooperation with teachers and native speakers. Available languages are English and Spanish. German is coming soon!  Levebee can be used on a projector, interactive board, computer, tablet or phone with Android. Teachers are recommended to use Levebee in a browser while their students are practising in the Android app.  **FOR STUDENTS** With Levebee, students embark on a language journey full of engaging and entertaining activities. Levebee enables practising languages during the class as well as at home. Students complete their assignments electronically and immediately receive results. The app additionally asks them about their subjective opinion on the practised material and sends feedback to the teacher who, in turn, adjusts lessons accordingly. Students and parents can keep track of the progress as Levebee provides them with results reports.   **FOR PRIVATE TEACHERS** Teachers gain access to a database of exercises and activities suitable for any class regardless of currently practised materials or textbooks. The exercise menu is very intuitive as all activities are grouped in categories, topics and levels (labelled in accordance with Common Reference Levels). Instead of wasting time on researching and copying materials, teachers plan their lessons in the app. Tutors create a playlist including any exercises they find suitable and play them in the class. After the lesson, they assign homework to their students by simply adding them to students profiles. Before preparing for the next lesson, tutors check their pupils results which helps them personalise courses to students individual needs.   **FOR LANGUAGE SCHOOLS** Levebee enables language schools teachers and students to practise languages during lessons as well as at home. Students practise together in groups on a projector or interactive board or individually on tablets, laptops and phones. Interactive exercises save teachers time spent on researching, copying materials and checking students homework. Teachers may create profiles of numerous classes and assign activities to multiple students at once. After leaving the classroom teachers stay connected with their students as they have constant access to all of their results. Levebee helps teachers prepare for future lessons better and keeps courses customised. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}