{
"name" : "Learn Irish Tunes",
"url" : "https://play.google.com/store/apps/details?id=cz.vancisin.irt.android",
"package" : "cz.vancisin.irt.android",
"category" : "Education",
"description" : "Learn to play traditional Irish tunes in a natural and effective way!  Each tune is split into phrases and bars. The application walks you through them step by step. You listen to, play along and repeat each phrase in selected tempo until you feel comfortable playing it, then move to the next one. You can select from 4 predefined tempos, from the slowest to the fastest.  Application contains over 100 of the most famous and popular traditional Irish tunes - reels, jigs, slip jigs, slides, hornpipes and polkas. Each tune contains both sheet music and ABC notation. Doesnt matter whether you are tin whistle or fiddle player, this app is made to be useful for everyone.  The app also keeps progress of your learned tunes, so you will never forget the tunes you have learned.  Tune list:  A Fig For A Kiss Banish Misfortune Bill Sullivans Bill The Weavers Chief ONeills Favourite Comb Your Hair And Curl It Cooleys Cronins Danny Abs Denis Murphys Dennis Doodys Dever The Dancer Donnybrook Fair Drowsy Maggie Elizabeth Kellys Delight Farewell To Whiskey Fishers Garrett Barrys Give Us A Drink Of Water Going To The Well For Water Hardiman The Fiddler Her Golden Hair Was Hanging Down Her Back Hundred Pipers Ievans Polkka Jessicas Jimmy Wards John Ryans Kilfenora Kittys Wedding Loch Gamhna Maggie In The Woods Merrily Kissed The Quaker Mickey Duggan Miss McLeods Morrisons Mrs Ryans My Darling Asleep My Wifes My Own OKeeffes Off To California Out On The Ocean Palm Sunday Patsy Gearys Poll Hapenny Rolling In The Ryegrass Sonny Murrays Sweeneys The Ballydesmond The Banshee The Black Rogue The Blarney Pilgrim The Boys Of Ballisodare The Boys Of Bluehill The Britches Full Of Stitches The Brosna The Butterfly The Cat Rambles To The Childs Saucepan The Cliffs Of Moher The Cock And The Hen The Congress The Connaughtmans Rambles The Cuil Aodha The Cup Of Tea The Dingle Regatta The Drops Of Brandy The Earls Chair The Fermoy Lasses The Flowers Of Edinburgh The Foxhunters The Galway The Geese In The Bog The Harvest Home The Home Ruler The Humours Of Tulla The Humours Of Tullycrine The Humours Of Whiskey The Kerry The Kesh The Kid On The Mountain The Lark In The Morning The Lilting Banshee The Little Diamond The Little Fair Cannavans The Liverpool The Maid Behind The Bar The Maids Of Ardagh The Merry Blacksmith The Mountain Road The Musical Priest The Plains Of Boyle The Rakes Of Mallow The Rambling Pitchfork The Rattlin Bog The Rights Of Man The Road To Lisdoonvarna The Rocky Road To Dublin The Rolling Waves The Rose In The Heather The Sally Gardens The Salt The Scartaglen The Ships Are Sailing The Silver Spear The Snowy Path The Stack Of Barley The Star Above The Garter The Star Of Munster The Swaggering Jig The Toormore The Tournmore The Whinny Hills Of Leitrim The Wind That Shakes The Barley The Wise Maid Tobins Favourite Tripping Up The Stairs Where Is The Cat? ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.INTERNET']",
}