{
"name" : "Carlsen Weltraum VR",
"url" : "https://play.google.com/store/apps/details?id=de.carlsen.weltraum",
"package" : "de.carlsen.weltraum",
"category" : "Education",
"description" : "GEWINNER PDAGOGISCHER MEDIENPREIS 2018 NOMINIERT FR DEN DEUTSCHEN KINDERSOFTWAREPREIS TOMMI 2018    Erleben den Weltraum mit Virtual Reality!  Welches ist der grte Planet? Wie heit dieses Sternenbild? Was erforscht ein Astronaut? Das Weltall steckt voller spannender Informationen. Mit dieser Virtual-Reality-App erkundest du atemberaubende 360-Ansichten und schaust dir Planeten und Sterne aus nchster Nhe in 3-D an. Schau nach oben, nach unten oder hin und her  wohin du dich auch drehst, berall gibt es etwas zu entdecken!  SO GEHTS 1. App Carlsen Weltraum VR herunterladen und installieren. 2. App starten und das Smartphone in die Cardboard-Brille einlegen. 3. Entdecke Planeten, Sterne und vieles mehr...  Tipp: Halte deine Cardboard-Brille am besten mit beiden Hnden fest, damit das Smartphone an den Seiten nicht herausrutscht.    HHEPUNKTE - Planetensystem in 3-D erleben - Sternenbilder kennenlernen - Entstehung der Mondphasen und Jahreszeiten verstehen - 360-Ansicht einer Raumstation    BUCH ZUR APP Am 15.06.2018 erscheint das Buch zur App im Handel! Du kannst es hier vorbestellen: https://www.carlsen.de/hardcover/carlsen-clever-weltraum/93781    KONTAKT Sie haben Fragen, Rckmeldungen oder Anregungen? Dann schreiben Sie uns gerne eine E-Mail an apps@carlsen.de. Wir freuen uns auf Ihre Nachricht und werden uns schnellstmglich bei Ihnen zurckmelden. Auf Anfragen in den Bewertungen knnen wir leider nicht direkt antworten und bitten daher um eine Kontaktaufnahme per E-Mail.  Wir freuen uns ber eine Bewertung von Ihnen im Google Play Store! WINNER EDUCATIONAL MEDIA PRIZE 2018 NOMINATED FOR THE GERMAN CHILDRENS SOFTWARE AWARD TOMMI 2018    Experience space with Virtual Reality!  Which is the biggest planet? What is the name of this constellation? What is an astronaut researching? The universe is full of exciting information. Explore stunning 360  views with this virtual reality app, and see planets and stars up close in 3-D. Look up, down or back and forth - wherever you turn, there is something to discover everywhere!  HOW TO DO  1. Download and install Carlsen Space VR app. 2. Start the app and insert the smartphone in the Cardboard glasses. 3. Discover planets, stars and much more ...  Tip: It is best to hold on to your Cardboard glasses with both hands so that the smartphone does not slip out of the sides.    HIGHLIGHTS  - Experience the planetary system in 3-D - Get to know the stars - Understand the origin of the moon phases and seasons - 360  view of a space station    BOOK TO THE APP  On 15.06.2018 the book for the app appears in the trade! You can preorder it here: https://www.carlsen.de/hardcover/carlsen-clever-weltraum/93781    CONTACT  Do you have questions, feedback or suggestions? Then write us an E-Mail to apps@carlsen.de. We look forward to your message and will get back to you as soon as possible. Unfortunately, we are unable to respond directly to inquiries in the reviews and therefore ask you to contact us by e-mail.  We appreciate a review from you in the Google Play Store! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE']",
}