{
"name" : "Freggers Play: Learn to Code in 3D",
"url" : "https://play.google.com/store/apps/details?id=de.freggers.FreggersPlay",
"package" : "de.freggers.FreggersPlay",
"category" : "Educational",
"description" : "With Freggers Play, learning how to code can be easy as pie. You can tell stories with animated animals and characters or invent your own games. Or you just have fun building in 3D and at the same time improve creativity and spatial imagination. With its many possibilities our award-winning app inspires girls and boys of almost every age.   AWARDS  Childrens Media Award The White Elephant  Two fundings for exceptional educational game concepts   BUILD IN A DREAMLIKE SETTING  a vulcano island  a dusty desert landscape  a treasure island  with matching items and components  PLAY WITH CUTE PETS  cheeky dragons  lovely ponies  cuddly pandas  curious monkeys  leisurely turtles  INVENT STORIES WITH:  ninjas and kids  cowboys and Indians  castaways and tribe people  FOR FREE  all actions  all worlds  four complete sets with unlimited number of figures and items  additional sets can be purchased in-app  SPECIAL FEATURES  building in 3D with easy touch control. Successfully tested by 3-year-olds!  realistic physics-simulation: have you ever played dominoes with walls?  idea generator gives you billions of suggestions for new projects  REQUIREMENTS  NO coding experience needed   We are looking forward to your questions and your feedback! Write us an email to: info@freggersplay.com Visit our website: https://www.freggersplay.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
}