{
"name" : "Math Wiki - Learn Math",
"url" : "https://play.google.com/store/apps/details?id=de.lakdev.mathewiki",
"package" : "de.lakdev.mathewiki",
"category" : "Education",
"description" : "What is a linear function?, How to solve a quadratic equation?, What is the Pythagorean theorem all about?  Math Wiki provides numerous exercises and articles in the field of mathematics, which are helpful to better understand the foundations of mathematics. The app is also useful in preparation for middle school exams, high school and college math.  Math Wiki includes the following features:   portable and compact reference work for math  glossary of mathematical terms  numerous foundations from 7th grade  ideal for learning, reference and practice  simple and detailed explanations with lots of examples for better understanding  exercises on every topic  clear structuring with subtopics  search option  suitable for high school graduation and middle school exams  Math Wiki has many explanations of important topics of mathematics which are described in detail. In addition to the explanations there are examples and lots of tasks with solutions. Learn, repeat or practice math anytime and anywhere with our wiki and encyclopedia of mathematics.  The following topics are already included:  Arithmetic / laws of arithmetic / mathematical rules  Elementary arithmetic   Fractions  Percentage calculation   Brackets  Exponents and roots  Logarithms  Geometry  Geometric formulas  Pythagorean theorem  Trigonometry  Equations  Fractional equations  Linear equations  Quadratic equations  Systems of linear equations  Solve equations  Functions  Linear functions  Quadratic functions  Sine and cosine  Trigonometric functions  Exponential functions  Growth and decay  Real functions  Exponential functions  Rational functions  Family of curves  Stochastic  Random experiments and events  Probability  Calculating probability   Tree diagrams  Combinatorics  Statistics  Differential calculus  Differentiability and derivative  Derivative rules  Applying the derivative  Curve sketching  Applications of differential calculus  Integral calculus  Indefinite integral  Integration rules  Definite integrals  Calculating areas with integrals  Applications of integral calculus  Analytical geometry  Vectors  Vector algebra  Lines in three dimensions  Relative position of lines  Planes  Relative position of planes  We strive to constantly expand the app and add new items and tasks. Feel free to send us your feedback, requests, topics and suggestions to math@lakschool.com. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}