{
"name" : "Deutsch A1 Hören Lernen Prüfung",
"url" : "https://play.google.com/store/apps/details?id=de.lenado.Deutsch.A1Horen",
"package" : "de.lenado.Deutsch.A1Horen",
"category" : "Education",
"description" : "Deutsch lernen leicht gemacht! Hier setzten wir von Deutsch Hren A1 an: Wir wollen, dass Deutsch lernen nicht nur einfacher fllt, sondern auch das Ziel,  das hinter dem Lernen steckt, schneller erreichbar machen. Du willst Deutsch sprechen und verstehen knnen, ohne dabei in Karteikarten  und Grammatikbungen zu versinken? Dann ist Deutsch Hren A1 genau das Richtige fr Dich. Lernen und Spa machen passt fr dich nicht zusammen? Du denkst an deine Schulzeit, an Lernstress, Vokabelstapel und den strengen Blick  des Lehrers? Gut, denn jetzt weit du, dass Lernen auf die Art nicht fr jeden funktioniert und vor allem nicht jedem Spa macht.  Wie wre eine Art des Deutschlernens ohne Korrektur, ohne Grammatikbcher und ohne den anderen Kram, der dich demotiviert?  Beim Deutschlernen, oder generell beim Lernen von Sprachen geht es eigentlich darum die Sprache zu verstehen und sprechen zu knnen.  Wirklich Spa macht Deutsch nmlich erst, wenn man den Erfolg des Lernens merkt und sich mit anderen unterhalten kann.  Warum also bei der Grammatik beginnen, wenn man auch gleich mit dem verstehen und sprechen beginnen kann?  Ja wenn das nur so einfach wre sagst du jetzt, darauf knnen wir nur antworten genau so einfach ist es!. ber 500 der wichtigsten Deutsch Vokabeln kostenlos anhren, mit Beispiel-Phrasen. Trainiert euer Hrverstehen Deutsch A1 bis B1 mit unseren bungen zum ... Hrverstehen Deutsch - bungen zum Hrverstehen - Deutsch hren A1  Die besten kostenlosen Lernangebote  Mit Nachrichten, Reportagen und Radiosendungen das Hrverstndnis ben. Deutsch Lernen Online knnen Sie Audio-Texte und bungen auf drei Sprachniveaus anhren und so effektiv Hrverstehen, Aussprache, Wortschatz Sie Trainieren des Hrverstehens fr Lerner des Deutschen. Die Texte sind immer kurz. Deutsch lernen  Texte hren. Top-Thema mit Deutsche Vokabeln Sprachniveau B1. Learn German made easy! Here we start from Deutsch Hren A1: We want to make learning German not only easier, but also the goal that is behind learning, making it more accessible. You want to be able to speak and understand German without being in tabs and to sink grammar exercises? Then German Hearing A1 is just right for you. Learning and having fun does not fit together for you? You think about your school time, learning stress, vocabulary stack and the stern look the teachers? Good, because now you know that learning that way does not work for everyone and, above all, does not make everyone happy. How would one kind of learning German be without correction, without grammar books and without the other stuff that demotivates you? When learning German, or generally when learning languages, it is actually about understanding the language and being able to speak. German really only becomes fun when you notice the success of learning and can talk to others. So why start with grammar when you can begin to understand and speak with it? Yes, if only that would be so easy ... you say now, we can only answer that thats just how easy it is!. Listen to over 500 of the most important German vocabulary for free, with sample phrases. Train your listening comprehension German A1 to B1 with our exercises to ... Listening English - Exercises for Listening - Listening to German A1 The best free learning opportunities  Listening to news, news reports and radio broadcasts. Learn German Online you can listen to audio texts and exercises at three levels of speech, effectively listening, pronunciation, vocabulary They train listening comprehension for learners of German. The lyrics are always short. Learn German - listen to lyrics. Top topic with German vocabulary language level B1. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'de.lenado.Deutsch.A1Horen.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}