{
"name" : "World atlas & world map MxGeo",
"url" : "https://play.google.com/store/apps/details?id=de.mediaz.mxapp.hpbgeodefree",
"package" : "de.mediaz.mxapp.hpbgeodefree",
"category" : "Education",
"description" : "World atlas, world map and educational app for geography. Flags, position maps and basic data for more than 240 countries and territories of the world. Political maps with regional units and comprehensive economic and statistical country data for all African countries.  Designed for smartphones and tablets.   Flags, position maps and basic data for more than 240 countries of the world  Political maps and comprehensive data of all African countries  Interactive political world and continent maps  Shaded relief layer for world and continent maps  Geography quiz challenge for playful learning  Country comparison, favorites and distance calculator  Choropleth maps: area and population  Configurable world clock with time zone display  World-explorer: the smallest, largest, ... countries  No online connection required  Explore the world by political world and continent maps offline maps. Learn where each country in the world is located. View its position highlighted on a digital globe. Create your favorite color theme or choose from different color schemes for map display.  Do you know the flag of Zambia? Yes? Perfect. Do you also know in which country Mount Kilimanjaro is located? World atlas & world map MxGeo Free Quiz helps you acquire a geographic literacy in a playful manner.  Choose from six geo guessing games:   Test your knowledge about the capitals of Africa  Do you know the ISO countries codes?  Recognize the proper country flag based on the outline map  Do you know the top-level domains of each country?  Guess the highlighted country on the virtual globe  Do you know the mountains of Africa?  Geo learning app and educational game which is fun for everyone whether children, adults, seniors or teachers. Get ready for your next stay abroad while enjoying this great world almanac including time zones and statistical data, such as population growth, unemployment rate, average age, gross domestic product (GDP) by sector and other key figures. Or prepare for your next geography lesson with this genius digital world map. If not traveling our world atlas lets you explore the world just only virtually.  Free version includes comprehensive data and maps for all African countries. Get World atlas & world map MxGeo Pro with detailed data and maps including regional units and capitals for 240 countries and territories of the world: Europe, Asia, North America, Africa, Oceania and South America.  Version history: Ver. 1.x:  world map, country maps and flags  capitals, country flag and virtual globe quiz  world-explorer: explore the smallest, largest and most populated countries  country comparison: quick comparison of countries and territories  favorites: shortcut your favorite countries  corrections and updates of country data and maps  Ver. 2.x:  high resolution flags for all countries  population growth chart for all countries  no app permissions  continent maps of Asia, Europe, South and North America and Oceania  improved country comparison, with sorting function  Full-screen mode for Android >4.4  additional Geo Quiz: mountains of the world  corrections and updates of country data and maps  Ver. 3.x:  shaded relief layer for world and continent maps  interactive rotating virtual globe  performance optimization for map view  optional high quality mode for virtual globe  world clock: time zones map optimized  corrections and updates of country data and maps  Ver. 4.x:  countries maps update: now including neighbor countries and more details  additional regional position maps incl. marine region info  time series charts for gross domestic product (GDP) and unemployment rate added  distances and areas can now be displayed in kilometers or miles  info about voltage and plug types added  adjustable font size for map labels  choropleth maps by area and population  world-explorer: new key figure average temperature  corrections and updates of country data and maps ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.WAKE_LOCK']" 
"extra_perms" : "[]",
}