{
"name" : "Rune writer 2",
"url" : "https://play.google.com/store/apps/details?id=de.runewriter",
"package" : "de.runewriter",
"category" : "Education",
"description" : "This program translates Latin letters in some ancient or fictional alphabets. Write and post runic messages as pictures directly on Facebook or Google+ or use the pictures as your logo or background for your home screen.  Alphabets included in the free version - Elder Futhark Proto-Norse runes (1th9th centuries AD). - Gothic alphabet (4th7th centuries AD).  In the full version these alphabets are available: - Elder Futhark Proto-Norse runes (1th9th centuries AD). - Theban Witches alphabet used in modern Wicca (from 16th century). - Danish younger Futhark runes from viking age (9th-10th centuries AD). - Swedish-Norwegian Rk runes from viking age (9th-10th centuries AD). - Anglo-Saxon runes (4th10th centuries AD).  - Medieval runes (1100-1500 AD).  - Aryan Armanic runes. - Old Turkic script: also known as Gktrk script, Orkhon script, Orhun Yaztlar (8th-10th centuries AD).  - Gothic alphabet (4th7th centuries AD). - Celtic Ogham alphabet (4th10th centuries AD). - Klingon pIqaD (fictional from Star Trek). - Etruscan alphabet (8th1st centuries BC). - Ugaritic cuneiform (from around 1400 BCE). - Phoenician alphabet (from 1050 BCE). - Slavic Glagolitic alphabet (from 863 AD)  Translated text can be exported as PNG image. You can change the background color and font color and size.  Output text is UTF encoded. Please note that not all programs can display the translated text copied from Rune Writer, because not all apps have the needed fonts installed. You see then only question marks or empty squares.   Not all Latin characters can be translated directly into ancient alphabets, as appropriate characters are missing (eg all or some vowels in Ugaritic cuneiform and Phoenician alphabet). If you see a not translated characters, then it is no error - the target alphabet is missing the required letter.  Let me know if you needed some other translations or features. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
}