{
"name" : "Math Exercises for the brain, Math Riddles, Puzzle",
"url" : "https://play.google.com/store/apps/details?id=de.softan.brainstorm",
"package" : "de.softan.brainstorm",
"category" : "Educational",
"description" : "Increase your brain power and compete against players from around the world! Experience the heated battle that will keep you on your toes!  Free Math Games for everyone from kids to adults. Brain games is based on principles of cognitive psychology to help you practice different mental skills: memory, attention, speed, reaction, concentration, logic, mathematics, time tables and more math quiz.   Fight with other people in math game in multiplayer Arena in real time!   Quick Brain - it is a Puzzle game with many levels and multiplayer: - Multiplication table - Training game with flexible settings for math (Multiply, Plus, Minus, Divide), time for questions, complexity and type of game like Test, True / false or Input of answer with keyboard. - 2048 - puzzle with many sizes, 4x4, 5x5, 6x6, 7x7, 8x8 and speed level - True / False mathematics game - Mathematics Balance - Schulte table - Multiplayer Arena with leaderboards. You can fight with your friends in real time!  For all ages: games for kids, for parents and for everybody!  The main advantages: - quick developing of memory and attention for children and adults - efficient training of the brain - simple and understandable process of playing - game is available without Internet connection - app doesnt spend much time - number sense  The application will be useful for all ages: - students and kids - to master the basics of mathematics and arithmetic, learn multiplication table, prepare for math tests and exams - adults who want to keep their mind and brain in good shape  Develop your intellectual facilities by solving various mathematical tasks as quickly as possible: addition, subtraction, multiplication and division! Limited amount of time for answering only stimulates your brain to work faster, better and more efficiently.  Mountain your Math skills by playing Quick Brain daily! Compare your records with friends, thereby motivating yourself to be the best among them.  Brain Teasers do not require special knowledge so everyone can improve their brain function through repetition and adaptation.   In Quick Brain your main target is to reach the highest number possible within the time limit, all while dealing with the high difficulty and all the other challenges that appear as you play.  What is Quick Brain trainer?  - Your personal trainer in developing your skills; - Mathematics game (Multiply, Plus, Minus, Divide games); - Educational Puzzle; - 2048 puzzle game - Train concentration; - IQ trainer; - Smart & Quick Thinking ; - Faster Reaction Speed; - Simple and easy to use interface; - Designed for smartphones and tablets - Leaderboards of players.  Boost up your IQ with the mobile app Quick Brain!  Quick Brain math games is a brain-training, where logic & thinking & math meet fun, enjoyment, amusement and lighthearted pleasure. In our App We will See How To play together.   - We added the classic 2048 puzzle - addictive and a very simple number puzzle game. You join the numbers and get to the 2048 tile!   HOW TO PLAY in 2048 puzzle:  Swipe (Up, Down, Left, Right) to move the tiles. When two tiles with the same number touch, they merge into one. When 2048 tile is created, the player wins! 8 .. 16 ... 1024 .. 2048. To access Leaderboard, you will have to sign in using google plus account.  We in Facebook: https://www.facebook.com/OfficialQuickBrain/  Do not worry about your difficulties in Mathematics. I can assure you mine are still greater.  Albert Einstein. Welcome to Quick Brain, the puzzle game where you get the power of math in your hands.  Download that app for FREE now! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'de.softan.brainstorm.permission.C2D_MESSAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}