{
"name" : "GTReasy+ Demo",
"url" : "https://play.google.com/store/apps/details?id=de.schroedel.Unity.gtr.demo",
"package" : "de.schroedel.Unity.gtr.demo",
"category" : "Education",
"description" : "Testen Sie 30 Tage kostenlos unsere GTReasy+ App! Die App ist ein grafischer Taschenrechner, der speziell fr den Schulgebrauch und alle gngigen Tablets konzipiert wurde. Alle bentigten Funktionalitten sind bersichtlich sortiert und durch die intuitiven Bedienelemente ohne Handbuch verstndlich. Natrlich enthlt die App auch einen Prfungsmodus, der bei Aktivierung das Verlassen der App protokolliert und somit eine sichere Nutzung in Prfungssituationen erlaubt.  Im Funktionenplotter lassen sich Funktionen kinderleicht anlegen, plotten, analysieren und in Funktionswerttabellen darstellen. Ableitungen an der Stelle, die Flche unter einer Kurve und auch die Schnittflchen zwischen zwei Funktionen knnen automatisch angezeigt werden. Der klassischen Taschenrechnerbereich punktet mit eindeutigen Funktionsnamen, hilfreichen Rckmeldungen und Suchfunktionen sowie einem umfangreichen Funktionenkatalog. Numerische Lser zum Anzeigen von Schnittstellen und reellen Nullstellen sowie zum Lsen von Gleichungssystemen sind selbstverstndlich vorhanden. Der Statistikbereich bietet neben einer bersichtlichen Darstellung von Tabellen die Auswahl zahlreicher Diagrammarten und einen klar strukturierten Analysebereich, der neben der deskriptiven Statistik unterschiedliche Regressionsanstze sowie Binomial- und Normalverteilungen beinhaltet. Besonders praktisch: drei Profile ermglichen es, unterschiedliche Einstellungen zu speichern und z.B. fr verschiedene Fcheranforderungen wieder aufzurufen. Try our GTReasy + app for 30 days for free! The app is a graphical calculator, which was designed especially for school use and all popular tablets. All required functions are clearly sorted and understandable through the intuitive controls without a manual. Of course, the app also includes a test mode, which logs the activation of leaving the app and thus allows safe use in exam situations. The functions plotter makes it easy to create, plot, analyze and display functions in function value tables. Derivatives at the location, the area under a curve and also the intersection between two functions can be displayed automatically. The classic calculator range scores points with unique function names, helpful feedback and search functions as well as a comprehensive function catalog. Numerical solvers for displaying interfaces and real zeros as well as for solving systems of equations are of course available. In addition to a clear overview of tables, the statistics section offers a choice of numerous diagram types and a clearly structured analysis section, which includes descriptive statistics, different regression approaches, and binomial and normal distributions. Especially handy: three profiles allow you to store different settings and save, for example, to recall for different fan requirements. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}