{
"name" : "Wort des Tages: Italienisch - Vokabeln lernen",
"url" : "https://play.google.com/store/apps/details?id=de.spotlight.wordoftheday.adesso",
"package" : "de.spotlight.wordoftheday.adesso",
"category" : "Education",
"description" : "Lernen Sie jeden Tag eine neue italienische Vokabel  und verbessern Sie Ihren Wortschatz ganz stressfrei.  Italien, das ist La Dolce Vita. Da sollte das Studium der italienischen Sprache natrlich nicht fr stupides Auswendiglernen stehen. So ganz ohne Vokabeltraining geht es aber doch nicht.  Mit unserer kostenlosen Italienisch-Lern-App verbessern Sie Ihren Wortschatz ganz nebenbei: Eine Vokabel pro Tag erscheint erstmal wenig. Wenn Sie aber kontinuierlich am Ball bleiben, werden Sie jedoch bald Lernerfolge feiern.   LA PAROLA DEL GIORNO IST DIE IDEALE APP FR SIE, WENN SIE...   jeden Tag ein bisschen fr Ihr Italienisch tun wollen  Ihren Wortschatz kontinuierlich erweitern mchten  im Idealfall bereits ber Grundkenntnisse im Bezug auf Wortschatz und Grammatik verfgen  DIE APP IM BERBLICK:   Sie lernen jeden Tag eine italienische Vokabel oder Redewendung    natrlich inklusive der deutschen bersetzung  Sie knnen sich die italienische Aussprache direkt in der App anhren; die Aufnahmen stammen von Muttersprachlern  Die App zeigt auf einen Blick, um welche Wortart es sich handelt  Mithilfe eines Beispielsatzes lernen Sie die neue Wendung im Kontext kennen   WEITERE FUNKTIONEN DER KOSTENLOSEN ITALIENISCH-LERN-APP:   Sie knnen bis zu 30 Tage zurckblttern  z.B. um die Vokabeln der letzten Tage zu wiederholen  Push-Notifications erinnern Sie  falls gewnscht  an Ihre tgliche Dosis Italienisch  Alle Funktionen sind kostenlos in der App enthalten.  IHRE SPRACHEXPERTEN HINTER LA PAROLA DEL GIORNO: DER SPOTLIGHT VERLAG  La parola del giorno wurde von den Redakteurinnen und Redakteuren des Spotlight Verlag entwickelt.  Der Spotlight Verlag garantiert fr:   langjhrige Erfahrung in der Konzeption von Medien zum genussvollen Sprachlernen  hohe Qualittsstandards: an den Produkten des Spotlight Verlages arbeiten erfahrene Sprachdidaktiker und Muttersprachler   eine ideale Mischung aus Lernen und Unterhaltung: wir sind berzeugt, dass Sie anhand von spannenden, aktuellen Themen am besten lernen  Mehr ber den Spotlight Verlag: www.spotlight-verlag.de   VERBESSERN SIE IHR ITALIENISCH MIT DEN PRODUKTEN VON ADESSO   Sie wollen mehr fr Ihr Italienisch tun? Und ganz nebenbei in die Kultur und das Alltagsleben in Rom, Mailand oder Florenz eintauchen? Dann knnte Sie Adesso interessieren.  So knnen Sie mit Adesso Ihr Italienisch verbessern:   MAGAZIN: Einmal im Monat versorgt Sie die Zeitschrift Adesso mit spannenden Reportagen, aktuellen Nachrichten, Interviews und Rezepten. Beim Verstehen der italienischen Texte helfen Vokabellisten mit bersetzungen fr schwierige oder seltene Ausdrcke. Erklrungen und bungen, insbesondere zur italienischen Grammatik und dem Wortschatz, helfen Lesern, ihre Sprachkenntnisse zu verbessern. Adesso ist als Zeitschrift, E-Paper oder in der Adesso-Kiosk-App erhltlich.   PLUS-HEFT: Das Trainingsheft mit zustzlichen bungen  funktioniert wunderbar als Ergnzung zum Magazin. Es ist gedruckt oder als E-Paper erhltlich.   AUDIO-TRAINER: Hrverstndnis und Aussprache knnen Sie mit dem Audio-Trainer von Adessofestigen. Er enthlt spannende Texte, Erklrungen rund um die italienische Sprache sowie kleine Audio-bungen. Alle Inhalte werden von italienischen Muttersprachlern aufgenommen. Den Audio-Trainer gibt es als Download, CD oder eingebettet in die Adesso-Kiosk-App.   Weitere Informationen zum Angebot von Adesso finden Sie unter: www.adesso-online.de/i-nostri-prodotti   WEITERE APPS DES SPOTLIGHT VERLAGS  Mit der Adesso-Kiosk-App knnen Sie das Magazin und den Audiotrainer ganz bequem innerhalb einer App (iOS und Android) nutzen: adesso-online.de/produkte/adesso-app    KONTAKT:  Bei Fragen wenden Sie sich an: apps@spotlight-verlag.de Learn every day a new Italian vocabulary - and enhance all stress your vocabulary.  Italy, which is La Dolce Vita. Since the study of Italian language should not stand for mindless memorization of course. but so entirely without vocabulary trainings not the point.  improve our free Italian learning app your vocabulary by the way: A word a day appears first little. but if you stay on the ball continuously, but they will soon celebrate student achievement.  LA PAROLA DEL GIORNO IS THE IDEAL APP FOR YOU IF YOU ...   every day want to do a bit for your Italian to extend continuously  your vocabulary  ideally already have a basic knowledge in terms of vocabulary and grammar  THE APP AT A GLANCE:   You learn every day an Italian word or phrase ...  ... of course, including the German translation  You can listen to the Italian pronunciation right in the app; the photographs were taken by native  The app shows at a glance which part of speech is it  Using an example sentence you learn about the new twist in context  OTHER FEATURES OF THE FREE ITALIAN LEARNING App:   You can scroll back up to 30 days - for example, to repeat the words of the last days  push notifications to remind you - if desired - to your daily dose of Italian  All features are included free with the app.  YOUR LANGUAGE EXPERTS BEHIND LA PAROLA DEL GIORNO: THE SPOTLIGHT VERLAG  La parola del giorno was developed by the editors and editors of Spotlight Verlag.  Spotlight Verlag guarantees:  many years of experience in the design of media for enjoyable language learning  high quality standards in the products of Spotlight publishing work experienced language teachers and native speakers  an ideal blend of learning and entertainment, we are confident that you will based on interesting, current topics learn best  More on the Spotlight Publisher: www.spotlight-verlag.de  IMPROVE YOUR ITALIAN WITH THE PRODUCTS OF ADESSO  You want to do more for your Italian? And by the way immerse themselves in the culture and daily life in Rome, Milan and Florence? Then you might be interested Adesso.  So you can improve your Adesso Italian:   MAGAZINE: Once a month you supplied the magazine Adesso with exciting reports, news, interviews, and recipes. In understanding the Italian texts help vocabulary lists with translations for difficult or rare expressions. Explanations and exercises, in particular for Italian grammar and vocabulary, help readers improve their language skills. Adesso is available as a magazine, e-paper or in the Adesso kiosk app.   PLUS ISSUE: The training booklet with additional exercises - works great as a supplement to the magazine. It is printed or available as an e-paper.   AUDIO TRAINER: listening and pronunciation you can use the audio coach Adessofestigen. It contains interesting articles, statements about the Italian language and small audio exercises. All contents are recorded by Italian native speakers. The audio coach is available as a download, CD or embedded in the Adesso kiosk app.  Further information on the offer from Adesso, see: www.adesso-online.de/i-nostri-prodotti  MORE APPS THE SPOTLIGHT PUBLISHER  With the Adesso kiosk app you can use the magazine and the audio coach comfortably within an app (iOS and Android): adesso-online.de/produkte/adesso-app   CONTACT:  For questions please contact: apps@spotlight-verlag.de ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}