{
"name" : "Unlock any Device Guide 2020:",
"url" : "https://play.google.com/store/apps/details?id=device.password.iqra_tech_unlock.mobile_guide",
"package" : "device.password.iqra_tech_unlock.mobile_guide",
"category" : "Education",
"description" : "This app provides guide to unlock any android devices and others. Unlock any device by remove password, Hard reset, unlock without account and much more features. Unlock any phone guidelines. Provides screenshots for guidelines. How to unlock lava phones Screen overlay detected solution. Guideline to unlock phone Unlock T-Mobiles tips Unlock Verizon mobiles guide Provide Guidelines to unlock phone by Google account or without Google account Provide guidelines to unlock phones by using third party PC software to remove passwords Factory data reset How to unlock a Three phone How to Unlock Mobile Wireless Device Use Google to Unlock Your device Use Restore factory settings to remove password Using third party Software to Unlock without losing Data Simply Reset your Android Device Use Fitbit to Unlock Your device Find, lock, or erase a lost Android device How to Unlock Virgin Media Phone Unlocking android 4.4 KitKat or earlier versions Set Automatically Unlock Your Device How to block Bluetooth  Warning: This is not official app of any cell brand, it is just for guide purpose. First made backup of your important data and then then try any tip. Enjoy and share it with your friends. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}