{
"name" : "Macmillan English Dictionary",
"url" : "https://play.google.com/store/apps/details?id=dictadv.english.britishmacmillan",
"package" : "dictadv.english.britishmacmillan",
"category" : "Education",
"description" : "The most up to date, comprehensive and best value students dictionary on the market. This major new dictionary has been created from scratch, by two teams of over 100 lexicographers, working in Britain and America. Using a corpus of over 200 million words collected from contemporary written and spoken sources, Macmillan English Dictionary gives the most up-to-date information available about the meanings of words and how they are used in todays English. The whole dictionary has been designed for ease of use by students of English. Clear and simple definitions of over 100,000 British and American words and phrases are written using a defining vocabulary of no more than 2500 words. Longer entries are introduced by a menu to help you to find the correct meaning fast. Over 80,000 examples show the defined word in a real context which further strengthens students understanding. Although English has at least 600,000 different words, 90 percent of all the written and spoken language we read and hear are made up from only 7,500 frequent words. These 7,500 words are highlighted in red, and treated in more detail, with extra information and examples. A practical reference book for the classroom and home, Macmillan English Dictionary helps students with words that are needed for communicating in English, and offers invaluable support for those who want to write and speak accurate and contemporary English.  The most up-to-date dictionary for learners of English!  * Over 100,000 references and 80,000 examples of words in use  * More references than any other English learnersbliog dictionary  * Only 2,500 words used to define all entries  * Up-to-date information on new words, spoken English and changes in meaning  * Short and clear definitions, with menus in longer entries to help find the meaning quickly    Although the English language is made up of over one million individual words, 90% of all written and spoken text consists of 7,500. The Macmillan English Dictionary highlights these vital 7,500 in red, encouraging learners to swiftly grasp the core words necessary to speak and write fluently. This is a practical reference book for the classroom and home, offering invaluable support for those wishing to write and speak English accurately.  Application Features: - Full content of the print dictionary - PLUS additional collocations, synonyms, and word origins - Guide on how to use the dictionary - Search using wildcards and suggested words - Predictive text in search helps you with spelling as you look for words - Search for idioms and phrasal verbs - Search history to help you find recently searched for words - Support for search from within other compatible apps on your device - Bookmark your favorite words ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'dictadv.english.britishmacmillan.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}