{
"name" : "ReWi",
"url" : "https://play.google.com/store/apps/details?id=edu.yale.rewi",
"package" : "edu.yale.rewi",
"category" : "Education",
"description" : "Change your behavior and become happier. ReWi will help you rewire your brain to build healthier habits.  ReWi is an app developed for students in Dr. Laurie Santos new wellness course, which is taught at Yale University as a semester-long course (Psychology and the Good Life) and online as a Coursera course (The Science of Well-Being).  The app allows you to track eight activities that are known to promote increase in well-being. These include sleep, exercise, meditation, goal setting, gratitude, kindness, social connection, and savoring. All of these practices are based on psychological research suggesting that increasing these practices can lead to increased happiness. You can choose to log responses for any of the wellness activities at any given time on a daily basis. The more you log, the more likely it is that you will establish long-term change! Logging becomes easier the more you do it.  Track your progress with: * Daily streaks * Total activities logged * Calendar view of each activity * Bar chart view of all activities tracked over time  Beyond merely tracking activities, you can even practice several activities on the app itself such as listening to meditation tracks and visualizing effective goal setting with a rotation of prompts.  While there are many existing wellness-related tracking apps out there, ReWi houses all the course-specific wellness activities all in one interface. The course team designed ReWi with the hope of facilitating positive behavior change.  All you need to do to get started is download the app for free and sign up. Start with one habit, practice it in your daily life, log it on the app, and begin to see how your behavior and mood changes over time.  Please be aware that app usage data may be used for empirical research and you will be asked to give consent within the onboarding screens of the app. Consent is completely optional. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}