{
"name" : "Class Notes of Mathematics Rakesh Yadav",
"url" : "https://play.google.com/store/apps/details?id=ek.ryclassnotesmathengcom.techzone.higher.secondarycom.downloadclassnotes.app.creative",
"package" : "ek.ryclassnotesmathengcom.techzone.higher.secondarycom.downloadclassnotes.app.creative",
"category" : "Education",
"description" : "Class Notes of Mathematics Rakesh Yadav Class Notes of Mathematics Rakesh Yadav Key Questions and Answers  Class Notes of Mathematics Rakesh Yadav consists of a collection of maths apps in hindi exam questions with key answers and discussion of each of your answers.  Class Notes of Mathematics Rakesh Yadav is an educational application of maths in hindi simulation and learning about maths in hindi material as well as complete mathematics and arithmetic.  Problems contained in the test maths apps in hindi of Class Notes of Mathematics Rakesh Yadav is a matter of maths in hindi and complete mathematics and arithmetic. which we have summarized from maths in hindi and complete mathematics and arithmeti rakesh yadav  A set of maths in hindi exams as well as complete mathematics and arithmetic. based on the grid provided by the education office. As for the matter of Exercise maths in hindi and complete mathematics and arithmetic. , and Problem Try Out maths in hindi and complete mathematics and arithmetic. even in maths apps in hindi.  Class Notes of Mathematics Rakesh Yadavs Subjects include: Time and work Pipe and cistern Time and distance Boat and stream Percentage Profit and loss Mixture and allegation Ratio and proportion Partnership Average Compound interest Simple interest  ADVANCED MATHS (VOLUME-2)  Number system and algebra HCF and LCM Geometry Co-ordinate geometry 2D mensuration 3D mensuration Trigonometry Height and distance Data interpretation Arithmetic (Volume-1)                            ********************* Advance Maths (Volume-2) *********************              (2D)  (3D)      Hopefully this app will help you to understand math lesson in hindi ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}