{
"name" : "e-School",
"url" : "https://play.google.com/store/apps/details?id=elica.elicaknowledge",
"package" : "elica.elicaknowledge",
"category" : "Education",
"description" : "This app is knowledge based app made for service people. The service person can learn many things from this app. To avail the benefit of services which are available in this app, user has to first sign up into app. Then your request for registration will accept from head office and your account is created successfully. Then Login into app with user id and password which are provided by user at the time of registration. After login user can take the benefit of app. Features of App : 1. Service Bulletin : In service bulletin user will get all the information regarding the products like product aesthetics and design, product features, Installation diagrams, FAQs, Caution and care etc.  2. Demo & Installation : In this menu user will get all the demo and installation videos of products.  3. Service : In this menu user will get all the service related videos of products, like any problem occur in product how to solve it, If any error code occur then how to solve it, how to change jets, how to clean filters etc.  4. FAQs : User will get all the answers for the questions which I are frequently ask by customers. For that user has to first select the product family then model and click on submit the related file will open.  5. Charges : User will get all the charges list here I.e. installation charges, visiting charges, service charges, ducting pipe charges etc.  6. Warranty policy : User can read warranty policy from here.  7. Features : In this menu user will get features of the selected product, also the image of the selected product, installation diagram of the selected product. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}