{
"name" : "Memory Game: Learn English",
"url" : "https://play.google.com/store/apps/details?id=english.word.matching.game",
"package" : "english.word.matching.game",
"category" : "Education",
"description" : "Have fun learning English with memory game!  Are you are looking for a fun game to expand your English vocabulary and common English words rapidly?  Then you should try out Matching Game: Learn English!  Unlike most games to learn English, with the Matching Game: Learn English you will have more fun learning through playing. You can keep playing and soon realize that you know automatically the meaning of the words you dont recognize on your first attempt.  Features   Matching Game: Learn English Includes thousands of English words across 100+ levels   Matching Game: Learning English has unique game mechanics that will make you want to keep playing   Matching Game: Learning English is super easy to use and fun to learn for all ages   Play games to learn English with Matching Game: Learning English, you will unlock new levels and track as you progress   Matching Game: Learning English will be fully customizable - You will be able to setup your levels for family and friends (coming soon)   Matching Game: Learning English optimized for all devices - You can play games to learn English offline   Matching Game: Learning English includes many selected carefully English words from classic British English literature, American English literature, and academic papers   Vocabulary in the Matching Game: Learn English is accompanied by standard voice readers  Weve come a long way from our 7+ years of developing apps and games for people to learn English. Give it a shot and let us know what we can improve for the next update. Please send your comment or feedback to admin. Thank you! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'com.android.vending.CHECK_LICENSE']",
}