{
"name" : "Hahu Yeneta",
"url" : "https://play.google.com/store/apps/details?id=et.kidsedu.hahuyeneta",
"package" : "et.kidsedu.hahuyeneta",
"category" : "Education",
"description" : "Now you can learn the Ethiopian Alphabet on your tablet/phone. Yeneta is an Amharic term meaning teacher. Our App HaHuYeneta refers an app that teaches Geez/Amharic letters (Ha [] Hu []). The app provides a simple learning mechanism for children to learn geez/Amharic alphabet in a fun and simple way.  Children or adults who dont get the opportunity to learn Amharic in classroom get the advantage of learning it at their convenience.  In the Amharic alphabet each letters represents a sound. For example the first letter  represent the sound produced ha (hea). Thus each starting letter has seven or more forms. Learning the geez alphabet means learning the 34 main letters with their 7 or more forms.   Reading In the reading section, each of the letter is presented with the appropriate sound the letter produces. Additionally a second functionally teaches the letters associating them with picture objects; an object which starts with the letter is shown on the display and the object is read. In this way the trainee learns how those letters are used in words or they will associate each letter with an object so that they can remember and know the alphabet easily.  Writing After learning what the letters look like and what sound they produce, the learner can progress to the writing section. This category shows how to write the letters in a precise and practical way. Then it gives the space and format to rewrite the letters accordingly then tells when it is done correctly by checking the finger movement.  Game/Quiz In the other category the learner will find him/herself to easily test their progress in playing/exercise mode. You will find three more features here; matching, filling missing letter and selecting the object that start with the letter in question.  Matching: This option tests the learner weather he/she have got visual identification of the letter in question. It is about identifying the letter in question from other choices it is mixed with.  Filling missing letter: One of the seven forms of a base letter is missing and the app prompts the user/player to be able to choose the correct missing letter from a set of choices.  Selecting the object that start with the letter: as a means of testing what is learned in the reading section including their ability to identify a letter associated with an object, the learner will be choosing an object that starts with the letter shown.  System requirements and specifications - The application can be installed on android tablets or phones with Android 3.0 or later - The app does not require internet connection to function, once installed. ",
"desc_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}