{
"name" : "Magyar Katolikus Lexikon",
"url" : "https://play.google.com/store/apps/details?id=eu.gyurasz.magyarkatolikuslexikon",
"package" : "eu.gyurasz.magyarkatolikuslexikon",
"category" : "Education",
"description" : "Ez itt a Magyar Katolikus Lexikon ksrleti internetes vltozata. Abban a remnyben bocstjuk kzre, hogy a szles internet kzssg hasznra lesz, gyaraptja a tudst s a hitt. Az internetes vltozat ltrehozsban a Pzmny Pter Katolikus Egyetem Informcis Technolgiai Karnak dikja, Rcz Andrs vett rszt, Psztor Mikls irnytsval.  Az anyag feldolgozsa mg nem teljes, s tvolrl sem tkletes. Minden jobbt szndk szrevtelt ksznettel vesznk a lexikon@katolikus.hu cmen. Az anyagok hitbuzgalmi s lelkipsztori clra szabadon felhasznlhatk, azonban kereskedelmi cllal nem.  A lexikon alapvet tulajdonsga, hogy cmszavak al rendezett adattr. Tbb mint a sztr, mert a cmsz meghatrozs utn a trtnett, a vele kapcsold dolgokat, szemlyeket, trtnseket, s belle szletett eredmnyeket is kzli. Kevesebb mint egy enciklopdia, mely tanulmny jelleggel ismereteti cmszavai tartalmt.  Ez a lexikon rmai katolikus. Tengelye Jzus Krisztus, az emberisg Megvltja, aki szmunkra az egy, szent, katolikus s apostoli Anyaszentegyhzban mutatkozik meg. Az adatok gyjtsnl s cmszavakba foglalsnl katolikusan gondolkodunk: tudjuk, hogy mr a jzan sszel elrhet megismersnknek is minden rszlete a Megvlt Krisztus fel irnyul; hitbeli tudsunk pedig Tle ered s Hozz vezet.  Ez a katolikus lexikon magyar: a Szent Istvn kirly ta ltez orszg terlethez ktdik. E terletrl s a magyarsghoz tartozkbl merti anyagt, s magyarul kzli az ismereteket.  50 tmakre kzl a fontosabbak:  - szemlyek (ppk, kirlyok, pspkk, rk, szemlyisgek), - esemnyek (magyar egyhzi s vilgi trtnelem, egyetemes egyhztrtnelem), - helyek (orszgok, pspksgek, magyar egyhzmegyk, plbnik, bcsjr helyek, szerzeteshzak), - intzmnyek (szerzetesrendek, egyesletek), - fogalmak (filozfia, szentrstudomny, dogmatika, egyhzjog, liturgia, mvszetek, termszettudomny)  A szcikkekben tallhat utalk a kapcsoldsi pontok a tbbi szcikkekhez.  Arra treksznk, hogy mr a kzpiskolsok szmra is rthet s hasznlhat adatbzist tegynk kzz. Hasznlata nem kvetel vallsos hitet, csak a tnyeket s objektv igazsgokat elfogad, becsletetes gondolkodst.  Forrs: http://lexikon.katolikus.hu This is the Internet version of the Hungarian Catholic Encyclopedia pilot. the assistance is provided in the hope that it will benefit from the broad Internet community, enrich the knowledge and faith. the Catholic University Faculty of Information Technology student, Rcz Andrs participated in the creation of the web version, Psztor Miklss guidance.  Processing of the material is incomplete and far from perfect. All improvements we would like to thank intentioned remarks at lexikon@katolikus.hu. The materials may be used freely and devotional pastoral purposes but not for commercial purposes.  The essential feature of lexicon that arranged under headings repository. More than a dictionary, because after the keyword to determine the history associated with things, people, happenings, and it was also communicate results. Less than an encyclopedia, which content items are ismereteti study basis.  This is the Roman Catholic lexicon. Axis of Jesus Christ, the Redeemer of mankind, who showed us to the one, holy, Catholic and Apostolic Church. collection of data entries and Catholic Book of thinking: we know that every detail has been directed to understanding our common sense is available to the Christ the Savior; faith and knowledge comes from Him and lead Him.  This Hungarian Catholic lexicon: link with the territory of King Szent Istvn in place since the country. This area and the Hungarian community draws its material from falling and communicate knowledge of English.  Among the more important topic 50:  - Persons (popes, kings, bishops, writers and personalities) - Events (Hungarian religious and secular history of the universal Church History) - places (countries, bishoprics, Hungarian dioceses, parishes, pilgrimage sites, religious buildings) - institutions (religious orders and associations) - Concepts (philosophy, science scripture, dogma, canon law, liturgy, art, science)  In the words of the articles are relative links to the other articles.  We strive to do has been published understandable and usable database for middle school students. It does not require the use of religious faith, just the facts and, honestly thinking acceptance of objective truth known.  Source: http://lexikon.katolikus.hu ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.PREVENT_POWER_KEY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.PREVENT_POWER_KEY', 'android.permission.INTERNET']",
}