{
"name" : "Tuudo",
"url" : "https://play.google.com/store/apps/details?id=fi.caleidon.tuudo",
"package" : "fi.caleidon.tuudo",
"category" : "Education",
"description" : "Tuudo is an app that brings together all the important and useful services for the students of higher education institutions.  With Tuudo, you can:  - enrol for courses and exams - view your schedule, which is created automatically from your enrolments - keep track of your credits - find your way around the campus, includes indoor navigation - follow the news and notices published by the faculty, e.g. cancellations and changes of venues - search for individuals and services - check out the campus canteen menus - check public transport timetables  New services are continuously being developed.  Tuudo supports your studies by making your life easier. Stop wasting time - spend it on your studies.  Tuudo is free for students.   Full functionality currently available in - Arcada University of Applied Sciences - Centria University of Applied Sciences - Diaconia University of Applied Sciences - Haaga-Helia University of Applied Sciences - JAMK University of Applied Sciences - Kajaani University of Applied Sciences (KAMK) - Lapland University of Applied Sciences - Lappeenranta University of Technology - Laurea University of Applied Sciences - Metropolia University of Applied Sciences - Novia University of Applied Sciences - Oulu University of Applied Sciences (Oamk) - Seinjoki University of Applied Sciences (SeAMK) - South-Eastern Finland University of Applied Sciences (Xamk) - Tampere University of Applied Sciences (TAMK) - Turku University of Applied Sciences - University of Eastern Finland (UEF) - University of Lapland - University of Oulu - bo akademi  View your completed studies and degrees from - HUMAK University of Applied Sciences - Hme University of Applied Sciences (HAMK) - Karelia University of Applied Sciences - Lahti University of Applied Sciences (LAMK) - National Defence University (MPKK) - Police University College - Satakunta University of Applied Sciences (SAMK) - Savonia University of Applied Sciences - Tampere University of Technology (TUT) - University of Turku (UTU) - Vaasa University of Applied Sciences (VAMK) ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'fi.caleidon.tuudo.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}