{
"name" : "French Songs For Kids",
"url" : "https://play.google.com/store/apps/details?id=fr.heykids.comptinespourenfants.app",
"package" : "fr.heykids.comptinespourenfants.app",
"category" : "Education",
"description" : "The official HeyKids.fr - Chansons Pour Enfants video app is designed for curious little toddlers and preschoolers to dive into our world of discovery, learning and entertainment!  The popular French childrens songs combined with lovely 3D animated videos keeps young children entertained while learning new vocabulary.  Carefully designed for babies, toddlers and children of all ages this application is ideal for an engaging, educational, visually and audibly exciting experience. Turn up the volume and let the family fun begin!  Features  NO ADS, ensuring a safe environment for your children  OFFLINE VIDEO PLAYBACK. Watch the animations anywhere you go, no internet connection required.   Over 10 famous nursery rhymes with 3D animated music videos!  New animated songs added every month !  Designed for kids; this means no unnecessary buttons, easy scrolling, and instant full-screen.  Multiple settings available for parents  Six kids songs in French are included for free:  Si tu as dla joie au coeur  Brille Brille Petite toile   Un lphant Qui Se Balanait  Joyeux Anniversaire  Laraigne Gipsy  Mon Beau Sapin  More songs that kids love are available with a subscription:  Le Fermier Dans Son Pr  Frre Jacques  Dans La Ferme de Mathurin  Tte, paules, Genoux et Pieds   Douce Nuit, Sainte Nuit  and many more...  Definite must-have for parents with little kids!  For customer support, comments, or suggestion please contact us at contact@heykids.com  Like our app? Please rate us or write a review to tell us what you think. ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}