{
"name" : "Orthographe et grammaire",
"url" : "https://play.google.com/store/apps/details?id=fr.lemonde.gsmobile",
"package" : "fr.lemonde.gsmobile",
"category" : "Education",
"description" : "Frantastique propose des cours de franais personnaliss : orthographe, grammaire, conjugaison, syntaxe et expression crite.  Chaque jour, un courriel avec les aventures de Victor Hugo explorant lunivers de la francophonie. Les cours sont humoristiques, pratiques et sadaptent  tous les niveaux ( partir de 16 ans).   Plus de 2 500 000 utilisateurs dans le monde   Des progrs durables   Une approche personnalise   Un franais moderne et actuel   ..........................  Un contenu personnalis : Chaque jour, recevez une leon adapte  vos besoins et votre niveau : contenus crit, audio et vido, accents varis, franais moderne et international... 15 minute par jour seulement !   Motivation, Humour & Culture : Dcouvrez la diversit et la richesse culturelle du monde francophone  travers les aventures de Victor Hugo au XXIe sicle. Chaque jour une histoire, une citation, une chanson ou un extrait de film.   Une correction immdiate : Aprs avoir rpondu aux questions, vous recevez votre correction avec votre score, des remarques personnalises, le vocabulaire demand...   Mmorisation et Rvisions : Pour une mmorisation long terme, Frantastique construit un programme de rvisions pour revenir sur chaque point abord. Les progrs sont consolids dans le temps !   ..........................  Testez Frantastique gratuitement pendant 7 jours. Ce test est gratuit et sans engagement. Daucune faon vous ne pourrez tre inscrit  la version payante de nos cours sans lavoir explicitement demand.   Le programme Frantastique est conu et dit dans son ensemble par la socit A9 SAS Gymglish. Frantastique offers customized French lessons: spelling, grammar, conjugation, syntax and writing.  Every day an email with Victor Hugos adventures exploring the world of Francophonie. The courses are humorous, practical and adaptable to all levels (from 16 years).   Over 2.5 million users worldwide  Sustainable progress  A personalized approach  A French Modern and present  ..........................  Personalized content: Every day receive a lesson for your needs and your level: written content, audio and video, varied accents, modern French and international ... 15 minutes a day only!  Motivation, Humor & Culture: Discover the diversity and cultural richness of the Francophone world through Victor Hugos adventures the next century. Every day a story, a quote, a song or a film clip.  Immediate correction: After answering the questions, you receive your correction with your score, custom remarks, requested vocabulary ...  Storing and Revisions: For long-term storage, Frantastique built a revision program to return on each item discussed. Progress is consolidated in time!  ..........................  Test Frantastique free for 7 days. This test is free and without obligation. Theres no way you can not be enrolled in the paid version of our courses without having explicitly requested.  Frantastique The program is designed and powered as a whole by the company A9 SAS Gymglish. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}