{
"name" : "Learn and play. French words - vocabulary & games",
"url" : "https://play.google.com/store/apps/details?id=free.langame_fr.rivex",
"package" : "free.langame_fr.rivex",
"category" : "Education",
"description" : "This engaging game of skill is a mobile tutor for self-study of vocabulary and phonetics on the beginners (elementary, basic) level. The word list includes words from various topics used in everyday life (most common words). This self-teaching game helps to learn productively correct pronunciation and orthography through visual and audio support. The game consists of several stages so that the learning process is more efficient:  Training  learning the alphabet ABC, parts of speech, such as nouns, adjectives and verbs with phonetic transcription through flashcards and sound accompaniment.  Language quiz  testing of the knowledge of the words happens through fun and simple games: 1. Reading and association: choosing the right word for the picture. 2. Visualization: choosing the dynamic moving images for the words. 3. Spelling test: writing words and spell check. Simple interface, HD tablet and phone support, graphic themed photos and high quality voice work by native speaker improve listening comprehension and allow concentrating on the training material. This ensures quick and efficient learning process. The app contains the following topics: vegetables and fruits, wild animals, domestic animals, animal body parts, birds, sea life, home, bathroom, clothes, colors, transport, human, body parts, tableware, home appliances, food, toys, school, nature, natural phenomena, insects, numbers and figures, geometric shapes, musical instruments, tools, sport, summer sports, winter sports, travel, entertainments, office, infrastructure, shop, society, professions, information technology, prepositions. With this interesting and entertaining game you or your child will be able to add new words from scratch to their vocabulary through playing. The speaking vocabulary is the foundation for good oral and writing skills. Interactive (adaptive) teaching is an easy and accessible way to study foreign language effectively. For kids, this course is not only a fast and easy way to learn to speak and write, but is also a way to build upon the knowledge acquired at school or kindergarten. Parents can use this app as preschool lessons by method of Glenn Domans flashcards. This learning app includes the translation of words more than 10 languages.This is practically an illustrated dictionary and exercises for learning French that helps beginners, juniors and children to learn French words through playing. Studying French at home will help you quickly learn to read and to speak French. Spoken French from scratch its easy. Apprendre le franais facilement! This free app works in offline mode. The paid version has no ads and contains detailed results, helping you to analyze the level of language proficiency. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}