{
"name" : "Fairy Tales Cards (Learn Languages)",
"url" : "https://play.google.com/store/apps/details?id=ft1.kids.edu",
"package" : "ft1.kids.edu",
"category" : "Education",
"description" : "* Quick, Fun & Easy Ways to Learn Fairy Tales with Multiple Languages.  * Learning languages in a playful way.  * More then 60 excellent fairy tales cards waiting for you to explore. * Each fairy tale card is provided link of wiki, take you to learn more about fairy tales. * You can learn many kinds of Fairy Tales. * You can play Fairy Tales puzzles. * You can also draw directly on a card. * Support Quiz Feature.  * The app helps to easy learning many kinds of Fairy Tales from the cards and know their names in several languages. - Learn English - Learn Spanish - Learn Chinese - Learn Japanese - Learn korean  It includes the pictures and sounds, you can easy learning from the cards.  Let you playing while learning and then learning from playing.  More than 60 interesting pictures and sounds will help you learn lots of Fairy Tales.  The app provides the best way to get started learning many kinds of Fairy Tales which contains many cards, each word card are voice-enabled, and related words and pictures.  - Contains special memory mode make you play from black and white pattern to colorful card when you complete some task. - Funny jigsaw puzzle games has 5 levels from easy to hard. - Easy drawing pen function - English human voice help you learn English vocabulary easily. - Support for Visual Memory mode. - Provide cards collection function. - Support for language switching, then you can learn many kinds of languages at the same time. (English / Chinese / Japanese / Korean / Spanish ) - Training your comprehension,logic,language ability. - All jigsaw puzzle are generated randomly.Its really a interesting educational game - With nice interface that you can play on both tablet and mobile phone. - Fairy Tales Flashcards - Learning card series - Fairy Tales  More Then 60 Fairy Tale Cards (Grimm Fairy Tales , Andersen Fairy Tales) 1. The Three Little Pigs 2. Little Red Riding Hood 3. Jack and the Beanstalk 4. Snow White ..... ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}