{
"name" : "Toppr - Learning App for Class 5 - 12",
"url" : "https://play.google.com/store/apps/details?id=haygot.togyah.app",
"package" : "haygot.togyah.app",
"category" : "Education",
"description" : "Toppr - Best Educational App for Students  Toppr is an online learning app personalized for CBSE students. We are on the mission to make online study experience easy and smooth for students. We cover a very wide range of syllabus from CBSE Board, ICSE, and State Boards. Students who are preparing for IIT JEE Main, NEET, AIIMS can also use Toppr to prepare and practice with Mock Tests.   Our Video lectures cover all topics & chapters from the CBSE syllabus. CBSE video lectures are available in Hindi and English. You can learn through our high-quality video lectures, take mock tests for the exam you are preparing & also practice questions asked in previous exams.   Toppr also has a real-time doubt clearing feature. In fact, Toppr is one of the best doubt-solving apps. Be it Chemistry, Maths, Science, Physics, or any subject, our experts are available 24x7!   Toppr - Best Learning App for CBSE, ICSE, and State Board Students  For students from CBSE Class 5 to Class 12, Toppr is the best learning app. Toppr provides a wide range of study materials like NCERT Solutions, Previous Year Question Papers, CBSE Notes, Important Questions, and much more. NCERT Solutions is very important for CBSE students since CBSE follows the NCERT Syllabus guidelines. You can get NCERT Solutions for every chapter & topic on Toppr. Furthermore, you can also clear doubts in Maths, Chemistry, Biology and other subjects on Toppr. We cover all subjects - English, Physics, Chemistry, Maths, Biology, Science, History, Geography, Civics and more.  Toppr - Best Entrance Exams Preparation App - JEE Main, NEET, AIIMS and more  Are you preparing for IIT JEE Main, NEET, AIIMS or any Engineering, Commerce or Medical Entrance Exam? Then Toppr is the best option for you! You can take mock tests for all the entrance exams on Toppr. Toppr is the best app for NEET Preparation, IIT JEE Main Preparation, AIIMS Preparation, JIPMER, and much more. You can take the JEE Main Mock Test to test your knowledge.  Toppr Live: Free Live Classes for Class 5-12, IIT JEE Main, IIT JEE Advanced and NEET  Toppr Live class aims at personalizing learning for millions of children by giving them direct access to Indias best teachers.  Following is List of Entrance Exams we cover -   Medical & Engineering Exams -   MHT-CET TS-EAMCET AP-EAMCET BITSAT VITEEE BCECE KCET KEAM & more  Engineering Exams   IIT JEE Main IIT JEE Advanced UPSEE (UPTU) COMEDK WBJEE & more  Medical Exams   NEET AIIMS JIPMER  Commerce Exams   CA, CS, & CMA Foundation CLAT  Get rewards for helping your friend learn better!  Having too many friends is now rewarding. If you like Toppr learning modules, tell your friends about us and get cash rewards!  How it Works  Share your referral code  Your friends get 20% off with your code   Earn cash rewards   You get 20% of the subscription fee (up to Rs 10,000) as cash rewards  Get cash in your bank  We send all your cash rewards to your bank once every two months  Following are the plans that you can choose  Under Free Basic Plan You Get -  Free video lectures Stories & concepts  Under Advanced Plan You Get -  Everything from Basic Plan Practice questions & Crash course  Test series & previous papers Create your own tests  Under Ultimate Plan You Get-  Everything from Master Plan  Ask Doubts - Chat with tutors 24x7 & get Instant solutions  Under Master Plan You Get -   Everything from Ultimate Plan Live Classes  You can also avail flexible EMI options  Certain packages include a welcome kit delivered to the students home.   You can avail attractive scholarships for students from Class 5 - 12& who are preparing for entrance exams. Talk to your academic consultant to check your eligibility   Privacy Policy: https://www.toppr.com/privacy/ Terms of Service: https://www.toppr.com/terms/ ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.truecaller.permission.sdk.internal.read_account_state', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'haygot.togyah.app.permission.C2D_MESSAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.truecaller.permission.sdk.internal.read_account_state', 'android.permission.SEND_SMS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}