{
"name" : "Learn Spanish Free - Spanish Word of the Day",
"url" : "https://play.google.com/store/apps/details?id=helium.wordoftheday.learnspanish.vocab",
"package" : "helium.wordoftheday.learnspanish.vocab",
"category" : "Education",
"description" : "Learn new Spanish words, improve your vocabulary, and master the language with this Spanish learning app for free. Learn how to pronounce Spanish words correctly!  With Word Of The Day format, learning new words each day become very easy. The app offers a rich vocabulary without causing information overload. Relevant and useful Spanish words are added daily from trusted sources. Every word has Synonyms, Antonyms, One-word substitutions, Foreign Words & Phrases, Idioms & Phrases, Phrasal Verbs, and Important Words.   The words are chosen daily from the top wordbooks, thesaurus, top and trusted dictionaries, and more. Learning spanish has never been this much easier before. The glossary of new Spanish words is updated in the app after several checks and reviews. The app is simple to use and so effective that you wont need any other wordfinder or lexicon.  You can improve your Spanish vocabulary in a significant manner with this app. Every day, the most important words are selected and made available to our users. If youre a beginner or intermediate, you can master the spanish language and become an expert with this app. The app, as stated by our users, is better than Dictionary and more effective.   All the words are extracted from top and trusted sources. What are you waiting for? Download the app and start learning spanish toady!  Key Features:  Words picked by experts.  Bookmark Words and View Later Anytime  Definitions and example sentences for every word  Top and Trusted Sources   Explore new challenging words each day. You can save the most difficult words to study separately from the ones added daily. If you need to expand your Spanish vocabulary, get this app. A single word can have different meanings. So, we give you all. By clicking on the word, you can get the complete meaning of the word with pronunciation.  If you like this app, do rate us.  Do You Have any questions?  Customer satisfaction is important to us. If you have any questions or comments, please send us an email at heliumliteapps@gmail.com. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'helium.wordoftheday.learnspanish.vocab.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}