{
"name" : "NCLEX-RN Mastery",
"url" : "https://play.google.com/store/apps/details?id=hlt.nursing.com",
"package" : "hlt.nursing.com",
"category" : "Education",
"description" : "Master the most important test of your career: the NCLEX. This app prepares you for 2,000+ practice questions, quizzes, mnemonics and strategies based on past NCLEX RN exams.    NCLEX Mastery was created by nursing students and professors who understand the struggle and pressure of nursing students just like you. We are always improving our app and adding new content at no additional cost.     NCLEX Mastery was developed to give you an edge by obsessively focusing on providing maximum learning in minimal time. Review NCLEX RN practice questions anywhere, anytime -- no network connection required!   Features: 2,000+ meticulously crafted NCLEX RN questions with rationales and pictures  40% of the questions are Select All That Apply (SATA) Practice quizzes  Custom Quiz Builder  Pharmacology questions  Content based on past NCLEX questions  The most comprehensive list of NCLEX mnemonics on the market  Detailed test taking and study strategies  In depth statistics that display your strengths and weaknesses  Built in timer so you know how long you are taking per question  Lab Values    Get access to all questions when you subscribe:  Monthly: auto-renewing payment of $29.99  3-Month: auto-renewing payment of $59.99  12 Months: auto-renewing payment of $119.99   Install NCLEX Mastery now and see why more than 1,700,000 nursing students made NCLEX Mastery the #1 rated nursing app. Our reviews speak for themselves!    There is NO risk -- install now and try it before you buy it!    We ALSO guarantee you will pass your exam using NCLEX Mastery Premium or you get double your money back!    BONUS: Full-featured ONLINE version is absolutely FREE.  Can you help us?  We appreciate your feedback and reviews, please reach out to us and let us know what you think!    Our Customer Success Team is available from 8 am to 6 pm, Monday - Friday (except on major holidays). Please contact us if you have any questions, suggestions, or commentsnursing@hltcorp.com or 319-237-7162.  Whats New: New, sleek user interface and experience You are now able to create an account which will allow for syncing across multiple devices. New content added.     Ace the nursing boards test or just get help in school or with ATI tests by using the NCLEX Mastery exam preparation app, review flashcards and practice questions along with quiz questions  Before, during or after school, study for your nursing boards with the best preparation system, featuring flashcards, a study guide, and quiz questions  Prep for school or guide your study for the biggest test in your nursing life with the best test prep and practice exam review guide  Study well for your ATI exam and LRN nursing boards with over 2,000 practice exam and quiz questions, as well as flashcards  Improve your preparation and review all nursing practice and quiz questions which will help you pass your Nursing boards and ATI exams  Quiz and practice exam questions, flashcards, review etc. all in one mobile app to ace your nursing boards and ATI test  The nursing school review and preparation material with flashcards and a study guide that can help you prep for your nursing boards and ATI test  The most exhaustive test preparation and nursing guide includes test prep material with more than 2000 flashcards and questions that can help you ace the nursing boards and perform better in school ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.GET_ACCOUNTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_SYNC_STATS', 'android.permission.AUTHENTICATE_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.WRITE_SYNC_SETTINGS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_INTERNAL_STORAGE']",
}