{
"name" : "Gyan Se Pehchan - General Knowledge Quiz",
"url" : "https://play.google.com/store/apps/details?id=in.allen.gsp",
"package" : "in.allen.gsp",
"category" : "Education",
"description" : "Most people think General Knowledge is only important for students or for those who aspire to participate in competitive exams such as AIIMS, IAS, UPSC, Bank PO, and General Knowledge based contests such as Kaun Banega Crorepati (KBC), Siddhartha Basu Quiz Shows etc.  However, one must note that General Knowledge goes beyond competitive exams; it is a method of enhancing knowledge base and building an intellectual personality. So, irrespective of age; a good dose of General Knowledge helps the brain to function in the finest possible manner.  And what could be the best way to learn while enjoying the perks of winning some exciting prizes.  Keeping this very thought in mind, Allen Career Institute has launched the Gyan Se Pehchan app  under its Klipinterest flagship. Klipinterest is a unique concept of knowledge sharing from various fields of life; on a single platform. Gyan Se Pehchan, powered by Klipinterest, aims to further improve the learning process in a fun way. The Gyan Se Pehchan app truly reflects Allens vision of knowledge sharing in a profound manner which is open to all age-groups.  GAME RULES  Every game has 15 questions with multiple choice answers. You get 30-60 seconds to answer, depending on the difficulty level. You get reward points & score for every correct answer. Click on restart for next attempt. You can play another game (after 5 attempts) on redeeming 50000 points or after 3 hours There are 3 stages where points get locked (Q5, Q10, Q15), so you get minimum points.  You have three lifelines to use during the game- Fifty-Fifty, Double Dip, Flip the Question:   Fifty-Fifty lifeline eliminates 2 options, thus leaving you with only 2 choices.  Double Dip lifeline allows you to make two guesses for a question, but requires you to play out the question, thus forbidding you to walk away or use any further lifelines  Flip The Question lifeline replaces the current question with another having same point value. Top 10 scores of the week are displayed in TOP SCORES. If you QUIT at any stage, you will get the points earned till last stage  Points Allotment  If you answer the question in: 1-3 secs: You will get the score equal to 5 times the points allotted 4-6 secs: You get the score equal to 4 times the points allotted 7-9 secs: You will get the score equal to 3 times the points allotted 10-12 secs: You will get the score equal to 2 times the points allotted After 12 secs: You will get the score equal to 1 times the points allotted For e.g. Question 1 is allotted 100 points. If you answer within 3 secs, you get 500 scores (100 points *5) If you do not answer in the given time, the game will end there.  Whats New ?   Refer & Earn  While you earn points playing the quiz, the app now allows you to increase point count through referrals. On every referral you earn 250 points provided the referred person downloads the app and signs up to play the quiz.   Earn Daily Coins  Logging into the app daily allows you to win new points on everyday basis. However, if you fail to log-in to the account daily, the point allotment starts from day one.   More Quizzes  You can play more time-bound quizzes on Klipinterest website and share the result on your FB page.  Points Redemption  Once you reach a selected point scale, you can redeem them in exchange of exciting Gift Vouchers.  Keep playing and keep winning!  For any query related to the app, your account or trouble while logging-in, contact our Support Team anytime at klip@klipinterest.com  Like us on: https://www.facebook.com/KlipInterest/   Follow us on:  https://twitter.com/klipinterest https://www.instagram.com/klipinterest/ https://plus.google.com/+Klipinterest ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}