{
"name" : "ALLEN Info & Admission",
"url" : "https://play.google.com/store/apps/details?id=in.allen.alleninfo",
"package" : "in.allen.alleninfo",
"category" : "Education",
"description" : "Over the past three decades, Allen Career Institute has been the frontrunner in offering value and success-driven education. It is the most trusted and valued institute for the preparation of IIT-JEE (Main + Advanced), NEET-UG / JEE Main and many other competitive exams.  With an aim to nurture young minds and direct them to the right path, Allen has been running various other educational and knowledge-based programmes. Today, Allen Career Institute is not just acclaimed nationally but is widely acknowledged across the globe too.   At Allen, growth is a never- ending process. And to make this process free of any hiccup, Allen has been continually upgrading its system in sync with the changing technology. The latest addition to it is Allen Info, an app designed with the sole purpose of helping students and parents reach out to the wide range of information in an easy manner. Through its different categories, the app lets you access any information related to Allen Career Institute as per your comfort and convenience.  Highly advanced and bug-free, this app is handy to use and comes with a host of features to help every user.  Some Key Features of the App  Dashboard  This page is your guide to useful information such as your profile, links to other vital apps, pages and websites of Allen Career Institute such as online admission, course details, ALLENChamp, Tallentex and many others.  Apply for Admission - By far this is the most remarkable feature of the app. Using this feature, students can sign-up for admission and complete the entire admission process online.  Student Profile  This feature facilitates the parents to register the profile of their children studying in Allen Career Institute. They can access the profile, check every detail and stay updated with their childs performance.  Courses - Depending on the study city, you can find information related to the courses offered there. You can even get through the desired center by easy location tracking facility as provided in the app.  Why Choose Allen Info App?   Access to every bit of information at one single place  Ease of use   Time savvy   Quick functioning   Use of latest and advanced technology  Updated with the most recent information  No matter in which part of the city or country you live, Allen Info App is here to bridge the gap between you and Allen Career Institute. Get started with this user-friendly experience today ! ",
"desc_perms" : "['android.permission.ACCESS_COURSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}