{
"name" : "ASP.NET MVC Video Tutorials",
"url" : "https://play.google.com/store/apps/details?id=in.hoven.mvcvideotutorials",
"package" : "in.hoven.mvcvideotutorials",
"category" : "Education",
"description" : "***********IMPORTANT BEFORE YOU INSTALL************* THIS APP SHOWS ONLY INCOMPLETE YOUTUBE VIDEOS. YOU MUST PAY FOR VIEWING THE COMPLETE VIDEOS. FOR DETAILS VISIT http://mvc.hoventrainings.com *********************************************************************  We are selling ASP.NET MVC Video Tutorials. This app gives a preview to our website - http://mvc.hoventrainings.com  Nominal price $10(outside INDIA) INR Rs. 900/-(within INDIA, DVD is sent by courier)  What will Ship? ============ In just $10(outside INDIA) and INR Rs. 900/- you get the following   ---99 video tutorials organized into chapters that simplify learning  ---MVC projects/snippets/concepts explained in a very lucid and simple style  ---Source code of the various examples discussed in the videos  ---E-Book on in-depth MVC Interview Questions  ---E-Book on ASP.NET MVC. This E-Book is a companion to the video tutorials  Why Buy? ======== By purchasing the complete set of MVC video lectures, you get the following benefits.  --Watch lectures offline - no internet required  --Very good audio and video quality  --Learn in the comfort of your home, utilize your free time to upgrade your skills  --Learn on your Android Tablet also, anywhere, while travelling. No internet required  --Video lectures can be played on both a Windows PC(XP+, Vista, Win7, Win8) and Android OS(2.3 and up)  What should be my first step? =======================  Just send us an email, and we shall immediately revert back with all the details. Please do write which country you are from. Our email is: SALES.HOVEN@GMAIL.COM.  What shall I Receive? =================  99 MVC video tutorials organized into chapters that simplify learning MVC projects/snippets/concepts explained in a very lucid and simple style Source code of the various examples discussed in the videos E-Book on in-depth MVC Interview Questions E-Book on ASP.NET MVC. This E-Book is a companion to the video tutorials  What is the mode of Delivery? ========================  Content(about 2GB) is delivered in the following modes - We shall send you download links(Google Drive) so that you can download the entire consignment in zipped form. If you are a customer from INDIA: You will also receive the entire DVD through SPEED POST. You will not be charged anything extra. What shall be the mode of Payment  If you are a customer within INDIA you can directly deposit in our bank account. For the rest of customers, the only mode of payment is through our PAYPAL account. For further details, please write to us on sales.hoven@gmail.com  Hoven ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "[]",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE']",
}