{
"name" : "Computer Course in Hindi",
"url" : "https://play.google.com/store/apps/details?id=in.mmsoft.computercourseinhindi",
"package" : "in.mmsoft.computercourseinhindi",
"category" : "Education",
"description" : "Learn Computer in just 14 Days (Learn Computer in Hindi). This app provide content to learn computer with very ease with your own language Hindi. Computer knowledge is the most basic need in this fast growing world. You must know the basics of the computer, how to operate a computer, how to work on MS office and Internet are must for all person.  This Computer Course in Hindi (Learn Computer in Hindi) application is specially designed for the people who want to learn the basics of the computer operations. You can learn operating a computer in just 15 days by using Computer course in hindi app . This application is in HINDI and explain all the things very clearly with images and simple text, so that anyone can understand and learn computer course in hindi. It does not require you to be an expert in computer programming or english to learn computer basics.  Computer Course Application covers following important topics:  - Fundamentals of Computer - Type of Printers  - Generations of Computer and Types of Computers - Types of Monitors (LCD and CRT) - Microsoft Word - Microsoft Excel - Microsoft Powerpoint - Adobe Photoshop - Adobe Pagemaker - Internet - Basics of Computer Hardware - Tricks and Tips for daily computer use  Computer Course in Hindi (Learn Computer in Hindi) is designed for help to make #DigitalIndia and #SkillIndia which was dream of Honorable Prime Minister of India Mr. Narendra Modi   Keyword: Computer Course in Hindi, Computer Course Hindi, Computer Basic in Hindi, Computer Fundamental in Hindi, Microsoft Word in Hindi, Microsoft Excel in Hindi, Microsoft Powerpoint in Hindi, Adobe Photoshop in Hindi, Adobe Pagemake in Hindi, Computer Hardware Course in Hindi, Computer Internet in Hindi, Learn Computer in Hindi, Learn Computer in 30 Days, Learn Computer in 14 Days, Learn Computer in 7 Days  This computer Hindi Tutorial App is more related to below mention topics : - learn computer in hindi - computer lessons for beginners - how to learn computer programming for beginners - basic computer training - how to learn computer basics pdf - basic of computer knowledge - computer basics for beginners - how to learn computer typing - computer basics for beginners - computer basics pdf - computer basics questions - computer basic knowledge - computer basics for kids - basics of computer - computer fundamentals tutorials - what is computer fundamentals  Global Related search : Computer, Fundamentals, Tutorial, Beginners, Overview, Applications, Generations, Types, Components, CPU, Input Devices, Output Devices, Memory, RAM, ROM, Motherboard, Memory Units, Ports, Hardware, Software, Number System, Number Conversion, Data, Networking, Operating System, Internet,Buying, Courses  This application is free and offline. user can learn from anywhere anytime. All computer software and hardware solutions are listed in this application.  learn computer in 30 days learn computer install windows install linux important software Microsoft Excel Microsoft Word Microsoft Powerpoint MS Office Tally ERP9 Computer Architecture Computer History Shortcut keys paint windows media player vlc player how to format computer? Computer Course in Hindi Computer Course (in Hindi) Computer Course in English Computer Course       Computer Hardware Course Repairing course Ghar Baithe Computer Sikhe Computer networks basics Computer Networking Concepts Computer Dictionary  Our Other Apps on Computer: Computer Course in Hindi Computer Hardware Course in Hindi Learn MS Excel Learn MS Word Learn MS Powerpoint Basic Keyboard Shortcut Tally Keyboard Shortcut MS (Microsoft) Office Complete Tutorial ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.ACCESS_NETWORK_STATE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'in.mmsoft.computercourseinhindi.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'in.mmsoft.computercourseinhindi.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'in.mmsoft.computercourseinhindi.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}