{
"name" : "myCBSEguide - CBSE & NCERT Learning App",
"url" : "https://play.google.com/store/apps/details?id=in.techchefs.MyCBSEGuide",
"package" : "in.techchefs.MyCBSEGuide",
"category" : "Education",
"description" : "My CBSE guide is the best learning app for CBSE students that is recommended by the experts and followed by the toppers. It provides latest NCERT solutions, RD Sharma Solutions, RS Aggarwal Solutions, NCERT Textbooks as PDF to download, CBSE syllabus, CBSE Sample Papers, CBSE question papers, Quick revision Notes, NCERT Exemplar solutions CBSE guess papers and Chapter-wise important questions. Watch best videos, Play & Practice online Tests with themyCBSEguide mobile app. This is one of the most trusted apps for CBSE sample papers and CBSE guess papers. The CBSE Guide App provides CBSE sample papers with solution for the year 2020, 2021. CBSE sample question papers and model test papers help students to understand the difficulty level and pattern of the exam. We suggest students download the app and practice question papers as much as possible.  With more than 10 million page views per month, myCBSEguide provides acomplete learning solution for CBSE students. Not only Maths and Science, butwealso provide study material for CBSE classes 3 to 12 covering almost all popular subjects in both Hindi and English medium. myCBSEguide Test Series help students to check their readiness for the upcoming exams. We conduct regular test series for the students.  With myCBSEguide mobile app you can, View latest CBSE syllabus from class 3 to 12, Access chapter-wise quick revision notes for free, Go through the chapter-wise important questions, Get NCERT Solutions for all the classes, Practice unlimited tests online, Play quizzes with your friends on real-time and challenge them online, Get notified on latest news and updates, Revise and practice papers on the go, Explore the gamified learning solutions.   The best learning app for CBSE students, myCBSEguide now includes study material for UP Board and UK Board (Uttarakhand Board) in Hindi medium. The app is adding ICSE and ISC syllabus too.  Now the IIT and medical aspirants can prepare for their IIT JEE and NEET UG exam on the go. myCBSEguide is providing notes, previous year IIT question papers and online tests for JEE students.  Are you preparing for government jobs, teacher exams or entrance exams? myCBSEguide is here to help you. Now you can find best in class study material for SSC CGL, Bank PO, CTET, STET, CAT, MAT and other exams too.  This App also contains:-  * CBSE solved question Papers of theyear 2020, 2019, 2018, 2017, 2016, 2015 and 2014. * CBSE past ten-year papers as previous year papers for 2014, 2013, 2012, 2011, 2010, 2009, 2008 and 2007. * CBSE Question papers and answer sheets solved by toppers 2020, 2019. * CBSE Compartment papers with thesolution from 2005 to 2019. * CBSE Class 10th and 12th Solved Practice papers (Chapter-wise) * CBSE 10th and 12th Important Questions with answers  This App includes previous year papers and sample papers with solutions of the following subjects:-  NCERT Solutions for Class 12 NCERT Solutions for Class 11 NCERT Solutions for Class 10 NCERT Solutions for Class 9 NCERT Solutions for Class 8 NCERT Solutions for Class 7 NCERT Solutions for Class 6 NCERT Solutions for Class 5 NCERT Solutions for Class 4 NCERT Solutions for Class 3  myCBSEguide App has Solved Sample Papers and guess papers of session 2019-20, 2018-19, 2017-18, 2016-2017 and 2016-15 prepared by the experts as per the latest syllabus issued by CBSE, New Delhi. We recommend students to solve these Sample papers and score well in the exams.  Salient features of the CBSE Guide App: 1. 10-year question bank with thesolution. 2. CBSE Sample Papers Based on the latest pattern with thecompletesolution and CBSE Marking Scheme 3. CBSE Important Questions for board exams (Chapterwise) 4. CBSE Curriculum and CBSE Marking Scheme based on 2019-2020 session. 5. Offline access once thecontent is downloaded within the app. 6. Compartment Solved papers of board exams.  Help us to serve you better. Mail your suggestions/feedback to mycbseguideapp@gmail.com. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_CREDENTIALS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'in.techchefs.MyCBSEGuide.permission.C2D_MESSAGE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}