{
"name" : "Anatomy & Physiology",
"url" : "https://play.google.com/store/apps/details?id=io.ocedu.anatomyandphysiology",
"package" : "io.ocedu.anatomyandphysiology",
"category" : "Education",
"description" : "Human Anatomy and Physiology is designed for the two-semester anatomy and physiology course taken by life science and allied health students. The app follows the scope and sequence of most Human Anatomy and Physiology courses, and its coverage and organization were informed by hundreds of instructors who teach the course.  The artwork for this app is aimed focusing student learning through a powerful blend of traditional depictions and instructional innovations.  Color is used sparingly, to emphasize the most important aspects of any given illustration. Significant use of micrographs from the University of Michigan complement the illustrations, and provide the students with a meaningful alternate depiction of each concept.  Finally, enrichment elements provide relevance and deeper context for students, particularly in the areas of health, disease, and information relevant to their intended careers.  Features: - Study progress - Quiz progress - 6 Study units - 197 Lessons - 28 Quizzes - 714 Practice questions - 370 Flashcards - 3187 Glossaries  Unit 1: Levels of Organization Chapters 14 provide students with a basic understanding of human anatomy and physiology, including its language, the levels of organization, and the basics of chemistry and cell biology. These chapters provide a foundation for the further study of the body. They also focus particularly on how the bodys regions, important chemicals, and cells maintain homeostasis. Chapter 1 An Introduction to the Human Body Chapter 2 The Chemical Level of Organization Chapter 3 The Cellular Level of Organization Chapter 4 The Tissue Level of Organization  Unit 2: Support and Movement In Chapters 511, students explore the skin, the largest organ of the body, and examine the bodys skeletal and muscular systems, following a traditional sequence of topics. This unit is the first to walk students through specific systems of the body, and as it does so, it maintains a focus on homeostasis as well as those diseases and conditions that can disrupt it. Chapter 5 The Integumentary System Chapter 6 Bone and Skeletal Tissue Chapter 7 The Axial Skeleton Chapter 8 The Appendicular Skeleton Chapter 9 Joints Chapter 10 Muscle Tissue Chapter 11 The Muscular System  Unit 3: Regulation, Integration, and Control Chapters 1217 help students answer questions about nervous and endocrine system control and regulation. In a break with the traditional sequence of topics, the special senses are integrated into the chapter on the somatic nervous system. The chapter on the neurological examination offers students a unique approach to understanding nervous system function using five simple but powerful diagnostic tests. Chapter 12 Introduction to the Nervous System Chapter 13 The Anatomy of the Nervous System Chapter 14 The Somatic Nervous System Chapter 15 The Autonomic Nervous System Chapter 16 The Neurological Exam Chapter 17 The Endocrine System  Unit 4: Fluids and Transport In Chapters 1821, students examine the principal means of transport for materials needed to support the human body, regulate its internal environment, and provide protection. Chapter 18 Blood Chapter 19 The Cardiovascular System: The Heart Chapter 20 The Cardiovascular System: Blood Vessels and Circulation Chapter 21 The Lymphatic System and Immunity  Unit 5: Energy, Maintenance, and Environmental Exchange In Chapters 2226, students discover the interaction between body systems and the outside environment for the exchange of materials, the capture of energy, the release of waste, and the overall maintenance of the internal systems that regulate the exchange. The explanations and illustrations are particularly focused on how structure relates to function. Chapter 22 The Respiratory ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}