{
"name" : "MyEasyApp Unisa",
"url" : "https://play.google.com/store/apps/details?id=it.easystaff.unisa",
"package" : "it.easystaff.unisa",
"category" : "Education",
"description" : "MyEasyApp Unisa  lapplicazione dellUniversit degli Studi di Salerno MyEasyApp Unisa consente agli studenti e ai docenti dellUniversit di consultare tutte le informazioni relative allorganizzazione delle lezioni, in particolare: - Configurazione del corso di laurea, anno e percorso formativo di appartenenza e relativi insegnamenti per i quali  necessario monitorare lagenda delle lezioni. - Consultazione degli orari delle lezioni per settimana e per lintero semestre. - Descrizione dettagliata delle lezioni con data, orario e aula di svolgimento e i relativi docenti. - Ricezione di avvisi e comunicazioni tramite notifiche PUSH. - Rilevazione delle presenze ai corsi a frequenza obbligatoria*  * la rilevazione della presenza tramite App sar utilizzata soltanto da alcuni corsi MyEasyApp Unisa is the application of the University of Salerno MyEasyApp Unisa allows students and teachers of the University to consult all the information relating to the organization of the lessons, in particular: - Configuration of the degree course, year and educational path to which it belongs and related lessons for which it is necessary to monitor the agenda of the lessons. - Consultation of lesson times per week and for the whole semester. - Detailed description of the lessons with date, time and classroom and the related teachers. - Receive notifications and communications via PUSH notifications. - Survey attendance at compulsory attendance courses *  * the presence detection via the app will only be used by some courses ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_CALENDAR', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'it.easystaff.unisa.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.WRITE_CALENDAR', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}