{
"name" : "UNINTOUCH",
"url" : "https://play.google.com/store/apps/details?id=it.easystaff.unint",
"package" : "it.easystaff.unint",
"category" : "Education",
"description" : "UNINTOUCH  lapplicazione ufficiale dellUniversit degli studi Internazionali di Roma. Lapplicazione consente a studenti e docenti di avere a portata di mano tutte le informazioni relative allorganizzazione delle lezioni ed alla disponibilit delle aule gestite. Con UNINTOUCH  possibile avere sul proprio dispositivo: - Configurazione del corso di laurea, anno e percorso formativo di appartenenza e relativi insegnamenti da voler monitorare. - Visualizzazione degli orari delle lezioni sia per settimana che per intero ciclo didattico. - Descrizione dettagliata delle lezioni con riferimenti ai docenti. - Disponibilit delle aule in tempo reale. - Ricezione di avvisi e comunicazioni tramite notifiche PUSH. UNINTOUCH is the official application of the University of International Studies in Rome. The application allows students and teachers to have all the information regarding the organization of lessons and the availability of the classrooms at hand. With UNINTOUCH you can have on your device: - Configuration of the degree course, year and educational path of belonging and related lessons to be monitored. - Display of lesson times both for the week and for the entire educational cycle. - Detailed description of the lessons with references to the teachers. - Classroom availability in real time. - Receive alerts and communications via PUSH notifications. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.READ_CALENDAR', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'it.easystaff.unint.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.WRITE_CALENDAR', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}