{
"name" : "Meow Meow Star Acres",
"url" : "https://play.google.com/store/apps/details?id=jp.colopl.nyankous",
"package" : "jp.colopl.nyankous",
"category" : "Educational",
"description" : "Meow Meow Star Acres was chosen among the Best Games of 2014 on Google Play  Meow Meow Star Acres is an island simulation game that can be played by simply swiping the screen. The gameplay is simple and intuitive so children and adults can both enjoy it.  Explore Star Acres and help the cats cultivate the fields and raise farm animals. You can use your crops to make butter, bake a cake, and learn all kinds of other recipes. Share the food you make with your feline friends and they will give you coins and stars. You can then buy new tools and decorations with your coins to make your island unique!  The cats in Star Acres cannot wait to spend time with you!  ----- Meow Meow Star Acres Official Facebook Page: https://www.facebook.com/MeowMeowStarAcresOFCL -----  FEATURES  Just swipe the screen Not only adults, but small children can play as well. Gathering all your crops with one drag of the finger is effortless! Watch the cute cats as they work and play They cultivate the fields, cook, skip work, and sometimes get angry. Just try to resist their cute mannerisms! Learning recipes is fun Baking cakes, squeezing juice, making cheese . . . When you level up, the cats learn a new recipe! Experience their heartwarming island lifestyle Till the fields, raise chickens and cows, and make your island beautiful. This warm, laid-back paradise is waiting for you! Sail to other islands Hop on a ship to visit and explore your friends islands. If you are lucky, you may even find items there! Android tablet compatibility Can transfer data Recover your game data or transfer it to a new phone by way of advanced user registration. Safety measures to prevent accidental in-game purchases Can be played offline Only certain features require a network connection.  ----- Meow Meow Star Acres is free to download. No complicated registration is required! -----  -Presented by COLOPL, Inc.- ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'jp.colopl.nyankous.permission.C2D_MESSAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}