{
"name" : ""Unlimited" kids anime -Japan",
"url" : "https://play.google.com/store/apps/details?id=jp.co.forii.jajajajanjpfr",
"package" : "jp.co.forii.jajajajanjpfr",
"category" : "Education",
"description" : "When kids launch this app they will in fact be launching a world of fun... Fabulous sound effects, animations, and music- AppPicker.com    MOVING BOOKS! Jajajajan (Japanese) is an educational app for kids, filled with delightfully animated stories and songs such as Three Little Pigs, Jack and the Beanstalk, The Other Day I Met a Bear and more. Watch, read, listen, dance and sing along. Prince Jajaja and his whimsical kingdom of characters are ready to help your kids learn and play.   Every Moment a Chance to Discover   Animated fairy tales and songs delivered right to your device. Theres always time for a nursery rhyme.  Great for travel. Watch offline. No internet connection required to play downloaded content.   Loads of fun at parties. Have a singalong.  Ideal for toddlers and preschool kids.  Share stories and songs together at bedtime, circle time, and story time.   Read and Listen  Traditional folk tales, fables, bedtime stories and popular fairy tales come to life in delightfully animated scenes. Words appear onscreen so your child can follow along.    Sing along and Dance  Sing along in a karaoke jam to animated childrens songs such as Lets Clap Our Hands . Easy dance moves your little ones can quickly learn reinforce basic motor skills, self-expression, and communication skills. Note: vocals cannot be switched off.   Storybooks and songs Included  Three Little Pigs The Little Match Seller Jack and the Beanstalk Kasajizou (a Japanese folk tale) Lets Clap Our Hands Oh Vreneli The Other Day I Met a Bear Cinderella Little Red Riding Hood The Ugly Duckling Twinkle, Twinkle, Little Star The Golden Axe The North Wind and the Sun Omusubi Kororin (The Rolling Rice Ball) Momotaro Welcome to the Snowman Party! Kachi Kachi Mountain Red Shoes Little Fox Rabbit Dance Sesame Miso Yankee Doodle The Little Mermaid The Town Musicians of Bremen and more! (*available now and coming soon.)    Age Recommendation Infants to preschool (ages 0-8)   *****   We take raising awareness of privacy and safety seriously. MOVING BOOKS! Jajajajan does not collect personally identifiable information. Anonymous performance data is tracked to improve app development. This app allows in-app purchases. There is no social media integration. One in-app link behind a parental gate will take you to our Privacy Policy via your devices browser.   Thank You We hope your little ones are enjoying MOVING BOOKS! Jajajajan as much as we are producing it. Wed like to hear your feedback. If you have a moment, please let us know what you think with a review.   For additional support: info@forii.co.jp Twitter: http://www.twitter.com/FORiiKids ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'jp.co.forii.jajajajanjpfr.permission.C2D_MESSAGE', 'android.permission.BROADCAST_STICKY', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.INTERNET', 'com.android.vending.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'com.android.vending.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS']",
}