{
"name" : "CASIO EDU+",
"url" : "https://play.google.com/store/apps/details?id=jp.co.casio.fx.CasioEduPlus",
"package" : "jp.co.casio.fx.CasioEduPlus",
"category" : "Education",
"description" : "QR Code scanner app for CASIOs ClassWiz series of scientific calculators  CASIO EDU+ links the QR Code compatible ClassWiz series of scientific calculators with cloud services, thereby enhancing features that allow you to have more fun studying mathematics. The app is equipped with a graph display function that makes numbers visually easier to understand and a function for sharing group work on a website. It is fitted with a newly developed QR Code scanner engine that has been optimized for the ClassWiz series. It also supports multiple QR Codes, allowing you to send large volumes of data, such as numerical tables.   [Features]  Easy to understand and convenient thanks to Online Visualization Expressions and graph drawings are linked with the Keisan engine  The scientific calculator converts formulae and data entered to a QR Code, according to the calculators settings, and displays it on the calculator screen. You can display expressions and statistical graphs by scanning the QR Code with CASIO EDU+.  The Keisan engine is a high precision calculation engine used by the keisan calculation website that performs useful everyday and business calculations.   Online Manual makes it easy to look up things that you dont understand Learn immediately how to use the calculator with direct jumps to the relevant page in the Online Manual  If you display on the calculator screen the QR Code of the page corresponding to the Online Manual and scan the QR Code with CASIO EDU+, that page of the Online Manual will be displayed, allowing you to quickly find out how to use the calculator.   Make lessons more fun with Online Sharing Simultaneous graph display supports class announcements and group work  You can simultaneously display graphs and numerical tables on a website by scanning QR Codes with CASIO EDU+. By comparing and integrating multiple pieces of data, you can project students assignments onto a screen and compare the results of group work. You can also easily create and manage multiple shared spaces (Classes) on CASIO EDU+.     Also saves data  Back up graph drawing results to CASIO EDU+   Results that have been scanned by CASIO EDU+ are kept in the app as history. Even after the data has disappeared from the calculator, you can still view graphs and expressions on the cloud from the history.  See the website for more details.   Worldwide Education Website http://wes.casio.com/  Online Help  http://wes.casio.com/en/education/extension/casioeduplus/  [Supported scientific calculators] ClassWiz Series  fx-991EX fx-570EX fx-991DE X fx-87DE X fx-92 Spciale Collge fx-92B Spciale Collge fx-991SP X fx-570SP X fx-991AR X fx-570AR X fx-JP900  [Operation confirmed models] ASUSTeK Nexus 7 (2013), Lenovo YOGA Tablet 2 8, Acer ICONIA A1, Samsung Galaxy Tab 7.0 PLUS Samsung Galaxy S3 mini, Huawei Ascend P7, LG Optimus L5, Xiaomi Redmi 2, ZTE Blade Q+  *QR Code is a registered trademark of DENSO WAVE INCORPORATED in Japan and in other countries. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.CAMERA']",
}