{
"name" : "#OEKAKI SUPPLE30 drawing-tips",
"url" : "https://play.google.com/store/apps/details?id=jp.gr.java_conf.natnag.es30",
"package" : "jp.gr.java_conf.natnag.es30",
"category" : "Education",
"description" : "      -----------------------------------------    http://32650059.jimdo.com  Special Thanks K ---------------------------------------          3011      ---------------------------------------     ---------------------------------------   Android http://qiita.com/AAS/items/79009d824812940bc138  ---------------------------------------  Privacy Policy  ID ID       For beginners to intermediate users  Painting support application!  Illustrator  Major Kingdom by, Roughly summarized how to draw the human body, Pictorial memo It is an application that gathers images ...!  ----------------------------------------- [Author information] Illustrator  Minkon kokoro Residing in Tokyo. Illustrating bright and fun  Http://32650059.jimdo.com  Special Thanks K --------------------------------------- Do you know how close the eyes and eyes are to each other? Did you draw the ear appropriately? From which finger will you bend the moment of your hand?  I like to draw pictures, but I can not draw it well. I want to improve even more. It is an application recommended for such people. Focusing on how to draw the human body, from head to foot, Also, tips on how to draw are introduced to fine parts such as fingertips. Since there is more than 30 pages, if you draw a picture consciously one page at a time, you can grow monthly every month.  Because important places are drawn with a red pen on a monochrome-based picture, you can learn it easily. It is not too difficult as a specialized book, so you can learn with ease, so it can be said to be the best teaching material for beginners. Please use this to hone your technique of painting with even faster speed.  ---------------------------------------  [About copyright copyright etc.] This application is secondarily used by the authors favor.  ---------------------------------------  This application was created based on the following site information. Android application                       http://qiita.com/AAS/items/79009d824812940bc138  ---------------------------------------  Privacy Policy  Use of advertisement ID A unique ID is used when displaying advertisements. It is clearly stated here that you use it in terms of data sent from the application.  There is no personal identification from this information.  Network Access  It is used for advertisement display in the application. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "[]",
}