{
"name" : "#OEKAKI SUPPLE100 drawing-tips",
"url" : "https://play.google.com/store/apps/details?id=jp.gr.java_conf.natnag.es100",
"package" : "jp.gr.java_conf.natnag.es100",
"category" : "Education",
"description" : "During translation little by little   OEKAKI SUPPLE is easy drawing-tips for artists. ---------only on Android now-------------- japanese--(supported) multilingual localizationProgress status(roughly) korean----(supported) chinese---(supported) english---- you can seetranslate-list of oekaki-supplein those site. >> http://www.pixiv.net/member_illust.php?mode=medium&illust_id=49743345  >> http://pixiv.me/mijinnko3265 >> http://32650059.jimdo.com  ----------------------------------------------------------- Description:  A drawing app for beginners or intermediate learners! With very few words and plenty of illustrations,  you will quickly learn to discern the different features of the human body!  It offers over 100 color illustrations for specific drawing techniques,  making this a brand new and intuitive smartphone learning tool for drawing.  This app includes a collection of Drawing Memos, images drawn by the illustrator Mijinko Ookoku(Daphnia-kingdom),  which break down in detail the different ways of drawing a human body! ----------------------------------------- Information about the artist  Mijinko Ookoku(Daphnia-kingdom),Japanese illustrator http://32650059.jimdo.com  --------------------------------------- Do you know how far apart from each other your should draw the eyes? Are you drawing the ears properly? When someone clasps their hands, which fingers does the bending motion come from?  I like drawing, but you cant draw that well. I would like to improve your skills. If you feel this way, we recommend this app to you.  It helps you focus on drawing the whole human figure, from head to toes, and even such detailed parts like fingertips. It really introduces you to the know-how of drawing.  It includes almost 4 times more extra content than the previous version, #OEKAKI SUPPLE30. If you purposefully do one page of drawing every day, youre bound to improve as the days and months roll by.  Important parts of the black-and-white illustrations are outlined in red pen, making them easier to learn. Its not as complicated as a technical book, and allows for a lighthearted form of learning which is ideal for beginners.  Please continue to sharpen your art skills at an even faster speed with this app.  In regards to copyright and authorship The content of this app is copyrighted to its respective creators. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}