{
"name" : "Challenge with Erin – Japanese Language Test –",
"url" : "https://play.google.com/store/apps/details?id=jp.ne.erin.challengeerin",
"package" : "jp.ne.erin.challengeerin",
"category" : "Education",
"description" : "Contents and how to use the app   In the study section (Lets Try there are four maps: spring, summer, autumn and winter, and you start with spring in the same way as Japanese schools start in spring.  Contents: KOTOBA remember words through a game where you match cards with the same pictures  KOTOBA make sentences by matching illustrations of verbs with cards of vocabulary often used with those verbs  KOTOBA choose illustration cards with the same meaning as Japanese character cards and match the cards  MANGA become characters in a manga, choose the appropriate lines from the choices you are given, and read them out loud  BUNKA deepen your understanding of Japan through a quiz about Japanese culture and society  STAGE TEST a review test of what you studied at each stage. 20 multiple choice questions each with four options  Challenge yourself! Test section> There are 16 tests altogether in the test section (TEST).  You can take eight of these any one week. The questions change each week. Challenge yourself and check which Japanese vocabulary and words you remember and know with this test. Once you finish the tests, you will be issued with a certificate of results that includes your name. If your percentage of correct answers exceeds 80%, you receive a pass certificate that includes a medal (illustration)!    KOTOBA LIST A mini dictionary where you can find all the vocabulary and expressions that appear in the app. Each of the words that you answered that you had remembered have a check mark next to them. In the list each word is also written in Roman alphabet and hiragana/katakana, and there is a translation of the words meaning to enable you to study Japanese characters.  STATUS Every time you log in to the study section and study, you receive 100 points, and when you take a stage test, that score is added as points. You can see the results of your study to date, including your overall points, your weekly points (total points from the most recent Monday to Sunday), the number of words you have remembered so far, the number of stages you have cleared, and the number of tests you have passed.  RANKING Displayed here is the overall point ranking of all learners using this app and the number of stages they have cleared, as well as your own overall points and number of stages cleared.   HONIGONSCAMERA When you clear the stage test of each stage in the study section, HONIGONSCAMERA starts up. For each stage various different frames (background illustrations) are displayed, and you can take a celebratory photograph combining these frames and a photo of yourself that you take. ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.ourcompany.ourapp.permission.C2D_MESSAGE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.ourcompany.ourapp.permission.C2D_MESSAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}