{
"name" : "Crayon Shinchan Operation Little Helper",
"url" : "https://play.google.com/store/apps/details?id=jp.neoscorp.edu.shinchan",
"package" : "jp.neoscorp.edu.shinchan",
"category" : "Education",
"description" : "------------------------------------------------------------------------ From the children to the adults, they all addicted to the little helper contents. ------------------------------------------------------------------------ Helping others is so happy! From the popular game Crayon shin-chan Little Helper , you can enjoy a variety of challenges while playing!   There are many things you can do such as cleaning up or washing clothes, even shopping and care for pets and fishing goldfish  Even if you dont know the method or order, just play with shin-chan and can be very happy! Through the playing house games, you can play a lot of little helper missions!   all content that can be enjoyed regardless of age!  ------------------------------------------------------------------------  Introduction of the little helpers task  ------------------------------------------------------------------------ Go Shopping! Challenge the shopping in the supermarket! After you remember what you want, put it in the shopping basket and take it to the cashier to pay for it! If you can complete the checkout, you will complete the shopping!  Clean Up! The first thing to do is to put together the puzzles. After you have prepared your vacuum cleaner, clean the dust in your room! This is the exact order to clean up a room.  Sushi Restaurant! Make sushi today! Put the tuna and squid together, put the melon and pudding together... Make a sushi for everyone. How many can you eat?  In addition to this, a new Little Helper mission will be updated every month.   Target age  All ages   Compatible terminals  Required Environment: Android OS 4.4 or later   About the unlimited play course  Price and duration: 350 yen (including tax) / Automatic renewal after every month After subscribing for the period, you can use all the services and play freely any number of times. After subscribing for the period, the advertisement will be removed. - Payment will be charged to your Google Account.   About automatic renewal of periodic subscription  Unless the registration of the periodic subscription is cancelled 24 hours before the end of the period of validity, the subscription will be extended automatically for the next period. To cancel the registration of the periodic subscription, it is necessary for the user to take steps oneself.   Contact information  If you have comments or hopes about the application, you can contact us by the following email address. kureshin@support.neoscorp.jp   & Copy; Yoshito Usui / Futaba, Shinei, TV Asahi, ADK & Copy; Neos Corporation ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['jp.neoscorp.edu.shinchan.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}