{
"name" : "TO-FU OH!Fire",
"url" : "https://play.google.com/store/apps/details?id=jp.smarteducation.tofu.firedept",
"package" : "jp.smarteducation.tofu.firedept",
"category" : "Education",
"description" : "Youre a fire fighter! Go help the people in town with Daizu the skunk! This app is designed to guide your young ones to play by their instincts and through this, stimulate his or her creativity. TO-FU island is on fire here and there because of the troublesome aliens. We need to extinguish it fast! Will you be the driver or the one to spray water? Hop in the fire truck and go to the site as fast as you can!   After youve accomplished your mission, drive all around TO-FU Island freely and explore! If you see a funny looking cactus, hose it watch it turn gigantic and make sure to rush through the scary tunnel real fast because there are ghosts in it. When you see a huge rock rolling towards you, jump off the waterfall! You can paint the town by firing colored water balls, just the way you like. Make no mistake, this is NOT just your ordinary fire fighter game. Your child will experience many activities in this single app.  They will not only be able to learn the work of a fire fighter but also make their own discoveries. Through this, they will enjoy the fun of searching for new adventures and making up their own play, open up their inner power to be creative. Be yourself and have fun freeing your imagination limitless  Description - Extinguish fire by spraying water from the fire truck. - Use colorful paint balls, icy freeze balls and magic foam to extinguish. - Park the fire truck on the orange X to get to the fire site. - Drive around TO-FU Island and hose down whatever catches the eye. - Have fun at the cactus desert, ghost tunnel and shore line? - Go visit the huge waterfall on top of the mountain! Explore! - Hose down even the buildings, roads and mountains and see what happens. - Experience AR by taking in photos as the background for your original play!   About TO-FU STUDIO This is our second release after our very first app, Oh! SUSHI!. We create apps to make kids burst into laughter all around the world, since this is what we want to see most from them. By playing our apps, kids will experience various jobs in a fun way, and be stimulated by his or her creativity. We will keep on creating apps that bring laugher in kids lives, so please support us by using them with your family. *Our apps are FREE to download. You can enjoy all features by purchasing additional items or by watching adds. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}