{
"name" : "Human Heroes Einstein’s Clock",
"url" : "https://play.google.com/store/apps/details?id=kalam.tech.einsteindemo",
"package" : "kalam.tech.einsteindemo",
"category" : "Educational",
"description" : "**Currently supports English language only**  Play with historys greatest minds! Designed alongside education specialists, this app brings back to life the most iconic figure in science: Albert Einstein, voiced by Stephen Fry!  Einsteins Clock is a completely free app with no in-app purchases, no subscriptions or signups and can be played offline, with no internet or Wi-Fi connectivity required.  Taught by the creator of the theory of relativity himself, and presented as an interactive 3D character, a dancing, quirky Einstein will be your very own personal tutor guiding you through The Cadence of Clocks, helping you when you struggle, and telling you funny jokes along the way.  Move hour and minute hands across 8 different levels and learn how to tell the time in different configurations: OClock, quarter and half, and past and to.   Tutorials and on-screen guidance allow for children of all abilities to enjoy this educational adventure of a lifetime!  Einsteins Clock is an introduction to the Human Heroes universe, with the full Einstein experience covering relativity, rhythms, pendulums, gravity, Einsteins fascinating life and so much more in Human Heroes Einstein On Time, available on the App Store today!  Features:  - A realistic live-show experience: High-quality visuals and dynamic speech system complimenting the luxurious voice performance by Stephen Fry, who recorded dozens of lines for this game!  - Master reading the clock: Covering a Key-Stage National Curriculum area  - Scaffolding teaching techniques used throughout. You are sure to succeed as Einstein steps in with on-screen visual and verbal help when you struggle.  - Travel through time by moving the clock hands backward or forward and witness the effects of time on the succession of day and night.  - Learn about different types of clocks.  And much more!  All facts and figures have been rigorously checked and researched by subject matter experts to ensure scientific, historical and biographical accuracy.  About Human Heroes:  Einsteins Clock is the third game in a childrens educational app series  Human Heroes - Created by edtech startup KalamTech, centred on historys greatest minds. From the philosophers of ancient Greece to the giants of science, renowned artists, composers, mathematicians, authors, and architects  these inspirational characters are brought back to life in a futuristic theatrical setting to perform a captivating live-show experience covering their life and their famous discoveries.  Forthcoming apps will explore the legacies of Leonardo da Vinci, Isaac Newton, Mozart, Ada Lovelace, Aristotle, Jane Austen and many more. ",
"desc_perms" : "['android.permission.vibrate', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}