{
"name" : "Little Traveller: Learning Games for Toddler Baby",
"url" : "https://play.google.com/store/apps/details?id=kidsgame.playandlearn.littletraveller",
"package" : "kidsgame.playandlearn.littletraveller",
"category" : "Educational",
"description" : "Little Traveler is the toddler & baby game perfect for your search.   Created with beautiful & original artwork, as well as unique characters and locations that educate your little angel and help him/her develop faster, Little Traveler is one of the best babies games & toddler learning games you could download as a parent!   What is Little Traveler at its core?  It is a versatile educational app for babies, toddlers, and kids that features variety of games in 1 app. It is created by an experienced creative team, parents, and educators, and has a goal to help you spend your time with children more effectively while entertaining & helping them develop fine motor skills.  Absolutely adorable & toddler-friendly, it features fun, colorful characters and interesting educational tasks that are specifically designed to speed up development and help little kids learn while having great time.  Designed with multi-touch technology and impressive visuals, Little Traveler is sure to help both you and your kids play together and enjoy every second.  TRAVEL AROUND THE WORLD WITH YOUR TODDLER:  As one of the best baby games for boys & baby games for girls, it puts your little one in the role of a traveler. The little traveler needs to visit different magic places all around the world:  - Limpopo Super cute level, inspired by Africas flora and fauna. Savannah, Baobabs, Giraffes, Hippos and many more colorful drawn creatures and nature landscapes. Dont miss this fantastic yet safe Safari trip!  - Pyramidsland This logical toddler game level is inspired by mysterious Egypt Pyramids, ancient Egyptian characters and endless deserts.  - Ivanovka Challenging level inspired by Russian mysterious expanse of majestic snow-capped landscapes, quaint villages, invigorated culture, traditional toys, clothes, musical instruments like piano phone and food. Enjoy your stay:)  - Gioto Entertaining and educational level, inspired by Japanese culture and heritage, includes Geishas, Ninjas, Sumo fighters characters, origami and the very beautiful scenery with Pagodas and the Sakura tree.  - Britannika (UK inspired) What a fun level! You get a chance to ride a red bus where the wheels on the bus go round and round...It drives you to the park with a giant Ferris wheel, hop in :))))  - Napoletana (Italy inspired) Hungry? Welcome to the pizzeria, an Italian chef is about to make some delicious pizzas for you, help him to pick the veggies and fruits from the fridge, enjoy;)  - Kaktusito (Mexico inspired) Endless adventure in one of the worlds great civilizations, iconic cactus-strewn deserts, the home of sombreros and spicy beverages. Welcome;)  - Schangchiao (China inspired) Become a true artist in the world of bright and colorful zodiac signs. Coloring them is so much fun!  VARIETY OF BABY PHONE GAMES  The huge selection of learning games for toddlers includes simple and challenging tasks:  - Solving puzzles (puzzle games for kids aged 2+)  - Coloring (coloring games for kids aged 2+)  - Finding the right half of the object or character (object games for toddlers aged 2+)  - Learning to scale and balance  - Playing peek-a-boo, finding the hiding character (find the difference for toddlers)  - Arranging objects by number, pattern, color, form, and size (shape games for kids)  - Using logic when selecting a series of toys, objects (logic baby games for girls)  - Putting figures on the silhouette (move objects kids game)  - Sorting characters, objects in the right order (order baby games for boys)  Aid and speed up your kids development and fine motor skills with one of the most complete toddlers & babies games in 1 learning app!  Designed for children of preschool age and also suitable for boys and girls 18 months - 5 years old.  Let your kids benefit from our super-fun educational games.  Download Little Traveler now for free! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS']",
"perms_with_call" : "['android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}