{
"name" : "ABC Song - Rhymes Videos, Games, Phonics Learning",
"url" : "https://play.google.com/store/apps/details?id=kidzooly.rhymes",
"package" : "kidzooly.rhymes",
"category" : "Education",
"description" : "Learn ABC, Numbers, Phonics, Kids Rhymes, Alphabets, Vehicles, Fruits, Shapes, Colors with ABC songs and rhymes videos by Kidzooly. Videos of ABC Song are COMPLETELY FREE and OFFLINE and can be used by everyone interested in Learning ABC & Phonics fun way.  ******** WE HAVE UNLOCKED ALL LEARNING ACTIVITIES AND LEARNING SONGS FOR FREE.  Everyone can enjoy ABC song and offline rhymes videos any place any time without the need for data/internet connection.  Teachers and everyone can use this app to keep students and kids entertained through fun learning.  ABC Song and Top Nursery Rhymes Videos for everyone are handpicked, sorted to enjoy all favorite ABC Songs by Kidzooly featuring top videos and most viewed songs from Videogyan Learning Songs Series including rhymes, alphabets finger family, numbers, colors, phonics, vegetable finger family, fruits finger family.  ABC Learning Songs and nursery rhymes included in    Alphabets: ABC songs with nice music to get started with Alphabets.  Phonics: Explore new words with Phonics to understand the usage of alphabets, ABC, and words.  Numbers: Nursery rhymes to understand Numbers from 1 to 10 in an easy and fun way.  Colors: Colors songs to enjoy beautiful colors.  Shapes: Explore the world of shapes and understand different aspects of the shapes.  Vehicles: Get audience introduced to vehicles like car, train, plane, buses and much more.  Rainbow: Learn natures mesmerizing play with colors and enjoy different colors nature has to offer.  Fruits: Learn more about tasty fruits along with most loved Finger Family Songs.  Vegetables: Teach kids about different vegetables and how they look with cute animations.  Domestic Animals: Enjoy the Domestic Animals with animal sounds.Kids can enjoy animals along with the favorite finger family song.  Wild Animals: Wild Animals and songs include elephant, lion, bear and other wild animals finger-family.  ********************************************************** ABC & Phonics Learning - Top Features and Activities  **********************************************************  Under Water World - a Delightful Underwater world with moving objects to play with fishes and other objects.  Kids Classroom - Learn Alphabets, Numbers, Colors, and Shapes by tapping and interacting with the cute objects.  ABC Songs and Video Rhymes - Fun Animations, Songs, Finger Family Videos and offline Videos to learn through music and video.  Kids Memory Games - Improves Memory by tapping on different tiles.  Kids Puzzles - Develop matching and fine motor skill.  Kids Block Puzzles - Match the shadow of the objects and improve memory and matchmaking  Kids Coloring - Color the alphabets, numbers, vehicles, fruits and much more.  Alphabet and Number Tracing - Tracing Capital Alphabets, Small Alphabets, and Numbers.  Kids Connect the Dots - Join the dots to see the animals, vehicles.  WordPlay - Complete the Spelling of objects and learn with fun.  Trivia - Put your kids knowledge to test by answering fun quiz just by tapping and much more to come.   If you like our effort please show us your love by leaving a comment and rate our app.Please check our other apps too @ https://play.google.com/store/search?q=kidzooly&c=apps We are all ears as always. Thanks. Kidzooly  ------------------------------------------------------------------------  Like Us : https://www.facebook.com/videogyanminds/ Support & Feedback : email us @ support@vgminds.com Other Apps : https://play.google.com/store/search?q=kidzooly&c=apps Website : www.kidzooly.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'kidzooly.rhymes.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING']",
}