{
"name" : "TAYO Driving Practice",
"url" : "https://play.google.com/store/apps/details?id=kr.brody.tayodriving",
"package" : "kr.brody.tayodriving",
"category" : "Education",
"description" : "TAYO Driving Practice is back with new and more exciting features! Lets learn the importance of road traffic safety and how to follow traffic rules.  Lets clear various missions while driving with Tayo and his friends? We will help the little buses drive safe and also learn traffic safety rules!   TAYO Driving Practice Renewal! - TAYO Driving Practice is back with entirely new features. Enjoy even more fun and various characters and contents the game provides.    There are many different characters and backgrounds. - Brand New World Map Updated! You can choose TAYO Town, Sand Village, Snow Village  - From bright daytime to dark afternoon, lets drive on various roads with Tayo! Youll see many different maps with their own unique backgrounds. Dont just focus on clearing the missions - check out what kind of impressive background youre driving at. Tayo and his friends will be there with you. Guess who youre going to drive with today!   Learning traffic safety rules while playing - You cant just drive however you want! Drive the little buses safe until the point of arrival following the traffic safety rules. You dont know the rules? Not a problem! Pat and Rookie are out there ready to teach the rules and help you out! * Follow the traffic light. * Follow the speed limit. * Stop completely at traffic lights or crossroads. * Be careful not to bump into other cars. * Yield to fire trucks and ambulances. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.INTERNET']",
}