{
"name" : "PINKFONG Car Town",
"url" : "https://play.google.com/store/apps/details?id=kr.co.smartstudy.cartown_android_googlemarket",
"package" : "kr.co.smartstudy.cartown_android_googlemarket",
"category" : "Education",
"description" : "Welcome to [Pinkfong Car Town]!  DRIVE, SING, and PLAY exciting games with your favorite car! From the brave superhero Police Car and the mighty Fire Truck, to the friendly School Bus and the tough Bulldozer -- we have variety of car options for you to choose from! Pick a vehicle & race it along the road!   The app also includes educational activities, such as learning car-related vocabulary and coloring car pictures using colorful art tools. Join the fun now!  Features:  1. Drive & race with your favorite car! - Whats your favorite car? Police cars? Fire trucks? You can choose! - Turn, honk, accelerate, and pick up your friends while you drive. - Easy & safe features for young children and toddlers.  2. Watch 7 different car videos! - Sing-along familiar nursery rhymes, including Wheels on the Bus. - Enjoy high quality graphics for free! - Available in 4 languages: English, Korean, Chinese and Japanese.  3. Play fun games! - Each car comes along with its own fun mini game.  - Learn numbers and new words while playing the games.  4. Includes coloring activities! - Paint your favorite car using 15 different colors.  - Use stickers and patterns.  5. Learn the names of different cars! - Even better, you can learn the names of the cars without even trying!  Have FUN with the app!  *The app is created by Pinkfong -- the company behind the worldwide sensation, Baby Shark. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}