{
"name" : "Fun Times Tables: Toddler Math",
"url" : "https://play.google.com/store/apps/details?id=kr.co.smartstudy.timestablesiap_android_googlemarket",
"package" : "kr.co.smartstudy.timestablesiap_android_googlemarket",
"category" : "Education",
"description" : " Get the Times Tables Full Pack on 70% discounted price.  Times tables, the first step in math! Start with [Fun Times Tables] and learn multiplication in a fun and interactive way.   [Fun Times Tables] is an educational app that helps your child to practice essential key skills needed in multiplication through animated songs and mini games.  Children as young as 2 to 3 years old can enjoy the app by singing along to songs and playing games. Begin learning math by becoming familiar with the times tables!   This is how you enjoy [Fun Times Tables]!  One. Sing along to Skip Counting Songs. - Become familiar with the key concepts of the times tables while singing along to fun songs.   Two. Play with bubble games and dot-to-dot games. - Review and repeate what you learned as you play with bubble games and dot-to-dot games.  Three. Sing along to Times Tables Songs. - Learn the times tables from 2 to 9 by going on a journey with your favorite animal friends! Animal characters resembling different numbers such as a bunny with two long ears or a bee in a search for flowers with nine petals will guide you through the journey.  Four. Enjoy quizzes. - Take quizzes on multiplication. Its more fun when enjoyed with mom and dad!  Five. Play with a built-in camera. - Have fun taking pictures with the cute characters from Times Tables Songs and share them with other children on SNS!   * Supports 4 languages - Through the settings menu, you can change the language between Korean, English, Chinese, and Japanese. Enjoy learning numbers and times tables in different languages with a single, one-time purchase!  You can master the times tables with [Fun Times Tables]! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}