{
"name" : "Eggbun: Learn Korean Fun",
"url" : "https://play.google.com/store/apps/details?id=kr.eggbun.eggconvo",
"package" : "kr.eggbun.eggconvo",
"category" : "Education",
"description" : "Learn & practice your speaking, reading, listening and Korean writing skills with Lanny  the chatbot tutor. Have a chatbot tutor in your pocket!  ---  Looking for a live chatbot app to learn the Korean language? Want 1 Korean learning chat app to learn & practice:  .. Korean reading  .. Korean writing  .. Korean vocabulary  .. Korean speaking  Well, you need Eggbun, the Korean language learning chatbot. With 1,000,000+ users worldwide, Eggbun is the most popular way to learn Korean language!  LEARN WITH LANNY  THE CHATBOT TUTOR  Its a fun chat Korean app that allows you to practice your speaking, reading, listening and Korean writing skills all by chat. Get started by chatting with your personal chatbot tutor, Lanny, and get access to 550+ Korean lessons, whether its Korean for beginners or advanced language learners. With Lanny in your pocket, you can learn Korean online anytime, anywhere!   WHY YOULL LOVE EGGBUN Neatly organized, beautifully designed and fun, the Korean live chat app allows you to   Get Korean language basics in one place - Start with learning Hangeul, basic verbs, phrases, and sentences!   Actually communicate in South Korean language - All the phrases and words for travel in Korea that you need to know, ordering guides and even the occasional K-drama reference. We believe that context is the best way to learn.   Talk like a native speaker - Its not just text, but audio to help you with pronunciation too! Eggbun Korean language tutorials include audio by native Korean speakers that are sure to help you with your Korean speaking & Korean vocabulary.   Get a strong understanding of Korean culture - Eggbun has Culture Notes to help you really understand and learn Korean culture! Its like you have an ability to chat with Korean people and you probably know that learning Korean is much easier when done through chatting.  And all this is designed in the simplest UI youll ever see in a Learning Korean app.. we can guarantee that!  EASY PROCESS TO GET STARTED  Download and sign up via the popular email & social media networks with one click. Explore categories like Korean characters, greeting expressions, pronunciations, real-life conversations, common verb endings, business, and more, but dont forget to especially check the Survival Korean for Travelers series.  Everything is made to be fun, fast and conversational, yet memorable and effective!  All your progress is tied to your account, so you can come back and continue your learning process at any time & anywhere.  Dont miss the opportunity to finally learn this amazing language.  Learning with Eggbun is like having a Korean language school on your phone.  Download the ultimate chat Korean bot to:  .. learn to speak Korean  .. learn to write Korean  .. understand Korean  NOTE:  If you have any questions or suggestions, please contact us at help@eggbun-edu.com.  Website: http://www.eggbun-edu.com Instagram: https://www.instagram.com/eggbun_education Facebook: https://www.facebook.com/eggbun.edu -------------------- Privacy: http://www.eggbun-edu.com/privacy Terms of Use: http://eggbun-edu.com/terms-of-use ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}