{
"name" : "Penguin - vocabulary trainer",
"url" : "https://play.google.com/store/apps/details?id=kz.otanmukhanov.penguin",
"package" : "kz.otanmukhanov.penguin",
"category" : "Education",
"description" : "The main differences between our vocabulary trainer.  Arcade gameplay that will allow you to learn English words when playing.  Voice-over of all words by a native speaker  Dictionary database that is constantly updated: English-Spanish, English-Portuguese, English-Russian, English-Kazakh, etc.  Ability to play in offline mode  Carefully selected dictionary database by our experts in linguistics from 3000 most popular words in English, which covers 95% of the words from everyday English speech.  The game provides answers with identical parts of speech (noun, verb, adjective) and similar topics. For example, if you are asked to choose the correct translation of the word learn, then all variants of answers will be verbs on the same topic.  A team of developers and linguists are constantly developing the game, which will add new features in the near future and expand the dictionary base of the game.  Vocabulary trainer suitable not only for beginners pupils and students with the knowledge beginner level, intermediate, but also to those already held polyglots who are preparing to take the exam toefl, ielts.  The process of the game. English words will fall on top of the screen, and you will need to guess its translation until it falls to the bottom of the screen for seven seconds. The faster you guess the word, the more points you will get. The maximum number of points for one drop is 100. For each word, your score is calculated. If you can not guess the word before it reaches the bottom of the screen, or a wrong choice of words, you will go bankrupt - all your progress points of the word reset. When the progress of the word glasses reaches 500, the word is considered learned and disappears from the dictionary and will no longer fall.  Levels in the game. To go to the next level, you need to study all 3000 words of the current level.  Level 1. Normal mode. The life of words is 500.  Level 2. Normal mode. The life of words is 300.  Level 3. Normal mode. Life of words - 200.  Level 4. Blind mode. The life of words is 500.  Level 5. Blind mode. The life of words is 300.  Level 6. Blind mode. Life of words - 200. Normal mode - words will fall with voice acting and with text. Blind mode - words will fall only with voice acting (without text). Life of words - you need to score points for each word, so that the word is considered learned. Life of words - you need to score points for each word, so that the word is considered learned.  Whats the chip? The whole game is built on the mechanism of instantaneous reflective memory. When you are just slowly learning words you have a certain part of the brain that is responsible for analysis and imagination. But, in the game Penguin is not so. Here you will not have much time, because in the game, either you guess the word in seven seconds, or all the progress on this word is reset. This makes you instinctively use the reflex memory of your brain instead of the analytical memory when memorizing words. And it works. See for yourself.  Have you always wanted to learn or improve your English? Then Learn English Words Now! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}