{
"name" : "AAKASH DIGITAL - For Live Class Premium Students",
"url" : "https://play.google.com/store/apps/details?id=learn.aakash.digital",
"package" : "learn.aakash.digital",
"category" : "Education",
"description" : "Today in the fast-pacing world where everything is becoming smart, from smartphones to smartwatches to smart TVs, educational pedagogy is evolving and moving towards a smarter zone too. As legends say, smart world is a better world. Rolling on a similar format, Aakash Digital launches a series of revision lectures with its special classes where you get added benefits in the form of added features which will enhance your preparation. Now, studying is more fun and exciting and convenient as you get the experience of high-level teaching from our renowned faculty along with the 30 plus years legacy of Aakash.  What you get in Aakash Digital app is something to look forward to. Below are the features which you will get once on the app:  * Board control to students: Students can now access the smart board in ongoing class which will enhance the interactive element among students  * Audio control to students: We all want our voices to be heard every now and then and a fun class is the one where you get to interact with the teacher as it helps in better comprehension and doubt resolution. So, now students can get audio control inside an ongoing class  *Fastest finger first: Remember KBC? Now students can make their home their hotseat by using our fastest finger first feature. Students can also see who has answered first in the quiz which will enhance the competitiveness amongst them  * SMS/Push notification: Gone are the days when you could lose track of time and study planning as now, students will also get chain of notifications which will help them to keep a track in managing their time  * Video jumpers: No need to waste time anymore by studying a specific topic again. Now students can directly jump to sections of videos to the specific topic to save time and improvise revision  * Analytics engine: Now students will get access to their regular attendance, class engagement levels etc. (in graphical and tabular format) which will help them to plan their presence better and organize their study strategy in an efficient manner  * Teacher-connect app: Now students will also get access to a separate app where students will connect with teachers directly and will also get their assignments from teachers there  Isnt that fun and exciting in itself? So, hurry and download the app to study in a modern and smarter way. ",
"desc_perms" : "['', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.DISABLE_KEYGUARD', 'learn.aakash.digital.permission.NOTIFICATION_CALL_BACK', 'android.permission.WRITE_OWNER_DATA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_OWNER_DATA', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_OWNER_DATA', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.USE_FULL_SCREEN_INTENT', 'learn.aakash.digital.permission.NOTIFICATION_CALL_BACK', 'android.permission.WRITE_OWNER_DATA', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}