{
"name" : "Learn English Podcasts: Free English Conversations",
"url" : "https://play.google.com/store/apps/details?id=learnenglish.com.learnenglishpodcasts",
"package" : "learnenglish.com.learnenglishpodcasts",
"category" : "Education",
"description" : "-------------------English Podcasts------------------- Listen to everyday conversations recorded by native British English speakers in our LearnEnglish Podcasts series, and improve listening skills. Listen to podcast hosts Tess, Ravi, Adam and Rob chatting with different people and talking about different everyday topics, such as their favourite celebrities, making plans for the weekend, having a dinner party and which cities they like to live in.  The app helps you learn everyday English by providing more episodes and over hours of free listening about a wide range of topics, as well as great new features that help you listen and understand the conversations.  LISTEN, READ AND CHECK THAT YOU UNDERSTAND In every episode, listen and read along with a moving audioscript. The audioscript gets highlighted to help you focus on listening. Comprehension questions come with each episode so that you can check your listening and whether you understand the conversation.  HOW THE APP HELPS YOU LEARN EVERYDAY ENGLISH The best way to improve your listening skills is to listen to a little bit every day and try to listen to a wide range of different topics in English. When youre listening, try to remember or write down as many of the main points as possible.  FEATURES BACKGROUND PLAYING AND OFFLINE ACCESS The audio plays even when the screen is turned off. This is a popular request from our users  thank you all for your feedback. You can also: - download episodes onto your tablet or phone and listen offline - delete episodes after youve listened to them to create space on your tablet or phone. Re-download episodes when you want to listen again. Thank you. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.RECORD_AUDIO', 'learnenglish.com.learnenglishpodcasts.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}