{
"name" : "HSK 2 Chinese Flashcards",
"url" : "https://play.google.com/store/apps/details?id=learn.chinese.flashcards.hsk.two",
"package" : "learn.chinese.flashcards.hsk.two",
"category" : "Education",
"description" : "Master 150 Chinese words with HSK 2 Chinese Flashcards! Your vocabulary will grow by leaps and bounds with this app.  Choose the word pack and number of cards you wish to study and hit play! Cards are randomly generated each time to prevent any muscle memory being used to remember word order.  HSK 2 Chinese Flashcards allows you to quickly blaze through hundreds of cards. No need to flip each card to see the answer. If you recognize it, tap Next. If not, then flip the card and study the answer. Think youve mastered the current card pack? Do it again, just to be sure, then tackle the next pack of flashcards. Each time you start, the cards will be once again randomized.  Think you know all 150 words? Time to try the full deck Mandarin Chinese flashcards pack. Studying Chinese has never been this simple. Pronunciation of each word is also available at the top of a button. Want to take another look at the Chinese characters on the previous card containing the Chinese word? Simply tap the previous button, or tap the previous button multiple times to go back to the beginning.  Your Chinese study stats are recorded and available on the main page. You can reset these at anytime.   How many minutes a day do you have to study Chinese? 5? 10? 15? 300? The more the better, but with HSK 2 Chinese Flashcards, there is no limit. You can pick up and start again from where you previously left off. Give your Mandarin Chinese an immediate and lasting boost with this simple yet effective flashcards app.  Where do you study Chinese? At your desk? In the library? While you commute? With HSK 2 Chinese Flashcards, the possibilities are endless. You can even easily study while exercising at the gym. Any spare minute you have during the day can quickly be filled by using this flashcards app. The results will be striking and noticeable in short order.   This learning Chinese app can be used in a couple of ways. Prior to flipping the card, try to really recall what the English and Pinyin are. If the answer is obvious, no need to waste time flipping the card. Simply tap next and proceed. In this way, you will develop the ability to blaze through all 150 words in under a minute, which means you are now an HSK 2 master.  Use this app multiple times per day, and directly before sleeping for best results, and watch your vocabulary and character recognition grow exponentially. Already finished all of the words? There are 4850 more Chinese words to go if you download our other flashcards app, for HSK levels 1 to 6. Good luck in your pursuit of mastery of the amazing Chinese language.  ** For Chinese learners looking for a new and brilliant way to study Chinese, be sure to also download our Chinese learning app - Chinese Character Hero - HSK Pro, also available on Play Store. The Hero Method allows you to quickly learn Chinese characters by enforcing a recall and recognition process, essential for long-term memory. This method is even more effective than the traditional flashcards approach, and is a lot of fun! Get it today! ** ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING']",
}