{
"name" : "Yasir Qadhi Lectures",
"url" : "https://play.google.com/store/apps/details?id=lecture.yasir.app.yasirqadhi",
"package" : "lecture.yasir.app.yasirqadhi",
"category" : "Education",
"description" : "Yasir Qadhi Lectures  Watch all the videos of Yasir Qadhi in your smartphone. You can access and watch the video anytime you want with just one application. Take this chance to learn more about Islam in the convenience of your smartphone. About Yasir Qadhi Abu Ammaar Yasir Qadhi is an American Muslim scholar, speaker and writer of several books. He was born in Houston, Texas in 1975 and he is of Pakistani descent. He spent his childhood in Jeddah, Audi Arabia and then back to his birth place to attend university. He graduated from University of Houston with a B.Sc in Chemical Engineering. After that, he went back to Saudi Arabia to study and earned a bachelor degree in Arabic and a master degree in Islamic Theology. Qadhi is currently teaching in the Religious Studies Department of Rhodes College. In addition, he also has become the Dean of Academic Affairs in AlMaghrib Institute since 2001. His contribution in the academic world, especially in the Islamic studies granted him a title as One of the most influential conservative clerics in American Islam from New York Times back in 2011. Qadhi is famous for his strong critics towards extremist violence instigators who use religion to justify their actions. He said that contrary to popular belief, violence is against the value of Islam because Islam is a religion of peace that condemns any kinds of act of violence. Features of This App - Watch all Yasir Qadhi lectures videos freely and conveniently from your smartphone. - A great chance to learn Islam from a great Islamic scholar. - New videos will be updated everytime Yasir Qadhi posted a new video in his YouTube channel. - No login required so there is no need to make and remember any username and password. - This application and the videos are completely free. - The application is very neat and easy to use.  Great Things about Yasir Qadhi Lectures Application Yasir Qadhi is one of the most respected Islamic scholars in America and listening to his lectures definitely will be a great way to learn more things about Islam. You can access all of his public lectures from this application in a very simple way. The videos are separated into categories so you can easily find a suitable video according to a theme that you want to explore more. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
}