{
"name" : "Kanji Learning",
"url" : "https://play.google.com/store/apps/details?id=ludo.app.kanjilearning",
"package" : "ludo.app.kanjilearning",
"category" : "Education",
"description" : "Kanji Learning aggregates full Japanese Kanji data to support you learn easier.  The application provide full level of Kanji include: - Elementary: kanji for beginner level. - Secondary: kanji for intermediate level. - Advanced: kanji for advanced level.  The application also provides many other features: - Searching: help you to search all kanji in our database. - Radicals: concentrate full radicals of all kanji, help you to learn and remember kanji easier. - Marked Kanji: contains marked kanji of user for all level. - Marked Vocabulary: contain marked vocabulary from any kanji. - Marked Sentences: contain marked example sentences from any kanji. - Setting: setup the personal setting.  The main screen of application show the kanji data based on users level. User can refresh data or change the level on setting screen.  For each kanji data, you can see the detail of it and mark it for the later learning. From the detail, you can see the sentence examples, each sentence contain the romaji and meaning text. You can also see the vocabulary that contains this kanji and which level the kanji is. Yon can mark vocabulary or sentence to learn later.  To remind you about kanji, application has feature named Daily Notification that display random kanji based on your selected level.  The application supports some methods that help you to study kanji easier. - Writing/Drawing - Flashcard - Multiple choices quiz  Kanji Learning, kanji, learning, study, radical, vocabulary, sentence, kaiwa, flashcard, test, jlpt, drawing, writing, learn kanji, study kanji, kanji study. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'ludo.app.kanjilearning.permission.C2D_MESSAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.INTERNET']",
}