{
"name" : "Learn foreign words with Smart-Teacher",
"url" : "https://play.google.com/store/apps/details?id=me.devinco.smarteach.tts",
"package" : "me.devinco.smarteach.tts",
"category" : "Education",
"description" : "This self-teaching game helps to learn productively correct pronunciation and spelling through visual and audio support. For the correct organization of the learning process will help the function Smart-Teacher. With this interesting and entertaining game you or your child will be able to add new words from scratch to their vocabulary through playing. The vocabulary is the foundation for good oral and writing skills. Self-training every day can improve your knowledge in practice - reading, speaking, listening and literacy. This free app works in offline mode. You can learn words in the following language modules:  Learn English British Learn English American Learn Spanish Learn Italian Learn German Learn French Learn Polish Learn Portuguese Learn Ukrainian Learn Russian Learn Chinese Learn Taiwanese Learn Korean Learn Czech Learn Slovak Learn Serbian Learn Greek Learn Swedish Learn Japanese (Gojon: hiragana and katakana) Learn Danish Learn Norwegian Learn Dutch (Nederlands, Hollandic) Learn Arabic (we recommend to install Vocalizer TTS) Learn Hungarian Learn Romanian Learn Croatian Learn Belarusian (we recommend to install Sakrament TTS) Learn Indonesian Learn Turkish Learn Vietnamese Learn Bulgarian (we recommend to install Vocalizer TTS) Learn Hebrew (we recommend to install Vocalizer TTS) Learn Thai Learn Hindi Learn Finnish Learn Estonian Learn Persian / Farsi (we recommend to install eSpeak TTS) Learn Latvian (eSpeak TTS) Learn Lithuanian (eSpeak TTS) Learn Bengali (Bangla) Learn Malay (eSpeak TTS) Learn Slovenian / Slovene (eSpeak TTS) The learning process consists of several stages: - Learning the alphabet, parts of speech, such as nouns, adjectives, verbs with phonetic transcription through flashcards and sound accompaniment by TTS (text-to-speech). - Testing of the knowledge of the words happens through fun and simple tests:  Choosing the right word for the picture.  Choosing the dynamic moving images for the words.  Writing words and spell check. This engaging and useful game of skill is a mobile tutor for self-study of vocabulary and phonetics on the elementary level. List of topics: colors, human body parts, domestic animals, wild animals, animal body parts, birds, insects, sea life, nature, natural phenomena, fruits, vegetables, food, kitchenware, home, home interior, bathroom, home appliances, tools, office, school supplies, school, numbers, geometric shapes, musical instruments, shop, clothes, shoes and accessories, toys, infrastructure, transport, travel, entertainments, information technology, human, society, professions, sport, summer sports, winter sports, prepositions. Added mini phrasebook with transcription, it includes common phrases and expressions, adjectives, topics - months and family for such pairs of languages: English British, English American, Russian, German, Spanish, Italian, French, Polish, Portuguese European, Portuguese Brazilian, Czech, Slovak, Ukrainian, Serbian, Montenegrin, Bosnian, Croatian, Dutch, Hungarian, Romanian, Bulgarian, Turkish, Swedish, Danish, Norwegian, Finnish, Vietnamese, Indonesian, Malay, Lithuanian, Latvian, Estonian, Slovenian. This interactive self-learning app can be used on any device: phone, tablet and smart TV without a touchscreen and control by keypad or d-pad. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.CALL_PHONE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}