{
"name" : "Sema Goal",
"url" : "https://play.google.com/store/apps/details?id=me.kukua.semagoal",
"package" : "me.kukua.semagoal",
"category" : "Educational",
"description" : " AppsAfrica Innovation Award 2017  Sema and her twin brother MB are up against the Bongolalas once again and they need your help to win the football championship in Dunia. Sema Goal teaches children all the 26 capital letters of the alphabet. Children kick the ball to letters in the goal post and learn to identify capital letters and the sounds they make.  Sema Goal is a fun and engaging educational game for kids developed with teachers and pedagogy experts. Each level features a different letter and kids must help Sema and MB score all the 5 goals to defeat the Bongolalas and move to the next level.    Features:   26 unique game levels that teach children the capital letters.  Children learn 26 letter sounds and get a new reward on each level  Exciting, interactive gameplay that keeps kids learning outside of school.  Curriculum designed in collaboration with pedagogy experts and teachers in Africa. Have fun dressing up Sema and MB with a new item on each level.   Starring Africas heroine, Sema!    Appropriate for children aged 3-6.   Free game for kids, no in-app purchases, no ads, and all features are fully functional offline.  The third learning game in the series of Sema educational games (more to be released soon!)  At Kukua, we empower children with the confidence to change the world by teaching them reading, writing, and math. We are now working on the first African superhero series, Super Sema and look forward to sharing it with the world. Give your child the chance to join thousands of children learning to read and write with our free educational games for kids: download Sema Goal today! ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}