{
"name" : "Easy Japanese - Let's Learn Japanese with Anna!",
"url" : "https://play.google.com/store/apps/details?id=me.visencl.app.easyjapanese",
"package" : "me.visencl.app.easyjapanese",
"category" : "Education",
"description" : "Easy JapaneseApp is an third party client of NHK WORLD RADIO JAPAN. Japanese language lessons are provided by NHK WORLD. You can learn basic grammar and useful expressions through lessons designed in audio-drama style.   Introduction of the story The heroine of the story is Anna, a 20-year-old Thai student who loves Japanese manga. She has come to Japan to learn the Japanese language for one year at a university in Tokyo. She will learn practical Japanese through various experiences, such as classes at the university, daily life at a dormitory, shopping, and traveling.   A wide variety of lessons starting with the basics! Easy for kids to learn too We have lessons at various levels, so dont worry even if you are a complete beginner. People who have just started learning Japanese can start with the basics and improve their skills from there. The programs are also perfect for those who want to brush up on their listening and speaking skills.   Learn properly with audio files of native Japanese speakers When you are not in Japan, its difficult to find a language school with native Japanese teachers.  At first when learning how to speak a new language, its important to listen to the pronunciation of a native speaker and practice by imitating the way they speak. Imagine that you are in Japan on vacation and you want to ask someone where the train station is. You know how to say it, but once you try asking someone they cant understand you. Even if you know the phrases, you cant use them in a real situation.  To avoid this, youre better off learning the pronunciation, intonation and rhythm from a native Japanese.   Easy, useful, 100% free. If you have any questions or suggestions, please send an email to hatasei@hotmail.com. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "[]" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE']",
}