{
"name" : "IELTS Listening Practice - English Listening",
"url" : "https://play.google.com/store/apps/details?id=mimosa.english.ieltpractice.listening",
"package" : "mimosa.english.ieltpractice.listening",
"category" : "Education",
"description" : "IELTS Listening Practice develop listening comprehension skills, improve your listening skill with  many level and easy to use. There are 3 levels in the IELTS listening part. Each level has 34  lessons. There is one transcript and one exercise in each lesson. With over 700 articles about English Listening. Each lesson is based on a real world conversation.  You can improve speaking skill with it, listening every day and speak repeat. Moreover, you can boost your English vocabulary by learning new words in various topics such as  airport, bank, colors, shops etc. These phrases or expressions can be used not only in your daily  conversation but also in academic writing. All phrases and expressions in this app are based on  Britain English. Key Features:  You can see TED Talks in each language.  Practice authentic IELTS exam tasks  Over 800 lessons for IELTS & English Listening  Listen & Read lesson with Audio & Transcripts  IELTS Quiz.  Most Common Phrases with audio supported.  Essay for IELTS.  A high TOEFL, IELTS, or TOEIC  Help you learn vocabulary 4-5 times faster  Common Phrasal Verbs.  SAT Words.  English Tenses.  Search lesson.  Bookmark manager.  Download audio file.  Background Audio Mode.  Two listen mode: Online or Offline. Notice : This App is NOT a TEDs official app. All TED Talks are sourced from http://ted.com . TED does not endorse or sponsor this app in any way. All TED Talks subject to the creative commons  license found at ted.com ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}