{
"name" : "Raccoon Treehouse: Kids puzzles & sorting games",
"url" : "https://play.google.com/store/apps/details?id=mobi.ka.th.raccoons.free",
"package" : "mobi.ka.th.raccoons.free",
"category" : "Educational",
"description" : "*** Fun EDUCATIONAL game for toddlers of AGE 3 and up  *** SORT, MATCH, CLASSIFY and BUILD by shape, pattern, color and everyday objects  *** Developed with certified child psychologists and experts in early education *** 12 beautiful puzzles for pre k students  About the game:  Raccoon Treehouse toddler learning program - consists of 12 beautiful rooms each focused on developing a set of basic concepts such as size, colors, numbers and patterns using everyday objects from the childs world such as clothes, food and many more.  Game Boards:  The App consists of 12 preschool learning games. The boards were carefully chosen in order to represent basic elements from the childs world. Kids will learn to match colors, shapes, size with the objects from the real world they see around.  Bathroom: Match polycubes by SHAPE.  Dressing room: shape sorter to dress the raccoon. Living room: Place each everyday object in its LOGICAL place. Watering Can: helps kids learning shapes.  Playroom: Assemble toys by placing missing parts in their LOGICAL place. Backyard: fruits color sorting for kids. Kitchen: Classify food and kitchen appliances by their purpose. Dining room: Sort the raccoons dinner by matching SIZE and NUMBER. Vegetable garden: Match fruits and vegetables by MEMORY. Laundry room: Pair clothing items by SILHOUETTES. Tent: Match geometric shapes by SHAPE and PATTERN. Garage: Sort different tools by SIZE.  TinyHands toddler learning Games:  TinyHands Sorting Series A set of sorting games designed to help children acquire basic concepts such as shape, color, size seasons and animals. Game boards are organized in an ascending difficulty level starting from basic sorting followed by more complex context based sorting and classification environments.  TinyHands Towers Series Kindergarten learning games about Stacks and order, designed to help toddlers acquire basic concepts such as: big VS. small, before VS. after, and bottom VS. top. Boards are organized in an ascending difficulty level.  TinyHands Whats My Pair Series A series of three pair matching activities for kids. The game challenges the preschooler to match pairs, initially based on visual aspects alone and in more advanced screens based on logic and understanding of card content.  TinyHands First Words Series A set of vocabulary games for children of age 1.5 and up. It consists of 10 boards, each focused on a different theme from the childs world such as shapes, colors, clothes, animals and vehicles.  TinyHands Town Center Educational game recommended for toddlers age 3+. This game includes 10 beautiful boards each focused on developing a set of basic concepts such as size, colors, numbers and patterns using everyday objects from the childs world such as clothes, food and many more.   Note for parents: Like all in our games, this one is designed to provide quality playtime for parents and children together. Playing along with your children is highly recommended and will surely make them benefit the most from this app and help them expand their vocabulary.  We are sure that your toddlers will enjoy exciting educational activites that will encourage their thinking and contribute to the development of their basic skills. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
}