{
"name" : "Click Német Learning",
"url" : "https://play.google.com/store/apps/details?id=mobilport.clickknowledge.huhudede",
"package" : "mobilport.clickknowledge.huhudede",
"category" : "Educational",
"description" : "Have you learned a language, but your knowledge is not sufficient? If you miss excellent work possibilities due to the lack of language knowledge, then it is high time to change on it. You must surely know, that language knowledge is essential to have well-paid jobs. However, who has time and money to attend language school?  If you work and learn hard, it is very difficult to find time for language studying. On the top of that, teachers cannot always explain the grammar clearly, so the English lesson can be a distress. Although, we all know, that at least one language must be spoken well to have a promotion. English is especially essential in bigger companies, but demand for German, Spanish and Russian is getting higher and higher.  You do not have energy to sit down with a language book in the evenings after a tiring and long day, do you? Many times you only stare into the distance and you do not memorize even a single word. You need a more effective plan than this, as otherwise you are only wasting your valuable time.  If the language studying was only a distress, then you have not probably met with all the methods.  Click4Skill - the mobile language teacherThe most efficient studying method, if you memorize something, you practice it and at the end you check yourself. Thus you will not surely forget and memorize the new words and grammar badly.  If you cannot fit an hour into your day to learn English or German, then you can take advantage of the breaks with 10-15 minutes.  You can make every minute valuable!  The path-breaking Click 4 Skill language teaching software offers this possibility, as you can simply upload it to your smart phone in order to have this learning aide anytime at hand.  From now on, the language learning is as flexible as you wish.  If you want, you can spend 10 hours a day, but if you do not have time, you just pick your phone for only10 minutes. It does not matter how much time you spend with it, Click 4 Skill application gives feedback immediately of your current status. Thus you can measure your knowledge and the improvement will be concrete from day to day. This positive confirmation will motivate you in language studying and you will see the results instead of the failure. At last, you can try yourself out, how much better you can perform, if you are motivated.  You did not like studying language earlier? Our application was developed on the basis of native language knowledge acquisition, therefore it works in a more effective way, than the teaching used during the traditional school lessons. This playful software makes the language studying exciting with experience of fun. You do not have to be a talented language student, with the assistant of revision-based method of Click 4 Skill, everybody can be an excellent student. Can you imagine, that you make a practice of learning as if it was a game?  You can even reach the high level with our application in 7 months, if you learn one hour per day. As you constantly test your new knowledge, you can be sure, that you will be able to use the language knowledge in the school or at work, which was acquired during a playful language studying.  If you want to get closer to the future you have dreamed about with one big step, we will assist you in this with pleasure. You can go for a job interview or undertake work abroad with self-assurance - it depends on you, what you will do with your language knowledge. By introducing Click 4 Skill we found it important to place a more concrete language knowledge into your hand. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}