{
"name" : "My Little Unicorn: Games for Girls",
"url" : "https://play.google.com/store/apps/details?id=my.little.unicorn",
"package" : "my.little.unicorn",
"category" : "Educational",
"description" : "Come and play with your little unicorn, Kimi! Grow up together!  Features: - Amazing gift - hatch a surprise egg and take care of the super cute newborn unicorn with a ton of CUTE and FUNNY EXPRESSIONS. - DRESS UP & DECORATION are involved in this game! So that you can change the little babys clothing, dress, wallpaper, window, wardrobe and so much more! - FEED & BATH your little unicorn. Your baby is really hungry, prepare to feed Kimi with apple, lollipop, milk and even strawberry cake. Pay attention to the reaction when you feed different foods.  - Take a BUBBLE BATH with toys to make Kimi clean! - Your unique unicorn needs to SLEEP & GO TO THE BATHROOM. Play the lullaby before the unicorn falls asleep. Pick up the cutest toy for Kimi to hold. And Kimi will dream about the favorite toy. Teach the little one to go to the bathroom in the right moves, especially washing hands. - You need to be a really good babysitter! Are you ready to take care of Kimi?  How to play: - Use interactive controls to play the game. - Use patience and love to make the little Kimi feel happy and comfortable. - You can unlock plenty of different dresses, toys, and stuff as Kimi grows older.  Crash, Freeze, Bugs, Comments, Feedback? Feel free to drop us a line at https://www.kidsfoodinc.com/contact  Important Message for Purchases: - By downloading this App you agree to Kids Food Games Incs Privacy Policy. - Please consider that this App may include third parties services for limited legally permissible purposes.  About Kids Food Games Kids Food Games is a high quality Educational Game Studio for Girls. Our goal is to bring fun, safe and exciting new educational gaming experiences to girls.  Important Message to Parents This app is free to play and all content is FREE with ads. There are certain in-game features that may require purchase using real money.   Discover more free games with Kids Food Games Inc - Subscribe to our youtube channel at: https://www.youtube.com/channel/UCIBxt5W2xpgofE9jOS6fXqQ/featured - Learn more about us at: https://www.kidsfoodinc.com/ ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
}