{
"name" : "My Little Princess: Stores. Girls Shopping Dressup",
"url" : "https://play.google.com/store/apps/details?id=mylittleprincess.stores.free",
"package" : "mylittleprincess.stores.free",
"category" : "Educational",
"description" : "My Little Princess Stores is a storytelling digital dollhouse game where every game is a new adventure. Have fun pretend playing in the princess village stores. Get the latest fashion at the Clothing store, dressup, makeup and lots of clothing. Find you new best friend and the local Pets store or simply visit the supermarket for some food and party items. There are lots more shops and locations for you to play and discover in Little Princess Stores.  Why Do Kids and Parents love our games? My Little Princess games are a digital version of the classic dollhouse game. Our kids game has no rules or objectives, it is all about free play and pretending. This is what makes our games so exciting for kids. Everything a kid sees in the game is touchable or intractable. You can have a princess dress up party, apply girls makeup and customize every character. By connecting all of our games we are helping the kids to build a whole world around there own adventure.  Game Features: - 10 NEW locations and stores to explore! - Brand new characters to meet and play within both the My Little Princess games. - BRAND NEW hot air balloon feature! Each of the My Little Princess games now have a hot air balloon station, where you place the characters inside and then touch the liftoff button. The game then opens up a map with an entirely different game to explore! - Multi-touch support so you can play with friends together on the same tablet - Use the hot Air balloon to travel between downloaded little princess games  Recommended Age Group My Town : My Little Princess Stores is great for kids all ages between 4-12. Younger children can play with their parents, while older children can enjoy playing the game with their friends, or by themselves. All My Town games promote imaginative play, helping to develop creativity and empathy. Our games are used by autism and special needs therapists worldwide. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.sec.android.provider.badge.permission.WRITE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.sec.android.provider.badge.permission.READ', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'mylittleprincess.stores.free.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}