{
"name" : "Fairy Tale Magic Kingdom : My Little Princess",
"url" : "https://play.google.com/store/apps/details?id=mylittleprincess.fairy.free",
"package" : "mylittleprincess.fairy.free",
"category" : "Educational",
"description" : "Welcome to Little Princess, Have fun playing in the Fairies Magic kingdom Forest, its a Magic tale story full of fairies just waiting for you to explore. Play with the forest fairy, discover all the friendly animals, visit the tree house and collect the magic kingdoms rocks and see what they do. The Fairy Tale Magic Kingdom is an imagination game where every thing is possible. With lots of magical locations and fairy characters our game offers a huge play value for kids and parents!   Why Do Parents Like Our Games. Little princess fairy forest free dollhouse game has everything kids love. First we dont have any rules in the game, what kid likes rules? The game is pure imaginative fun, your kids will have a blast playing with this amazing digital dollhouse set. Dress up the little princess and the fairies with lots of different clothing and costumes. Enjoy artistic and creative play elements. Guaranteed hours and hours of pure fun.  *Easy enough for a 4 year old to play with, Exciting enough for 12 years old to enjoy!*  Game features: - Fully connects to other little princess games which means you can move clothing, characters and accessories between games  - 12 new locations to explore in the little fairy forest and lots of new animals and friends. Pretty little fairy garden, treehouse, shops and more! - Awesome new characters you can move around other little princess games. - Over 300 different accessories, clothing, plants and magical rocks all ready for your fairy tale story adventure. - No Rules, No Stress. Pure imagination fun.  Create your own fairy tale, Play as you wish, do what ever you want, interact with what you love. Its that simple!  Recommended Age Group This game is suitable for all ages, especially for 4-12 years old. Older kids can play alone while you, as a parent, can play along with your 4-6 years old child. Game supports multitouch for your convenience.  We Make Games That Kids Want To Play As you probably know, we read each and every email, message or tweet you guys are sending us. Keep proposing ideas, helping us with bugs you find or just connect to say hello. Please dont forget to rate the games.  Facebook: https://www.facebook.com/mytowngames Website: http://www.my-town.com Twitter: https://twitter.com/mytowngames ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.sec.android.provider.badge.permission.WRITE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'mylittleprincess.fairy.free.permission.C2D_MESSAGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.sec.android.provider.badge.permission.READ', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}