{
"name" : "Tee and Mo Bath Time Free",
"url" : "https://play.google.com/store/apps/details?id=net.pluginmedia.teeandmobathtime.free",
"package" : "net.pluginmedia.teeandmobathtime.free",
"category" : "Educational",
"description" : "Join Tee and Mo for Bath Time. This playful app helps to reinforce your childs bedtime routine and behaviour. Give Tee a bath, brush his teeth, and help him go to the toilet! If Tee can do it, can your little one do it too? NOTE: Free version includes bath game only, teeth brushing, toilet and gargling games all unlockable via in-app purchase.   Tee and Moseen on CBeebies, 2014 BAFTA and Prix Jeunesse nominee, and 2013 Winner of Childnet Internationals Positive Content Competition.   Tee and Mo Bath Time is a fun digital toy for kids aged five and under and their caregivers. It can help with potty training, bath time routine and behaviour. Tee and Mo is perfect for co-playenjoy some you-and-me-time together with your child!  FEATURES:  - Interact with your favourite characters from CBeebies across four entertaining activities. - Beautiful artwork and original music ensures a fun experience for kids and grown-ups too. - Easy to use with no rules or difficult gameplay. - Builds strong routines at the end of the day around bath time, teeth brushing, toilet and potty training. - Gated Parents area ensures peace of mind for grown-ups, with tips on how to use Tee and Mo Bath Time to build a familiar routine for kids. - No third-party advertising.  GAMES:  Bath Time  Help Mo give Tee a bath. Put Tee into the water and then give him a wash with the soap and a good scrub with the sponge. Choose a shampoo to wash Tees hair, sculpt a bubbly hair do and then rinse it all away with the shower. If the bathroom gets misty, use your fingers to wipe it all away.   Teeth Time  Help Tee brush his teeth. Choose a toothbrush to brush Tees teeth and then tap on Tees mouth to give them a good clean. Tee likes jumping around, so youll have to catch him!   Toilet Time  Tee needs a visit to the little monkey room. Help him go to the toilet, reach the toilet roll, and flush the chain. Dont forget to always wash and dry his hands!  Musical Mouthwash  Mo is partial to a musical mouthwash. Choose mouthwash to get Mo to gargle, and then tap the bubbles to make a tune. Poptastic!   ABOUT TEE AND MO  Tee and Mo follows the daily adventures of a funny and precocious little monkey, Tee, and his clever and unstoppable mum, Mo. Stories, songs, and games explore everyday situations through the viewpoint of child and parent.   While Tee and Mo may want to do different things, theres always plenty of fun to have by negotiating the challenges of daily life TOGETHER. Their light-hearted approach to problem-solving and teamwork inspire imaginative play and lead to care-giver and child bonding both on and off screen.  Find out more about Tee and Mo at www.teeandmo.com  ABOUT PLUG-IN MEDIA  Plug-in Media is a BAFTA-winning digital production company, creating both interactive and linear TV content for the children and families audience.  Our digital first strategy led to Tee and Mo - a co-viewing and co-playing brand for pre-schoolers. Launching initially as web games and apps; our animated music videos have now attracted over many millions of Youtube views and our 50-episode TV series is available across the globe. We also make award-winning games and apps for some of the worlds best loved childrens entertainment brands including Peppa Pig, Octonauts, Paw Patrol, and Sesame Street. See more at: www.pluginmedia.net ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'net.pluginmedia.teeandmobathtime.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'net.pluginmedia.teeandmobathtime.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}