{
"name" : "Master Flutter",
"url" : "https://play.google.com/store/apps/details?id=net.lebdevelopers.masterflutter",
"package" : "net.lebdevelopers.masterflutter",
"category" : "Education",
"description" : "This app will teach you how to create Flutter application in a very practical & simple manner, as every lecture comes with full coding video tutorials & corresponding code in notebook .  This app will be updated frequently as flutter and dart are in their early stages of development.  So what are you waiting for?  Who this app is for: Beginner flutter developers that are interested in developing mobile application for android and ios Developers that want to learn, how to create an mobile app using single code base..  If you are looking forward to work on Flutter, the new cross-platform mobile development then this is a great place to begin. One of the major perks is that this tutorial doesnt need any prior programming experience. All the necessary topics are covered from the scratch. There is a step by step learning process which is followed by challenges for better retention. By the end of this program, you will become confident about coding in Dart programming language and building cross-platform mobile apps.    Key USPs    Great course to get started with Flutter & Dart for beginners.  -Build full-fledged apps for your business or project.  -Lots of programming exercises to sharpen programming skills.   The lectures cover an array of topics in depth including data structures, networking, OOP.  -Build over 10 apps with the help of the lessons and strengthen your portfolio.  About Flutter Flutter is a mobile application development SDK (Software Development Kit) created by the minds at Google. The developers of Flutter term it as a high-performance and high-fidelity app builder for iOS and Android applications, from a single codebase. The idea behind Flutter was to help developers create fast applications that feel smooth on distinct platforms. With beautiful iOS flavored widgets built with Flutters own framework, developers can create beautiful and customized UX.  Prerequisites for learning Flutter Before you look out for Flutter tutorials, there are a few requisites to learn Flutter. To begin with, one should invest some time in learning the basics of control structures and the flow of an application. While this should be enough to help you start with Flutter programming, it is also advised to learn the programming language Dart for further proficiency in Flutter. Dart is a general-purpose language created by Google used to build web, server, and mobile applications.   Why learn Flutter? Flutter has gained quite some numbers in recent times due to its ability to help developers focus more on the end product and not the SDK. This is due to the features that Flutter brings to the plate, one of them being the silver layout model, which helps it to enable smooth scrolling from the layout itself, which significantly improves the UI design. Moreover, Flutter doesnt use the standard widgets unlike other SDKs but uses its own widgets, which are customizable and extensible, giving a fresh look to the design.  learn flutter learn dart learn ios app development learn android app development  learn ios learn android learn coding coding coding tutorials coding lessons coding lesson learn ios learn android #learn_flutter #learn_android #flutter #learn_ios #android #ios ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}