{
"name" : "Preguntas Examen EIR Enfermería",
"url" : "https://play.google.com/store/apps/details?id=net.jarcode.eir",
"package" : "net.jarcode.eir",
"category" : "Education",
"description" : "Si estas preparando el examen de EIR (Enfermero Interno Residente). Prepara tu examen de enfermera (EIR).  - Casi 3000 preguntas. - Toda la informacin est en la aplicacin por lo que no requiere conexin a internet para funcionar. - Puedes practicar las preguntas al azar, o realizar exmenes completos (generados aleatoriamente o reales de aos anteriores). - Estadsticas para consulta la evolucin de tu tasa de aciertos.   La aplicacin tiene las unas 2900 preguntas recopiladas de exmenes reales de aos anteriores. Tienes varios modos de aprendizaje: - Realizar tests sin fin con todas las preguntas. - Realizar exmenes generados aleatoriamente. Al ser generados aleatoriamente tienes infinitos exmenes a tu disposicin, todos ellos distintos entre si. - Realizar los exmenes de aos anteriores, estan todos desde 1993. - Despus de cada examen puedes revisar cada una de las preguntas para repasar los fallos. - Puedes realizar un test slo con las preguntas que has fallado. Las preguntas en este listado se mantiene hasta que las aciertas o borras el listado manualmente. - Compite contra otras personas para ver quien es capaz de responder mas preguntas de forma consecutiva sin fallar.  Incluye publicidad no invasiva, por lo que no te molestar mientras practicas. Gracias a esta publicidad la aplicacin se mantiene gratuita sin ningn tipo de coste.  Gracias por utilizar la aplicacin y suerte en el examen. If you are preparing the examination of EIR (Internal Resident Nurse). Prepare your nursing exam (EIR).  - Almost 3000 questions. - All information is in the application so it does not require internet connection to operate. - You can practice random questions, or perform thorough examinations (randomly generated or actual previous years). - Statistics to see the evolution of your hit rate.   The application has the some 2900 questions gathered from actual exams from previous years. You have several learning modes: - Perform all tests endless questions. - Conduct tests randomly generated. Being infinite randomly generated tests you have at your disposal, all of them different from each other. - Perform exams from previous years, they are all from 1993. - After each test you can review each of the questions to review failures. - You can test only the questions youve failed. The questions in this list is maintained until the guess right or delete the list manually. - Compete against others to see who is able to answer more questions consecutively without fail.  It includes non-invasive advertising, so they will not bother while practicing. Thanks to this advertising application remains free without any cost.  Thank you for using the application and luck on the exam. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}