{
"name" : "Mermaid Secrets32 – Mermaid Princess Party",
"url" : "https://play.google.com/store/apps/details?id=net.joyplustech.android_mermaid32",
"package" : "net.joyplustech.android_mermaid32",
"category" : "Education",
"description" : "There will be a mermaid princess party held for mermaid girl Mia to introduce her prince charming Eric to the mermaid world under the sea in the mermaid girl games. Lets make a beauty spa salon for the princess at sea in the spa day of the free games for girls. And how about a shining nail salon after princess salon spa in mermaid princess salon? Paint nails to be fashion nail and glitter nails in nail art salon is attractive to princesses in our mermaid games. After the spa party in the mermaid princess castle, the fashionista, feature underwater - Mia, and her loved Eric are swimming to the royal palace ball! All the sea animals and mermaids are dancing with the music now! Join them in the fun games for free together!  Mermaid Games Features: 1.Wow! Mermaid princess Mia plan to hold an ocean dance party for her first crush in the free girl games. She need a princess makeup salon in the girl game now. 2.As a princess girl in princess game, princesa Mia also like girly spas, especially for the royal party in the princess games. It is basic for fashion princesses to do facial spa before makeup and makeover in the salon games.  3.Now, beauty influencer, can you help to do fashion spa for Mia to make her as the dancing queen in the princess makeup salon? 4.Ouch! Be soft to Mia in the spa salon even it is only a salon game! Different from the day spa, games in spa will do more details in beauty salon for this spa weekend in the spa games.  5.How can a mermaid princess nails look like that! Help Mia do a manicure in the nail salon games. Get ready to make prinsessen Mia the best dancing queen in the party? 6.To beauty nails in the nail shop, nail designer will do the following treatment to Mia  nail repair, nail care, nail spa, nail polish, and nail design! Mia likes this relaxing nail spa in the nail salon games. 7.Look! Princess Mia is showing her glow nails to Prince Eric! The nail art makes fancy nails in the nail art salon and nail fashion salon. Such a fun game for girls! 8.Princesses and princes all love party, so it is to the princess Mia! In most salon games for girls, makeup artist always make up and make over princess in the makeup salon. Also, the make up artist will give princess dress the trendy design in the girls games. Those gorgeous princess dressing up will make Mia the most shining in the princess dancing party in our fun games for girls! 9.Mermaid princess dancing party is going on in the sea game. Mia with princess dressing up is dancing with her high school love Eric now, she is so beautiful in the girl games. 10.OMG! Erics father misunderstood that mermaid Mia kidnapped Eric!!! He is talking with Dr. Steven. Eric often had to save mermaids from this crazy scientist before! What will happen next in the girl games for free? Stay tuned for our new girls games!  Fashion girls, if you like beauty spa salon and manicures, play mermaid mias royal dancing party game, the best mermaid game for girls!  You will be girly girls after princess salon spa and polish nails in the nail game! Next nailstar is you! Download the games for girls right now! Start your princess story with princess Mia!  ABOUT US  JoyPlus creates fresh mobile content for the whole family. we lovingly produce digital adventures that entertain, challenge, and engage families all over the world.  Visit us: http://www.joyplustech.net/  Watch us: https://www.youtube.com/c/JoyPlusGames   CONTACT US  Let us know what you think! Questions? Suggestions? Technical Support? Contact us 24/7 at contact@joyplustech.net. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'net.joyplustech.android_mermaid32.permission.C2D_MESSAGE', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}