{
"name" : "Fun English for Schools",
"url" : "https://play.google.com/store/apps/details?id=net.studycat.funenglishjunior",
"package" : "net.studycat.funenglishjunior",
"category" : "Education",
"description" : "The Fun English for Schools app is a supplementary learning tool for educational establishments that use the Fun English for Schools curriculum.   It is an organized course of flashcards, games and quizzes divided into daily lessons for very young learners which works as a students home supplement and a classroom tool for teachers. It goes hand-in-hand with a three-year Fun English for Schools nursery, preschool, and kindergarten curriculum.  Who is Fun English for Schools for?  The Fun English for Schools app is a supplementary learning tool for educational establishments that use the Fun English for Schools curriculum.  Benefits of Fun English for Schools   Learn more than 566 important English words, 300 sentences, 48 original songs, 26 letters and 24 phonic blends.  Get three to four lessons a week throughout Nursery, Preschool and Kindergarten.  Gain listening, speaking, reading, writing, spelling and singing skills.  Attain a level of English proficiency equal to a Cambridge Pre A1 Starters preparation.   The Fun English for Schools course is designed for learners in the three years before elementary school. It begins with a Nursery course for 3-4 year olds that focuses on picture vocabulary, letter recognition and songs.  It is delivered three times a week in five to ten minute home lessons. The second level is for Preschoolers aged 4-5. It adds phonics, sight words and dialogues to the picture vocabulary and songs. The third level is for Kindergarten students aged 5-6. In this level, learners gain twice again the amount of content as in the first two levels, bringing them up to par with the Cambridge Pre A1 Starters benchmark for English proficiency.  The Fun English for Schools curriculum includes the Fun English for Schools app for school and home use. It also includes color Student Books, Activity Books, Teaching Guides and printed flashcards for the classroom.   About Us  People learn best when they are happy and relaxed, especially children learning languages. Games are the most effective way to teach because they add an element of enjoyment to the learning process. Games must be imaginative, humorous and come in great variety.  We believe that fun and humor are essential elements of language education. We want to provide a comprehensive learning experience that is entertaining to its core.   Like our app?  Please rate us or write a review to tell us what you think.  Need more information?   Website: https://studycat.net/apps/fun-english-jr/  Email: support@studycat.net ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET']",
}