{
"name" : "Chitas Guide",
"url" : "https://play.google.com/store/apps/details?id=net.amber_studio.chitas",
"package" : "net.amber_studio.chitas",
"category" : "Education",
"description" : "Test yourself and see how well you learned todays Chumash, Tanya, and Rambam.  A new app aimed at improving your comprehension of the daily Chitas learning curriculum. Learn the Chitas with the knowledge that youll need to remember the information in order to score well on the test.  The app provides 10 daily questions on the Chumash with Rashi. Each day you will be able to answer multiple-choice questions. The daily score will count towards your total score. You will also have the opportunity to take yesterdays test for a one-time nominal fee.   There is also a weekly test available for purchase. The weekly test combines the top 25 questions from the week.  The future updates will also include Rambam and Tanya, but for now, only the quiz for the Torah with Rashi is active.  Important Note: The questions and answers for each section of Chumash will follow the text as it is interpreted by Rashi. Although some of the answers may be correct according to another commentator (or even a Rashi from another Torah section), the correct answer will be the answer that follows the Rashi on each section.  If you find any mistakes or if you have any comments, please feel free to reach out through the Saber Team email. We will not respond to any other form of correspondence.  The Android version of this app is dedicated in loving memory of Shaina Bracha bas Shmuel and Mordechai Tzvi ben Yitzchok. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}