{
"name" : "WordBit Korean (automatic study - 한국어,한글 공부)",
"url" : "https://play.google.com/store/apps/details?id=net.wordbit.kren",
"package" : "net.wordbit.kren",
"category" : "Education",
"description" : " WordBit German  http://bit.ly/appgerman  WordBit Spanish  http://bit.ly/appspanish WordBit French  http://bit.ly/wordbitfrench  WordBit Italian  http://bit.ly/appitalian  WordBit Arabic  http://bit.ly/apparabic  WordBit Hebrew http://bit.ly/apphebrew  How often do you check your phone? We check them hundred times a day, and unlock our phone screen 50 times per day on average, but what if we can practice the new English word every time you unlock your screen? well,you can learn 3000 words in a month. Worbit,the English learning app is an app that will make you practice English words automatically. Download our app today,and maake your lockscreen into something useful! All downloads are free.   The key part of learing a language is memorizing,and repetitive learning is the key to master the language. Repetitive revising by checking WordBit will enable you to memorize new words easily and keep your language skills longer.  About WordBit  1. Various Contentes - English words that goes from level Beginner to Advanced  - Thematic conversations and phrases included  2. Various Study Modes  Study modes let you study English as flashcards,study sheets,and quiz cards.   3. Providing Pronunciation Aid - Check the correct pronunciation of all words and phrases in this app.   4. Other Utilities - Revising System - Automatic Pronunciation - Share Options - 14 Different Theme Colors (Black Color Added :Blue/Mint/Pink/Gray/Gold)   5. Custom Options  Favorites  Learned words  Wrong Answer List  Contents (Free!)    Words (For beginners) - with images Korean alphabets  Numbers,Time  Animals, Plants  Food  Relationship  Essential    Words (By level)  Elementary  Intermediate  Advanced  etc.    Words (Supplement)  onomatopoeia, mimetic words Unit  postposition    Sentences - not available on Quiz mode Basic Daily  Travel    [Functionality Description]  (1) After you download and start the app, learning mode would be automatically activated. - This app is designed for learning English automatically. Therefore, every time you turn on your phone the app would be activated and this enables you to learn English. (2) If you wish to temporarily deactivate the app from automatic study mode, you can do so by adjusting the [Settings} of the app. (3) For certain smartphone OS (Huawei, Xiaomi, Oppo etc.) the app could be automatically shut down. In this case, you can access and adjust your devices settings (ex. save power, power manager) to solve the shutdown problem. If you have any further questions about how to use it, please feel free to contact us.  contact@wordbit.net ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}