{
"name" : "Fun French: Language Learning Games for Kids",
"url" : "https://play.google.com/store/apps/details?id=net.studycat.funfrench",
"package" : "net.studycat.funfrench",
"category" : "Education",
"description" : "French language learning games for kids. Educational activities teach kids to read, speak & spell.   Designed by language learning experts for kids aged 3-10  Course for preschool, early learners & young children studying languages.  More than 11,000,000 parents and kids choose our apps worldwide   FUN FRENCH EXPLAINED  It combines a structured language course with engaging and entertaining games.  Our language course is divided into lessons. Each language lesson teaches core vocabulary and presents words in several contexts to assist learning and retention.  Fun French uses male and female voices. The voices use different tones and expressions so that learners can pick up on the subtleties of pronunciation.   FEATURES   6 or more unique games in each fun-packed lesson.  Original music, songs, sound effects and beautiful cartoon artwork  Engaging learning games will keep your child entertained as they learn   LANGUAGE LESSONS  2 Free Lessons - 14 Learning Games!   Colors - Say and spell the major colors.  Animals - Meet many animals alone and in groups.  There are many more lessons available for purchase.   Numbers - Learn how to count.  The Body - Learn the major parts of the body.  Fruits - Talk about the fruits you like.  Food - Learn how to say the food you want.  Clothes - Describe the clothing people are wearing.  Vehicles - Describe things, like cars and bicycles.  The House - Learn furniture, rooms and where they are.  Sea Animals - Compare things, like sharks and turtles.  School Bag Lesson - Learn classroom objects and whose they are.  Actions - Learn how to use action verbs   FOR EARLY LEARNERS  The variety of games, challenges, and different modes of interactivity can help with other areas of your childs development:   Play is an important element of your childs development  Helps your child build motor skills and concentration  Hand-eye coordination is reinforced during engaging activities  Instant feedback helps children understand how well tasks are being performed  Helps your child to use technology in a beneficial and effective way   ABOUT US  Fun French is created by our team of expert educators who have brought their classroom-tested language courses to tablets and smartphones.  We have created step-by-step courses that teach languages in an effective and entertaining way.   FEEDBACK & SUPPORT   More Information: https://studycat.com/apps/fun-french  Like Us on Facebook: https://facebook.com/studycat.net  Follow Us on Twitter: https://twitter.com/study_cat ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET']",
}