{
"name" : "WordBit Tedesco (German for Italian)",
"url" : "https://play.google.com/store/apps/details?id=net.wordbit.deit",
"package" : "net.wordbit.deit",
"category" : "Education",
"description" : "Perch perdi sempre lopportunit di studiare tedesco? C un modo per migliorare la tua conoscenza del tedesco usando il tempo che non pensavi di avere! Semplicemente lutilizzo della lockscreen.  Come funziona? Quando controlli il tuo cellulare, la tua attenzione  concentrata sullo schermo. Sei libero da quello che stavi facendo e pronto a ricevere nuove informazioni. In quel preciso momento, WordBit utilizza la tua attenzione per qualche secondo per studiare tedesco.   WordBit Inglese  http://bit.ly/appinglese  WordBit Spagnolo  http://bit.ly/appspagnolo  WordBit Francese  http://bit.ly/appfrancese  Funzioni dellapplicazione  Metodo innovativo per imparare usando la schermata di blocco Quando controlli i messaggi, guardi YouTube o semplicemente controlli lora, puoi studiare una dozzina di parole e frasi al giorno! Tutto ci si accumuler fino a mille parole al mese e imparerai automaticamente e senza redertene conto.   Contenuto ottimizzato per la schermata di blocco WordBit fornisce contenuti fatti su misura per la schermata di blocco e dora in poi imparare richieder solo un istante. Non c alcun bisogno di smettere di fare quello che stavi facendo!   Esempi utili Con frasi desempio, puoi imparare come usare i vocaboli nella vita reale e con quali altre parole puoi usarli.    Categorie di vocaboli suddivise per livello Puoi studiare parole e frasi adatte al tuo livello. (Pi di 10.000 parole dal livello base al livello avanzato)   Contenuto aggiuntivo - Sinonimi - Antonimi - Nomi: articoli diversificati per colore, forme plurali - Aggettivi: forme comparative e superlative - Consigli di grammatica: verbi irregolari, articoli irregolari - radice, prefisso, suffisso  Contenuto ben organizzato e ricco  Frasi Puoi imparare anche frasi di uso comune.  Varie categorie di Idiomi, Proverbi, etc.  Immagini per i principianti  Pronuncia - Pronuncia automatica e visualizzazione degli accenti tonali.  Funzioni estremamente utili per lutente  Modalit quiz e nascosta  Funzione di Ripetizione Giornaliera  Puoi ripetere tutte le parole che vuoi per 24 ore.  Funzione di classificazione parole personalizzata Puoi controllare le parole imparate ed eliminarle dalla tua lista di studio.  Funzione di ricerca  16 diversi tema colore (tema scuri disponibili)  --------------------------------------------------------------  Contenuti che offriamo    Vocaboli (per principianti)   Numeri, Ore   Animali, Piante   Cibo   Relazioni   Altro     Vocaboli  Principiante   Intermedio   Intermedio (Avanzato)  Avanzato   Avanzato (Superiore)    Espressioni  Espressioni (Espressioni base)  Espressioni (Viaggiare)  Espressioni (Salute)  ----------------------------------------------- Privacy policy  http://bit.ly/policywb -----------------------------------------------  [Functionality Description]  (1) After you download and start the app, the learning mode would be automatically activated. - This app is designed for learning German automatically. Therefore, every time you turn on your phone the app would be activated and this enables you to learn English. (2) If you wish to temporarily deactivate the app from automatic study mode, you can do so by adjusting the [Settings} of the app.  (3) For certain smartphone OS (Huawei, Xiaomi, Oppo, etc.) the app could be automatically shut down. In this case, you can access and adjust your devices settings o solve the shutdown problem. If you have any further questions about how to use it, please feel free to contact us.  contact@wordbit.net Why do you always lose the opportunity to study German?   There is a way to improve your knowledge of German by using the time you didnt think you had! Simply use the lockscreen. How does it work? When you check your phone, your attention is focused on the screen. You are free from what you were doing and ready to receive new information. At that precise moment, WordBit uses your attention for a few seconds to study German.   English WordBit  http://bit.ly/appinglese  Spanish WordBit  http://bit.ly/appspagnolo Francese French WordBit  http://bit.ly/appfrancese  Application features   Innovative method to learn using the lock screen  When you check messages, watch YouTube or just check the time, you can study a dozen words and phrases a day! This will accumulate up to a thousand words a month and you will learn automatically and without realizing it.   Content optimized for the lock screen  WordBit provides content tailored to the lock screen and from now on, learning will take only a moment. There is no need to stop doing what you were doing!   Useful examples  With example sentences, you can learn how to use words in real life and what other words you can use them with.   Categories of words divided by level  You can study words and phrases suited to your level. (More than 10,000 words from the basic level to the advanced level)   Additional content  - Synonyms - Antonimi - Names: diversified articles by color, plural forms - Adjectives: comparative and superlative forms - Grammar tips: irregular verbs, irregular articles - root, prefix, suffix  Well organized and rich content   Sentences You can also learn common phrases.  Various categories of Idioms, Proverbs, etc.  Images for beginners  Pronunciation - Automatic pronunciation and display of tonal accents.  Extremely useful features for the user   Quiz and hidden mode  Daily Repeat Function You can repeat all the words you want for 24 hours.  Custom word classification function You can check the words learned and eliminate them from your study list.   Search function  16 different color themes (dark theme available)  -------------------------------------------------- ------------  Content we offer     Words (for beginners)   Numbers, Hours  Animals, Plants  Food  Relationships  Other    Words Iante Beginner  Intermediate  Intermediate (Advanced)  Advanced  Advanced (Superior)    Expressions  Expressions (Basic expressions)  Expressions (Travel)  Expressions (Health)  ----------------------------------------------- Privacy policy bit http://bit.ly/policywb -----------------------------------------------   [Functionality Description]  (1) The learning mode would be automatically activated. - This app is designed for learning German automatically. Therefore, every time you turn your phone to the app. (2) If you wish to temporarily deactivate the app, you can do so by adjusting the [Settings} of the app. (3) For certain smartphone OS (Huawei, Xiaomi, Oppo, etc.) the app could be automatically shut down. In this case, you can access and adjust your devices settings or solve the shutdown problem. If you have any further questions about how to use it, please feel free to contact us.  contact@wordbit.net ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}