{
"name" : "Learn And Master French Verbs Conjugation",
"url" : "https://play.google.com/store/apps/details?id=net.cogitas.frenchverbs",
"package" : "net.cogitas.frenchverbs",
"category" : "Education",
"description" : "Master French verb conjugation, in a fun and easy way! Learn And Master French Verbs Conjugation gives you a fun and easy way to train to learn verb endings.  Lets be honest, learning how to conjugate French verbs doesnt feel really exciting, and yet, until you do it, you dont feel fully confident in your French. With French Verbs Conjugation Master, you can train at your own pace. The training sessions are too short to be boring, and yet, they will help you learn French verb conjugation, whether you are a beginner, focusing on simple verbs in a few basic tenses, or an advanced French student, able to tackle irregular verbs in the least used tenses.   Features:  * more than 500 verbs!  * select how to learn to conjugate French verbs by choosing a training mode: multiple choice, type your answer in, or think about it in your head and then compare.  * choose your level reflecting your current knowledge of French verb conjugation: beginner, intermediate or advanced.  * train on all verbs for a specific level, or on your favourite verbs only, or on a specific verb  * touch a verb to view its full conjugation.  * train on 1 or more specific tenses or shuffle between all the tenses available for your level.  * view your last 10 sessions statistics so you can track your progress easily.   Note: The app displays ads. You can remove the ads in the app via an in-app purchase if you wish to.  Download Learn And Master French Verbs Conjugation for a fun and easy way to train on and master french verb conjugation!  If youre looking for a way to boost your French vocabulary in a fun way, check out our other app Crosswords To Learn French. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}