{
"name" : "Jigsaw Puzzles for Kids – Cosmic Shapes Kids Game",
"url" : "https://play.google.com/store/apps/details?id=net.pizzagames.physicshapes",
"package" : "net.pizzagames.physicshapes",
"category" : "Educational",
"description" : "Cosmic Shapes kids game is a puzzle game for kids and toddlers which will help them to enhance logical thinking and analytical thinking, as well as their memory.  It helps children improve their ability to handle puzzle shapes through a series of puzzles, in which they must change simple shapes and place them in right positions. Along the way, the app responds to each childs actions with positive guidance and motivation. Plus, the apps digital exploratory playground regularly refreshes with different objects, which keeps children interested and engaged.  Let your kids shape different types of objects, such as rockets, trucks, houses, airplanes, unicorns, dinosaurs, teddy bear and a lot of other interesting puzzle shapes for kids.   Main features:  Kid-friendly design - Cosmic Shapes features a special kid-friendly that compensates for the fact that when your young children hold a smartphone or tablet, they often have a finger touching the screen  The interactive game area never blocks or limits children, and lets them freely access puzzle shapes. The menu is also neatly hidden away.  Learning value - Developing kids memory through tasks where they have to show analytical and logical thinking. They are also learning shapes through the game.  It is available in 22 languages: English, French, Spanish, Portuguese, German, Italian, Greek, Dutch, Finnish, Norwegian, Swedish, Danish, Turkish, Russian, Korean, Japanese, Indonesian, Malay, Vietnamese, Thai, Traditional Chinese and Simplified Chinese.  Download the Cosmic Shapes! Your toddlers and preschoolers will love to play with our puzzle shapes!  -------------  More about us: E-mail: info@pizzagames.net Website: www.pizzagames.net Facebook: www.facebook.com/pizzagamesnet ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}