{
"name" : "WordBit Hebreo (para hispanohablantes)",
"url" : "https://play.google.com/store/apps/details?id=net.wordbit.hees",
"package" : "net.wordbit.hees",
"category" : "Education",
"description" : " WordBit Ingls  http://bit.ly/wordbitingles  WordBit Francs  http://bit.ly/appfrances  WordBit Italiano  http://bit.ly/appitaliano  WordBit rabe  http://bit.ly/apparabe  WordBit Coreano  http://bit.ly/appcoreano  Por qu constantemente pierdes la oportunidad de estudiar hebreo ? Hay una manera de aumentar tu dominio del hebreo usando el tiempo que no saba que tenas! Cul es el principio? Solo es usar la pantalla de bloqueo. Cmo funciona esto? En el momento en que revisas tu telfono celular, tu atencin se centra en la pantalla. Ests libre de lo que acabas de hacer y ests listo para recibir nueva informacin. En este mismo momento, WordBit usa tu atencin por un corto perodo para estudiar hebreo .  Caractersticas de esta aplicacin  Mtodo innovador de aprendizaje mediante pantalla de bloqueo. Cuando revises los mensajes, veas YouTube o simplemente veas la hora, puedes estudiar docenas de palabras y oraciones al da! Esto se acumular a ms de mil palabras por mes, y aprenders de forma automtica e inconsciente.   Contenido optimizado para la pantalla de bloqueo WordBit proporciona contenido en un tamao perfecto y adecuado para la pantalla de bloqueo y a partir de ahora el aprendizaje slo tomar un instante. As que no hay necesidad de dejar de hacer tus cosas!   Ejemplos tiles Con los ejemplos, puedes aprender cmo se usan las palabras en la vida real y con qu se usan.   Categoras de vocabulario ordenadas por nivel Puedes estudiar palabras y frases segn tu nivel. (Ms de 10.000 palabras de bsico a avanzado)   Contenido adicional - Sustantivos : Los artculos se distinguen por color, formas plurales - Verbos: se proporciona la versin corta y larga de las tablas de conjugacin - Adjectives: formas comparativas, superlativas - tips de gramtica : verbos irregulares, artculos irregulares raz, prefijo, sufijo  Bien organizado, rico contenido  Oraciones Tambin puedes aprender las oraciones de uso comn. Varias categoras de modismos, Proverbios, etc.  imgenes para principiantes  Pronunciacin - Pronunciacin automtica y visualizacin de las marcas de acento.  Caractersticas extremadamente tiles para los usuarios  Quiz, modo portada  Funcin repeticin diaria Puedes repetir tantas palabras como desees durante 24 horas.  Funcin de clasificacin de palabras personalizada Puedes comprobar las palabras aprendidas y eliminarlas de tu lista de estudio..  Funcin de bsqueda 16 temas de color diferentes (temas oscuros disponibles)  Contenido que ofrecemos    Vocabulario (para principiantes) con imgenes Nmeros,Fechas,Horas Animales,Plantas Comida Relaciones Otros   Vocabulario (por nivel) A1 (Bsico 1) A2 (Bsico 2) B1 (Intermedio 1) B2 (Intermedio 2) C1 (Avanzado 1) C2 (Avanzado 2)   Expresiones Expresiones Bsicas Expresiones Viaje Expresiones Salud ---------------------------------------- (  Next : Curso de hebreo , gramtica hebreo )  Es una App genial porque aprendes palabras nuevas y practicas la pronunciacin a cada momento que desbloqueas tu pantalla. Aprendes cada vez que abres tu telfono. La forma ms inconsciente de aprender eficazmente.  English WordBit  http://bit.ly/wordbitingles  French WordBit  http://bit.ly/appfrances  WordBit Italiano  http://bit.ly/appitaliano  Arabic WordBit  http://bit.ly/apparabe  Korean WordBit  http://bit.ly/appcoreano  Why do you constantly lose the opportunity to study Hebrew? There is a way to increase your command of Hebrew by using the time I didnt know you had! What is the beginning? It is just using the lock screen. How does this work? The moment you check your cell phone, your focus is on the screen. You are free from what you just did and are ready to receive new information. Right now, WordBit uses your attention for a short period to study Hebrew.  Features of this application   Innovative method of learning via lock screen.  When you check the messages, watch YouTube or just watch the time, you can study dozens of words and sentences a day! This will accumulate to more than a thousand words per month, and you will learn automatically and unconsciously.   Content optimized for the lock screen  WordBit provides content in a perfect size and suitable for the lock screen and from now on learning will only take a moment. So there is no need to stop doing your things!   Useful examples  With the examples, you can learn how words are used in real life and how they are used.   Vocabulary categories sorted by level  You can study words and phrases according to your level. (More than 10,000 words from basic to advanced)   Additional content  - Nouns: Items are distinguished by color, plural forms - Verbs: the short and long version of the conjugation tables is provided - Adjectives: comparative, superlative forms - grammar tips: irregular verbs, irregular articles root prefix suffix  Well organized, rich content   Prayers You can also learn commonly used sentences.  Various categories of idioms, Proverbs, etc.  images for beginners  Pronunciation - Automatic pronunciation and display of accent marks.  Extremely useful features for users   Quiz, cover mode  Daily repeat function You can repeat as many words as you want for 24 hours.  Custom word classification function You can check the learned words and remove them from your study list.  Search function  16 different color themes (dark themes available)  Content we offer     Vocabulary (for beginners) with images Numbers, Dates, Hours  Animals, Plants  Food Relationships Other    Vocabulary (by level) A1 (Basic 1) A2 (Basic 2) B1 (Intermediate 1) B2 (Intermediate 2) C1 (Advanced 1) C2 (Advanced 2)    Expressions  Basic Expressions  Trip expressions  Health expressions ---------------------------------------- ( Next: Hebrew course, Hebrew grammar)  Its a great App because you learn new words and practice pronunciation every time you unlock your screen.   You learn every time you open your phone. The most unconscious way to learn effectively.  ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.DISABLE_KEYGUARD', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SYSTEM_OVERLAY_WINDOW', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}