{
"name" : "Learn to Read & Save Animals, English Phonics ABC",
"url" : "https://play.google.com/store/apps/details?id=net.cleverbit.LearnToRead",
"package" : "net.cleverbit.LearnToRead",
"category" : "Education",
"description" : "Learn to Read & Save the Animals  is an educational Montessori game for kids created for preschoolers from 4 to 7 years old and junior school children of the 1st, 2nd and 3rd grades, who learn English. It can be used for pre-school education and teaching how to read in English in kindergarten.  The evil Snow Queen has frozen the letters of the English alphabet and the poor animals were taken into the icy captivity. Only your smart kid can save the animals. In order to do that your child has to learn English letters and combine them into words, which represent the names of the captured animals.   Its not a big secret that many kids can face difficulties learning to read in English, because English letters in real words have different pronunciation rules in comparison with their sounds in the English alphabet.   Learn to Read & Save the Animals educational game offers efficient Phonics techniques in order to learn how to read in English. During the process of playing the educational game the children will hear the sound of each English letter in exactly the same way as its pronounced in the shown word.   It allows your child to understand the rules of English word reading on the subconscious level. Kid will simply feel how to pronounce the English words, without suffering and trying to find the transcription of the word in thick English dictionaries.  WHAT YOUR CHILD WILL LEARN  We are not going to learn the English alphabet; we will teach your kids how to read in English!  Learn English ABC letters easily  Discover the names of the animals in English  Kid will learn how to read in English, reinforcing newly obtained reading skills during enthralling guessing games and quizzes   Educational Montessori game for kids of 3 years old and higher  Pre-school education, learning how to read in English using highly efficient Phonics  Learning game for preschoolers, as well as of pupils who learn English for the students of the 1st, the 2nd and the 3rd grades or even of kindergarten kids. The interface of educational Montessori game is so simple that even a 3 year old kid can play and learn how to read English by themselves!  Learn to Read & Save the Animals game offers 3 educational levels free of charge. The full version contains the total of 16 educational levels allocated by the level of complexity. Words of the very first level contain just 2 or letters, while the words of the last level may have up to 7 or even 8 letters. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}