{
"name" : "General Knowledge Quiz : World GK Quiz App",
"url" : "https://play.google.com/store/apps/details?id=nithra.quiz",
"package" : "nithra.quiz",
"category" : "Education",
"description" : "Knowledge is Power. Power excels you to this world.  This General Knowledge Quiz: World GK Quiz App helps you to do the same. This free gk quiz app or quiz of knowledge app improves ones general knowledge about India as well as the world.  This general knowledge app helps you to be sharp-witted in gk and to be fast in world gk learning, in order to be successful in this competitive world.  This quiz app helps you to do the same. You may avail much general knowledge but this gk apps helps you to improve your general knowledge easily and fastly.  This user-friendly quiz helps you to answer all gk questions, as the GK quiz answers are given directly.  If you want to be a brilliant person in the general knowledge quiz, you can go for the practice section of this gk quiz in English app which helps you to practice each question with four options which makes your brain acute.  The main reasons why g.k questions and answers is important in the lives of people are: This gk made easy app to make conversations easier with others and helps you to develop better decision-making skills.  This general knowledge app not only helps you to enhance your personality but also it helps you to get more marks in school, college and in competitive examinations.  This gk games contain a variety of questions based on various topics like India general knowledge, World general knowledge, India static current affairs and from various topics like Agriculture, History, Geography etc,  Features of this knowledge app:  This g.k quiz app contains 30+ streams of general knowledge questions  A wide range of general knowledge questions to test your knowledge around the world  You can take the test freely to refresh your gk via this gk questions and answers  You can attend the Quiz in the form of online test, test and daily gk test to improve your knowledge  You can practice quiz questions and answers in offline mode  In this question answer app, you can share each gk questions with your friends   You can download quize app at free of cost  You can share this General Knowledge app with your friends via social media  You can play this gk test app in offline mode  This kids quiz app is a completely free app  This gk quiz app has a user-friendly interface  GK questions covered in this kids gk app are:   Agriculture Quiz  Animals Quiz  Books and Authors Quiz  Capitals and Countries Quiz  Chemistry Quiz  Computer Knowledge Quiz  Electrical Quiz  Environment Quiz  First In World Quiz  Food and Drinks Quiz  General Awareness  General Knowledge  General Questions  General knowledge Quiz  World Geography  Historical Places  Invention and Inventors Quiz  National Symbol  Personalities Quiz  Physical Education Quiz  Physics Quiz  Plants Quiz  General Science Quiz  Sports And Games  Cups And Trophies  Technical General Knowledge  Trade and Industry Quiz  Historic Personalities  Historical Places  National Animals  National Birds  National Emblem and flag  National Flowers and Trees  World Organisation  World General Knowledge Quiz  World Economy  Practicing with this huge collection of basic gk in this quiz apps helps you to crack the competitive exams easily.  You can avail this gk quiz and awareness app anywhere, anytime for free. Our future updates are separate categories for English and Hindi gk quiz for India, and many more GK Bank and GK questions categories. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}