{
"name" : "Content Box",
"url" : "https://play.google.com/store/apps/details?id=online.meghshala.box",
"package" : "online.meghshala.box",
"category" : "Education",
"description" : "This is the version for installation on set-top boxes and similar single purpose devices. Please install https://play.google.com/store/apps/details?id=online.meghshala.app on regular phones and tablets.  Meghshala empowers teachers to be instructional leaders in the classroom. The app turns classrooms into fun and engaging learning spaces by improving teachers instruction skills, and students critical thinking capabilities.   This app contains exemplary multimedia lessons designed by educational experts. Meghshala lessons contextualize world class pedagogy into everyday classroom teaching. These lessons contain images, videos, activities, and strategies to convert the classroom into an active learning space. These lessons also provide detailed teaching instructions/ideas for the teachers to effectively execute these lessons in class.   Features: Subjects: Math, Science, English, and Social Studies. Grades: 1-8. Languages: English, Kannada, Hindi and more languages coming soon. Offline mode: download a lesson once, and use it any number of times. Contact content@meghshala.online for more assistance.   Detailed Description:  This app contains multimedia lessons that are divided into two primary components- student slides and teacher instructions. The student slides are what appear on the screen for the entire class. They include the necessary text, images, videos, and questions that students need to directly engage with. However, there are also additional teacher instruction (TIs) slides that are visible only to teachers, which will provide the detailed support to implement the lesson. This includes suggestions on how to conduct each part of the lesson, the rationale for certain pedagogic practices, and additional information that could be used by the teacher to enhance the lesson further. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
}