{
"name" : "Learn English with Antura",
"url" : "https://play.google.com/store/apps/details?id=org.antura.learn.english",
"package" : "org.antura.learn.english",
"category" : "Educational",
"description" : "Learn English with Antura offers an introduction to English as a second language, aimed mainly at girls and boys between 5 and 8 years old.  Throughout the game, children learn the entire English alphabet, more than 250 words and a series of phrases and simple expressions in a playful way. The game is organized in 6 worlds different, each world includes between 15 and 20 teaching units, each with a specific pedagogical objective that is learned thanks to a series of mini-games and concludes with a final test to reinforce learning. To overcome the different mini-games you will have to associate words, images and sounds so that the learning and the progress in the game go hand in hand.  GOALS Our main objective will be to familiarize girls and boys with a basic English vocabulary and with the loudness of English at a level equivalent to PreA1; all this with great attention to the spoken part, that becomes a constant element in the whole game. The chosen vocabulary consists of more than 250 words organized in thematic groups as well as various expressions and phrases that will help us to introduce syntactic and grammatical questions that, although they are outside the workable explicit contents, appear in a transversal way with the objective of educating the ear. For the selection of this vocabulary, the use of nearby and everyday objects has been taken into account next to the phonetic component so that we have all the phonemes represented in it. The game can be used within both academic and informal contexts, serving as a teaching support tool and a playful approach to learning English as a second language.  METHODOLOGY Learn English with Antura bases its pedagogical model on meaningful learning through a playful learning environment reinforced by a reward system. It complements learning models based on the communicative approach and oral communication with game systems that favor Stealth Learning, a method that allows children to focus on the game and challenges that this entails, without really having to make an effort to learn or memorize concepts. The game introduces the new concepts without any theoretical explanation, simply proposes a challenge and guides the child who plays in the first steps so that she/he can move forward alone, creating their own mental model of knowledge. Each time the player interacts with a letter or a word, the game pronounces it the right way, reinforcing the learning. The content has been organized around the learning of words through pictograms, phrases and their written forms so that they are related in a triangular way giving rise to inferences and deductions that serve to organize the proposed vocabulary through its use in the various game mechanics.In addition, the game offers rewards in the form of biscuits that can be used to acquire aesthetic accessories to customize Antura the dog, who will be our adventure partner through the game. In this way we add an additional motivation to complete the different levels properly and to use the application frequently.  PEDAGOGICAL TOUR The game is composed of 6 different worlds that we will travel playing the different teaching units and tests. Each of the worlds includes several groups of words, in each one we will work around 50 words organized in groups of between 8 and 12. We begin with an introductory world in which you will become familiar with English phonetics through the alphabet and where we will see the first words of the vocabulary that will be added transversely to the rest of the worlds. The different worlds are as follows: 1. Alphabet 2. Nature and animals 3. Home, objects and clothes 4. Places of the city and family 5. Body parts and food 6. Colors, numbers and calendar  Based on the Award-winning game Antura and the Letters ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}