{
"name" : "Mock Practice Tests NEET AIIMS JEE CBSE Classes",
"url" : "https://play.google.com/store/apps/details?id=org.moducation.moducation",
"package" : "org.moducation.moducation",
"category" : "Education",
"description" : "Moducation is best learning App for Mock Tests for NEET AIIMS JEE Main JEE Advanced CBSE Board Classes offering Free Last 10 Years solved Papers.  Moducation provides best JEE Main, JEE Advanced / IITJEE, NEET (AIPMT), AIIMS, CBSE Board, Engineering and Medical Entrance Examinations Online Preparation Mock Practice Test Papers and online test series.  This is best Android App for 2019 and 2020 Aspirants.. Learn and practice for JEE Main, JEE Advanced / IITJEE, NEET (AIPMT), AIIMS, CBSE Board, Engineering and Medical Entrance Examinations with Moducation app, generate Self Analysis Reports, Efficiency Reports and enjoy your preparation - anywhere, anytime. The progress reports make it more helpful compared to Aakash Test series and Allen Test Series which help students get extramarks in their tests.  Practice Sheets and Periodic Tests are generated by associated Coaching institutes for IIT admission guidance & schools and will be available to students who are studying at our partner coaching institutes and schools only.  Moducation services: JEE Main Video Lectures by Exam Fear and by IITPAL, JEE Main Correspondence Course Material, JEE Main Smart Revision (Crash) Course (having Physics / Chemistry / Maths important formulae and concepts), JEE Main CBSE Text Books, JEE Main Online Doubt Discussion, JEE Main Test Papers, JEE Main Chapter Practice Tests, JEE Main Part Syllabus Papers, JEE Main AITS (Mock Full Test Papers), JEE Main Previous Years Papers, JEE Main online test series, JEE Main Self Analysis Reports & Efficiency Reports with Attempt History and records of Submitted Exams.  Free NEET Video Lectures by Exam Fear and by IITPAL, NEET Correspondence Course Material, NEET Smart Revision Notes in Physics / Chemistry / Biology concepts), CBSE NCERT Text Books, NEET Online Doubt Discussion, NEET Practice Test Papers, NEET Chapter Practice Tests, Part Syllabus Papers, NEET AITS (Mock Full Test Papers), NEET Previous Years Papers, NEET online Test Series, NEET Self Analysis and Efficiency reports with Attempt History and Submitted Exam History. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'org.moducation.moducation.permission.C2D_MESSAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}