{
"name" : "Brilliant",
"url" : "https://play.google.com/store/apps/details?id=org.brilliant.android",
"package" : "org.brilliant.android",
"category" : "Education",
"description" : "**Featured in The Atlantic, The New York Times, NPR, and more.** Brilliant creates inspiring, interactive learning experiences for ages 10 through 110. Award-winning teachers, researchers, and professionals illuminate the soul of math, science, and computer science through fun, bite-sized problem solving explorations.  Whether you want to hone your quantitative skills, improve your knowledge of science and technology, be a smarter parent for your inquisitive kid, or simply stay sharp, Brilliant helps you grow as a curious and ambitious person.  Brilliants entertaining and educational course library is great for beginners, but also includes intermediate and advanced topics for professionals and lifelong learners.  Join over 10 million problem solvers on Brilliant, and...  1. FINISH YOUR DAY A LITTLE BIT SMARTER Brilliant provokes your natural curiosity and guides you through an interactive exploration of concepts and principles. Learn in an informal way that fits into your busy life.  2. BECOME A BETTER PROBLEM SOLVER Brilliants approach to learning is active, not passive. Through active problem solving, Brilliant helps you build your quantitative intuition. Learn frameworks for thinking and solving challenging problems, instead of memorizing formulas.  3. ENJOY NEW CHALLENGES EVERY WEEK With free, curated weekly problems, you can gain timeless knowledge and flex applied problem solving skills in bite-sized sessions. Stay fresh and discuss your favorite solutions with an engaged community of lifelong learners.  Brilliant requires Android version 4.1+. Send feedback to android@brilliant.org.  VISIT US: https://brilliant.org LIKE US: https://facebook.com/brilliantorg FOLLOW US: https://twitter.com/brilliantorg ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}