{
"name" : "OCTAID",
"url" : "https://play.google.com/store/apps/details?id=org.mountsinai.octaid",
"package" : "org.mountsinai.octaid",
"category" : "Education",
"description" : "The OCT App is an educational tool which has been developed as a means to teach intra-coronary optical coherence tomography (OCT) with the goal of making it easy to understand for physicians all over the world.  There is rising interest among interventional cardiologists to learn OCT given its ability to help with image analysis, determination of plaque characteristics, visualization of intra-coronary pathology and stent optimization.  Mount Sinai Heart is a global leader within the field of interventional cardiology; the myriad of cases and pathology which are seen in The Mount Sinai Cardiac Catheterization Laboratory make it the perfect center to educate medical professionals within this field.  The OCTAID app will teach the principles of intra-coronary imaging and the technique of how to perform and understand OCT pullback images. Users will also come away with an increased confidence in how to interpret various notable and commonly seen examples with labeled images and explanations. Finally, there is a link to an interactive portal where users can test their knowledge of the material with still images and pullback videos.  This mobile application can be used on-the-go all over the world and it gives medical professionals globally exposure and access to cutting edge technology they may not be able to receive otherwise. As the field of intra-coronary imaging expands, so too will the use of optical coherence tomography. There is a need for a means to educate medical professionals on how to perform and interpret OCT and this app meets those needs for a global audience. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}