{
"name" : "Nature Cat's Great Outdoors",
"url" : "https://play.google.com/store/apps/details?id=org.pbskids.naturecatsgreatoutdoors",
"package" : "org.pbskids.naturecatsgreatoutdoors",
"category" : "Education",
"description" : "**NEW IN VERSION 2.0.0**  100 DAILY NATURE ADVENTURES - Whether rain or shine, at home or on the go, nature adventures for any kind of day! 0000 / 4000  100 MORE STICKERS ADDED - Now earn even more stickers as you complete Nature Adventures!  PHOTOBOMB FEATURE - Take pictures and selfies with Nature Cat and his friends!  BADGES - Unlock Nature Badges for your Nature Explorer sash as you complete Nature Adventures!  Based on the hit PBS KIDS show, Nature Cats Great Outdoors is the on-the-go toolset that will inspire your child to explore nature  in the backyard, at a local park or even looking out the window. Every day, Nature Cat has a set of new daily adventures that lets kids use tools to record and share their observations in fun, creative ways!  DAILY NATURE ADVENTURES  100+ adventure prompts given daily to get kids using tools, thinking about nature and recording their observations  Filter by rain, snow, sun, and indoor to play any time  Daily Nature Adventures are saved in a special journal so kids can go and revisit what they have explored  NATURE TOOLS  Take photos and selfies with Daisys camera  Record sounds with Hal and his microphone  Use journal art tools to insert photos, sounds, stickers in addition to drawing, stamping, and painting  Create an endless amount of journals filled with your own nature adventures  REWARDS Earn achievement badges for your Nature Explorer sash the more Daily Adventures you complete. Unlock over 100 stickers as Daily Nature Adventures are completed to use in your journal.  Onward and yonward!  ABOUT NATURE CAT Nature Cats Great Outdoors app is based on the Emmy-nominated PBS KIDS series Nature Cat, co-produced by Spiffy Pictures and WTTW Chicago, designed to extend the series science curriculum.  Watch Nature Cat anytime on the PBS KIDS Video App and find more games and activities at pbskids.org/naturecat  ABOUT PBS KIDS Nature Cats Great Outdoors is part of PBS KIDS ongoing commitment to helping kids build the skills they need to succeed in school and in life. PBS KIDS, the number one educational media brand for kids, offers children ages 2-8 the opportunity to explore new ideas and new worlds through television, digital media and community-based programs. PBS KIDS and local stations across the country support the entire ecosystem in which children learn, including their teachers, parents and community. For more apps from PBS KIDS, visit pbskids.org/apps.  PRIVACY Across all media platforms, PBS KIDS is committed to creating a safe and secure environment for children and families and being transparent about what information is collected from users. To learn more about PBS KIDS privacy policy, visit pbskids.org/privacy. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO']",
}