{
"name" : "CadaEstudiante",
"url" : "https://play.google.com/store/apps/details?id=org.cru.everystudent.cadaestudiante",
"package" : "org.cru.everystudent.cadaestudiante",
"category" : "Education",
"description" : "Artculos y vdeos cortos en temas como  - 6 razones para saber que Dios existe. - Responde Dios las oraciones? - Relaciones, sexo, intimidad. - En qu exactamente puedes contar con Dios? - Cmo encontrar el propsito de tu vida.   Del sitio popular, CadaEstudiante.com. Todos los artculos y series especiales son independientes y se encuentran en la app. No se necesita wifi. Fcil de compartir con otros.  Lo que las personas han dicho...  La evidencia que tu das de la existencia de Dios fue suficiente para convencer a este ateo de 33 aos de edad; No es un desafo fcil!  Esto ha sido una experiencia que cambia la vida. Llegu a conocer el amor de Dios. No tengo palabras para explicar la alegra que estoy experimentando hoy.  Realmente estoy disfrutando tu serie especial. Despus de recibir cada una, no puedo esperar para recibir la siguiente. Son tan reales. Nunca me di cuenta de que los cristianos podran ser tan geniales.  No puedo expresar lo agradecido que estoy de tropezar con esto. Tantas preguntas que tena ahora son aclaradas. Todo esto me ha ayudado mucho.  T me has llevado de una completa negacin de la existencia de Dios a no solo creer en l, sino saber que l est all.  Despus de muchos aos de preguntas sobre / y si creo, ahora tengo una verdadera relacin con Dios. Gracias por todo esto.  Descarga Cada Estudiante ahora. Mira razones lgicas sobre Dios. Experimenta una vida ms significativa.   Preguntas / comentarios sobre la app: support@everystudent.com Articles and short videos on topics such as ... - 6 reasons to know that God exists. - Does God the prayers? - Relationships, sex, intimacy. - What exactly can you tell God? - How to find the purpose of your life.  The popular site, CadaEstudiante.com . All articles and special series are independent and are in the app. No wifi is needed. Easy to share with others.  What people have said ...  The evidence you give of Gods existence was enough to convince this atheist 33 years old, Its not an easy challenge!  This has been a life changing experience. I got to know the love of God. I have no words to explain the joy I am experiencing today.  Im really enjoying your special series. After receiving each, I can not wait to receive the next. Theyre so real. I never realized that Christians could be so great.  I can not express how grateful I am tripping over this. So many questions I had are now cleared. All this has helped me a lot.  You have led me to a complete denial of the existence of God not only to believe in Him, but know that He is there.  After many years of questions about / and if I think now I have a real relationship with God. Thank you for all this.  Download Each student now. Look logical reasons about God. Experience a more meaningful life.  Questions / comments about the app: support@everystudent.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}