{
"name" : "FAO-SHARP",
"url" : "https://play.google.com/store/apps/details?id=org.fao.sharp",
"package" : "org.fao.sharp",
"category" : "Education",
"description" : "Self-evaluation and Holistic Assessment of climate Resilience of farmers and Pastoralists (SHARP). This is a Food and Agriculture Organization (FAO)-developed tool that helps farmers and pastoralists self-assess and prioritize resilience aspects of their livelihoods in a participatory manner. The survey is both paper and tablet based and assesses the resilience of farmers and pastoralists to climate change organized into governance, environmental, social, economic and agricultural practices using a combination of self-assessment and academic review of livelihood components. There are 54 questions in total of which 26 are mandatory to fully assess resilience. SHARP can be used both as a monitoring and evaluation tool, as well as a learning method integrated into agropastoral/ farmer field schools training curricula. The tool provides immediate results (offline) on the tablets in the field and offers the possibility to analyse results online in more detail. Data can be disaggregated based on gender, production practice type, age group; comparisons can be made across households, within communities, regions and countries.  The tool was developed starting in mid 2013 by FAO and partners and has been tested or piloted in 8 sub-Saharan African countries (Angola, Burkina Faso, Mali, Senegal, South Sudan, Uganda, Zambia, Zimbabwe). The tool scores and ranks priority areas for action through a peer reviewed scoring system developed through testing and an e-discussion with experts. The tool is also being used to assist and encourage community dialogue by providing more information to communities and to better prioritize actions that can improve climate resilience. More information can be found at: http://www.fao.org/in-action/sharp/ ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE']",
}