{
"name" : "Vachanamrut Study App",
"url" : "https://play.google.com/store/apps/details?id=org.baps.vachanamrut",
"package" : "org.baps.vachanamrut",
"category" : "Education",
"description" : "The Vachanamrut Study App by BAPS Swaminarayan Sanstha  The Vachanamrut is a principle scripture of Swaminarayan Sampraday that introduces Bhagwan Swaminarayans novel Vedantic philosophy of Akshar-Purushottam Darshanam. It is a compilation of 273 spiritual discourses delivered by Bhagwan Swaminarayan from 1819 to 1829. It is a Hindu scripture filled with illuminating analogies and metaphors, and divine revelations that provide philosophical and practical answers to the deepest mysteries and questions of life. With the inspiration and guidance of Brahmswarup Pramukh Swami Maharaj and Pragat Brahmswarup Mahant Swami Maharaj as well as the tireless efforts of the learned sadhus and experienced volunteers of BAPS, the Vachanamrut is being made available in app format  delivering the same spiritual wisdom in a modern, accessible medium. Through short-and-simple definitions and easy-to-understand explanations, this app provides a study platform for spiritual seekers looking to better understand the subtleties of eternal knowledge and apply the teachings of Bhagwan Swaminarayan to their lives. Utilising current technology, this app meets the needs of todays spiritual generation by giving them access to ancient wisdom in a modern format  making the study of the Vachanamrut a truly enjoyable experience.  The Vachanamrut Study App contains easy-to-use features such as:  - Simple definitions of regional, scriptural and philosophical words. - Clear and structured explanations of complex concepts with scriptural references and the words of the Gunatit Guru Parampara  - Compilation of quotations by Bhagwan Swaminarayan and the Guru Parampara to enhance the theoretical and practical interpretations of subtle concepts - Interesting introductions to various people, places and scriptures - Historical accounts, Prasangs, Explanations, Glory and Summaries related to the Vachanamrut - References and meanings of shloks as well as kirtans mentioned in the Vachanamrut  - New look and feel - English translations of History, Prasangs, Explanations, Glory and Summary to complement the Gujarati text - Access the Vachanamrut that you last visited from the Home Page - Auto-rotate view available to ease your reading - Audio feature to enhance the reading experience - Subject-wise reading options - Bookmark function to access the marked position in the Vachanamrut directly from the Home Page - Tapping on the Read button will automatically take you to the next Vachanamrut without having to swipe. This can be enabled from within settings - View the history of all the Vachanamruts you have visited - Back-up and restore the app ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'org.baps.vachanamrut.permission.C2D_MESSAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.GET_TASKS', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}