{
"name" : "Madar Al-Huruf",
"url" : "https://play.google.com/store/apps/details?id=org.qfi.madar",
"package" : "org.qfi.madar",
"category" : "Education",
"description" : "Madar Al-Huruf means wheel of letters in Arabic. The wheel is a valuable, open, and free language tool that introduces users to the Arabic alphabet. Anyone who is unfamiliar with the Arabic alphabet can write his/her name by matching English letters and sounds to their Arabic phonetic counterparts.   The app includes sounds to hear the spoken letters so beginners are able to hear and sound out the Arabic alphabet and allows the user to customize and share their name in Arabic as a digital sticker online through social media. An updated interface includes an option for both novice and experienced users who can either be guided step-by-step as they write their name in Arabic or taken directly to animated wheel where they can spin and select the Arabic characters that match their English name.  The first version of the app was developed through a partnership with Qatar Foundation International and Qatar Computing Research Institute (QCRI), based off a physical version of the wheel created and designed by Moneera Al-Badi.  QFI is a US-based member of Qatar Foundation whose mission is dedicated to connecting cultures and advancing global citizenship through education. QCRI is a nonprofit multidisciplinary computing research institute founded by the Qatar Foundation.  The current version of the app was developed in partnership with MindGrub Technologies, LLC, an award-winning US-based technology innovation agency. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}