{
"name" : "StudyByTech",
"url" : "https://play.google.com/store/apps/details?id=org.paraggupta.studybytech",
"package" : "org.paraggupta.studybytech",
"category" : "Education",
"description" : "Best App to Study for CA Exams.  StudyByTech- Blend of Experienced Teachers, Best Videos and Excellent Study Material.  As experienced by CA teachers, CA students used to face many obstacles while preparing for their CA exams like Travelling long to pursue classes from the best faculty, weather hinderances, untimed traffic jams, some health issues, and unavoidable parties. So to overcome these problems, we designed an app which works according to student and for their welfare, because we understand your needs. Features- 1. CA Lectures- We provide updated CA videos, which aims to cover CA Exams as a whole. 2. One to one discussion on queries- Any query by students enrolled in the CA course can be discussed directly by the Faculty, or with peer friends inside the app under DISCUSSION FORUM. This gives CA students a feel of individual coaching. 3. Notifications- Regular updates are provided in the app, so that every CA student enrolled with us is updated in every aspects. 4. Player- Our player has many facilities which really make the CA studies much easier, like- fast forward button, change of bitrate button while playing classes when your internet quality is not good, resume from last played. 5. Tracking of classes- We track your classes according to no. of hours the classes played on the player. So if you watch a class just for 10 minutes and then resume the class the next day, then also your only 10 minutes are deducted from your account, as compared to tracking according to no. of views where, in the said case, the no of views would be 2. 6. To reduce the Mobile data usage- We have also provided option of offline download & SD card option for those who do not have enough mobile data. So that CA students can download the classes and watch them anywhere and at anytime, with just 30-40 seconds of being online. 7. Course Progress- You can check the course progress, percentage of course done and total hours utilized anytime within the course, so that you can plan your CA exam preparations properly. 8. Add Notes- This feature is very useful for revision during exams. 9. 20% extra hours provided- to the students so that CA students will get extra time for the revision and also technical hindrances do not come in their way of studies.   Our Efforts shown up in previous years results-  Nov 18 Exams- We are proud to say that, Top scorers for CA Final Costing & AIR 3, AIR 6, AIR 10 and many more, are our students for Nov 18 CA Final exams.  May 18 Exams- Despite of such unusual result in CA Final(only 139 passed the New Course May 2018), our student got 4th Rank, as well as highest marks in Costing all over India was also our student.   Download and talk to us to know more. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.MANAGE_ACCOUNTS', 'android.permissionadb.READ_PHONE_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permissionadb.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.GET_ACCOUNTS']",
}