{
"name" : "Word Fairy's Adventures",
"url" : "https://play.google.com/store/apps/details?id=org.regentropfen.lfwordpuzzle",
"package" : "org.regentropfen.lfwordpuzzle",
"category" : "Educational",
"description" : "Includes:   In Letter World, all words are broken down into small parts! Help Word Fairy to collect them all and reassemble them. Her friend the dragon can help you. But only if you find him and feed him with magic stars. Word Fairys Adventures is a game adapted to kids learning to read and speak but learners of all ages can enjoy it and have fun while learning intuitively and independently.  Can learning to read be as easy and exciting as playing a computer game? Weve developed a game with which you can learn to read intuitively and individually, as you would play a game. We believe that a learning game has to be so good that it would encourage you to play it even though you might not be interested in its pedagogical content. Weve done our best to implement this idea in our game. In doing so, we incorporate psycho-pedagogical foundations and concepts from the Montessori method, improve upon such tools as phonetic charts and present the syllables as they are actually spoken and not as they would be if spoken separately. Our emphasis is not on learning to recite the alphabet or spelling out words; on the contrary, instead of learning the ABC off by heart, the pupil learns which sounds actually occur in each word. As such, double vowels, for instance, are never separated. Should you have any further questions about our pedagogical method or about the game itself, please feel free to contact us at (in English or German): info@regentropfen.org   The game is adapted for children aged 4 to 8, regardless of whether the pupil goes to school, kindergarten, pre-school or primary school. Children in higher grade may also profit from the game in case of various reading and/or spelling difficulties such as dyslexia. You can also use the game to learn some basics of foreign languages, regardless of your age: thanks to the audio clips, you can discover learn the pronunciation of the individual phonemes in each word. You hence not only learn a translation of the word, but have a native speaker show you the meaning and the spelling of each word. Of course, this is not meant to be a complete linguistic pedagogical environment: the words offered are all nouns and there are as of yet no adjectives, verbs and no punctuation. Learning the language is based here on a challenging speaking vocabulary trainer. This app however can be used as an interactive introduction to the acquisition of speaking skills for individual words. The game does not contain a dictionary and is not split up in individual lessons, but rather in levels with various themes such as pirates, animals or vehicles. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
}