{
"name" : "Habla Polaco",
"url" : "https://play.google.com/store/apps/details?id=pl.tweeba.espplconv",
"package" : "pl.tweeba.espplconv",
"category" : "Education",
"description" : "Habla Polaco son conversaciones en la lengua polaca. Aprende polaco ms fcil!  Si viajas a Polonia o tienes amigos polacos y quieres hablar polaco, descrgate nuestra app Habla Polaco. Tiene muchas opciones para cada estudiante y puede ser utilizado en todos tipos del aprendizaje. Habla Polaco puede ser tu diccionario de polaco y ayuda durante charlas durante viajes a Polonia.  Algunos temas son: - amigos, familia - viajes y descanso - dinero, banco - nmeros, fechas, tiempo - salud, cuerpo - comida, cocina, compras - muchas palabras muy til y necesarias en polaco  Ms nuestras aplicaciones para la educacin y el aprendizaje de lenguas extranjeras en http://www.edumobi.org  Te gusta esta app? Dale una buena nota en este mercado de apps! Polish talks are talks in the Polish language. Learn Polish easier!  If you travel to Poland or have Polish friends and want to speak Polish, download our app speaks Polish. It has many options for each student and can be used in all types of learning. Speaks Polish can be your dictionary Polish and help during talks during trips to Poland.  Some topics are: - Friends, family - Travel & Leisure - Money, bank - Numbers, dates, time - Health, body - Food, cooking, shopping - Many very useful and necessary words in Polish  More our applications for education and learning of foreign languages in http://www.edumobi.org  Like this app? Give him a good grade in this market apps! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}