{
"name" : "Pocket Thai Speaking: Learn To Speak Thai Today",
"url" : "https://play.google.com/store/apps/details?id=pocketthai.speaking",
"package" : "pocketthai.speaking",
"category" : "Education",
"description" : "Dont just memorize a few key phrases - learn actual Thai vocab and grammar so that you can truly understand the language and create unique sentences.   Pocket Thai Speaking is designed for travelers and others that want to learn the most important parts of the Thai language quickly and easily.  Try the first four lessons for free today!  __________  What will you learn with Pocket Thai Speaking?   22 Lessons: 220 pages of interactive content   Focus On The Essentials: Learn only the most important items for daily life and travel in Thailand   Culture Lessons & Travel Tips: Highlight the unique aspects of Thai culture and learn tips for fitting in to Thai culture and how to behave politely   Professional Audio: 1000+ clear audio recordings of female and male native Thai speakers   Interactive Quizzes: Test your understanding with fun multiple choice quizzes that change each time you take them   Friendly and Fun Explanations: A warm tone and down to earth explanations of both grammar and culture make learning easy   Study at Your Own Pace: Designed to be effective at whatever pace works best for you   Always With You: Pocket Thai is anywhere that you are, no internet connection required  __________  Which version of Pocket Thai is right for you?  Pocket Thai Master contains 38 lessons and teaches reading, speaking, and culture. It is ideal for serious students and anyone living and/or working in Thailand for 6 months or longer.  Pocket Thai Speaking contains 22 lessons and teaches the most important aspects of speaking and culture. Ideal for travelers and some long term visitors that want to learn the basics without a major investment of their time.  Pocket Thai Reading contains 12 lessons and teaches only the Thai script. It is aimed at people that probably speak Thai already but never learned how to read the Thai alphabet and tone rules.  __________  What Pocket Thai Speaking is NOT:  This isnot another app made by a company that gets a list of the most common vocabulary words in 20+ languages and creates a bunch of apps with simple picture/word matching games. I spent years living in Thailand and studying Thai including reading many grammar books, creating and reviewing thousands of flashcards, and having lots of conversations with friends and acquaintances. This app contains lengthy grammar explanations and cultural nuances that other programs dont include, because their authors probably dont even speak the languages of the apps that they create.  __________  Want More Info?   Please email with any questions that you may have: Evan@Pocket-Thai.com   I respond to every email that I receive and answer questions, give advice, or listen to feedback!   More information is available on the website: Pocket-Thai.com. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING']",
}