{
"name" : "AstroFD",
"url" : "https://play.google.com/store/apps/details?id=ru.astrofd.astrofd",
"package" : "ru.astrofd.astrofd",
"category" : "Education",
"description" : "Application AstroFD is a powerful analytical tool that helps anyone to reveal the opportunities inherent in him or her from birth; clearly see how the potential embodied in this formula can be realized through numerous examples of famous people with similar formulas; to see the forces connecting families and collectives, as well as chances for harmonization of mutual relations.  To select a date, click the down arrow button. To quickly select desired year, click on the year of the calendar - a list of years will appear.  Design of the formula is optimized for mobile devices. At your fingertips - planets of the formula can be easily moved around the screen, to redesign formula for better representation and review. If necessary, expand the visual space of the formula, moving some planet beyond the edge of the screen. To expand the area of the central planets, move one of the central planets to the left. Tip: to make sure that the program does not confuse planet movement with intent to change a view (horizontal swipe), start moving the planet vertically (up or down). While moving, a semitransparent target appears on the screen, showing a point the planet will fall into upon movement completion. You can shift planets vertically by half the cells height. When selecting such positions, the target is displayed in a lighter tone.  The program requires connection to the Internet. If the program is unable to receive data, check for update on Google Play - mobile version of AstroFD is developing rapidly, which affects data transfer formats.  The application is designed for professionals familiar the method of Alexander Astrogor Soul Formula and students of educational programs. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.CHECK_LICENSE', 'android.permission.ACCESS_FINE_LOCATION']",
}