{
"name" : "Countries of the World - reference and quiz",
"url" : "https://play.google.com/store/apps/details?id=ru.androidtools.countries_of_the_world",
"package" : "ru.androidtools.countries_of_the_world",
"category" : "Education",
"description" : "Traveling these days is very fashionable, but very expensive. There are few people among us who can easily jump into a plane and fly to the end of the world. But, as a rule, you always want to go far away, be sure to see all the countries and their capitals, and, of course, their famous sights, many of which are real wonders of the world. You know, Venice is sinking, Notre Dame is burned, and Vesuvius is going to blow up and sleep Pompeii again... However, if you are aware of the cultural tragedies of the last hundred years, and are sure that you know all the countries and capitals, perfectly oriented in the names of cities, continents and even foreign Internet domains are familiar to you - the section Countries of the world quiz if created specifically for you.  When developing our application were taken into account all the wishes and needs of travelers - real and virtual. Only in our directory of the world collected the most complete information needed when traveling to a particular state - from the area and the national currency to the form of government and telephone code.  Application Countries of the world for easy use is divided into several parts: - countries (look in the directory is useful when planning the details of the trip or just intending to pump their knowledge); - continents (do you know which continent is Cape Verde or Djibouti?); - wonders of the world (this part tells about the most famous sights of the world and where to look for them); - the game (for those who like to show erudition and test yourself); - quiz (20 questions about different countries, flags, coats of arms and other interesting things). As not only a nice but also a useful bonus the app offers: - a thematic article about the countries in your favorite Wikipedia; - demonstration of the world on the map.  How to visit the Colosseum and not spend a single Euro? Walk along the great wall of China and then swing across the ocean to admire the waterfalls of Iguazu in Brazil? Our application will help you to make all these fantastic trips quickly, interestingly, and most importantly - for free. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}