{
"name" : "Countries of the World - Quiz Game and Learning",
"url" : "https://play.google.com/store/apps/details?id=ru.devera.countries",
"package" : "ru.devera.countries",
"category" : "Education",
"description" : "Have Fun While Learning About The 195 Countries of The World Featuring: Learn of each Nations Flag.  Find out Capital City of each country.  Did you know which Form of Government is used in different countries around the world?  Research which Languages Spoken.  Currency varies around the globe, find out what is being used.  How many people live here? We will show you the population across the world.  Famous Wonders (The Pyramid of Cheops, The Colosseum, Chichen Itza, The Amazon and The Amazon jungle, and many more!)  Location in the world / Continent (South America, North America, Europe, Asia, Africa, Australia and Oceania)   Quiz mode will test your knowledge of the countries. Come play, unlock achievements and expand your knowledge of the globe. This application is suitable for students or anyone that wishes to expand their education of the world. Have fun while refreshing your knowledge and learn something new!  Features: - A beautiful design and intuitive interface perfect for students.  3 fun quiz game modes to test your knowledge.  Up to date information on the 195 countries of the world.(flag, capital, language, territory, population, etc) With new information added frequently.   ",
"desc_perms" : "['android.permission.ACCESS_COURSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}