{
"name" : "Leo the Truck: Nursery Rhymes Songs for Babies",
"url" : "https://play.google.com/store/apps/details?id=ru.projectfirst.leo.songs",
"package" : "ru.projectfirst.leo.songs",
"category" : "Education",
"description" : "Welcome to the magical world of Leo the Truck and his friends! Our new, interactive music app develops the awareness, hearing, motor skills, intuitive reading, and spatial thinking of your child. Listen and sing songs with Leo the Truck and cars!  Leo has prepared many interesting songs and task to study colors, objects, and numbers together. And, of course, he hasnt forgotten about cartoons! Your child will explore Leos house, the playground, the kitchen, and the village with all its pets. After each story, your child will get to watch a wonderful cartoon about cars.  Hurry up and launch our music app! Leo the Truck and his friends have a lot to do! Lets start with the most important thing - a good rest! Together with a star, sing your favorite lullaby and help friends fall asleep. After waking up, well go with Leo to the playground. Cute and harmless spiders are waiting there to help us learn colors and sing a song.  But this was only a warm-up. Our cars have a real mystery to solve. All the cookies are missing! Leo the Truck goes with his friends to look for them. Bulldozer, Robot, Lifty, and Roller start their search, and your child will help them. As we know from the cartoon, Skoop decided to throw a surprise, but the cars didnt expect it!  Whoosh! Now were doing important things in the kitchen. Together with Forklift Lifty, well pick vegetables and learn what items shouldnt be in the kitchen. Singing along to fun songs makes remembering them so easy! Your child will help prepare a delicious soup, which the cars rush to try. After lunch, Leo the Truck will go to the village to feed pets. Well get to learn which sounds each of them makes. Each story is accompanied by a short song that your baby will love. Repeat the song, and soon the child will remember simple words and melodies. This app helps your child develop intuitive reading skills and expand vocabulary. Getting to know more about the world around you in a playful way is a fascinating chance to raise your child.  Features of our educational music app: - Based on the popular Leo the Truck cartoon for kids - Safe for children who have not yet fully developed fine motor skills - By listening to songs, the child remembers the names for objects, animals, colors, and numbers - This app is optimized with entertaining content that helps development - 5 different locations allow you to explore familiar and interesting situations for children - After each story, the child will eagerly await the fascinating cartoon about cars - This app develops awareness, hearing, and fine motor skills - Professional voice acting and the basics of intuitive reading - This app helps develop your childs spatial thinking - Colorful graphics and intuitive interface - For easy use, select one of the modes (listening or listening on repeat)   This vibrant, educational interactive app will surely captivate fans of the Leo the Truck cartoon. Leo is a curious and cheerful character. In each cartoon, he teaches about interesting cars, shapes, letters, and colors. This educational cartoon is perfect for young children and toddlers.  Lets sing fun songs with your favorite characters!  If you have questions or suggestions, you can always write to us at appsupport@projectfirst.ru. We love reading the messages you send us :) ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'ru.projectfirst.leo.songs.permission.C2D_MESSAGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING']",
}