{
"name" : "Tyra",
"url" : "https://play.google.com/store/apps/details?id=se.bayou.android.tyra",
"package" : "se.bayou.android.tyra",
"category" : "Education",
"description" : "All information och kommunikation p ett stlle!  Vilken dag var nu frskolan stngd? Skulle jag fylla p med bljor eller uteklder? Har Lisa det mysigt p utflykten? Nr skulle de ka ivg till badplatsen nsta vecka? och vad skulle packas med? Vilken teckning var de nu Lisa hade gjort som hon pratade om hela kvllen? Med Tyra kan ni enkelt hlla koll p ert barns utveckling och lrande och samtidigt se vad de har fr sig under dagen.  Pedagoger kan genom vrt smarta incheckningssystem se vilka barn som befinner sig p frskolan och ven senare under dagen rkna in dessa s att de stmmer. Genom dokumentationen finns mjlighet att dela barnens lrande samtidigt som det fungerar som ett underlag fr kommande utvecklingssamtal. Kontaktlistor innehllandes kontaktinformation till frldrar, andra pedagoger samt vikariepool fr att snabbt kunna f tag i den man sker.  Dessa r bara en brkdel av de funktioner som Tyra erbjuder fr att underltta vardagen fr frldrar och pedagoger. All information and communication in one place! What day was now the nursery is closed? I would stock up on diapers or outdoor clothing? Lisa has it cozy in the excursion? When they would go off to the swimming area next week? and what would be packed with? What warrants were now Lisa had done as she talked about all night? With Tyra, you can easily keep track of your childs development and learning and also see what they are doing during the day.  Teachers can, through our smart check-in system to see which children are at nursery school and even later in the day to figure out these to match. The documentation for the opportunity to share the childrens learning at the same time serves as a basis for future discussions. Contact lists contents contact to parents, other educators and supply pool to quickly find the one you want.  These are just a fraction of the features Tyra provides to make life easier for parents and educators. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'se.bayou.android.tyra.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
}