{
"name" : "Seesaw Parent & Family",
"url" : "https://play.google.com/store/apps/details?id=seesaw.shadowpuppet.co.seesaw",
"package" : "seesaw.shadowpuppet.co.seesaw",
"category" : "Education",
"description" : "Seesaw is a digital portfolio that gives you real-time glimpses into your childs school day. Seesaw helps you stay in the loop and gives you an opportunity to support your childs learning at home.   Used in over 200,000 classrooms, 1 in 4 schools in the US, and over 100 countries!   **Named Best Website of 2016 by American Association of School Librarians, 2016 Top Pick for Education by Common Sense Media, and featured in by Apple as Perfect for Every Classroom for 9 months.**  +REQUIRES A SEESAW SIGNUP CODE FROM YOUR CHILDS TEACHER TO USE+  When your child adds a new post to their journal, like a photo, video or drawing, youll automatically get notified. Follow the notification to view the new addition to your childs journal and support their learning.   FEATURES  Simple Sign Up  Scan the QR code on the handout you received from your childs teacher to create an account  Automatic Notifications About New Posts  Check out what your child is doing at school, wherever you are!   Customize your notification preferences. Receive all notifications or a daily digest   Leave a text or voice comment to encourage your child!   Easily Message Teachers   Message privately with your childs teacher  Receive class-wide announcements   All of Your Students Work in One Place!  Browse your childs journal from each class   View posts on a calendar or sort by folders   Translate notes, comments and captions into 50+ languages, including Spanish, French, Chinese, Japanese and more!   Save anything to your devices camera roll   All Content is Private and Secure   Student content is secure, and is never shared with 3rd parties.   Check out our Privacy Principles at http://web.seesaw.me/privacy   Export a Zip Archive of Your Childs Work  Available anytime on the web anytime at: app.seesaw.me.  Need help? Visit our Help Center at help.seesaw.me. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_INTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.STORAGE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_INTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
}