{
"name" : "Simulados Detran - Provas e simulado para CNH",
"url" : "https://play.google.com/store/apps/details?id=simuladodetran.aplicativoslegais.com.simuladodetran",
"package" : "simuladodetran.aplicativoslegais.com.simuladodetran",
"category" : "Education",
"description" : "Agora voc pode estudar para a prova terica do Detran diretamente do seu celular, so 4.500 questes diferentes para voc.  a melhor forma de se preparar para tirar sua carta de motorista.  Com o app Simulados Detran, voc poder fazer simulaes de provas tericas. Cada simulado conta com 30 questes e deve ser feito em at 40 minutos, igual prova da CNH do Detran.  O aplicativo ainda conta com um histrico das suas notas, assim, voc pode verificar a evoluo do seu desempenho e se est mais prximo de passar na prova para tirar sua carteira de motorista.  Todos os assuntos necessrios para tirar sua carta de motorista esto contemplados nesse app, confira: - Legislao de Trnsito; - Regras de Circulao; - Mecnica de Veculos; - Proteo ao Meio Ambiente e Cidadania; - Sinalizao; - Direo Defensiva; - Infrao; - Noes de Primeiros Socorros; - Placas de trnsito.  Baixe agora o Simulados Detran e se prepare para tirar sua carteira de motorista.  ------------------- As questes utilizadas so referentes ao Detran do Rio de Janeiro, de So Paulo e de Gois, mas servem como preparatrio para outros Detrans. Em breve, sero adicionados questes de outros estados tambm. Now you can study for the DMV written test directly from your mobile are 4,500 different questions for you. It is the best way to prepare to take your drivers license.  With Simulated DMV app, you can do simulations of theoretical tests. Each simulated has 30 questions and should be done within 40 minutes, just proof of DMV of CNH.  The application also has a history of your notes, so you can check the progress of their performance and is close to pass the test to get your drivers license.  All matters required to take your drivers license are included in this app, check out: - Traffic Law; - Circulation Rules; - Vehicle Mechanics; - Environmental Protection and Citizenship; - Signalling; - Defensive Driving; - Infringement; - First Aid Basics; - Transit plates.  Now download Simulated DMV and get ready to take your drivers license.  ------------------- The questions used are of the Traffic Department of Rio de Janeiro, So Paulo and Gois, but serve as preparatory to other Detrans. Soon, questions will be added to other states as well. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}