{
"name" : "Dictionary Synonyms and Antonyms Spanish Offline",
"url" : "https://play.google.com/store/apps/details?id=sinom.aymcorp.com.sinom",
"package" : "sinom.aymcorp.com.sinom",
"category" : "Education",
"description" : "Welcome to Sinonimun V2 (the new version of the Sinonimun application), your free and easily accessible dictionary of Spanish synonyms and antonyms. .  The use of the application is very simple, open it and enter in the search box the word you want to get the synonyms and / or antonyms and thanks to its interface designed to be as simple as possible, the results will be incredible.  For more detail, the application works in harmony with the dictionary services of synonyms and antonyms provided by the Real Academia de la lengua espaola (RAE) in order to provide the best results. Results that even include new words and Bulgarianisms.  For the application to work properly you need an internet connection. This way we can offer results updated in real time. But not everything remains here, we are preparing an offline version for anyone who has no connection can enjoy the application without problems.  If you still have doubts, download it and look for several examples of synonyms and antonyms, youll see that the results are surprisingly fast! It will be a game for children to learn how to use it.  The app works in real time, so youll be calculating the results at the same time you fill in the search box.  If you needed a simple, easy to use, unadorned and to the point application, this is your application.  Although we already have all the words in Spanish, we are also working to get it out in several other languages. Like English, French, German, Italian, etc...   Instructions:  1 - Download and install the application on your mobile device or tablet. 2 - Open the application, at that moment the app will connect to our services on the Internet to offer you the best result in your search. 3 - At the top of the screen you will see a search box in which you will have to tap. 4 - A small tab will open in which you can insert your search, the keyboard you have configured on your phone will appear to facilitate the task. 5 - Click on the button that will appear at the bottom right aligned to execute the query (usually a magnifying glass). 6 - You will wait for a few seconds, depending on your Internet connection, for the results to appear and thats it. You already have your synonyms.  One more thing, if the application has been useful to you, dont forget to share it with your friends.  For example you can search: Restaurant synonyms, flirting synonyms, synonyms of popular, synonyms of sadness, drinking verb synonyms,> commentator synonyms, and a long ETC... that would never end.  And finally, for those who have never looked for it :) Synonyms of synonyms: equal, similar, analogical, equivalent, parallel, similar, consonant, corresponding, homologous >  Please dont forget to rate the application and leave in the reviews that you would improve, remove or change.  Greetings, AyMCorp team. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.INTERNET', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}