{
"name" : "Ta3lim Siya9a 2020 - تعليم السياقة 2020 - تعلم",
"url" : "https://play.google.com/store/apps/details?id=ta3lim.siya9a.maroc.imti7an.siya9a.permis.code.route.darija",
"package" : "ta3lim.siya9a.maroc.imti7an.siya9a.permis.code.route.darija",
"category" : "Education",
"description" : "Sya9a Maroc 2020    2020   ..                   ..                2020  ..        ..          ..                         Code Rousseau Maroc 2020.                              ..     2020        - Sya9a Maroc 2020     2000       .           !             !       .           .                                                 .     2020                .      2020                              .                    .    Ta3lim Siya9a 2020 -   2020 - :                                  (   )     .                     - ta3lim sya9a 2020  - Code Route Maroc - imtihan sya9a maroc        Sya9a Maroc 2020    . Sya9a Maroc 2020 Driving education application 2020 for beginners and professionals .. Because the lessons you can choose means that if you are a beginner choose lessons for beginners and if you are a professional then choose lessons for professionals .. We offer you the latest lessons in the world of driving education in order to make it easy for you to obtain a driving license 2020 in an easy way .. Just download the app and enjoy free driving lessons.  The premium application contains important topics about the drivers license .. Because it contains many categories such as traffic lights, car mechanics, and also additional information, bookmarks and much much more, just download the application and discover the application Code Rousseau Maroc 2020.  Driving application in your smartphone means you have a school in your pocket at any time you want education or any time you have an empty time use the application and enjoy free lessons ..  Driving app 2020 saves you effort and time learning to drive - Sya9a Maroc 2020   More than 2000 questions in many aspects of driving education.  All series and all questions are free and you can test them all for free!  Questions and driving tests in Arabic with a very clear voice like the official exam!  The app is simple, easy to use and uncomplicated.  View answers and also correct your wrong answers in all test chains.  The app, why is it special? Because the lessons and summaries are renewed, I mean, it suffices to carry the application only once, and when we add a new lesson, it will automatically be added to the lessons in an application, you will not need to remove it and download it again, so once it is enough for you to enjoy the distinct and upcoming lessons that will clean it.  The driving education 2020 application enables you to view all the lessons and techniques that will help you to obtain a driving license with ease.  All driving lessons 2020 are directed directly to Moroccans, I mean the drivers license for Morocco, but this cannot be done if you are from another country to look at the lessons in order to learn also and take experience from that.  The application also works in driving in Algeria and driving in Tunisia because they all have the same curriculum and the same exam almost, and there is no difference.  With the application of Ta3lim Siya9a 2020 - Driving Education 2020 - Learn: Your assistant will be at any time you need help at the time when you want to learn driving in general because we give you the ability to enter without limits and free of charge to all chains and lessons on driving (theoretical lessons and practical lessons Also explain all the traffic lights.  Come on, download the application before everyone else benefit from it and its exclusive features that are not found in any other application  ta3lim sya9a 2020 - Code Route Maroc - imtihan sya9a maroc  Download now and enjoy the app Sya9a Maroc 2020 driving education before it gets paid. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_FINE_LOCATION']",
}