{
"name" : "English Grammar – Preposition (free)",
"url" : "https://play.google.com/store/apps/details?id=tc.engsoft.QA_free",
"package" : "tc.engsoft.QA_free",
"category" : "Education",
"description" : "*** English Grammar  Preposition was reviewed and deemed educationally valuable by an independent group of educators in Google Play for Education.   *** Google Play for Education is a destination where schools can find great, teacher-approved, educational apps and videos on Play Store. All apps on Google Play for Education are evaluated by a third-party educator network to ensure that they align with Common Core State Standards in the United States. http://www.google.com/edu/tablets/#play-intro http://www.corestandards.org/  *** This is the free version (with advertisements) of English Grammar  Preposition! The content of both versions are identical.   English Grammar  Preposition (free) helps you learn preposition in a fun way! Get this app now to improve your TOEFL, IELTS, TOEIC, SAT, GMAT, GRE and HKDSE results!  What will you lose if you dont download English Grammar  Preposition (free)?  COMPREHENSIVE lessons with translations: 300+ sample sentences and common mistakes with Chinese translations!  INTERESTING Quiz game: 1000+ multiple-choice questions in our question bank! The more questions you can answer correctly, the more difficult questions will be intelligently generated. You can use 50:50 (fifty-fifty) to eliminate half of the incorrect choices. Better still, there are 4 game modes: Answering 20, 50 or 100 questions AND Sudden Death Mode. (Game continues until you answer one question incorrectly or you answer all the questions.)  DETAILED test result: It shows which questions you answered incorrectly, score, max. combo (Max. number of questions answered correctly consecutively), date and time of the test. Better still, it shows your top 30 frequent mistake questions too! It is useful for your revision and interesting to challenge with your friends!  CONVENIENT search: 1000+ preposition usage with Chinese translation can be searched easily!  Some more features:  Written by experienced English teachers  No Internet connection required  Dont want advertisements? Download English Grammar  Preposition! https://play.google.com/store/apps/details?id=tc.engsoft.QA  What about a free app without advertisements? Download English Grammar  Preposition (lite)! https://play.google.com/store/apps/details?id=tc.engsoft.QA_lite  Want to improve English? Find us on:  Blog: http://engsofttc.blogspot.com Facebook: http://www.facebook.com/pages/engsofttc/188400257918339 Twitter: http://twitter.com/engsofttc Weibo : http://weibo.com/2558322097  Update BIWEEKLY! With translation! ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}