{
"name" : "Learn Tamil Alphabet Easily - Tamil Letter",
"url" : "https://play.google.com/store/apps/details?id=tfe.mobilesoft.alphabet.tamil",
"package" : "tfe.mobilesoft.alphabet.tamil",
"category" : "Education",
"description" : "TAMIL LANGUAGE Welcome to learning Tamil Alphabet (Tamil Script, Tamil Syllable, Tamil Symbol, Tamil Letters, Tamil Characters, Tamil abc ) Tamil is an official language of Sri-Lanca and Singapore Application teach you to read and write Tamil Alphabet (Tamil Script, Tamil Syllable, Tamil Symbols, Tamil Letters, Tamil Characters, Tamil abc ). If you want to learn Tamil the first thing you must know is alphabet (script, syllable, symbols, letters, characters, abc) fluently.  The application is a great reference for the symbols , script, letters, characters and will help you to memorize the alphabet easily. This application makes easy for beginner to memorize the Tamil alphabet (memorize Tamil letter). Features:  Play Quizzes Game: quiz to test letters identification  Play Freaking Game  Flashcards  How to pronounce the alphabet   Very simple , easy to use  How to write the alphabet  Tamil consonant  Tamil vowel  Tamil numeral, number, numbers, counting, 123  Tamil date and time  Tamil handwriting cursive  Find the IPA (International Phonetic Alphabet)  Recorded by a native speaker  High quality audio  Contain voice for each letters  Copy to clipboard by long click  If you like app, give us 5 stars.  Enjoy the fun!  After using our app, you can:   Memorize, Learn, Pronounce, Study, Read, Write, Remember, Spelling Tamil alphabet, symbols, characters, letters, script, syllable, abc, language, number easily. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'tfe.mobilesoft.alphabet.tamil.permission.C2D_MESSAGE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}