{
"name" : "Learn Hindi Barakhadi Easily - Hindi Alphabet Easy",
"url" : "https://play.google.com/store/apps/details?id=tfe.mobilesoft.barakhadi.hindi",
"package" : "tfe.mobilesoft.barakhadi.hindi",
"category" : "Education",
"description" : "HINDI DEVANAGARI LANGUAGE Welcome to learning Hindi Barakhadi (Hindi Script, Hindi Syllable, Hindi Symbol, Hindi Letter, Hindi Characters, Hindi varnamala, Hindi abc)  Hindi is an Indo-Aryan language with about 545 million speakers, 425 million of whom are native speakers. It is the main language used in the northern states of Rajasthan, Delhi, Haryana, Uttarakhand, Uttar Pradesh, Madhya Pradesh, Chhattisgarh, Himachal Pradesh, Jharkhand and Bihar. It is spoken in much of north and central India alongside other languages such as Punjabi, Gujarati, Marathi or Bengali. In other parts of India, as well as in Nepal, Bangladesh and Pakistan, Hindi is understood, and there is a significant number of Hindi speakers in South Africa, Mauritius, Fiji, Suriname, Guyana, Trinidad & Tobago and Nepal. In Fiji people of Indian origin speak Hindi, and in some areas the Fijian people also speak it.  Application teach you to read and write Hindi Alphabet . If you want to learn Hindi (Devanagari) the first thing you must know is alphabet (script, syllable, symbols, letters, characters, varnmala, abc) fluently.  The application is a great reference for the symbols , script, letters, characters, varnamala and will help you to memorize the alphabet easily. This application makes easy for beginner to memorize the Hindi alphabet (memorize Hindi script). Features:  Play Quizzes Game (test, check your knowledge)  Play Freaking Game  Flashcards with picture (pictures)  How to pronounce the barakhadi   Very simple , easy to use  How to write the alphabet  Hindi consonant (Vyanjan, maatra)  Hindi vowel (Swar)  Hindi numeral, numbers, 123, counting  Hindi date & time  Recorded by a native speaker  High quality audio  Copy to clipboard by long click  If you like app, give us 5 stars.  Enjoy the fun!  After using our app, you can:   Memorize, Learn, Pronounce, Study, Write, Read, Remember, Spelling Hindi barakhadi, alphabet, symbols, characters, letters, script, syllable, abc, language, number, varnamala easily. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}