{
"name" : "ITProTV",
"url" : "https://play.google.com/store/apps/details?id=tv.itpro.app.android",
"package" : "tv.itpro.app.android",
"category" : "Education",
"description" : "Do you need to learn new technology, pass an IT certification exam, or train your IT team on the latest tech? ITProTV delivers binge-worthy learning to IT professionals in every stage of their careers. With training thats more like a talk show, youll watch a subject matter expert engage with a host and an online audience to create a better-than-classroom experience that youll look forward to watching. With ITProTV, youre a member of an IT community that turns IT education into a conversation that connects learners to experts and each other.  Learn server administration, network administration, cyber security, cloud technology, IT service management, pen testing, and more. Cisco, Linux, Apple, AWS, Microsoft, ITIL  all of the vendors you need. ITProTV is CompTIAs official video training partner so you can be sure youre watching the latest online IT training for their IT certification exams.  With a free account, youll get access to a selection of free content, as well as the daily live stream. To become an ITProTV member, create an account on itpro.tv. Once your account has been made, youll be able to access the entire 4000+ hours of content, and depending on which tier you select, you can use the in-browser app to access virtual labs and practice exams to help solidify your skills.  Overview of app features:  Stream the daily live feed  Access to select free IT training courses  Access the entire (4000+ hours) course library with your paid ITProTV membership (must create an account on itpro.tv)  Paid members also get access to bi-weekly webinars on cutting-edge tech and IT leadership skills, and Techando, the weekly tech news and tech interviews podcast  Sync your viewing history with the ITProTV website  Easy search bar  Resume watching episodes where you left off  Watch video or choose audio-only when on-the-go  Download episodes (as MP4-video) to your device for offline viewing (annual memberships only)  Chat with support in-app ",
"desc_perms" : "['', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}