{
"name" : "My IELTS Classroom",
"url" : "https://play.google.com/store/apps/details?id=tv.myieltsclassroomgeneral.android",
"package" : "tv.myieltsclassroomgeneral.android",
"category" : "Education",
"description" : "Confused by IELTS essay organisation? Dont know how to find the key features for your overview? Stuck on semi-formal letters? Well, you are in the right place! Welcome to My IELTS Classroom - the most detailed online IELTS writing course ever created (www.myieltsclassroom.com).  Inside this app is ALL of the knowledge Ive accumulated over the last 17 years as an IELTS teacher, examiner, and test-writer. The result? A 33-hour course that will prepare you for ANY IELTS WRITING QUESTION!  Plus, do you know why My IELTS Classroom is the fastest-growing IELTS website today?! Its because my course contains real lessons that are fun and interactive!   Seriously, my lessons are NOT boring PowerPoint presentations or long lectures. Thats not how teaching works you dont learn by watching, you learn by DOING!   So thats why in My IELTS Classroom, you will participate in every lesson by pausing the video to practice what you have just learned. Plus, theres even homework to complete at the end of each class! And, unlike other IELTS websites, my course contains 10 hours of integrated grammar lessons to make sure your language skills match your academic skills.   Sound familiar? Of course, it does! Its like being in a real classroom! Only now, YOU can decide when class starts and ends. And, with the new My IELTS Classroom App, you can now download the content to watch anytime  so there is no excuse not to study.  The average band score improvement after completing the course is a 0.5. However, there have been improvements of as much as +1.5 in just ONE MONTH. If that sounds like magic, its not. Its just good old-fashioned teaching that focuses just as much on improving your language as your test-technique.   The App includes: 14-hour Essay Writing Video Course. Learn very aspect of essay writing, including how to    satisfy each of the four Band Descriptors  brainstorm, plan and organise the 8 main types of IELTS essay  write introductions and conclusions that address questions fully  build paragraphs that are fully-extended  use high-level grammar accurately in the RIGHT places  use transition signals and referencing   avoid over-generalising   check your work for mistakes   Plus, 5 guided practice videos where you will plan, write, and check an essay with an ex-examiner.  Plus 120 pages of unique downloadable practice activities that contain 50 Band 9 model essays  10-hour Academic Task 1 Video Course. Everything you need to know about report writing, including:   how to organise the paragraphs in your report logically  how to write good introductory sentences  how to paraphrase effectively  how to find key features for the OVERVIEW (very important!)  how to organise the sentences inside your paragraphs logically  the vocabulary and sentence structures needed to describe a CHANGE chart, a COMPARE chart, a PROCESS and a MAP  how to deal with reports that have MORE THAN ONE CHART and STRANGE CHARTS  Plus, 6 guided practice videos where you will plan, write and check a report with an ex-examiner: bar chart, table, line graph, 2 chart task, process and map  Plus 120 pages of practice activities that contain 40 Band 9 model reports   12-hour General Training Task 1 Course. Everything you need to know about letter writing, including:   how to analyse the prompt to make sure you address the bullets fully  how to recognise when to write informal, formal, and semi-formal letters, and the language differences between them  how to organise your letters correctly and use suitable openers and closers   how to use complex TENSES, including separate lessons on the Present Perfect, Narrative Tenses and Future Tenses  how to use Discourse Markers effectively  Separate 30-minute lessons on the most common types of letter  In short, this App is all you will ever need to achieve a 7.0 or higher in the IELTS writing exam. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}