{
"name" : "Chinese Characters First Steps",
"url" : "https://play.google.com/store/apps/details?id=uk.ac.open.kmi.chinesecharacters",
"package" : "uk.ac.open.kmi.chinesecharacters",
"category" : "Education",
"description" : "Learning to read and write Chinese characters presents two challenges to both non-native learners as well as Chinese children who first start learning characters:  - the complexity of characters, as an average character consists of about 12 strokes;  - matching characters with their pronunciation, pinyin and the meaning;   This new version of Chinese Characters First Steps tackles these two challenges on one screen to help you learn, recognize and remember the most frequently used 400 plus characters in a systematic, friendly and fun way. Rather than having a textbook, audio device, dictionary and a notebook to write, you get the stroke-by-stroke writing, the native-speaker pronunciation, pinyin, English definition and instructions in one interactive experience.   These 400 plus characters are introduced in the Open Universitys Beginners Chinese module  D y b (L197) and drawn from the most commonly and frequently used word list published by the Ministry of Education of PRC (China). By combining them, you will learn a further 230+ useful words and phrases. For example, you learn the three single-character words for red ( hng), green (l) and light (dng), which put together make up the word traffic lights, which you will find in one of the word search puzzles.  There are 20 lessons which chronologically build upon each other.   Each lesson has 4 sections:  - Writing Practice - Listening Test - Reading Test - Word Search  The first five lessons with characters and related activities are included free to give you a taste of what this app can do. The other 15 lessons are available via in-app purchase for a total of 1.49 by tapping the upgrade button.  PLEASE NOTE: This app uses Google Analytics to allow The Open University to gather anonymous statistical data on how the app is used. The data is used for academic research only.  No personal or device information is gathered.   By installing this app you give consent to The open University to use Google Analytics in the manner stated above. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING']",
}