{
"name" : "Aviation English Vocabulary 4 – 5",
"url" : "https://play.google.com/store/apps/details?id=uk.co.englishteacheroxford.aviationenglish",
"package" : "uk.co.englishteacheroxford.aviationenglish",
"category" : "Educational",
"description" : "About to take your ICAO English Test? Whether youre relaxing at home, in the crew room or having a break from the control tower, this app allows you to learn and refresh your Aviation English anywhere, without the need for WIFI.  Focussing on essential vocabulary like cargo problems, unruly passengers, fire onboard as defined in ICAO doc 9835, this app is easy to use and navigate around and will keep you entertained and motivated from start to finish.  Working against the clock and using fast-paced interactive quizzes, this app helps you to expand your vocabulary and learn quickly. The quizzes get progressively more difficult as you work your way through each topic. You start by simply tapping the correct image and finish with a spelling quiz, which really tests your learning and knowledge. This method allows you to build your vocabulary step by step and learn at your own pace, in your own time.  Live scoring immediately shows you your ICAO English Level and allows you to track your progress as you work through the quizzes and topics. You can also consolidate your learning at the end of each section by taking a Test, with the results being easily accessible on the STATS page.   The pronunciation section where you can listen to a native speaker and learn how to pronounce words clearly and confidently, enables you to speak and communicate more fluently and naturally.  We welcome you to download this app and we hope you have a great user experience. Please look out for more apps in the near future.  Best wishes. ETO app team ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING']",
}