{
"name" : "Driving Theory Test 4 in 1 2020 Kit Free",
"url" : "https://play.google.com/store/apps/details?id=uk.co.focusmm.combo4free",
"package" : "uk.co.focusmm.combo4free",
"category" : "Education",
"description" : "Now is the time to begin your Theory Test revision! Download DVSA revision materials and exclusive learner content for the 2020 Theory Test.   Driving Test Success, the creators of the UKs No.1 Theory Test app, have helped over 13 million learners prepare for their test, so whether youre preparing for your Car, Motorcycle or Trainee ADI Theory Test youre in safe hands!     Get started with your Theory Test revision with our FREE 4 in 1 Theory Test App :   THEORY TEST APP: Work your way through 2020 DVSA revision questions, answers and explanations    ENGLISH VOICEOVER: Brand NEW English voiceover to read aloud ALL Theory Test revision questions, explanations and answers, to help users with reading difficulties or dyslexia    HAZARD PERCEPTION APP: Revise 8 interactive clips, including DVSA CGI clips and cheat detection software just like the official test!    HIGHWAY CODE APP: A helpful tool to reference for the Theory Test and beyond! Learn 10 important sections of the UK Highway Code, with an advanced search feature    ROAD SIGNS APP: Exclusive content you wont find in any other app! Learn UK road signs visually using illustrations, descriptions and photos    TRY BEFORE YOU BUY: Once youve worked your way through this introductory app, feel confident to upgrade to our best-selling 4 in 1 Theory Test Kit  The app does not require an internet connection once downloaded so you can revise anytime, anywhere without worrying about your data. If you experience any issues while downloading please contact at us at support@drivingtestsuccess.com  - For use only with device that ship with Google Play pre-installed.  Crown Copyright material reproduced under licence from the Driver and Vehicle Standards Agency which does not accept any responsibility for the accuracy of the reproduction.  *Data gathered from a 2017 survey conducted by Driving Test Success sampling 345 of their app users. Of the 272 users that had taken their Theory Test, 245 (90.07%) passed using the Driving Test Success 4 in 1 app.  http://theorytestapp.co.uk ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'uk.co.focusmm.combo4free.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}