{
"name" : "Driving Theory Test Free 2020 for Car Drivers",
"url" : "https://play.google.com/store/apps/details?id=uk.co.focusmm.dts_theory_free",
"package" : "uk.co.focusmm.dts_theory_free",
"category" : "Education",
"description" : "Join the 13 MILLION learners weve helped prepare for their tests! Practise over 350 DVSA multiple choice 2020 Theory Test revision questions from the DVSA. Pass your Theory Test first time!  SUITABLE FOR:  Car Drivers in Great Britain & Northern Ireland  Motorcyclists in Great Britain & Northern Ireland  Trainee ADIs in Great Britain & Northern Ireland  WHY SHOULD I DOWNLOAD THIS FREE APP?  PRACTISE - Over 350 Theory Test revision questions, answers and explanations, licensed by DVSA (the people who set the test)  ENGLISH VOICEOVER: Brand NEW English voiceover to read aloud ALL 2020 Theory Test revision questions, explanations and answers, to help users with reading difficulties or dyslexia  MOCK TESTS - Sit mock Theory Tests with interactive case study questions, just like in the real test  FLEXIBLE - Choose which Theory Test category you want to learn from, select the number of questions and off you go! You can even filter questions that you have not yet seen or previously answered incorrectly  REVIEW - See where you went wrong and how to improve for next time round  MONITOR YOUR PROGRESS - Keep a daily track of how well youre doing, to see if your test ready TRY BEFORE YOU BUY Once youve worked your way through this introductory app, feel confident to upgrade to our best-selling 4 in 1 Theory Test Kit. 9/10 pass their test using nothing but our 4 in 1 Theory Test Kit app!   The app does not require an internet connection once downloaded so you can revise anytime, anywhere without worrying about your data. If you experience any issues while downloading please contact at us at support@drivingtestsuccess.com  Crown Copyright material reproduced under licence from the Driver and Vehicle Standards Agency which does not accept any responsibility for the accuracy of the reproduction.  *Data gathered from a 2017 survey conducted by Driving Test Success sampling 345 of their app users. Of the 272 users that had taken their Theory Test, 245 (90.07%) passed using the Driving Test Success 4 in 1 app.  http://theorytestapp.co.uk ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'uk.co.focusmm.dts_theory_free.permission.C2D_MESSAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}