{
"name" : "Urdu to English Dictionary",
"url" : "https://play.google.com/store/apps/details?id=urduenglish.multimedia.dictionary",
"package" : "urduenglish.multimedia.dictionary",
"category" : "Education",
"description" : "This is the worlds first Urdu to English Language Multimedia Dictionary which gives you Urdu Meanings, English Definitions, Images, Audios and Videos for any word that you search with it. It has a built in Text to Speech support for you to accurately learn the pronunciation of English Language words. Its quick, easy and very useful. Urdu Language Meanings are available in offline mode while English Definitions, Images, Audios and Videos require live internet connection on your device.                                                                    It holds beautiful Urdu Language Nastaleeq font which doesnt require you to install any additional plugins on your device. Its smooth and pain-less. The vocabulary is constantly being updated. At present there are more than 36,000 Urdu Words with Meanings, Images, Audios and Videos while there are more than 100,000 English Definitions in this dictionary.                          36000            100000          This Multimedia information will:  Help you to better understand the words.  Allow you to quickly memorize words.  :              -      -  Features of this App are:  Alphabetical listing of all possible correct words is shown when you type the characters in search bar.  You can listen the letters while you are typing a word for easy spell check.  It will display Urdu Meanings and English Language Definitions of any word that you choose from the list as well as its pronunciation is provided.  You can use the icons at the bottom of Main screen for Image, Audio and Video information of the particular word.  You can zoom in Urdu Language Meanings, English Language Definitions and Images by pinching and double tapping on the screen. :                      -           -               -           -  This dictionary is one of the best Urdu Language dictionary for travelers, businessmen, players, students, children, teachers, learners, boys and girls.  We are constantly adding more words as well as audios, videos and images in this dictionary. At the same time we are removing any errors as soon as it is pointed out to us. You are encouraged to provide us your valuable feedback about the data in case you find out that there is some mistake in it. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
}