{
"name" : "dinos AR - Dinosaur Land Jurassic Game",
"url" : "https://play.google.com/store/apps/details?id=vision.rasa.dinosar",
"package" : "vision.rasa.dinosar",
"category" : "Education",
"description" : "Spawn dinosaurs anywhere with this advanced AR (ARCore) technology! Bring T-rex, velociraptor, and a host of other dinos in 3D alive in your bedroom with our dino game. This game is super realistic and immersive! Maybe you prefer dilophosaurus, brontosaurus, allosaurus, or triceratops? You dont have to travel to the lost world to play with your favorite ceratopsia, you can bring them alive anywhere with new ARCore games, which is a new form of VR (virtual reality), that is made possible through todays technology advancement.   dinosAR game is not just another dino game. Our game is very advanced, unique, and of course, immersive. Through the newest technology that is beyond the traditional VR (virtual reality), you can spawn live dinos anywhere you like, anytime! Can you imagine playing with a live T-rex, velociraptor, or brontosaurus in your room? Or having dilophosaurus, triceratops, or brachiosaurus on your front yard? You can even record a video of an oviraptor in your car. How cool is that?    FEATURES OF DINOS AR - DINOSAUR LAND JURASSIC GAME:  3D REALISTIC DINOS: there are many types of dinosaurs that you can spawn anytime including brachiosaurus, allosaurus, brontosaurus, dilophosaurus, and triceratops.  ADJUST DINO SIZE: you can have small or big dinos in your room. Use your fingers to adjust the size.  MOVEMENT AND SOUND: unlike other games where the dinos dont move, these animals are alive here! The dinos will move and make sounds that make them stand out, and you can control them!  SIMPLE TO USE: Simply choose a dino to spawn them on a surface, adjust their size, tap to interact with them and you have a live dino in your room! USE ANYWHERE, ANYTIME: take this lost world AR game with you and play with it anytime, anywhere. Bring a dino alive in your kitchen, yard, or even inside a car! TAKE VIDEO: Want to impress your friends and family? Create a video of a dino in the park or in your car!   This is a new twist of the VR (virtual reality) AR games that are so popular these days. Its also a great dino game because its so realistic and immersive. They can observe their favorite ceraptosia close by, can even almost touching it. The rendering is super detailed and live. You wont believe that the T-rex or velociprator in your room isnt the real one running on the lost world millions of years ago!   Our love of the lost word era and desire to have our own dinos are what inspired us to create this awesome dino game. We hope to create an app that showcase the best pictures of Velociraptors, Brontosaurus, and other awesome dinos living in a dinosaurs world. Bring any dino with your and play with them anytime, anywhere, for FREE!  *You need to have a compatible phone that can run Google ARCore (Google Play Services for AR) to be able to download and run this app.   ** The app contains In-App Purchases. Two dinosaurs are included free by default, and a new dinosaur can be used for free with the Dinosaur of the Day promotion.   ---  We hope you enjoy playing dinosAR - Dinosaur Land Jurassic Game! We certainly have lots of fun creating it. Please support this free game by leaving a rating and review.  We cant wait to see what you create!   instagram: @dinosARapp twitter: @dinosARapp facebook: https://www.facebook.com/dinosARapp/  Privacy Policy: We value your privacy, and designed dinosAR with your privacy in mind. The app collects no personal information, and you can view our full privacy policy here: https://rasa.vision/privacy.html ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BLUETOOTH', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING']",
}