{
"name" : "Animals puzzle game for kids",
"url" : "https://play.google.com/store/apps/details?id=vn.edugames.animalsPuzzle",
"package" : "vn.edugames.animalsPuzzle",
"category" : "Educational",
"description" : "This Free jigsaw like puzzle game helps your kids develop matching, tactile and fine motor skills while playing 100 different Animals Puzzles - horse, cow, pig, sheep, duck, chicken, donkey, dog, cat and rabbit, bee, butterfly, mouse, peacock, monkey, owl, fish, dolphin, penguin, frog. It is a fun and educational learning game for preschool children and toddlers including those with autism.  Watch them learn all the names of numerous pet, farm, jungle, zoo and water animals through fun and play. A pleasant voice will always encourage and praise your kids and motivate them to continue to build their vocabulary, memory, and cognitive skills while playing. The game is enriched with animations, pronunciations, sounds and interactivity for repeat playing & learning. It will keep your kids busy and yet you will never be worried about them losing any piece of the puzzles!  Our baby favorite, the best educational FREE puzzle game that will entertain and teach for hours. It will help your toddler learn his first words and alphabets while working on the development of fine motor and tactile skills - all this through matching different shapes. Animations, interaction & high-quality graphics with the addition of educational elements ranging from animal names, animal sounds & real-life animal pictures, fun facts & videos are what makes this game unique and hard-to-resist. Learning can be a lot of fun!  A must-have puzzle for little children who loves playing in Water and on the Sea Beach. Learn who lives underwater, match the broken shapes and watch the cute animals come to life. This free kindergarten game is great for your baby toddler or preschooler and is appropriate for autistic children too. Having hours of fun will lead to development of fine motor skills, as well as improvement of speech and pronunciation while learning first words and lots of animal names, sounds & fun facts  Features: Simple & intuitive child-friendly interface Universal app for all phones and tablets Hundreds of puzzle pieces in 84 different puzzles Easy navigation between puzzles Easy movement of puzzle pieces across screen High-quality graphics Sweet background music Drag & drop animations Balloon animation & happy cheering after each correctly solved puzzle  And last but not least ***All puzzles are available for FREE***  Privacy Disclosure:  As parents ourselves, EdugamesStudio takes childrens wellness and privacy very seriously. Our app:  Does not contain links to social networks  Does not contain any in-app purchases  Does not collect personal data But yes, it does contain advertising as thats our means of providing the app free of cost to you  the ads are carefully placed such that the kid is least likely to click on it while playing. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
"manifest_perms" : "['vn.edugames.animalsPuzzle.permission.C2D_MESSAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
}