{
"name" : "English Vocabulary Builder App",
"url" : "https://play.google.com/store/apps/details?id=vocabmagik.sirez.com.vocabmagik",
"package" : "vocabmagik.sirez.com.vocabmagik",
"category" : "Education",
"description" : "Vocabulary building can be fun!  VocabMagik is an innovative, English vocabulary app that helps you improve your vocabulary for day-to-day use as well as for competitive exams like GRE, GMAT, SAT, CAT, Bank PO, BBA, UPSC, CLAT, SSC, TOEFL, IELTS etc. Learning with animated cartoons and witty mnemonics makes the process a lot more fun and efficient. Ace your English vocabulary with guided learning plans for GRE preparation, CAT preparation, GMAT preparation, SSC Online and other courses. Use our flashcards and bookmarking feature to save difficult words. Evaluate your skills by taking unlimited tests and get detailed progress reports.  Key features:-  1. Vocabulary using cartoons: Learn over 1200 English words with VocabMagiks vocabulary builder app. Have fun, learning vocabulary words, while you meet wondrous characters like Enigmatic eggs, Glamorous genies, Cowering cows and much more!  2. A great word list that caters to GRE, SAT, GMAT, CAT, SSC, Bank PO, UPSC aspirants as well as anyone looking to improve their English vocabulary  GRE Vocabulary - Test takers preparing for GRE exam must command a high-level vocabulary to achieve a high score. Our word list comprises 1000+ GRE words most frequently occurring in the exam.    CAT Vocabulary - Kick start your CAT preparation by learning 1000+ high frequency words, which will help you ace your verbal ability section.   SAT Vocabulary - SAT needs a different approach to vocabulary building, and we ensure that with our contextual learning approach, you will have to spend little time on the vocabulary section and you can focus better on other aspects of your SAT preparation.    BBA / BBS /CLAT Vocabulary- A large weight age is given to direct vocabulary questions. With VocabMagik, you can easily master your vocabulary for BBA exam /BBS exam / CLAT exam   GMAT Vocabulary - GMAT exam tests your skill needed in business and requires basic vocabulary knowledge for the verbal ability section. We ensure you dont spend a ton of time mugging long wordlists.   UPSC, BANK PO, SSC Vocabulary - You can improve your Comprehension, Interpersonal and writing skills for UPSC exam / BANK PO exam / SSC exam with our fun vocabulary app. We help you prepare for your exam in a fun and efficient way.   Daily Vocabulary - If you are looking to improve your day-to-day vocabulary, our app will help enhance your verbal and written communication.  3. All about the word: Learn anything and everything that you ever wanted to know about a word. We provide information on vocabulary words with meaning, form, pronunciation, synonyms, antonyms, usage and many interesting facts about the word.  4. Unlimited Tests: Take unlimited tests from our data bank of 3500 questions; get detailed progress reports to help you improve English vocabulary.  5. Guided Learning Plan: A guided learning plan designed by experts to ensure you dont have to worry about planning your CAT, SAT, GMAT, UPSC, SSC, BANK PO, CLAT, GRE preparation. We do it all for you, in a manner that these words become part of your long-term memory.  6. Revise words using flash cards: Our flashcards will help you quickly revise words on the go.  7. Many more features: This great mnemonic dictionary offers many other interesting features like bookmarking and searching words.  We hope we are able to help you in your endeavour to improve your English vocabulary. If you have any questions or suggestions, please send us an email at contact@vocabmagik.com. You can also message us directly from the app.   Happy vocabulary building! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.android.vending.BILLING', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.READ_APP_BADGE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_TASKS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.VIBRATE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.sec.android.provider.badge.permission.WRITE', 'com.oppo.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'vocabmagik.sirez.com.vocabmagik.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}