{
"name" : "World General Knowledge : New",
"url" : "https://play.google.com/store/apps/details?id=world.general.knowledge.titli_apps.education.book",
"package" : "world.general.knowledge.titli_apps.education.book",
"category" : "Education",
"description" : "General Knowledge 2020 app is for learning about English General Knowledge at one place. Now you can increase your general knowledge using your android phone. The best part of this general knowledge app is that content of app is in English language. So people in everywhere in World can easily increase their knowledge. General knowledge in English will helps students & professionals to prepare for competitive exams, refreshing the concepts & boosts confidence. With English GK app you can increase your English General Knowledge in very short time. Kids also can learn a lot of form this beautiful Kids GK Book. Current Affairs in various categories also supported now like World , Technology , Science and many more categories with regularly updates . Best General Knowledge App for Complete preparation of NTS test , FPSC and CSS test and ajkpsc test.   Features of app are:  Increase IQ, Animals & birds Body Facts, Politics general knowledgeexpert: measuring your ability Abbreviations, Books and Authors Famous Places Units and Measurements Wonders of the World, World History Seaports, Parliaments Names, ftcegeneral knowledgetest strategy Rivers, general knowledgeband general knowledge quiz World Wars History, World Headquarters Capitals of all Countries and Cities GK Computer, Biology,Psychologyand Physics Gk Currencies of the World Famous Inventions, Nobel Prize Worldgeneral knowledge- science technology 2018 Religion and culture, Religious Festivals Seven Continents, Science Sciences and Scientists, Sports general knowledgetrivia Operating System,Economy GK in English is useful for Interview, Competitive exams like SNAP, NTS, OTS, JTS, CTS, MTS, PTS, GCTS, BTS, UTS and other MBA exams, CSS, Entrance exams, Bank PO, UPSC, IAS and other Public Service Commission Exams. We hope so this app help you to increase your general knowledge. Download, enjoy and dont forget to share it with your friends. If anyone find content that subject to copyright please mail us at trustapps11@gmail.com we will remove it. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}