{
"name" : "4000 Essential English Words 6",
"url" : "https://play.google.com/store/apps/details?id=x.kelynle.studio.words6",
"package" : "x.kelynle.studio.words6",
"category" : "Education",
"description" : "The activities in 4000 Essential English Words are specially designed to make use of important learning conditions. Firstly, the words are introduced using sentence definitions and an example sentence. The activities that follow in the units encourage learners to recall the meanings and forms of the words. Some activities also make the learners think about the meaning of the words in the context of a sentencea sentence different from the sentences that occurred in the introduction of the words. Moreover, each unit ends with a story containing the target words. While reading the story, the learners have to recall the meanings of the words and suit them to the context of the story. Such activities help learners develop a better understanding of a common meaning for a given word which fits the different uses.  Illustrations for each target word are provided to help learners visualize the word as it is being used in the example sentence. These word/image associations aim to help students grasp the meaning of the word as well as recall the word later. It should be noted that words have more than one grammatical category. However, this series focuses on the words most common form. This is mentioned to remind learners that just because a word is labeled and utilized as a noun in this series does not mean that it can never be used in another form such as an adjective. This series has simply focused on the word in the form that it is most likely to be expressed. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}