{
"name" : "Youth Student (1 to 12) Guj & Eng Medium",
"url" : "https://play.google.com/store/apps/details?id=youth.student",
"package" : "youth.student",
"category" : "Education",
"description" : "- Covers Gujarati and English Medium for GSEB APP .  - Covers All Subjects in GSEB Std. 10 i.e. Maths, Science, Social Study ,English(FL & SL),Gujarati(FL & SL),Sanskrit, Hindi, Computer  - Covers GSEB Std 11,12 Science, i.e. Maths, Physics, Chemistry, Biology  - Covers All Subject in Std 12 Commerce i.e. Account, Commerce and Management, Economics, S.P., Statistics, Computer etc.  - Having question bank of more than 1,00,000 questions for both eng & gujarati medium.  - It covers both Textbook MCQ as well as Pervious Year Question Paper MCQ, Very Short Answer (VSA), Long Answer (LA) and MCQs by Experts.  - It has three modes , i.e. Learning Modes, Practice Mode and Exam Modes  - At End Result will be displayed along with Right and Wrong Answer.  The Gujarat Smart Education App helps the students to secure more marks who are studying in SSC and 11 & 12 Science & Commerce Stream in GSEB. This gseb app covers both English and Gujarati Medium GSEB Students along with GSEB Results. In this App we have tried to give students to improve their educational knowledge. By using this App, Students can improve their educational knowledge and secure more marks in their final examinations.  Currently this App provides MCQs of textbook, MCQs of previous year question paper and MCQs of extra practice and all the subject details of Standard 10 i.e. Maths, Science, Social Science, English, Gujarati, Sanskrit As well as in Standard 11,12 Physics, chemistry , Biology and Maths.  In this gseb app, for more practice for students, we are adding questions on regular basis. So the student can study maximum questions answers.  The GSEB APP have Three modes... 1) Learn Mode : In this mode students can do Learning of different subjects as per their requirement  2) Practice Mode : In this mode students can do practice of different subjects as per their requirement  3) Exam Mode : In Exam Mode the students can select Number of Questions for the GSEB ALL MCQ Question Bank and can do exam practice.  At the end of practice student can get the summary also. They can update their knowledge by getting the current answers of their wrong answers.  Overall the Gujarat Smart Education is a great app for the GSEB Students who wants to secure maximum marks in their examinations for Gujarat Education Board  **************************** Youth Student is a one-stop solution for users who want to earn money online.  Make money with zero investment. You can earn rupees daily using this app and work only a Few Minutes in a day.  How to use:-  Download Youth Student application and sign up using your mobile number.  Fill up your profile details to activate your account.  Suggest other people to use and share the link    Earning Type: -  Joining Bonus: Once the user will complete the registration will get the joining bonus points.  Exam Bonus: Earn points by bringing more than 80% result in MCQ exam.   Money Withdraw Option:-  Users will send request to Youth Support Team for redeem the point. and Youth Support Team will contact the user and send payment with in 24 hours in working days   NOTE: All tasks, offers, prizes and rewards given by Youth Student App are not affiliated with Google Inc. The offers are solely sponsored by Youth Student App. All Prizes and or rewards are NOT Google products; and nor do they have any association with Google.   Please send your valuable suggestion to  youtheducation17@gmail.com ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}