{
"name" : "Happy Birthday Cards App",
"url" : "https://play.google.com/store/apps/details?id=cards.davno.bday.en",
"package" : "cards.davno.bday.en",
"category" : "Social",
"description" : "Happy Birthday Cards App lets you send unique and beautiful virtual birthday cards to friends and loved ones.  Just choose from the vast selection of birthday ecards in the app, and send via email, Whatsapp, Viber or social network (youve all seen those birthday cards for Facebook, right?).  Customise your birthday cards with your own messages, or if youre not feeling too creative just send birthday cards with quotes.  Bad at remembering birthdays? No problem, Birthday Cards Free App can remind you to send birthday cards and messages to your friends and loved ones every year!  Of all the birthday cards free apps out there, were sure that ours has the best selection of free happy birthday cards and gif animated images for him, her and for best friends  three categories that are often overlooked by other apps. And yes, we even have birthday cards with pictures of cats...  Theres no birthday party without cake. Happy birthday cake card or animated image is an awesome choice for anyone in your life, from a family member or relative to collegue or co-worker. In our app we have dozens of original greeting cards and gifs with lovely yummy birthday cakes, fancy cupcakes with lit candles, pretty balloons, twinkling lights, celebration confetti and spectacular sparklers. Just download for mobile any of the images and send your warmest birthday wishes to a wonderful person.   If you are searching for a birthday card for her (mother, grandma, sister, wife, girlfriend or female friend) choose the ones with exceptional flowers. What does every woman want to receive on her special day? A beautiful bouquet of flowers! Our flowers birthday cards with gorgeous red or white roses, elegant tulips, graceful peonies or even and exotic flowers with animated butterflies is the best way to make her feel very special.   Is your father, granddad, brother, uncle, husband, boyfriend of good fellow celebrating a birthday today? Do you want to let him know that he deserves all the happiness in the world? Then download and send him an animated gif with sparkling fireworks, colorful gift box, funny dog, glass of wine or beer or just a great abstract background with birthday wishes written on it.  Let the one who lights up your world you love know how you feel special on their important celebration. Choose a fantastic red roses card, an animation with flying hearts or two romantic glasses of wine. Select the best card xpress your love to your sweetheart.  Looking for a bday pic for a friend? Let your dear friend know how much they mean to you with our exquisite bday cards with warmest wishes and humorous and funny illustrations.   Download, install, give it a try and youll never again run out of ideas for birthday cards and wishes. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}