{
"name" : "Yubo: Make New Friends - Meet & Chat Livestream",
"url" : "https://play.google.com/store/apps/details?id=co.yellw.yellowapp",
"package" : "co.yellw.yellowapp",
"category" : "Social",
"description" : "Yubo is a social video live-streaming app to find new friends, chat and text with people just like you, and build a social community based on YOUR interests! Friendship is going live on Yubo! Meet friends nearby or from your college or around the world and go social with our live chat!   1/ STREAM: Go live and stream videos with friends! You can start a live video chat with up to 10 friends, and even invite new friends to join you. Sing, dance, talk about your day, send messages to the friends you love, or play a party game - you can do it all on Yubo.  2/ CHAT: Use the chat feature to say hi to new friends as well as reconnect with old ones. You never know who youll meet on Yubo!  3/ SWIPE: Find new people nearby AND from all around the world in seconds, with a swipe of your finger. Discover new people and find friends easily. Its all about socializing!  4/ FIND A COMMUNITY: Are you into art, games, theater, beauty, yoga, sports, music, dance, travel, manga, cinema or LGBTQ+? There are friends all over the world for you! Discover and connect with the perfect online community, full of friends to meet.  5/ SHARE: Earn rewards for inviting your best friends to join Yubo on Snapchat and other social media. Chat and text online with your friends and share your interests and stories livestream!  6/ PLAY: Have hours of fun playing our Q&A game To Be Honest (go live with questions about YOU and let the people vote on your answers) or guessing pictures in our challenging drawing quiz, Would You Rather and Let Them Guess!  YUBO, THE FREE ONLINE CHAT FOR SOCIAL VIDEO LIVESTREAM & FRIEND FINDER.  - Yubo is the best app to make new friends, find a community, and share your world - LIVE. Like in other social media, you are the messenger of your stories: Discover, connect, and meet new friends via video chat, online text messages, or livestream webcam! - Over 25 million people have already signed up to Yubo to start meeting new friends, so youll never be alone! - New games, tools, and updates every month - and were always listening to suggestions.  Connect this free app easily to your social media and snapchat accounts to expand your social networking and friend profile. Discover all the types of messages and stories you can send (like live video chat or video calling, texting and online messaging, sending pics, playing online games, or screen sharing)! Download Yubo and meet friends to hang out with!  Privacy Policy: https://yubo.live/legal/privacy  Terms of Service: https://yubo.live/legal/terms  Yubo is free to download and use. However, we also offer an optional subscription package (Power Pack).  If you need any help with Yubo, make sure to visit our Help Center (https://support.yubo.live). You can contact us from there! You can also reach us on Instagram: @yubo_App! We cant wait to meet you! We love receiving feedback from the Yubo community, and we use it to continuously make our app better! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}