{
"name" : "Tapatalk - 200,000+ Forums",
"url" : "https://play.google.com/store/apps/details?id=com.quoord.tapatalkpro.activity",
"package" : "com.quoord.tapatalkpro.activity",
"category" : "Social",
"description" : "Tapatalk is the mobile home to over 200,000 online forums worldwide. On Tapatalk, you will be interacting with like-minded individuals to develop meaningful conversations on the topics that interest you. Youll never have to wait until you get home to upload the fun images to your favorite forums. Instant push notifications will allow you to never miss out on any topics update.   Tapatalk is Free. Sign up to VIP to remove ads for $.99/month.   Here are some of the top sites available in Tapatalk:  MacRumors Forums VWvortex  Watchuseek Cruise Critic M3Forum Operation Sports Adventure Rider LXForums Pentax Photography Forums ThePhotoForum.com iMore Bimmerforums.com Focus ST CyanogenMod Archery Talk Apple iPhone Forum Audizine MTBR.com AnandTech Forums AVForums Reef Aquariums REEF2REEF BigSoccer Mobile Phone OS Forum Jeep Garage - Jeep Forum RootzWiki HowardForums.com BladeForums.com RCGroups.com EDCForums.com AVSforum Kodi Guru Gossip IGN Boards ReefCentral Natural Mamas Spacetime Studios GSM-Forum ( gsmhosting ) Windows Central RWI Swedespeed Germans Club WoodyCraft MoDaCo The Rolex Forums Audi-Sport.net NotebookReview.com IronMag Forums Pelican Parts Forums GolfMK6 The Outdoors Trader The Garage Journal SamMobile SmartCanucks The Two Plus Two Forums Plex Forums TZ-UK VW Audi Forum MyBroadband Sinisterly LinusTechTips Expedition Portal Bimmerfest SA 4x4 Community Forum Bushcraft USA Badger & Blade DODGE RAM FORUM skyscrapercity Smith & Wesson Forum BigFooty.com Hammock Forums DefensiveCarry.com CrackBerry Forums Civinfo Waze Forum BMW Forum: BMWLand Xiaomi Europe Support Lipstick Alley The High Road Practical Machinist Professional Muscle Candlepowerforums Detailing World Brave Frontier Forum Psych Central Overclock.net 2CoolFishing The Firing Line GmFullsize.com m4carbine.net AnabolicMinds 1911Forum Debate Politics Forums THCtalk OPPO Forums Everything iPhone Audiokarma iPad Forums OpenCarry.org R3VLimited Forums UG Bodybuilding NASIOC The Gear Page ASUS Forums The Shave Nook Westeros.org svtperformance.com BariatricPal Fourtitude iFans Market Militia FerrariChat.com Tenerife Forum Driftworks PowerStrokeArmy Total War Center Feed The Beast Vaping Underground UK-Muscle XDtalk.com - XD Gun Forum Baby Bargains & Baby 411! Survivalist Boards HeliFreak.com Personality Cafe The Planted Tank Evolutionary.org Forums FT86Club BMW Fanatics Zilvia.net RealGM Blu-ray.com forums Tacoma World GM-Trucks.com AlpineZone Muscle Research Forums EcoCityCraft Airbrush Forum Tech Support Guy Volkswagen Owners Club Jetcareers.com The Hobby-Machinist.com RTI INDIA SuperMoto Junkie Epic Games Forum BRISKODA.net InsanelyMac Indian Real Estate Forum Trouble Free Pool Texasbowhunter.com Digital Photography School BMW 5 Series Owners Board Student Doctor Network ModMyi Toyota 4Runner Forums The CABE ArboristSite.com Mustang Forums Jeepsunlimited.com Galaxy S4 Forums WebDesignForums.net Clash of Gem Stargazers Lounge UK Vapers Nikonites - Nikon Forum NerdFitness Rebellion HQ XBMC HUB GolfMKV PremierReef The Iron Den Photography-Forum.org Multitool.org Planet of the Vapes Cruise Addicts E46Fanatics RCCrawler SXOC Bulletin Board S3forums.com FPVLAB CNCzone.com VXR online SEATCupra.net PakWheels.com CAMARO5 Welding Web Mighty Car Mods RoadBikeReview.com Lifehacker www.itdunya.com EliteFitness legacygt.com babybmw.net Festool Owners Group HVAC-Talk GameGuardian Head-Fi ducati.org OpenELEC.tv Archery Addix  Tapatalk is absolutely free, but to support us, you can also purchase VIP status that will allow you to view Tapatalk ad free. VIP status is US$0.99 per month subscription, and will auto-renew until you elect to cancel. If you are interested in purchasing VIP status, go to Me>Settings, and scroll down to Advanced Options to subscribe. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.USE_CREDENTIALS', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WAKE_LOCK', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}