{
"name" : "Dinosaur Hunting- Dino FPS  Shooting & Hunter Game",
"url" : "https://play.google.com/store/apps/details?id=com.dino.hunting.real.dinosaur.hunt.best.sniper.shooting.games",
"package" : "com.dino.hunting.real.dinosaur.hunt.best.sniper.shooting.games",
"category" : "Social",
"description" : "Dinosaur Hunting - Deadly Dino Safari Hunter Game is a deadly dinosaur hunting game. 3D shooting master gives you an opportunity to encounter deadly 3D dinosaurs in the Real Dino hunting game with sniper shooting 2020. Lets enjoy and play real dinosaur hunting free with shooting adventure games of 2020. In FPS dino Hunter you are needed to play tactfully using Dino Hunt & modern sniper shooter. You have to adopt both offensive, attack and defensive mechanism while hunting savage dinosaurs games simulator. You may also face deadly Dino attack during hunt. So, rapid-fire on carnivores dinosaurs upon sighting.This dinosaurs game (2020) is full of shooting thrill, and it is a complete shooting adventure with sniper legacy for dinosaur hunters. You can become a real dinosaur hunter of Africa, America, Europe or anywhere on earth with through this dinosaur hunter game, for there are no more living dinosaurs on earth anymore. Dinosaurs Games is the high-end shooting game. This safari dinosaur hunting games a dinosaur hunting simulator to hunt dinosaurs in jungle, mountains, deserts, safaris,lagoons, polar and even in Jurassic islands. Dinosaur Safari Hunter - Dino Hunting 2020 Game is a real hunting game for shooting deadly dinosaurs hunter.  Real Dino hunting Carnivorous dinosaur hunt 2020 is like an unexplored expedition within the Jurassic island and world adventure & sniper legacy 2020. Its nor less than the experience of camping in the jungle, where you have to be alert, all the time with sniper games 2020. It has mountains dinosaur hunting tasks within the glaciers and deadly peaks to make animal hunting more interesting. Dino hunting 2020 is basically a dangerous dinosaur hunting and first-person shooting game & Royale with real fps battle. It is best hunting game for free carnivores dinosaurs shooting.  Dinosaur Hunting Game Enjoy dinosaur hunt simulator in 2020 with best flying dinosaursgame. We have the living virtual specimens of real dinosaurs for hunting in this Dinosaur hunting game. In our real dinosaur shooting 2020 dinosaurs hunting game, you can meet and hunt different kinds of ancient dinosaurs simulator and deadly shores.  Dinosaur new game 2020 consists of different levels in which you have to perform the role of dinosaursassassin with sniper shooting, but it is made to enhance the mountain sniper shooting skills. So, you have to work as a sharp sniper shooter and aim the head shot, lung, brain and heart to save yourself and rescue hostages and revenge if there are any dino battle simulator. Your weapons will be short gun, hunting knife, riffle and dagger. Use your best shots to be a predator instead of pray, and build your arsenal with every new level in sniper hunting with Dinosaurs Challenge.  Dinosaurs Hunting - Dino Hunter Challenge 2020 key features:  Real FPS Sniper Battle 2020  HD audio  Anti-cheat mechanism  Aim setting  Immersive environment  Sniper shooting challenge  Assault mode challenge  Jaw dropping high quality visuals  Dinosaur Hunting - Deadly Dino Safari Hunter Game is although a new game of hunting and shooting dinosaurs, but it is a real dinosaur simulator 2020. So, download our best hunting game and enjoy dinosaur game adventure, and dont forget to rate and review our best hunting dinosaurs game. Thank you. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.INTERNET', 'com.dino.hunting.real.dinosaur.hunt.best.sniper.shooting.games.permission.C2D_MESSAGE', 'com.oppo.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION']",
}