{
"name" : "Daily Status Saver",
"url" : "https://play.google.com/store/apps/details?id=com.incognisyssolutions.dailystatussaver",
"package" : "com.incognisyssolutions.dailystatussaver",
"category" : "Social",
"description" : "Wonder how you can download your Friends Status??? Well, this App will make your life easier to download the Photo or Video Statuses/Stories  Application Features  - Clean Design and Smooth Functioning - View the Photo and Video Status from multiple supported apps mentioned below - Download or Save single/multiple statuses by long pressing a photo or video status - View the status downloaded from within the app itself instead of searching for the same in Gallery - Repost or Share the status with your friends on any social media platform - Integrated photo gallery to view the downloaded photos by swiping forward and backward - Integrated Video player with multiple functionalities to watch the video within the app itself - If a status is no more required you have the right to delete it right from within the app itself - ALL THE PREMIUM FEATURES ARE FREE TO USE  Supported Apps Here is the list of supported Apps/Environments: 1. Normal Statuses WA 2. Business Statuses WA 3. GB Statuses WA 4. Parallel Space Pro Statuses WA 5. Parallel Space Lite Statuses WA  How to use this App? Step 1:- View/Open the desired status/story from any of the apps mentioned above Step 2:- Long Press on any of the photo or video to select the ones you wish to save to your phone or directly share with your friends  Step 3:- If you wish to view the photo or video inside this app then single tap/click on the photo or video and you will see the enlarged photo or the video player respectively  Yes... Its that simple to use this App. So what are you waiting for??? Download the app and start saving the Statuses/Stories and making some awesome memories...  If you encounter any bug/error in the App feel free to drop us an email with the description of it or a relavent screenshot at thetechtalks17@gmail.com.  If you feel the App is worth then dont forget to give us 5 Stars. Thank You ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'com.incognisyssolutions.dailystatussaver.TASKS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'com.incognisyssolutions.dailystatussaver.TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
}