{
"name" : "DeviantArt",
"url" : "https://play.google.com/store/apps/details?id=com.deviantart.android.damobile",
"package" : "com.deviantart.android.damobile",
"category" : "Social",
"description" : "Simply put: The Worlds Largest Art Gallery In Your Hand.  DeviantArt is the largest online social community for artists and art enthusiasts, allowing people to connect through the creation and sharing of art. We entertain, inspire, and empower the artist in all of us.  The DeviantArt mobile app moves the experience to hand-held devices exposing a full range of exciting, fresh, culturally relevant content from traditional media of painting, drawing, photography and sculpture to digital art, pixel art, anime and fan art. Browse endless streams of content as well as communicate with and submit to the community 24/7 with the DeviantArt mobile app.  Bleed and Breed Art.  Features:  Today Page  every day, the editorial team will draw from and reflect back to the community a vibrant combination of news, features, curations and conversations.   Whats Hot, Undiscovered, Daily Deviations and Explore  give you ways to liberate and inspire yourself with extraordinary images drawn from an art collection powered by over 32 million artists and curators on DeviantArt. Features like More Like This associate images through member-curated Collections to provide endless entertainment and inspiration as you travel through the app by browsing layers of similar art.   Status Updates  post short updates in a simple and direct format that lets you create informal conversations with your watchers. Use these to share how youre feeling, what youre thinking, what youre working on, or to share the work of an artist you love.   Watch Feed  a personalized and easy to access feed of every Journal, Collection, or Status Update posted by your watchlist.   Notifications  the communication center of the app where you manage all mentions, replies and other messages. This feature is similar to the websites Message Center.   Submit  submit art and literature to DeviantArt or compose a status update to initiate rich visual conversations. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_CALENDAR_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}