{
"name" : "Whats Tracker Chat",
"url" : "https://play.google.com/store/apps/details?id=com.wtchat.app",
"package" : "com.wtchat.app",
"category" : "Social",
"description" : "Join the perfect Social chatting app! Chat with new people.  Chat & meet new friends around you. WT Chat is an easy accessing social and chatting app to meet new people around you. Explore yourself & get connect with your nearby friends. Simply like the post or pass on the other people with this dating app.  WT Chat helps you to find new people nearby who share their interests and want to chat now! Its a fun, friendly, and free chatting app where you could connect with local guys. Its an easy & new social media app that offers a platform to explore yourself securely. You will get real users & real avatar. Like in any other social media app, you could send a request or post your own content that will disappear automatically after 24 hours.   The unique & main feature of the WT Chat app is that you can also check your profile visitor who visits your profile. Lets explore some more features.  WT Chat features:   Easy to use:Just one-step registration, you can see the nearby people, recommending people to you according to your preferences, age and interests.  Chat: Chat with nearby friends and check message status - sent/delivered/read. Along with chat, you can send an attachment.  Public timeline: You can add a timeline in your profile to explore yourself in the app, only your friends can view, like or comment on your timeline.  Nearby: Searching for new friends by distance, whether the distance is near or far away, search for people as per your taste.  Friend Request: In this social chat app, you could send or receive the friend request. It depends on you to accept or reject.  Profile visitor: You will be notified in the notification section about the visitors who visit your profile at the same time.  Interested In: Get nearby people according to gender-based choice.  Search: Search user by user name, city, state and country.  Notification: Get notified with the push notifications and keep yourself updated.  VIP Services: In this feature, you will get remove ads, search user unlimited & gender filter cost-effective services.  Block Users: Dont want to be connected with the particular person! Simply use the block option.  Report Abuse: In case if you feel anything wrong or someone abused you, simply report complains about this option.  Feedback: Give your feedback to us to add more improvement in the service.   User Privacy:  You can enable/disable read receipt, last seen and profile visitor feature from app setting  Users cannot save chat media in storage only can view it.  Screenshots not allowed in this app  User can delete message include media after sent ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_APP_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.RECORD_AUDIO', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.READ_PHONE_STATE', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'com.android.vending.BILLING']",
}