{
"name" : "Divorcee Matrimony - Exclusive Second Marriage App",
"url" : "https://play.google.com/store/apps/details?id=com.divorceematrimony",
"package" : "com.divorceematrimony",
"category" : "Social",
"description" : "An exclusive Divorcee Matrimony App for those seeking to remarry. Divorcee Matrimony App enables you to find the perfect life partner. Divorcee Matrimony App has a wide range of profiles from different religions or caste or sub-caste.  DivorceeMatrimony is a part of CommunityMatrimony from Matrimony Group - an exclusive community oriented service for shaadi. Thousands of people from several Indian communities have found their perfect life partner through our Divorcee App.  Features of Divorcee Matrimony App :  Free Registration Safe and Secure APP. 100% privacy guaranteed Find your life partner at your convenience User Friendly Interface and Features for easy partner search  Get instant notifications when a partner communicates  Express your interest to shortlisted prospective matches Shortlist and save potential matches Know who viewed & shortlisted your profile  Search from 1000s of NRI profiles across the globe Indias most trusted Divorcee Matrimony services App  Find your partner from our other Regional Apps such as Tamil Matrimony, Kerala Matrimony, Urdu Matrimony, Punjabi Matrimony, Hindi Matrimony, Bengali Matrimony, Gujarati Matrimony, Kannada Matrimony, Marathi Matrimony, Marwadi Matrimony, Oriya Matrimony, Telugu Matrimony, Assamese Matrimony, Parsi Matrimony and Sindhi Matrimony.  Divorcee Matrimony App comprises of eligible brides and grooms from Adidravidar, Agarwal, Aryavysya, Balija, Baniya, Bhumihar, Brahmin, Buddhist, Chettiyar, Christian, Devanga, Ezhava, Iyengar, Iyer, Jain, Jatav, Jat, Kamma, Kapu, Kayastha, Keralachristian, Khatri, Konguvellalar, Lingayath, Maheshwari, Maratha, Mathur, Mudaliyar, Muslim, Nadar, Nair, Padmasali, Pillai, Rajput, Reddy, Saraswat, Sengunthamudaliyar, Sikh, Sonar, Sourashtra, Thevar, Vaishnav, Vanniyar, Vishwakarma, Viswabrahmin, Yadav and 350 other communities. We provide other exclusive apps through our 40Plus Matrimony, Manglik Matrimony and Defence Matrimony. Our Divorcee Matrimony app helps you in finding your Shaadi that best matches from your community.  We cater to all Religions and Communities. Globally, we are the preferred NRI Matrimonial Service provider for aspiring brides and grooms to find their perfect partner, especially for NRI communities spread over USA, Canada, Middle East, Bahrain, Kuwait, Oman,Qatar, Saudi Arabia, Australia, Singapore, Malaysia, Srilanka, United Kingdom, London, France, Germany, New Zealand and others Globally.  Profiles are registered from cities across the country and globe such as Bangalore, Chennai, Hyderabad, Mumbai, New Delhi, Kolkata, Abu Dhabi, Dubai, Vishakapatnam, Goa, Thiruvananthapuram, Coimbatore, Madurai, Ernakulam, Mysore, Kottayam, Kanyakumari, Salem, Thane, Kozhikode, Tiruchirappalli, Thrissur, Guntur, Wayanad and many more.  Apart from Divorcee Matrimony Services, we also provide other Exclusive Apps like 40Plus Matrimony, Manglik Matrimony, Any Caste Matrimony, Ability Matrimony and Defence Matrimony.  The DivorceeMatrimony App is the most reliable place to find your Shaadi.  We have been instrumental for Thousands of successful marriages. We make your partner search simple and easy with our extensive features in our App. You can search for partners from accross the globe.  We are the most trusted Matrimony website among divorcees.  Our app ensures your privacy and it is 100% secure app for shaadi.  Download DivorceeMatrimony App Now! Register FREE!  Discover your perfect life partner! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.divorceematrimony.permission.MAPS_RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.GET_TASKS', 'android.permission.CALL_PHONE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'com.divorceematrimony.permission.MAPS_RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.SEND_SMS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}