{
"name" : "Hide Something 🥇 photos, videos",
"url" : "https://play.google.com/store/apps/details?id=com.colure.app.privacygallery",
"package" : "com.colure.app.privacygallery",
"category" : "Social",
"description" : " The Easiest and Highest rated hiding tool!    New feature: One click to browse your phones invisible photos with desktop browser!  Hide photos, pictures and videos from your gallery. EASY, SIMPLE and FREE!  It gives you control of who sees what and help protect your privacy. With Hide Something,  Your public gallery remains available to your friends, family, and coworkers. And your hidden images are only available for yourself.  You can customize your visible folders when you want to show different photos to different people.  You can share your photos and videos easily, even hand over your cell phone to others and no worry about your privacy.  Features:  Fingerprint, Pattern or PIN lock! Choose your favorite.  Directly hide files from third party applications by Share. e.g., Gallery, Browser!  One click to browse phones invisible photos in desktop browser.  Backup hidden files to Google drive.  Photos, Videos, Google+ photos... all of those files are supported.  Advanced image viewer displays pixel level of details.  GIF is supported.  Beautiful themes.  Fake mode can protect your privacy for unexpected checks.  Easy to share your private photos/videos to others.  Doesnt show up in recently used apps list.  Support for both phone and tablet.  More features are coming.  Easy to Use: Step 1: Choose photos or videos which you want to keep in privacy and hide them. Step 2: Using pattern lock to access your hidden photos or videos. Step 3: Choose the hidden photos or videos to restore.  Problems? Please contact us at coliferlab@gmail.com first before leaving a bad review. We will fix the issues for you as soon as we can. Suggestion? Please also shot us an email. Your ideas may be present in our next version. Thanks!  What our developers said: Personally, I tried to find a private gallery app on market, but I got disappointed after trying several ones - they are non-holo styled, slow and too complex. So I made this one by myself - a CLEAN, SIMPLE and BEAUTIFUL one. Hope youll like using it .  Online Help Problem with password? Check the help below: http://bit.ly/pg_help  Permissions: Read/Write external storaga - read and write media files. Use fingerprint - let you use fingerprint to unlock your app. Access internet - backup or restore media files to Google drive. Access coarse location - required by Google admob ads. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.USE_BIOMETRIC', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}