{
"name" : "The Guest - Photo Sharing",
"url" : "https://play.google.com/store/apps/details?id=com.veri.veri",
"package" : "com.veri.veri",
"category" : "Social",
"description" : "Getting married? Throwing a big event? Automatically get all of the photos and videos guests take at your wedding, reception or celebration with The Guest by The Knot! No uploading, no tagging, no separate camera apps. With The Guest (formerly known as Veri), all guests need is their normal Android camera to join in on the photo-sharing fun.  Simply create an event, invite guests via phone number or email address, and The Guest does the rest for free! As soon as an event begins, The Guest will start sharing photos and videos guests are taking with their Android cameras in real time as they take them.  Use The Guest To:   + GET EVERYONES PHOTOS & VIDEOS - Wedding guests take 2000 pics on average which the newlyweds will never see. Since The Guest automatically shares wedding pics and videos as guests take them, youll never have this issue!  + SAY BYE TO UPLOADING AND SEPARATE CAMERA APPS - Guests use their normal Android camera, and photos & videos are instantly auto-shared to everyone whos part of an event! Guests are in-control of their content, and can delete their pics or pause their auto-sharing at any time.   + ACCESS FULL-RESOLUTION PHOTOS & FULL-LENGTH VIDEOS - Everyone can download any -or all!- of an events photos and videos in full resolution.  + GET EVERYTHING INSTANTLY - No waiting weeks to get your wedding pics. With The Guest, photos & videos are shared in real time.  + HAVE A BEAUTIFUL WEB ALBUM - Everyone can see, download and share all of the photos in the apps event or in the web album The Guest automatically creates.   +SHOW LIVE WEB SLIDESHOWS - Display an events photos and videos on any screen as a live slideshow with just one simple web link.  +RELIVE IT WITH MAP VIEW - Guests can see where they went during an event with a completely private, real-time map view  + ATTEND FROM ANYWHERE - Guests who couldnt make it to an event in person can follow along in real time via The Guest.   What real couples are saying:  The Guest is a must-have for every event/trip and shared moments! We used it twice. For our friends wedding and for our wedding. So glad we had it! It was so much fun having our friends shots and moments in real time. It was like living our reception from everyones perspective! - Melanie R.  We literally have pictures with everyone who came to our wedding thanks to this app. I highly recommend using this if youre having a wedding or any event you want lots of pics of. Loved having this!! - Brian S.  Made sharing wedding pics so easy. Perfect for special days. Loved it. - Nikki M.  Questions, suggestions or feedback? Reach out to feedback@veri.com. We read and reply to every email. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_CONTACTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'com.veri.veri.permission.C2D_MESSAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.REQUEST_INSTALL_PACKAGES']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}