{
"name" : "KeralaMatrimony® - The No. 1 choice of Malayalis",
"url" : "https://play.google.com/store/apps/details?id=com.keralamatrimony",
"package" : "com.keralamatrimony",
"category" : "Social",
"description" : "Say hello to the official Kerala Matrimony android app.  Kerala Matrimony is pioneered by BharatMatrimony  the worlds most trusted matrimony portal. At Kerala Matrimony we have facilitated many successful marriages for the Malayalamspeaking community for years.  We have built our App for unbeatable performance. It boasts of an easy-to-use interface that seamlessly functions to help you search and find your perfect life partner. We have a list of interesting features that will help you quicken your partner search:   Registering and creating your profile can be done right within the App.  Sign up using Facebook too.  Search for partners from a huge list of Kerala brides/grooms.  Refine your search results to narrow down on profiles that you wish to shortlist.  Search profiles with Matri ID.  View profiles, photos, phone numbers of Malayali members.  Mark and save profiles that get your attention, for later viewing.  Stay connected with prospective Kerala matches on-the-go.  Take your chat wherever your go with the cool Chat feature.  Want to find a match closer to your location? Simply use the GPS-enabled City Search feature.  Do you wish to initiate a conversation with a prospective match? Send interests or personalized messages from within the App.  Be assured that your information will be kept private with us.  And guess what! The App is very light and uses minimum storage space on your phone!  We have helped happy marriages happen across different Malayalam-speaking communities such as Nair, Ezhava, Christian - Roman Catholic, Thiyya, Vishwakarma, Muslim - Shafi, SC, Muslim - Mapila, Christian - Latin Catholic, and Christian - Marthoma.  Looking to search for a bride/groom based on Religion? We have matches from all religions including Hindu, Christian, Muslim, Christian Catholic, Christian Orthodox, Christian Protestant, Muslim Sunni, Muslim Shia, Muslim Shia, and Inter Religion.  Globally, we are the preferred NRI matrimony service provider for aspiring brides and grooms to find their perfect partner, especially for NRI communities spread over United Arab Emirates, Saudi Arabia, Qatar, United States of America, Oman, Kuwait, Bahrain, United Kingdom, and Australia.  Our top registrations come from States namely Kerala, Karnataka, Tamil Nadu, Maharashtra, Delhi, Andhra Pradesh, Gujarat, Texas, New York, and California and from cities namely Ernakulam, Thiruvananthapuram, Thrissur, Kollam, Alappuzha, Kozhikode, Kannur, Kottayam, Palakkad, and Bangalore.  There are also profiles from different professions/occupations such as Software Professional, Technician, Engineer - Non IT, Manager, Executive, Supervisors, Accounts / Finance Professional, Nurse, Officer, and Administrative Professional.  With such a large database of profiles and advanced search criteria, you are sure to find the most perfect life partner.   BharatMatrimony has been featured in the Limca Book of World Records for the highest number of documented marriages online. It has been conferred with numerous national and international awards for its pioneering spirit, vision, and continuous growth through its path-breaking and innovative excellence. Some of the accolades include:    One of the 100 Most Innovative Companies Globally as recognized by Red Herring  Most Trusted Online Matrimony award by The Brand Trust Report  NDTV-Hindu Lifestyle Award for the Best Community Matrimony Website  Ranked twice in Top 50 Fastest Growing Tech Companies in India by Deloitte  The Most Visited Matrimony Portal in the World by Comscore  Your privacy is a top priority for us at all times, so feel safe. Use our 100% secure app to find your best match and enjoy a happy shaadi..   Download the App today for FREE and go mobile in your search for your life partner! ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}