{
"name" : "Birthday Reminder - Anniversary , Event Reminder",
"url" : "https://play.google.com/store/apps/details?id=com.birthday.event.reminder",
"package" : "com.birthday.event.reminder",
"category" : "Social",
"description" : "This free app reminds you of your friends and familys birthdays, anniversaries and other important dates. Its simple and we respect your privacy.   Youll never forget an important day anymore. Birthdays can be entered manually, or synchronized with your contacts. Duplicates are automatically removed.  Get your birthday calendar now for FREE:  Reminder on all birthdays (birthday alarm)  Import phone contacts  Free Beautiful greeting cards  Place for all your gift ideas  Be the one who remembers all birthdays! Import friends and colleagues from your phone contacts or easily create them with this birthday calendar. Get notified on their birthday, congratulate SUPER FAST via WhatsApp, facebook or send a beautiful greeting card.  Do you know the embarrassing feeling of forgetting someones birthday? Waking up and realizing yesterday was your grandmas important day? This will never happen to YOU again if you download Birthdays now   Reminder for every birthday You get reminded on all special days with a birthday alarm at the exact right moment. You decide whether you want to get a notification in the morning or after coming back home in the evening. Get a notification on the day itself and, if desired, a few days in advance.   johns birthday is today. He turns 33. Birthdays tells you whose day is about to come, the age and your gift ideas. With just one tap you can wish happy birthday directly via WhatsApp or call the birthday child via phone.   Say Happy Birthday with a greeting card Be special and impress your friends! Write your birthday wishes on one of the beautifully designed greeting cards and send them within seconds e.g. via WhatsApp. Birthdays is the only app of all birthday apps offering you greeting cards.   Write down gift ideas Ed Sheerans tickets for your friend? A blanket with your girlfriends name? Write down gift ideas whenever they come to your mind. Never forget a great idea again.   Widgets With handy widgets on your home screen you have all special days in sight. Got a good gift idea? Tap on the widget and youll be right in the app to capture the idea or wish happy birthday. Always know which friends special day comes up next.   Built in age calculator You dont know the birth years of your friends? No problemo amigo , just type in how old they are and the magic calculation is done for you. Most birthday apps let you struggle with figuring out the age  not this app!   Privacy is our priority  Read and write contacts: Required to import contacts on your request.  External storage: To backup the app on your phone.  Start automatically after booting: Start the birthday alarm after phone boot up.  Your data is super secure. All events are only stored on your phone. (*) some features require Birthdays Premium  Tags #birthdayreminder #birthdayreminderapp #eventreminderapp #birthdayandeventreminder #birthdayreminderwithalarm #birthdayreminderfromfacebook #birthdaygreetingcard #anniversaryreminder #anniversaryreminderapp #weddingeventreminder #workanniversaryreminder #gettogatherreminder #birthdayalarm ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['oppo.permission.OPPO_COMPONENT_SAFE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_CONTACTS', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.permission.external_app_settings.USE_COMPONENT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['oppo.permission.OPPO_COMPONENT_SAFE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'com.huawei.permission.external_app_settings.USE_COMPONENT', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}