{
"name" : "Swahili Audio Bible",
"url" : "https://play.google.com/store/apps/details?id=com.WordProject.HolyBible.sw",
"package" : "com.WordProject.HolyBible.sw",
"category" : "Social",
"description" : "Notice: This APP offers audio streaming directly from our servers. If you ever experience interruption in audio streaming or download, please try again later or another day. Although this is rare, it is possible that the server may be under maintenance and offline for a time. Always try again. Thank you.   Advantages: - Completely free and without advertising. - Very fast and easy to navigate. - Audio for all chapters can be downloaded and listened to offline - Biblical text included. Other languages downloadable. - Section of selected verses by topic - which includes its audio.  [This is a New version of the Wordproject app - now available with continuous play - that is, chapters play continuously as in a playlist - transforming your device into a neat audio player]  Now you may read and listen to the Bible in your mobile device through this comprehensive application put together by Konstantinos Bezanis and the WordProject team.  The application offers the Holy Bible (Text and Audio) in Swahili and 35 of the most wide-spoken languages of the world [Downloadable]: English, Hindi, Arabic, Portuguese, Spanish, French, Indonesian, Russian, Japanese, Korean, Italian, German, Chinese, Turkish, Vietnamese, Amharic, Thai, Persian, Urdu, Bengali, Gujarati, Kannada, Malayalam, Oriya, Punjabi, Marathi, Telugu, Tamil, Serbian, Czech, Polish, Romanian, Somali, etc. This application offers audio narrations, not dramatized versions. Portuguese narration in European Portuguese.  The application comes with the default in Swahili and all other languages are easily and automatically installed with one click, according to the needs of the user. The text in any language takes 30 seconds or less to download and gets automatically installed, you just need to have your device connected through Wi-Fi. Audio chapters can be streamed, and heard in any language when you are connected to Wi-Fi, or may be download into your device for use offline anytime, anywhere.  The audio download is available book by book, which means that even if you have limited space, you can download a book (i.e. Genesis), use it for awhile, and then uninstall it and download a new one - this can be done in any of the 36 languages available with both text and audio. If you have plenty of space in your device, then you may download the whole Audio Bible - if you wish to.  To use the audio continuous play option more effectively, please note that you should set the app to continuous play (on the settings page), and we recommend that you activate the Screen On option. In many devices the screen needs to be always on for the audio continuous play to be in effect. In that case, we also recommend that you use the brightness level available on the same page, to adjust the brightness to a minimum. That way you can enjoy listen to the Bible for several hours and keep your battery. Of course if you plug your device to the power outlet you can listen to the Bible all day  The purpose of this application is to make the Word available to as many people as possible, so new languages might be available in future versions.  For more audio and text Bibles, please visit the original Wordproject site: http://www.wordproject.org ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_SETTINGS', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
}