{
"name" : "Tyagi Matrimony - Tyagi Marriage & Wedding App",
"url" : "https://play.google.com/store/apps/details?id=com.tyagimatrimony",
"package" : "com.tyagimatrimony",
"category" : "Social",
"description" : "Tyagi Matrimony App from Community Matrimony is a part of MATRIMONY.COM Ltd. Our app enables Tyagi community members from Uttar Pradesh and around the world to find Tyagi brides and grooms. TyagiMatrimony.com is a community matrimony app, where matrimonial services are provided exclusively for the Tyagi community.  The Tyagi matrimony app has been designed to help you find the most compatible matches according to the customs and traditions of your family and community because we understand that you have specific preferences while choosing a life partner.  You can find Tyagi brides and grooms from different sub castes religions, professions, lifestyles and also from various locations around the globe in our app. You can find compatible matches who work in the same profession as you. This can lead you to have a happy Shaadi with someone who appreciates what you do. Thousands of Tyagi brides and grooms have found their best match in our app as per their preferences.  Tyagi Matrimony App Features include:   Free Registration  Safe and Secure APP. 100% privacy guaranteed  Find your life partner at your convenience  User Friendly Interface and Features for easy partner search   Get instant notifications when a partner communicates   Express your interest to shortlisted prospective matches  Shortlist and save potential matches  Know who viewed & shortlisted your profile   Search from 1000s of NRI profiles across the globe  Indias most trusted Tyagi matrimony services app   Tyagi Matrimony features registered user profiles from India and other countries including United States of America (USA), United Kingdom (UK), United Arab Emirates (UAE), Canada, Australia, Qatar and many more.  We also have registered members from cities and towns such as Delhi, Ghaziabad, Saharanpur, Muzaffarnagar, Gurgaon and many more.  We understand that your personal details and privacy are important to you and hence have taken a number of steps to ensure a safe matrimonial experience. All our members profiles are mobile verified. You can choose to protect your photo.  Finding the ideal life partner leads to a joyful Shaadi. We wish you the best in finding your perfect match in our app. Download the TyagiMatrimony App now and find your special someone! REGISTER FREE! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.CALL_PHONE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'com.tyagimatrimony.permission.MAPS_RECEIVE', 'android.permission.GET_TASKS', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.CALL_PHONE', 'android.permission.SEND_SMS', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.tyagimatrimony.permission.MAPS_RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
}