{
"name" : "Community Matrimony App - Marriage & Matchmaking",
"url" : "https://play.google.com/store/apps/details?id=com.community.matrimony",
"package" : "com.community.matrimony",
"category" : "Social",
"description" : "CommunityMatrimony - is an exclusive community based Matrimony Service from Matrimony Group which has been involved in helping thousands of people from different Indian communities find their perfect life partner.  Have any questions/concerns? Our helpline 1-800-3000-2222 (toll free) is open 24/7 to assist you.  Community Matrimony App FEATURES :  Free Registration Safe and Secure APP. 100% privacy guaranteed Find your life partner at your convenience User Friendly Interface and Features for easy partner search  Get instant notifications when a partner communicates  Express your interest to shortlisted prospective matches Shortlist and save potential matches Know who viewed & shortlisted your profile  Search from 1000s of NRI profiles across the globe Indias most trusted Community Matrimony services App from Matrimony.com Limited  Find your partner from our other Regional Apps from Matrimony.com, Tamil Matrimony, Kerala Matrimony, Urdu Matrimony, Punjabi Matrimony, Hindi Matrimony, Bengali Matrimony, Gujarati Matrimony, Kannada Matrimony, Marathi Matrimony, Marwadi Matrimony, Oriya Matrimony, Telugu Matrimony, Assamese Matrimony, Parsi Matrimony and Sindhi Matrimony.  CommunityMatrimony App comprises of eligible brides and grooms from Adidravidar, Agarwal, Aryavysya, Balija, Baniya, Bhumihar, Brahmin, Buddhist, Chettiyar, Christian, Devanga, Ezhava, Iyengar, Iyer, Jain, Jatav, Jat, Kamma, Kapu, Kayastha, Keralachristian, Khatri, Konguvellalar, Lingayath, Maheshwari, Maratha, Mathur, Mudaliyar / Mudaliar, Muslim, Nadar, Nair, Padmasali, Pillai, Rajput, Reddy, Saraswat, Sengunthamudaliyar / Senguntha Mudaliyar, Sikh, Sonar, Sourashtra, Thevar, Vaishnav, Vanniyar, Vishwakarma, Viswabrahmin, Yadav and 350 other communities. We also provide services to divorcees through our divorcee matrimony app. Our CommunityMatrimony apps helps you in finding your Shaadi that best matches from your community. Through our community matrimony app you can also find manglik matches .  Community Matrimony App comprises of thousands of NRI prospective brides and grooms living in USA, Canada, Middle East, Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, Australia, Singapore, Malaysia, Srilanka, United Kingdom, London, France, Germany, New Zealand and others globally.  We have profiles in cities across the country such as Chennai, Bangalore, Hyderabad, Mumbai, Delhi, Pune, Coimbatore, Ernakulam, Thiruvananthapuram, Thane, Thrissur, Kollam, Madurai, Kottayam, Salem, Alappuzha, Vellore, Ahmedabad, Guntur, Tiruchirappalli, Erode, Kolkata, Palakkad, Tirunelveli, Visakhapatnam, Kozhikode, Kannur, Tiruppur and Many More.  CommunityMatrimony.com is a part of Matrimony.com - An Exclusive community based Matrimony Service, we also provide Exclusive Apps through our 40Plus Matrimony, Divorcee Matrimony, Manglik Matrimony, Any Caste Matrimony, Ability Matrimony and Defence Matrimony.  Find your perfect Shaadi from the same community through our Community Matrimony Apps. Our priority is that your jeevan sathi is like you in every way, making the match as perfect as possible.  Your privacy is a top priority for us at all times, so feel safe. We are a 100% secure site for shaadi.  Enjoy - Privacy! Connectivity! Convenience! All this and much more, in the palm of your hand!  Download App Now Register FREE! ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.community.matrimony.permission.MAPS_RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.GET_TASKS', 'android.permission.CALL_PHONE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.SEND_SMS', 'com.community.matrimony.permission.MAPS_RECEIVE', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}