{
"name" : "Story Savebox",
"url" : "https://play.google.com/store/apps/details?id=com.unimania.story_savebox",
"package" : "com.unimania.story_savebox",
"category" : "Social",
"description" : "**Never miss an Instagram Story**  Story SaveBox is an Instagram downloader application that saves Instagram Stories, videos, and photos automatically from your favorite accounts for 7 days. Special bonus  watch your friends Stories anonymously!   **Relive precious Instagram moments**  Story Savebox allows you to easily download Instagram Stories, videos, and photos directly to your phone! It also allows you to share the content effortlessly.   ** Our Instagram Story Downloader Features **    Automatically download and save Instagram Stories, photos, and videos from people you select  Transfer in one click all Instagram stories, photos, and videos that were automatically saved to your gallery  Download Instagram stories, photos, and videos straight from your feed into your gallery  Share Instagram content easily  Simple and convenient design for easy usage  Lightning fast downloader   View Instagram stories anonymously  NO ADS or in-app purchases! Our Application is FREE OF CHARGE   Privacy Policy and Service Terms: We care a lot about your privacy and we work hard to safeguard the data we collect and to comply will all relevant laws and regulations.  To keep Story Savebox 100% free, we only collect anonymous, non-personal user demographics and ad data and aggregate them for market research purposes only, namely, to build special advertising related insights and analyses for brands that work with us. We do not collect, store, use, share or sell any of your personal information.  Please review our service terms and privacy policy below, before you install the extension, to learn more about what data we collect and what we use it for. If you have any questions concerning your privacy, please contact us at: privacy@unimania.xyz.   Privacy policy: https://bit.ly/2QMzqOi Service terms: https://bit.ly/2LBBliQ  Contact us: We are here for you. If you find a bug or have a new feature in mind, or if you have a question about the extension or your privacy, please dont hesitate to contact us at: story@unimania.xyz   Copyright notice: Story Savebox was developed by Unimania Inc. It is not affiliated with or endorsed by Instagram Inc. Instagram is a trademark of Instagram Inc. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE']",
}