{
"name" : "Muscateer - Oman's Social Network",
"url" : "https://play.google.com/store/apps/details?id=com.muscateers",
"package" : "com.muscateers",
"category" : "Social",
"description" : "Muscateer is the first and No.1 social network in Oman.Muscateer is indispensable for people living in Oman and those looking to move to Oman.  It is the Omans one- stop Information portal and ultimate gateway to Oman            .  The Muscateer Community is a fun, friendly and relaxed community. It is also a huge community with over 100,000 members! Muscateer is for people of all ages, nationalities, cultures and religions.   On top of buying and selling everyday items, our users can also discover:    Find whats top in everything around Oman  News-Get updated with the latest news and current affairs in a jiffy!  A virtual real experience of best restaurants in Oman   Jobs - we help jobs seekers and companies connect.   Muscateer Forums - interact with people who share similar interests as you.   Upcoming events in Muscat.   Offers & Promotions - we update our users with all the latest nearby offers & promotion by   Best restaurants, hotels, movies and attractions   Foodie Spot-A visual guide for foodies   Users can see and get a feel for the atmosphere and ambiance of each of your restaurants. Showcase sweeping Beautifully made videos and views of the city or beach and modern, upscale interiors. Likewise, present more laid-back dining options for the quick or casual meal.Users can also review full menus, Signature Foods, Most popular foods and even read reviews of each restaurants so that they already know what they want before they even sit down.   News   best local news app which filters out the important news of your city and summarizes them to present in a short and crisp 60 words. All the summarized news has the gist of the entire news story which contains just important news facts without any personal opinion.Get limited daily notifications for the most important news and breaking news of the day.   Services   Muscateer Services brings the best of experts in Home services, Home maintenance, Appliances repairs, Utility services, Lifestyle services, Repair & Maintenance, and other professional local service experts, right to your home or where you want us to.With a simple click Button of submit form with your enquiry mobile number, you get a call back from our professionals directly and can schedule the services as your convenience.   Explore   Discover and explore new and exciting things to do and even get suggestions. Muscateer Explore helps you find new activities, places, spots and more near you so you can step outside the norm and experience something new. select the categories from things to do. The application will return in response a list of nice things that you can see and do, more specifically:  JOBS   Muscateer Jobs finds job vacancies in thousands of different companies in Oman and shows them to you in one place. That way, you can be sure that you will find your dream job, no matter how hidden it is. Easy, convenient and fast Upload your CV & apply for a job in Engineering, Hospitality, Sales and many more in Oman.   EVENTS   Discover upcoming events near you and get personalized recommendations. Stay up on the latest for popular events like concerts, festivals, yoga classes, holiday events on New Years Eve and networking events.  This is the OFFICIAL app of the Largest Party Portal Party Lover in Oman. Theres an amazing fun, interesting world of events going on anywhere at anytime, we help you discover the best.   Forums   The Muscateer Forum is a lively place where like-minded people come together to share information, opinions and advices. you will be interacting with like-minded individuals to develop meaningful conversations on the topics that interest you.  Website: https://muscateer.om Instagram: https://www.instagram.com/muscateer.om/ ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.CALL_PHONE', 'android.permission.READ_CALENDAR', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.muscateers.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}