{
"name" : "Cluster",
"url" : "https://play.google.com/store/apps/details?id=com.getcluster.android",
"package" : "com.getcluster.android",
"category" : "Social",
"description" : "Featured under Best Apps of 2013 by Google  Cluster makes it possible to create private spaces where you share photos and memories with the people you care about. Create your own space with family, a group of friends, coworkers, people from your home town, or anyone else!   Great for:  College Students! Share memories with friends not appropriate for other social networks  New Moms! Share photos of a new baby with close friends and family without spamming everyone on other social networks  Families! Keep in touch even if youre not in the same place.   Tons of people already trust Cluster. Heres why:   Private & secure: Only invited members of the space can see what you post.  An app for everyone: Award-winning apps for Android, the web, and more.  Relevant notifications: Know when people you invited post new things to the space.   How it works:  1. Create a group space. 2. Add the people you care about. 3. Watch those people join and contribute.  The press LOVES Cluster:   Featured by the NYTimes, TechCrunch and many more!  Recently featured on Google Play under Play Picks and Best Apps of 2013      Permissions Requested  Network Access: We use network access to communicate with our servers for just about everything in the app including uploading photos, videos, comments, etc.  Location: We use location when you choose to post where you are, but we wont use your location otherwise.  Contacts: We show contacts you can invite to when building an album, and we only send invitations to people you choose to follow along. Your contacts will not be uploaded to our server. Write External Storage: We use this permission if you choose to download photos from other members of your album. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.VIBRATE', 'android.permission.USE_CREDENTIALS', 'com.getcluster.android.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}