{
"name" : "Status download and Status Saver",
"url" : "https://play.google.com/store/apps/details?id=com.whazappstatus.whasappstatus",
"package" : "com.whazappstatus.whasappstatus",
"category" : "Social",
"description" : "Do you love social media posts including image and videos, are you social media lover ?Then whatsapp status saver & video download is the right application for you. Save from whatsapp, whatsapp business, facebook, instagram, tiktok.  By using this application you can save, download any images, videos or post from whatsapp, whatsapp business, facebook, instagram and TikTok videos including musically video download that you love. Now its easy to save status, videos of any friends that you love the most. No need to ask him/her to send it to you. You can save from net. You can save from WHATSAPP, WHATSAPP BUSINESS, FACEBOOK, INSTAGRAM, TIKTOK, MUSICALLY AND MANY MORE.  Dual App: If you want to save statuses of dual (clone) whatsapp then you have to create dual app (clone) of this app as well.  Most exciting features of the application:  Save, Share and Delete your friends whatsapp status.  Delete not used status from long time.  Save, Share and Delete your friends whatsapp business status for FREE.  Save, Share, Re-Post your friends instagram post, videos and images.  Save, Share, Re-Post your friends instagram story, videos and images.  Download any facebook video and use it as you want.  Whatsapp direct - Send message to any whatsapp number without saving number. You  can also pick number from recent call list.  Download any videos from musically  Download any videos from tiktok  Save, Share and Delete your GB whatsapp statuses for FREE.  Save, Share and Delete your Parallel Space for FREE.  Save, Share and Delete your Parallel Space Lite for FREE.  We are providing all paid features in FREE then why you want to PAY. So just download the Status Saver app and enjoy all features in FREE.  So this app is one stop solution for all of your problems and it act as all social media downloader.  Many more features and settings we are currently adding. So keep using the app and help us by suggestions and feedback. We love to serve you better.    Note: This app is not related to and is not affiliated with any 3rd Party including Whatsapp inc., Instagram, Facebook or TikTok or Musically app. This app not use to clone or hack anything, it just display downloaded files in app. We never share any user data or never use it for our purpose. This app is not using any pictures, videos or any other content for any other purposes. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}