{
"name" : "Free Online Dating Site App",
"url" : "https://play.google.com/store/apps/details?id=com.gado.friendfin",
"package" : "com.gado.friendfin",
"category" : "Social",
"description" : "Want to hangout or date interesting singles around you? Here is an interesting and unique app for online dating and match-making - Online Dating Free. The free dating app helps you find nearby single men or women to date. While you can find interesting people, chat with them and become friends, you can also find singles for hookups. Online Dating Free app is where you can get connected with people sharing the same mood as yours and also meet them in person. The app is based on the best matchmaking and date finder website - http://www.FriendFin.com. Chat with them using the app and share your common interests and hobbies with them. You can also discover other FriendFin app users in your locality with whom you can chose to hangout with. Online Dating Free - FriendFin app is an awesome way of mingling and connecting with different kinds of people near you.  Founded in 2009, http://www.FriendFin.com is a completely free dating site app that helps people find others with whom they are compatible and who are also looking for friendship or love. Unlike other supposedly free online dating sites, FriendFin is 100% free dating app with no hidden fees. You wont ever be asked to pay to see your matches, to update your profile or to read messages from other users.   When you sign up for FriendFin, youll complete a short profile about yourself, answering questions about your habits, your location and what youre looking for from love and friendship. In addition to traditional private messaging and classifieds, we allow you to shoot live video of yourself to post on our site if you wish. You can even participate in audio and video chats to get to know other users without ever having to leave our site. In this way, FriendFin combines the concept of 100% free dating sites with Skype or instant messengers.  Another feature that sets FriendFin apart from other free online dating sites is our Facebook interface. We offer a feature not found on many dating sites free Facebook linking. This part of our interface allows you to quickly find FriendFin users on Facebook and help them find you. By connecting Facebook with FriendFin, youll dramatically increase your chances of meeting new people and finding that friendly or romantic relationship for which youre searching.  If you have questions about using our site, please feel free to contact us by email at contactus@FriendFin.com.  Here are some of the awesome features:  100% free dating site app.  Text, video and Audio chat. Users can also broadcast live video to their profile at free dating site.  Classifieds : This feature at 100% free dating site allows users to post classified ads. Each classified ad has name, description, a few photos and an expiration date.  Facebook Integration : Users can use their existing Facebook account to register and login to your site. The site automatically imports basic account details and photo from Facebook. Users can post status updated back to Facebook and invite their friends to join the site.  Users at this dating site can pick a privacy level for their profile, photos and blogs. The available levels are: Everyone, Registered user only, Friends only.  Other things you need to know:   FriendFin is safe and secure  You can view our Privacy Policy at http://www.friendfin.com/ContentPage_id_14.aspx  You can view our Terms of Use at http://www.friendfin.com/ContentPage_id_13.aspx  You must be at least 18 years old to download and use this app  You can visit us online at http://www.friendfin.com  ************************ SAY HELLO ************************ We are constantly working hard on making this Online Dating Free app better and more useful for you. Please feel free to email us for any queries/suggestions/problems or if you just want to say hello. If you have enjoyed any feature of the Online Dating Free app or the app has helped you in finding the right company at the right time, do rate us on play store and share among your friends. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}