{
"name" : "Basaveshwara Matrimony",
"url" : "https://play.google.com/store/apps/details?id=com.techmapps.basavamatrimony",
"package" : "com.techmapps.basavamatrimony",
"category" : "Social",
"description" : "Basaveshwara Matrimony is an Exclusive Android Mobile Application for Veerashaiva and Lingayata community committed to provide online matrimonial service for community members to find desired life partner at their fingertips.   Features:   One month free usage for all newly registered members.   Safe & Secure  Contact sharing only on members acceptance of request/ interest.  Supports Kannada Language.  Free to receive incoming requests for all registered members.   Packages Available at attractive prices to avail complete matrimony service.  Filtered Matches list based on the set Partner Preferences.  Get auto suggestions in case of profile is set as favourite by both the parties.  Profile suggestions from Admin or Agents side.  Download your Bio-data in PDF Format.  Get Notification for New Interest Received and Interest Acceptance.   Safety & Security Measures:   Mobile Application can only be accessed by Registered Member of the App through secure login.   Registration will be approved only after verifying the filled registration form by Admin. Users will be contacted for additional details or proof if submitted details seems invalid or incomplete.   Registered Member can only view the basic details and profile photo of other Registered parties of opposite gender.   Contact/ communication details (Parents Name & occupation, Contact Number & Address ) cannot be viewed or accessed by any Registered member / Paid member or any of our agents.  Contact/ Communication details will be shared only if the interest is accepted by member.   Member can delete their account by themselves through App if they dont want to continue.   Member can change their login ID or primary phone number anytime.   Members will be blocked/ terminated if Admin notices or come across any abnormal behavior.  Periodically we will inspect the Inactive users of the App and their account will be blocked / terminated if it is not in use for 2-3 months.   24/7 Support through Phone/ Email / Whats-app. We ensure that all your questions will be answered within 24 hours, 7 days a week.   Please go the terms of usage/ privacy policy for any detailed information.  The purpose of our App is bring the community member across different locations into one platform and help them to find desired life partner.  Please go through our website - www.basaveshwaramatrimony.com for more details about our Application. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}