{
"name" : "Love Messages for Girlfriend ♥ Flirty Love Letters",
"url" : "https://play.google.com/store/apps/details?id=com.waf.lovemessageforgf",
"package" : "com.waf.lovemessageforgf",
"category" : "Social",
"description" : "Love is the most powerful emotion a human being can experience.  Express your love and affection to your loved ones with the help of Love Messages for Girlfriend ? Flirty Love Letters, this app has a huge collection, so make use of it and make your boyfriend, girlfriend, husband or wife fall in love with you all over again.  Most people love their other half but they fail to express it, this app will help you convey your feelings very easily. Sharing your feelings with others help our relationship grow stronger. The more attention, love, and support shown to your significant other the stronger your bond will be. Couples that display their affection regularly have better odds of staying connected and working relationship problems out when they arise than those that do not.  Letting someone know that youre thinking of them and that they are important to you can make a huge difference in the way they respond to you on a daily basis.  Sending a love message or love gifs is one of the best ways to show your devotion and affection. Use Love Messages for Girlfriend ? Flirty Love Letters to share the love messages, love gifs, love quotes and love images to your loved ones on any social media like Whatsapp, Facebook, Twitter etc.  We have 9 different categories:  Love Gifs  Sweetest Messages  Heartfelt Love Messages  Top 50 Messages  Love Messages  Poems  Cute Messages  Love Letters  Name on Birthday Cake  Features: - Share them via Whatsapp, Facebook, Twitter etc. - Heart your favorite poems - Save your favorites directly to your gallery - Easily copy & paste the quotes, messages  Want to express your feelings in an interesting way? Try this app for free. DOWNLOAD NOW!!! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}