{
"name" : "TechGig: Coding Challenges, Tech News & Skill Test",
"url" : "https://play.google.com/store/apps/details?id=com.timesgroup.techgig",
"package" : "com.timesgroup.techgig",
"category" : "Social",
"description" : "Be at TechGig to Learn & Upgrade your Tech Skills with Coding Challenges, Hackathons, Skill Tests and Tech Tutorials to Get your Dream Tech/Developer Job.  If you want to beat the best in the IT world, download TechGig app NOW!   We are Indias biggest tech community and the most comprehensive app for your phone that includes everything from Coding Challenges, Skill Test, Programming Challenges, Hackathons, Tech Jobs, Webinars, Tech News, and Tutorials on various subjects.   While you can be updated about latest happening in the tech world through tech news, you can also assess your tech skills via skill tests, participate in coding challenges, hackathons and check out a suitable tech/developer job for you. You can also up your skill quotient with tech tutorials on various subjects like Java tutorials, PHP tutorials, C++ Tutorials, et al. This intuitive and sleek app allows a developer to enjoy the best tech experience while on the move. We certainly know how important it is to be updated for the desired career growth.  Key features:   Coding Challenges & Hackathons - Register and participate in coding challenges and hackathons to get hired & win big! - Participate in MCQ round, read coding problem in app   Skill Test - Time bound MCQ based assessments to help you up your skill quotient - 50+ Coding Languages at your disposal.   Tech News - Stay updated with latest tech news. - Latest content on a wide variety of topics of your interest ranging from Latest Technology, Hiring, Internet, Gadgets, Mobile, Startups, Social Media, It Security, Ecommerce and Leadership   Tech/Developer Jobs - Find all kinds of latest and most aspirational tech/developer jobs. - Top IT Companies are offering tech/developer jobs on TechGig   Webinars - Live knowledge sharing sessions on latest trending skills and technologies by industry experts. - Join Live webinar sessions or watch past webinars, basis your technical skill   About TechGig:  TechGig.com is a culmination of everything related to technology, a platform exclusively for IT professionals with coding challenges, hackathons, Tech News, tech/Developer jobs, skill tests, webinars and tutorials on various technologies. The platform helps IT community synergize, share, exchange ideas, facts and information as well as showcase their work and express their views on the vast repertoire that the IT industry encompasses. Garnering cutting edge views, reviews and tech news, jobs as well as providing a podium for connecting with your colleagues, peers are the mainstay of TechGig.com.  Some key highlights:  2.5 Million+ Registered Users 1,800+ Tech News 1800+ Expert Speak 2,000+ Coding Challenges 2.7 Million+ Code Submissions 1.7 Million+ Developers on Coding Contest ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}