{
"name" : "Chat Rooms - Find Friends",
"url" : "https://play.google.com/store/apps/details?id=com.chatgum.chat.rooms",
"package" : "com.chatgum.chat.rooms",
"category" : "Social",
"description" : "Chat and find new friends now with ChatGum. Our chat rooms will help you stay connected and discover new friends nearby or around the world.    Find and connect with people who share similar interests. The ChatGum community is organized by topic specific chat rooms. Whatever you are passionate about, we have a chat room for you. After you find a room you like, you can start chatting with like-minded people. Every message you send to the chat room will be read by the group currently online in the room. For a more personal touch, send a private message!  Express yourself and show the world who you really are. Interact with people in chat by moving around with your avatar. Use colorful and animated emojis to express your feelings without words.   Sending text messages using ChatGums Private Messenger is fast and fun. Use our private messaging service to text new friends or keep in touch with family. Messenger delivers all messages instantly, without needing to refresh. However, if your friends are offline, you can still send them messages with fun emojis. They will be receive a notification and can text back later.   Engage in in-depth discussions in our forum. Sometimes conversations are best in message board format. Each chat room has their own forum, in which friends can discuss topics they are interested in. Our forums are a great way to start long conversations without needing to online at the same time. Simply pick a topic, and decide to post a message, emoji or participate in a discussion. You can also like messages to show your support. Liking a message will also save it so you can read later.   Be more social and share things you like with people worldwide. ChatGum is a great way to grow your social network. Customize your profile, upload a selfie and fill out your bio with cool emojis to show the world what you are interested in. You can gauge your popularity by how many users have liked your profile.  This chat app is 100% Free, and does not charge for unlimited chatting or texting. All you need is a mobile phone or tablet with a stable internet connection, (WiFi, 3G, 4G or LTE ), and you can start chatting now.  Connect with ChatGum! Follow us on Instagram - https://instagram.com/make.friends Follow us on Twitter - https://twitter.com/MobileChatApp Like us on Facebook - https://facebook.com/ChatGum  ChatGum is only available for users ages 13 and over. Please review our terms of use, and safety statement in the private policy link below. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.READ_CONTACTS', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.REGISTRATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.chatgum.chat.rooms.permission.C2D_MESSAGE', 'com.amazon.device.messaging.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.REGISTER', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.google.android.c2dm.permission.REGISTRATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.REGISTER', 'com.android.vending.BILLING']",
}