{
"name" : "RecurPost - Social Media Scheduling with Recycling",
"url" : "https://play.google.com/store/apps/details?id=com.recurpost.android",
"package" : "com.recurpost.android",
"category" : "Social",
"description" : "RecurPost is a social media scheduler that allows you to share your best updates on social platforms in a recurring manner.  It is a simple way to build your business on social media. RecurPost lets you post on all social media platforms in one place.  Unlike other social media schedulers where you need to schedule your content every time you want it to go out, you can now recycle your previous content based on a set schedule. For instance, you can set your blogposts to go out once a day.  Once an update has gone out it waits in your blogs library only to be posted once everything has been posted. This makes RecurPost one of the few social media schedulers that can claim to be a set-it-and-forget-it tools.  This adds new life to your existing content and opens new avenues of traffic for you. This consistent post scheduling also keeps your brand reappear in front of your audience and you subconsciously get a space in their brain.  RecurPost supports all major social media platforms including Facebook, Twitter, LinkedIn, Google+ Instagram and we have Pinterest in the works.   RecurPost has a forever free plan which is good for most businesses and our paid plans are affordable when you need more value.  RecurPost has everything you want to see in a social media scheduler and you dont need a credit card to try us out. Download the app right now and get started. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}