{
"name" : "Hornet - Gay Social Network",
"url" : "https://play.google.com/store/apps/details?id=com.hornet.android",
"package" : "com.hornet.android",
"category" : "Social",
"description" : "Your Hornet Profile is a portrait of you. It displays posts from the moments of your life, showcasing you and your interests. Inviting guys to connect with you in a meaningful way - based on who you are, and what youre passionate about.  The Hornet Feed is all about connecting you to your community. Through trends and stories, there is always a conversation to be had - making interacting with other guys easy by liking and commenting on their posts, or starting a conversation through chat.  Discover all the fun and fabulous of the gay community with Hornets acclaimed editors, thousands of community leaders, your friends, and the guy next door.  Whether youve just come out or are ready to join in - Hornet gives you immediate access to over 25 million guys and is only a download away.   CONNECT PROFILES are rich portraits of yourself and others featuring photos and posts giving a fuller picture of you and those you want to connect with CONNECTING is easy  liking and commenting on posts, and sending heartstings makes for quick introductions CHAT with guys about mutual interests based on profiles that show you who they are and allow them to see who you are FOLLOW your friends and anyone you want to stay connected with to see their posts, pictures, and videos on their feed   DISCOVER FILTERS enable you to find exactly who youre looking for and where you can find them EXPLORE the guys in your neighborhood or anywhere around the globe HASHTAGS allow you to discover other guys who share the same interests to make a connection   JOIN JOIN over 25 million users on Hornet across the globe BE A PART of discussions with Community Leaders on current topics and learn about the hottest trends all curated by Hornets team of editors and a worldwide network of influencers MEET anyone anytime - theres always someone online   SHARE THE FEED features posts by guys you follow, guys nearby, influencers, and guys we think youll want to connect with POSTS reflect you and your interests allowing others to respond to everything you post   SAFETY PRIVACY is at the heart of Hornet  its designed by the gay community, for the gay community, built with privacy front and center MODERATORS and staff of Hornet ensure the community is a safe space for you to express yourself SUPPORT is free and always available 24/7 ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.USE_BIOMETRIC', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_PHONE_STATE']",
}