{
"name" : "Anuraga Matrimony - Exclusively for Brahmins",
"url" : "https://play.google.com/store/apps/details?id=com.bit7informatics.anuragamatrimony",
"package" : "com.bit7informatics.anuragamatrimony",
"category" : "Social",
"description" : "Anuraga Matrimony is a Matrimonial Website and App for Smartha, Vaishnava and Sri Vaishnava Brahmin Community.   Anuraga Matrimonial Center is a marriage counseling center serving all sets of Brahmin community for the past 30 years. It got started as a hobby by Smt. Sreemathi Dattathry at Mysore with no other intention than a social service to her circle of relatives and friends.  Supported by family and friends, she found immense pleasure to work for the society establishing large database over a period of time. With her restless attitude, she started counseling people with dedication and devotion to enliven marital relationship. Further, it was important for her to understand the pattern of distress among the parents and the expectations of the present generation of aspirants.  Being a Branch Manager in State Bank of Mysore, Sri.N Dattathry supported her wife for this movement. After retirement from his service in 2001, he also joined her to serve the society in full time. With great enthusiasm he maintained all customer details with utmost care.  Smt. & Sri.N Dattathry have listened to, respected, understood and facilitated better relationship between those involved in the Matrimonial search.  A thought towards serving the community beyond the geographical limits has led to the development of this online portal. M/s Millenium Services will facilitate making their dream by development, maintenance and support of this website www.anuragamatrimony.com  M/s Millenium Services serving IT industry since 2003, with various activities such as Back Office Process, turnkey Networking, Web portal development and maintenance, CCTV installations, Data Collection and reporting.  The purpose of this website is to extend the services of Anuraga Matrimonial Center to go on-line and help the Community on one platform to find desired life partner. It is solely the vision of our mentors that drives our team to work.  Apart from providing the matchmaking platform to the entire community, it extends the services to bring in the various value based contents to the site & spread knowledge.   Exclusive Online Matrimonial Portal for Brahmin Community.  100% screening of all customer Profiles.  First ever Matrimony search across all sections of Brahmin Community.  SMS & Email Support, Security of Profiles and much more.  www.anuragamatrimony.com will strive to work towards understanding and building a better society. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_PROFILE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CALL_PHONE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}