{
"name" : "Glympse for Auto - Share GPS",
"url" : "https://play.google.com/store/apps/details?id=com.glympse.android.auto",
"package" : "com.glympse.android.auto",
"category" : "Social",
"description" : "Glympse for Auto is the fastest and easiest way to share your location to friends and family from your car. Using your Favorites and History from the Glympse app, Glympse for Auto incorporates large buttons to allows users to quickly share their location. Let the important people your life know youre on your way using Glympse.  As an add-on to Glympse app, Glympse for Auto integrates with VW and Peugeot Mirrorlink compatible in-dash units as well devices with Pioneer App Radio. Full compatibility with all Mirrorlink devices soon, and more providers to come.  We value our customers feedback and have implemented landscape mode and large buttons for ease of use. Why text when you can just hop in your car and with a touch of a button let your friends and family know youre on your way. Your friends and family will be able to track your location in REAL TIME on a map without having to install the application.  Easy and convenient, download Glympse for Auto today!  App Features:  Easy: no sign up required   Safe: your Glympse automatically expires  Live: share location in real-time with dynamic map  Open: share with anyone  no app required to view  Passive: runs in the background  Global: works anywhere you have GPS and a data connection  Use Glympse for Auto to:  Share your road trip with family and friends  Let your spouse know your ETA on your way home from work  Provide a courtesy notice with ETA to a client or customer appointment when stuck in traffic  Direct emergency personnel to you quickly  Note about PERMISSIONS: If you have any questions about which Android permissions we require or how we use them, please visit... http://glympse.com/perms  Wed love to hear what you think, so please email us at support@glympse.com with any questions, feedback or comments. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.mirrorlink.android.service.ACCESS_PERMISSION', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'pioneer.permission.appradio.ADVANCED_APPMODE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'pioneer.permission.appradio.ADVANCED_APPMODE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.mirrorlink.android.service.ACCESS_PERMISSION']",
}