{
"name" : "We Heart It",
"url" : "https://play.google.com/store/apps/details?id=com.weheartit",
"package" : "com.weheartit",
"category" : "Social",
"description" : "We Heart It is a refreshingly positive community where you can search, save, and share what inspires you. Browse We Heart It and share your passion for inspiring quotes, fashion, beauty, photography, travel, music, and more. Join the millions of creators on We Heart It and explore endless curated collections of inspiring photos and articles!  Use the We Heart It app to:   GET INSPIRED  - Explore trending topics in your daily feed of inspiring content: quotes, fashion, photography, wallpapers, travel, beauty, celebrities, TV, movies, & more - Search millions of posts and find inspiration from our community of creators - Follow like-minded creators, top influencers, trending topics, and collections - Discover top writers who share their life experiences, review and recommend new products, share their daily routine, and more   CURATE & SAVE  - Download and save your favorite images to your camera roll - Heart posts you love and save them to a collection - Invite friends to contribute to collaborative collections   UPLOAD CONTENT & BUILD YOUR FOLLOWING  - Upload photos and edit them in our built-in photo editor - Write articles and share them with your followers - Endlessly curate your profile and collections - Get discovered! Top posts are promoted and shared with our millions of users   CREATE. HEART. SHARE  - Create content that inspires you and your followers - Heart your favorite posts and add them to a collection on your profile - Share your masterpiece with the community and beyond: Instagram, Pinterest, Tumblr, etc.   PREMIUM SUBSCRIPTION  - Customize your app icon: choose between many unique app icons and watch your app icon change instantly! - Customize your profile: choose from various unique backgrounds and colors to make your profile stand out from the rest! - Access exclusive wallpapers: download 60 hand picked wallpapers curated by our editors - Download unlimited watermark free images: heart & save your favorite images without that annoying watermark!  - Get the best look: apply one of our exclusive filters or overlays to make your images stand out from the rest! - Unlock the ad-free experience: browse endless inspiration without any of the distractions! - Start your free 3 day trial today!   Be a part of our inspiring community and join the millions of users who have used We Heart It since 2007!   ------------------------------------------ FOLLOW US ON PINTEREST: pinterest.com/weheartitapp ADD US ON INSTAGRAM: instagram.com/weheartit LETS BE FACEBOOK FRIENDS: facebook.com/weheartit FOLLOW US ON TWITTER: twitter.com/weheartit ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.GET_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.READ_SYNC_STATS', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.GET_TASKS', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SYNC_SETTINGS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.android.vending.BILLING']",
}