{
"name" : "Owly for Twitter",
"url" : "https://play.google.com/store/apps/details?id=com.arthurivanets.owly",
"package" : "com.arthurivanets.owly",
"category" : "Social",
"description" : "Owly is a truly unique and beautiful app for Twitter with a lot of useful features which will let you stay up to date with the latest news and trends and express your thoughts in a way never possible before.  Definitely give Owly for Twitter a try! You will be impressed!    Tweet Digest - stay up to date with the latest news from the people youre interested in. Configure the specific times for Tweet Digests, and enjoy this new way of data consumption which will never let you miss a thing.   Unique and Powerful Tweet creation  express yourself in a truly creative way without any limitations whatsoever; use the beautiful and customizable Templates which will allow you overcome the character limit and express your thoughts in a whole new and unique way. You can also attach the regular media to the Tweet.   Tweets based on topics you like from around the world  add specific topics that you like, apply some result filters and set the place you want to get your tweets from (e.g., specific area in the country of your desire, etc.); and always stay up to date with the latest news on the various topics of your interest.   Instant User and Media previews with Quick Actions  preview specific users and media attachments (photos, videos, GIFs) on the go by pressing and holding on them and decide what you want to do with those particular entities using the Quick Actions.   Advanced Tweet Management  manage the Tweets in a whole new way: hide the tweets you dont like, choose which ones to show in your timeline, or even apply some specific result filters  its all up to your preferences.   Extremely Customizable  themes, headers, transition animations, font related customizations  basically everything youd ever wish to be able to customize, its all there for you. Tailor your perfect experience.   Performance Mode  optimize the scrolling experience by reducing the complexity of the UI elements. This is especially useful if you want to get the most out of the less powerful device.   Multiple Accounts  add as many accounts as you want with an ability to sync them. Each accounts syncability can be controlled by you in the Settings of the app.   Key Features   Clean and simply outstanding Material Design UI  Support for multiple Twitter Accounts  Truly customizable Tweet Creation without any limitations  Fully customizable UI (Themes, Headers, Transition Animations, and more)  Instant User and Media previews, as well as the regular ones  Tweet search  User search  Next level Tweet Management  Configurable Tweet Digest  Relevant Tweets for topics of your desire with advanced filtering options  Background sync  Performance Mode  and a lot of other useful features ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_CREDENTIALS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_SYNC_STATS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.CHECK_LICENSE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
}