{
"name" : "BF4 Intel",
"url" : "https://play.google.com/store/apps/details?id=com.ninetwozero.bf4intel",
"package" : "com.ninetwozero.bf4intel",
"category" : "Social",
"description" : "Ever wondered what your gaming sessions would look like if you had access to all the information you need right there in-front of you, without the need to alt-tab nor move from that comfortable couch of yours? Heres the solution!  BF4 Intel is your most trusted companion on the Battlefield regardless of the platform youre playing on, or how many people you have in your party. Currently you can view your statistics, unlocks, assignments and awards, plus the added feature to view the latest Battlelog news! Most people have their phones next to them while playing, making this the ultimate app for all of you gamers out there - you wont need to have your laptop switched on as a console player, just for the sake of Battlelog. You dont need to alt-tab the game to look up your current unlocks, and miss important in-game opportunities. Just open the app, check what you need and play your best rounds ever.  # Disclaimer: This app was not created nor is endorsed by EA/DICE. All images are owned by their respective owners, and Battlefield is a registered trademark of EA Digital Illusions CE AB. No user account information is being stored off-device and/or shared with third-parties.  By using this application, you acknowledge that you (the user) may not use this software to break the law in any way (seen out of the laws perspective), and we (the developer) are not liable for any damage caused by you (the user) while using (and not using) this application.  # Important links / Contact details E-mail: help@bf4intel.com Website: http://www.bf4intel.com Twitter: http://www.twitter.com/karllindmark | http://www.twitter.com/peter_budo Source code (GPL3): https://github.com/ninetwozero/com.ninetwozero.bf4intel ",
"desc_perms" : "['android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}