{
"name" : "Family Locator - Family GPS Tracker",
"url" : "https://play.google.com/store/apps/details?id=com.hak.familylocater",
"package" : "com.hak.familylocater",
"category" : "Social",
"description" : "Family Locator - Family GPS Tracker simplifies life in digital world by making it easy to stay connected and lets you stay linked to your family members during the day, even when theyre far away! Family locator is the most accurate and easy to use application which can help your family stay connected all over the world.   Family Tracker and Family Locator - Family GPS Tracker application works like Phone Tracker by phone Number. This app is a secure and user- friendly GPS tracker that helps you locate your phones and your kids as well as your family members. It is designed to help you find your kidslocation by mobile number, Kids Phone tracker app enables GPS location tracking between parents and their childrens in private network.   How Family Locator - Family GPS Tracker / Family Tracker works: 1.) Install Family Locator on your device and have your family install it on their phone too. 2.) Provide your device id like your family; we will verify the true identity of the parents. 3.) When your family joins, you can see his location on the private map.  The Family Locator application is designed to provide your family with easy-to-use security tools. Family Locator connects you to the Internet and allows us to send and receive location information to and from family members on your private map. In order for our app to work properly, we need a few permissions. Dont worry - when you create an account, we help you through this quick and easy process.  Family Locator / Family Tracker advanced features are:   Get notified when tracked family members reach destination points.  Create your own groups in the app Family Locator.  It provides protection and safety anywhere with a dedicated GPS tracker designed for kids too.  Kids with Family Locator installed feel more freedom and confidence to move around city.  Locate a stolen or find a lost phone if the app has been installed before using GPS  The family locator app lets you find your loved ones easily.  Check-in to share your location with family  View the real-time location of Circle Members on a private family map  Please note, GPS location sharing is only possible upon mutual consent of all family members. Privacy of your family is the top concern for us - share your location only with people you trust.  Optional permission requests Family Locator / Family Tracker:  Location services, to inform family of your current location  Notifications, to inform you of your familys location changes  Contacts, to find other users to join your circle  Note:  For Family Locator to function properly Location services (GPS) must be turned on. Battery consumption is optimized for daily use of Family Locator. Family Locator app needs to check your position regularly so it may take your battery life ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_BACKGROUND_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_BACKGROUND_LOCATION']",
}