{
"name" : "Best Comments for Instagram Photos - CommentPlus",
"url" : "https://play.google.com/store/apps/details?id=com.neupanedinesh.commentsforinstagram",
"package" : "com.neupanedinesh.commentsforinstagram",
"category" : "Social",
"description" : "Have you ever got stuck writing nice comment on someones photo or reply someones comment. Worry no more ! CommentPlus app helps you to write best comments on Instagram and Facebook photos. It consists of all sorts of comments ranging from cute, funny, sarcastic, love and other categories.   So, the idea is simple. You just select a comment from wide rage of categories and use it or tweak it if you want.   Comment Categories:  Comment to write on girls photo  Comment to write on boys photo  Comment to write on friends photo  Comment to write on family photo  Comment for brother and Sisters Comments to leave on besties photo  Comments for couple  Thank you comments Lyrics Captions and Comments Hilarious puns, comment puns, sarcastic puns, sarcastic captions  Selfie captions and comments  Comments for Instagram photo  Comments for Facebook Photo  Love comments  Funny Comments Funny Captions Sarcastic Comments   The comments can be used as captions and status as well, get likes, get comments, give likes, give comments.   The comments and captions in this app can be great tool for engaging more users in your Instagram, get more likes, get more followers and build a audience who cares about you.  Comment ideas for instagram, caption ideas for instagram, instagram tool, emoji comments, beautiful girl comments, photo quotes and many more.   This app answers your following questions? - What are the best comments to write on besties photo? -What are the comments to write on sisters photo? -What are the comments to write on boyfriends photo? -What are the comments to write on a girls photo?  etc.  Have great fun. ",
"desc_perms" : "['android.permission.CAMERA']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}