{
"name" : "PunjabiMatrimony® - The No. 1 choice of Punjabis",
"url" : "https://play.google.com/store/apps/details?id=com.punjabimatrimony",
"package" : "com.punjabimatrimony",
"category" : "Social",
"description" : "The exciting new and official android App for PunjabiMatrimony is finally here!  PunjabiMatrimony is a part of and is pioneered by BharatMatrimony  the worlds largest and most trusted matrimony portal. We are happy to be responsible for thousands of successful Punjabi marriages across the globe.  We are featured in the Limca Book of World Records for highest number of documented marriages online.  How different is the App from the website? No different, except that you can carry your partner search with you on your phone. And a whole range of exciting features that will make you fall in love with our App before you fall in love with your perfect match.  Take a look at what makes us stand apart from the rest of the Punjabi matchmaking App crowd.   Registration of your profile can be done within the App.  Sign up using Facebook too.  Search, filter, view, and shortlist Punjabi brides/grooms using different search options.  Search profiles by Matri ID.  View photos and phone numbers of members you are interested in.  Get real-time notifications and stay connected with prospects anytime, anywhere.  Chat, send interests, and personal messages and get to know your matches better.  GPS-enabled City Search feature lets you find matches closer to your location.  To top it all, our App doesnt take up a lot of space on your phone. The PunjabiMatrimony App is smart and light!  Over the years we have helped Punjabi members find matches from across different Punjabi-speaking communities such as Sikh - Jat, Khatri, Arora, Sikh - Ramgharia, Sikh - Arora, Sikh - Khatri, Brahmin - Saraswat, Agarwal, Sikh - Saini, and Sikh  Ramdasia.  We have also helped Punjabi members find their matches from relevant community matrimony apps such as JatMatrimony, KhatriMatrimony, SikhMatrimony, 40PlusMatrimony, AnycasteMatrimony, BrahminMatrimony, BuddhistMatrimony, ChristianMatrimony, DivorceeMatrimony, JainMatrimony, MuslimMatrimony, VishwakarmaMatrimony, etc.  Looking to search for a bride/groom based on Religion? We have matches from all religions including Sikh, Hindu, Muslim, Christian, Muslim Sunni, Christian Catholic, Christian Protestant, Inter Religion, Jain Shwetambar, and Muslim Shia.  Globally, we are the preferred NRI matrimony service provider for aspiring brides and grooms to find their perfect partner, especially for NRI communities spread over United States of America, Canada, Australia, United Kingdom, United Arab Emirates, New Zealand, Pakistan, Italy, and Malaysia.  Our top registrations come from States namely Punjab, Delhi, Haryana, Maharashtra, Chandigarh, Uttar Pradesh, California, Rajasthan, Madhya Pradesh, and Karnataka and from cities namely Delhi, Ludhiana, Chandigarh, Amritsar, Jalandhar, Patiala, Mumbai, Gurdaspur, Hoshiarpur, and Sangrur.  There are also profiles from different professions/occupations such as Manager, Software Professional, Executive, Teaching / Academician, Engineer - Non IT, CXO / President, Director, Chairman, Business Analyst, Supervisors, Student, and Marketing Professional.  With such a large database of profiles and advanced search criteria, you are sure to find the most perfect life partner.  BharatMatrimony has been conferred with numerous national and international awards for its pioneering spirit, vision, and continuous growth through its path-breaking and innovative excellence. Some of such accolades include:   One of the 100 Most Innovative Companies Globally as recognized by Red Herring  Most Trusted Online Matrimony award by The Brand Trust Report  NDTV-Hindu Lifestyle Award for the Best Community Matrimony Website  Ranked twice in Top 50 Fastest Growing Tech Companies in India by Deloitte  The Most Visited Matrimony Portal in the World by Comscore  Your privacy is a top priority for us at all times, so feel safe. Use our 100% secure app to find your best match and enjoy a happy shaadi.  Download today for FREE and discover your life partner on the go! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COURSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.SEND_SMS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_COARSE_LOCATION']",
}