{
"name" : "Love Letters & Love Messages - Share Flirty Texts",
"url" : "https://play.google.com/store/apps/details?id=com.romantic.boyfriend.girlfriend.love.letters",
"package" : "com.romantic.boyfriend.girlfriend.love.letters",
"category" : "Social",
"description" : "Want to tell that special someone how you feel, but dont know how? Dont worry, send personal romantic messages and cute pictures to your special ones.The more attention, love, and support shown to your significant other the stronger your bond will be. Couples that display their affection regularly have better odds of staying connected and working relationship problems out when they arise than those that do not.  Show your love by sharing romantic love letters with your boyfriend,girlfriend,wife,husband or even a friend by using this wonderful app. It contains the best collection of love letters that you can send to your soulmates. Save time and effort by using our heart touching messages. A beautiful and huge collection of most romantic images, cards and letters for display picture. Find creative ways to say I Love You to your beloved person.  Send really cute romantic love letters or share as Facebook or Whatsapp status with the beautiful love message. Finding the right words for your loved ones is a lot easier now.  Saying just I Love you is the old way, now send an elaborate and detailed love message in the form of a love letter to your special ones so that they believe how much you love them.  Categories in Love Letters & Love Messages : - Love Gif - Love Letters - Love letters of her - Love letters for him - Romantic Letters - Short Love Letters  Features Of Love Letters & Love Messages :  Share love letters, love gifs & messages to your boyfriend, girlfriend, husband,wife via Whatsapp, Facebook, Twitter etc.  Heart your favorite love letters and messages  Easy to navigate  Copy the text and send directly to your loved ones as a WhatApp messages  Save images and upload them as your WhatsApp or Facebook display pictures  No need to search online for content  Free with no in-app purchases  Have fun and express your love by sharing free love letters, love gifs and free love images! Download now. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}