{
"name" : "OnGraviti - Be Different, Be Social, Be OnGraviti",
"url" : "https://play.google.com/store/apps/details?id=com.androidapp.ongraviti",
"package" : "com.androidapp.ongraviti",
"category" : "Social",
"description" : "OnGraviti Connects People!  OnGraviti seeks to make your online experience that much easier. Weve combined the most important elements from social media connecting, to business networking, in just one place. Now with just a few taps, you can swap between different profiles in one consolidated app, saving you time, money, and frustration along the way.  OnGraviti contains 5 different platforms therein: My World, Dating, Social, Roommate Finder (coming soon), and Business. Therefore, you can gather business leads, date, find roommates, connect with friends and family, have followers/grow a fan base if your profile is set to public, and do everything you could ever want to do in just one app. OnGraviti keeps your dating information completely separate from the professional side of the app, and vice versa. Best of all OnGraviti is Completely AD FREE!  Its your all-in-one solution you never knew you needed.  OnGraviti features:   My World Like, comment, and share posts, photos, build your followers much like you would on any social media site. With OnGraviti, this social media app is completely ad-free, which means you can finally enjoy social media engagement again.  Dating Create a private profile that you can use to chat, date, and connect with other likeminded people. All information is kept secret and encrypted from your other OnGraviti profiles. Watch a users video bio before swiping.  Social Connect with people based on likes, dislikes, and interests, as you create your own online community. Meet friends, make groups, schedule events, and build a family right through our app.  Roommate Finder (coming soon) With the video biographies you can upload to each profile, find roommates for upcoming vacancies. Videos will help you gage their personality so you are able to find perfect pairings more seamlessly, and in a fraction of the typical time.  Business Lastly, welcome to a new business app that is more intuitive than other options. Hire talent, connect with managers, and grow your business in this ad-free experience that makes it easier for everyone to get what they want at the end of the day.  Were your new social media option. If youre tired of the paid-for ads on social media, having to buy advertising to get your business out there, and sifting through failed dating apps that are based on nothing but looks, weve created a multipurpose solution with OnGraviti.   Change your life with just one app, available in both the Apple App Store and the Google Play Store. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_CONTACTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}