{
"name" : "Syrian Forum in France",
"url" : "https://play.google.com/store/apps/details?id=com.rachid.alkhayat",
"package" : "com.rachid.alkhayat",
"category" : "Social",
"description" : "Eid Wa7da is a social and participatory intiative that depends on the accumulation of experiences and exchange of information and solidarity between the Syrians and Arabs in their expatriations.  This intiative is divided into several phases:  Phase 1: which was started with the colaboration of the Syrian forum in France Facebook group. This groupe was established since 2014. The main goal of it was and still to bring ties between Syrians immigrants in France and to facilitate the experiences exchange between them. Exchange in different topics, including the administration issues, studying in France, finding jobs ...etc.  Our intiative decided to store some of their most important posts, after rephrasing them in our archive of articles (renewed continuesly), and providing it with a search engine.  Phase 2: This phase added some calculation tools to calculate the aid given by the French goverment to the migrants who does not work depending on the situation of each family. this phase is still under development and more tool shall be added.  Phase 3: On parallel with phase 2, and with the collaboration of other volenteers named: - Baptiste Pelletan  - Panthea Bahiraie  - Dalia Frantz  - Marine Rainjonneau  - c Manco - Lola Ripoche - Zeineb Bakhtaoui We added to our database over 1200 words and phrases (in French and Arabic) and divided into grouped to be presented in flash cards, so the user can listen to the spelling of each word/phrase and also check his spelling as well.  The development is still on, and more phases should be added soon in the coming future. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'com.rachid.alkhayat.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}