{
"name" : "Steller",
"url" : "https://play.google.com/store/apps/details?id=com.mombo.steller",
"package" : "com.mombo.steller",
"category" : "Social",
"description" : "Steller is the best way to create, share and discover fun and inspiring stories. With all new creative themes, layouts and fonts, its time to tell your story the way it deserves to be told!  Create & Connect with Stories Worth Sharing Connect with others in a supportive and creative community where you can inspire and be inspired! Steller is the space where you can express yourself through creative storytelling with beautiful themes for your photos and videos. Design and curate your real experiences into meaningful stories worth sharing.  TELL YOUR STORY Have fun creating your own stories using beautiful themes to showcase your unique experiences.  JOIN THE COMMUNITY Connect with a community of creatives from around the world and discover stories about cool cities, stays, eats, adventures, and exciting local experiences.  YOUR STORY IS WORTH SHARING Easily share your stories with the Steller community, and with friends and followers via Twitter, Facebook, and Pinterest.  Features: Community: Join our global community and build your community through following Steller topics and creators.  Discover: Need inspiration for your own story? Heading out on a journey, near or far? Get inspiration from storytellers all around the world sharing their own stories and adventures in the Steller community! Themes & Templates: Use themes, layouts, and text tools to tell your story and express yourself! Map View: Want to see a Steller story on a map. Just tap a geotag on any page to move to Map View. Fonts: Choose from 10 different styled fonts, with more added each month. Embed: Embed all your stories right on your website or in emails with Stellers handy embed tool.  Want to reach out to us to say, Hi? Email us directly at support@steller.co or DM us on Instagram at @stellerstories ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}