{
"name" : "Dark Mode Theme for Instagram",
"url" : "https://play.google.com/store/apps/details?id=com.ribbyte.darkmode.ig",
"package" : "com.ribbyte.darkmode.ig",
"category" : "Social",
"description" : "Switch your Instagram feed to dark mode!  This is an unofficial app that changes the style of Instagram to a black theme. No need for Android 10, works for Android 6, 7, 8 and 9!   You were browsing Instagram for far too long even though you have to get up at 5am the next morning? Well, we cant help you with that, but we can help you to reduce eye strain by turning bright and colorful colors to a dark mode. Use your favorite social network during the night!  If you start the web version, you can change the background to any other color! Change Instagram to blue, green, pink, whatever your heart desires!  Get the unlimited ad-free PRO version right here: https://play.google.com/store/apps/details?id=com.ribbyte.darkmode.ig.pro  Frequently asked questions:  How do I activate the dark mode? -> Start the app. Click on the Toggle Dark Mode button on the bottom. After you watch a short ad, the dark mode will be activated and Instagram should start. If it fails to start for any reason, you can select the Start Web Version button. This will load the web version of Instagram with a dark theme. It does not have all the features as the full Instagram app, but it has our multi-color support.   It doesnt work! -> Unfortunately, some vendors are not supported yet. This is outside of our control. But you can always use the Web version by clicking the Start Web Version button.  How do I turn dark mode off? -> The same way you turned it on: click on Toggle Dark Mode. Wait a few seconds until everything reloads. If it doesnt work, try rebooting your phone.  I have a Xiaomi phone and the dark mode cannot be turned off! -> This is a bug in the latest MIUI 11 update. A quick solution to this is to use the security app that is already on your phone (a green icon with a shield and thunder). Let it find all problems and press Fix it to solve the dark mode issues. If this doesnt work, try resetting your phone.  I uninstalled the app but everything stayed black! -> You uninstalled it without disabling dark mode first. Install our app and click on Turn Dark Mode Off. If it doesnt work, try rebooting your phone. If nothing works, try resetting your phone.  Why is my Google Play also dark? -> The app actually activates a global dark mode which also affects other apps like Google Play. There is not yet a possibility to limit this only to Instagram.  How do I change the background color to something else? -> You have to use the Web Version to change the colors. Select Start Web Version. Swipe right to open the menu. Click on Change colors. Pick your favorite color and give it a few seconds to display a preview of your choice. If you like it, press Apply changes and enjoy the new hip colors!  I dont like the colors I have chosen, how do I go back? -> Swipe right to open the menu. Click on Change colors. Press the button on the bottom titled Reset to default.  Do I need to create a new Instagram account? -> No. It works with all accounts.  How do I go back? -> Please use the back button on your phone to go back.  Do you have any suggestions or questions? Feel free to email us: ribbyteapps@gmail.com  We are not associated or related to Instagram or its rights holders in any way or form -- this is an independent third party application. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}