{
"name" : "WhatsLov: love stickers, emoji, gif. WAStickerApps",
"url" : "https://play.google.com/store/apps/details?id=com.shareitagain.whatslov.app",
"package" : "com.shareitagain.whatslov.app",
"category" : "Social",
"description" : " Surprise your loved ones +15 million people have already installed it. The best love sticker app.  Try it now, its a free app!   WAStickerApps: integrate directly into your WhatsApp stickers.   Share it in 1 tap via your favorite chat messenger.   Customize your library with HD packs and awesome animated Gif stickers.     Best Features   Thousands of free stickers, cute emoji, smiley faces and the best GIF emoticons.   Great stickers for WhatsApp, Snapchat, Facebook, emoji for Messenger, compatible with Telegram, WeChat, IMO, Viber, Kik. Its also great for your emails, text messages (MMS), Instagram story. The messenger apps are ordered according to your favorite ones.  For all occasions: spice up your love story, make your family smile, tease your best friends, send a love test to your lover, boyfriend or girlfriend, celebrate a birthday,   Customize (sticker maker): choose your background color, rotate or flip to create your own sticker.  Share up to 10 emoji at a time.  Premium version: Ad-free version, save to the gallery, add unlimited packages to WhatsApp   Free game: the more love you share, the more you gain.    What are we cooking?  Keyboard (GBoard) integration  Gif search via Giphy  Gif with animated text in your language  One day, One sticker category   HD Packages - Free to download  Smileys with daily and love quotes  Events: happy holidays, valentines day, mothers day, happy birthday, halloween  Cut The Rope  partnership.   Funny love gif stickers from students.   Theodor the Cat, animated Cats & Dogs. 3 gif packs from Iconka designer.   Emoji 3D Gif   Many packages for Christmas: greetings, happy new year, best wishes.   More to discover. We regularly add new ones.    What you need to know   Free stickers but only for personal use.  We do our best to be compatible with all messenger apps and provide emoji for Viber, stickers for Telegram, smileys for imo and kik. Nevertheless, if you have problems please contact us.   It is not possible to post imoji in Facebook comments. But you can use them in your timeline.    GIF format do not work everywhere   It is not possible to add our Gifs to WhatsApp stickers, because animated stickers are not supported at this time.   Only videos are supported on Instagram and Snapchat, not the GIF format.    This is not   This is not an android emoji keyboard, these emoticons are not for texting. Our smiley and sticker are sent as images (MMS) and not as SMS.  This is not an emoji maker. However, we do have features to customize the stickers.   This is not an adult emoji app. No adult stickers. We strictly respect Google policies.    Support us  Rate us 5 stars  if you are happy with the app.    Follow us   Facebook: @EmojiShareItAgain or Whatsmiley  Instagram: whatsmiley  Google Play developer page: Share It Again - Smileys & Emoji Apps. Discover here all our free emoji apps.   Contact us   We are always happy to help: contact@shareitagain.co  Feel free to ask for a new sticker or feature.   Thank you! Share It Again company We make apps for love & fun   Thanks to all artists   Aha-Soft: www.aha-soft.com  Daily Overview: www.dailyoverview.com  Design Bolts: www.designbolts.com  Icon8: www.icons8.com  Icon Drawer team: www.icondrawer.com  Iconka: www.iconka.com  Icon Master: www.iconsmaster.com  Mirella Design: mirella-design.blogspot.de  Seanau: www.seanau.com  Succo Design: www.succodesign.it  Visual Pharm: www.visualpharm.com  Esdac school of Montpellier, France  Morgane Danile: mdnl.art on Instagram ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.alarm.permission.SET_ALARM', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BIND_ACCESSIBILITY_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}