{
"name" : "Followers & Likes Tracker for Instagram - Repost",
"url" : "https://play.google.com/store/apps/details?id=com.mobiversite.lookAtMe",
"package" : "com.mobiversite.lookAtMe",
"category" : "Social",
"description" : "Follower Analytics  - Discover Instagram Unfollowers and Blockers -Who blocked you or who closed his/her Instagram account. -Watch, Repost Instagram Stories, Videos - The owner of the story wont be able to detect that you have watched the story. You wont be seen in the Instagram audience section of who watched stories. -Compare Likes - You can compare two different posts and find out who did like the first one and didnt like the second one - Happiest Instagram photos - Would you like to know the happiest photos of your lover, your friends or your spouse in Instagram? -Relation with your Instagram followers and followings - You can make comparisons of likes, comments, hours to your followers or followings  - Insights for Instagram, find out Full Analysis of Followers & Posts -Instagram Users - New and Lost Followers. People who unfollowed you recently. - Users not following you back or vice a versa. People who dont follow you back on Instagram. - Find your fake followers, fake following, mutual followers, etc. - Followers most - least liked your media - Followers most - least commented your media -Media posts, reposts - Most and least liked hour - Most and least commented hour - Most and least liked media - Most and least commented media -Media Filters - Most liked and commented filters  - See who unfollowed you - Instagram tracker for your followers and unfollowers  Follower Analytics lets you to find out who followed and unfollowed you. You can compare your likes and other information with other users, you can see who unfollowed you. Reach metrics about reposts. Watch and repost stories. An advanced Analytics tool for instagram Follower Analytics works like an assistant for your instant followers and unfollowers. You can find out the followers who blocked you. Likes for instagram and comments for Instagram is other great features of Follower Analytics. Find out the hottest hashtags for you posts. We do not show who is looking at your profile. Instagram do not provide such a feature.   Disclaimer: 1. This app is not affiliated with Instagram. 2. Re-uploading image or video stories is not encouraged, please seek owner approval. 3. Any unauthorized reposting of contents and/or violations of Intellectual property rights is the sole responsibility of the user.  We DO NOT sell FOLLOWERS or LIKES if you are seeking for these you are in the wrong app. We just provide analytics for your account and some tools to understand your followers behaviour like who blocked you or who closed his/her account. By using these statistics, you can manage your publishing times, your followers interests to increase your Instagram popularity.  Please do not hesitate to contact any time by directly sending a mail to info@mobiversite.com or using the feedback menu within the app ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION']",
}