{
"name" : "LinkedIn Lite: Easy Job Search, Jobs & Networking",
"url" : "https://play.google.com/store/apps/details?id=com.linkedin.android.lite",
"package" : "com.linkedin.android.lite",
"category" : "Social",
"description" : "LinkedIn Lite  We believe in making your job search experience a delightful one. LinkedIn Lite is indeed an easy way to stay in touch with your contacts and to build your network. Get access to over thousands of jobs on the go, without worrying about your mobile battery, storage space, or network connection.   LinkedIn Lite works seamlessly even on 2G or 3G connections and takes up approx 1 MB space on your smartphone. LinkedIn Lite is LinkedIns lighter and fast app offering. Install LinkedIn Lite now!  Why LinkedIn Lite?  Lighter - LinkedIn Lite app uses approx 1MB space on your phone  Simpler - Simple way to search jobs, apply for jobs, get job alerts on the go  Less Battery Usage - Light on your phone. LinkedIn Lite works even in 2G and 3G networks  Faster - Easy and fast way indeed to build connections and to stay connected with your network  Get faster job search, job alerts, and jobs update on the go. Stay informed, build connections and follow your favorite company news. LinkedIn Lite helps you stay connected while using low storage and it works on 2G or 3G networks.  How to Use LinkedIn Lite App to Grow Your Career? LinkedIn Lite is a faster, lighter app from LinkedIn built to work efficiently on slow 2G, 3G internet connections. LinkedIn Lite consumes less battery. This Lite app is approx 1MB and occupies minimum space while ensuring the true LinkedIn experience.  Easy job search experience with the power of LinkedIn Lite app:  Quick and simple - Job search based on title, location and keywords  Easy filter options - Job search by companies you would like to work at. Get access to the latest jobs, job postings and free job alerts  Relevance - Refine your job search results by work function. Get jobs by industry and job seniority level  Recommendation - Based on job search, jobs youve viewed, and your LinkedIn profile  Connect - Send messages directly to your connections at companies  Notify - Get notified when new jobs match your job search and work experience  Easy apply - Apply to jobs using your LinkedIn profile  Total privacy indeed  Your network wont hear a thing about your employment-seeking activity  With the LinkedIn Lite app you can connect to job opportunities while building your professional network. This Lite app makes your job search experience easy and helps you connect directly with recruiters. LinkedIn Lite app makes it easy for you to discover people who matter, follow companies, follow news, get job updates, apply for jobs, and stay in touch with topics that matter to you the most. Build your professional network.   What are the Features on LinkedIn Lite App?  Search for people, alumni, seniors, jobs and companies  Job search across all types of jobs including government jobs, MNC jobs, fresher jobs, IT jobs, software jobs, finance and banking jobs, HR jobs, sales & marketing jobs, internships and jobs for freshers. Apply to your dream job now!  Make useful connections with people who can help you in your job search  Send messages and chat with your connections to get job referrals and career advice  Make a professional profile that shows your skills, education, projects, internships and work experience  Get the latest industry news and updates that can help you stay informed, provide interview preparation tips, and much more  Add a profile image and employment or university details so that recruiters and hiring managers can discover you  Download the LinkedIn Lite app. Start your job search by creating or updating your LinkedIn profile, which captures your professional brand and journey. Your LinkedIn profile is like your virtual resume which you can edit and update anytime. Let prospective employers, recruiters and hiring managers know about your accomplishments.  Get the LinkedIn Lite app now! Experience easy job search & access to thousands of jobs on the go! The #1 app for job search & to build connections.  Have questions? Write to us at team-mobile@linkedin.com ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA']",
}