{
"name" : "HaikuJAM - write together, feel better",
"url" : "https://play.google.com/store/apps/details?id=com.herokuapp.haikujam",
"package" : "com.herokuapp.haikujam",
"category" : "Social",
"description" : "The best stress buster app for learners and creatives   HaikuJAM is a social writing game that brings you inner peace. Create write-ups together, make friends, have fun and relax.  How to play   Write a line and pass it on. Strangers around the world will write with you, adding a line each to make a micro poem, quote or story. Enjoy the magic of saying a lot with little - were inspired by the Japanese poetry called haiku which captures the essence of a moment in just 3 lines! Think of it as a challenge to train your creative thinking and writing skills by expressing yourself in as few words as possible. Reduce stress and feel calmer in the process!  Why you should try HaikuJAM   Research shows that even a little bit of creativity each day can boost well-being, be it writing poetry, quotes or stories, journaling, dancing, drawing, anything you like! This is because creative acts help us to express our thoughts and emotions, to reduce stress, to relax and find inner peace, to think clearly and to grow as people. If you ever feel like you need to calm down, let go of all stress but dont know how to relax, HaikuJAM is there to bring your mental peace :)  Say bye to writers block   HaikuJAM is here to help you make creative writing a part of your daily life, with fresh creative writing prompts and an inspiring creativity tracker. Plus, youll learn to express your thoughts, ideas and emotions and understand yourself better by using our mood tracker and personal insights that decode your thought patterns and emotions with HaikuJAM Premium.  Not a writer or poet? Not to worry!   Just write what first comes to mind, unwind and let your thoughts and emotions free - HaikuJAM is designed to make creative writing super fun and calming. You will collaborate with other people just like you, writers and poets around the world and help each other find inner peace and feel calm, learn how to write better and make friends! It will feel good, trust us :)  Other things to enjoy  - Very light and free writing app that doesnt use up much space on your phone - Be creative and find peace whenever it suits you with personalised writing reminders - If you love word games, this ones for you! Without a doubt the most sociable, creative, calming and beautifully designed word game around. - Practice writing in English with the help of spelling and grammar checkers - Collaborative writing means that youre always getting new perspectives from writers and poets around the world - Learn new vocabulary and writing techniques from millions of poems and quotes - Stay motivated with daily insights on your progress, creativity tracker, writing challenges, prizes, badges and earn Karma points - Set your own topics and get people writing about causes that matter to you  - Chat with your favourite writers and poets, get to know them better and make friends - Write on photos of your choice and personalise your words - Use unique backgrounds and fonts and write solo with HaikuJAM Premium  - Share your beautiful write-ups with friends on Social Media - Read and discover poetry, quotes, haiku poems, micro stories and shayari on any topic - Prevent burnout, manage stress, anxiety and depression by sharing your thoughts, worries, feelings and emotions without filters - take care of your general well-being  - HaikuJAM creates a sense of belonging as there is always someone who will hear you out, make you feel understood and less alone  As a small gesture of support during this time, we have made HaikuJAM Premium free for everyone until further notice. With HaikuJAM Premium, you can manage your wellbeing with Emotional Insights, write in SOLO mode and customise your write-ups   Follow @haikujam on social media and DM us if you face any issues.   Happy jamming! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'android.permission.GET_ACCOUNTS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.READ_CONTACTS', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.herokuapp.haikujam.permission.C2D_MESSAGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}