{
"name" : "Meetchat-Social Chat & Video Call to Meet people",
"url" : "https://play.google.com/store/apps/details?id=com.vichat.im",
"package" : "com.vichat.im",
"category" : "Social",
"description" : "Meet chat is a live video chat and call app. A new way to one-one-one video chatting and random chat with new people in 130 countries! And random match calls with strangers. Download meet chat and start meet & chat now!   Unlike other free live video cam call app, Meet chat has these extraordinary Features:  - Meet new local and meet strangers new local - Live free cam chat with beautiful girls and strangers and friends - Random video chat live cam hot in chatrooms - Free random chat and call match with strangers new local  Meet new and strangers local? Meet chat is a good place to meet strangers local. Using cam suft function, download the free and random live video chat and the free live video camchat call app - Meet chat, enjoy live strangers time and start your live video chat journey and meet friends and strangers local.  More surprises: Random match with strangers and friends local Meet chat offers you a new chance to meet strangers and friends local through random chatting. You could random video chat live cam hot and free live video camchat with strangers local.   More than voice chat Previously, you could only hear the voice from others. But now through cam suft and random cam chatroom, you have more chance to see the beautiful girls and free live video chat with strangers and friends local. In addition to text messages, there are so many random, live video calls and free cam chatrooms. Enter the random cam chatrooms and start free live video chat with stars and friends local and new. Start your cam surf now!  Free and random Iive video chat apps singles through cam chatrooms In Meet chat, you could meet local friends and strangers new. Then start the live video chat or random free video chat with stars. Or you could meet and match live free with beautiful girls and through match functions or random cam chatrooms. More than a way to help you randomly match with friends local and new. Live video chat and random cam surf calls with beautiful girls.  Free and random match calls with friends and strangers Through cam surf, you randomly meet local friends and strangers local and new. Through your location and photos, your fans could meet and match with you. Live video chat and random video chat live cam calls are new ways and functions to meet and find friends and strangers new and local. Stay at home and face meet your new friends in cam chat and cam chatroom calls.   Meet different friends and strangers from interesting life circles There are so many friends and strangers from different life circles, like travelling, food, music, dating, cam surf, cam girls, party guys... In this private cam surf chatroom, you will meet beautiful girls and friends and strangers local and new. Start your live cam chat with stars, friends and strangers. Text strangers and friends. You will meet what you want to meet.  : Open your cam surf function to let strangers and friends local discover you. : Open your location, meet friends local. : Open camera and mic before you go free live video chat and call. : Random match calls through free live video cam chat and free camchat with stangers.  New functions and new version offer you more chance to meet friends and strangers local and new. Go through cam surf, you could meet new and local strangers and friends in cam chatrooms. Open your free cam chat rooms, then you could start your free live and random chat and call journey.   In Meet chat, you can meet friends and strangers local by free live video chat and random cam chat with friends around the world or local! Dont waste your time. Join us and match call now! Friends and strangers local and new are waiting for you! Enjoy your free live and random chat and calls through cam live video chat. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REORDER_TASKS', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.WRITE_SETTINGS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_LOGS', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.REORDER_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.READ_LOGS', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'com.android.vending.BILLING', 'android.permission.REORDER_TASKS']",
}