{
"name" : "Mohalla – Online Chat Rooms, Watch Together",
"url" : "https://play.google.com/store/apps/details?id=com.cluxid.mohalla",
"package" : "com.cluxid.mohalla",
"category" : "Social",
"description" : "Meet new people, enjoy public or private chatrooms, watch videos or play games together and form ever-lasting connections with Mohalla  Online Chat Rooms, Watch Together.  Find friends from all over the world. Do you like to meet new people and talk to strangers to build strong connections? Mohalla app provides you with exclusive public and private chat rooms where you can meet people from every nook and corner of the world. Whether you are from India, France, Australia or America, you can meet people, talk to strangers and form new social network connections on this app. Enjoy casual chatting, share gossip and never feel alone again!  Chat With Strangers to build everlasting connections. Have fun or build serious relations with new people in the public mohallas or private chat rooms. Participate in healthy, thought-provoking and interesting conversations. Tap into the topics that pique your interest and find a partner or group of people that love to talk on your topic of interest. You can find your topic of interest from conversation categories available in the app for your convenience.   Join Private Chat and enjoy personal conversations with people you like. Like someone? Befriend them and chat with them in a private chat room. Simply tap the heart present on the profile of the one you like and add them as a friend. Wait for the response and start private chatting the minute someone adds you as a friend!  Fully-Moderated Chat Rooms for your peace of mind. Worried about abusers? Dont worry! The Mohalla  Online Chat Rooms, Watch Together chat rooms are fully moderated by keen moderators who ensures that the conversations stay meaningful and productive. You can report anything that you do not like and we will take action immediately. You can also block someone whom you dont like anymore.   Grow your Social Network, share interests and do things together. Mohalla is one of the greatest chatting apps as it brings people of similar interests together. Out of all the popular chatting apps, Mohalla is one of those apps that let you watch videos with your friends, listen to songs with other people or play simple games with your social network. Chat as you do things together on one of the best chatting apps.  VIP Experience for VIP users. Enjoy unlimited, free texting, chatting. We also provide with the option for VIPs, which further enhance your experience at a sake-minimum cost.  Connect with a suitable match and spend quality chatting time. Build your personality and customize your feed based on your online encounters and personal interests. The app will send you a notification the minute you have a match so you two can hit it off and make everlasting memories!  Customize your Profile or share your photos. So what are you waiting for? Sign up on the app, create a profile, customize the profile picture, add a personal description and start chatting and doing things with people you like. You can also share your photos on the story wall. Switch to dark mode to save your battery and enjoy the vision-friendly experience.  Download and use Mohalla  Online Chat Rooms, Watch Together today! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_BIOMETRIC', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.USE_FINGERPRINT', 'android.permission.VIBRATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.android.vending.BILLING']",
}