{
"name" : "Hukamnama Sahib & Live Kirtan",
"url" : "https://play.google.com/store/apps/details?id=com.hukamnamasahib",
"package" : "com.hukamnamasahib",
"category" : "Social",
"description" : "About Hukamnama Sahib Application  Hukamnama Sahib Application is designed and developed with aim to provide Daily Hukamnama Sahib and Live Kirtan Streaming on your mobile. This application is freely available on play store. Read the Daily Hukamnama from Sachkhand Sri Harimandir Sahib Amritsar in Gurmukhi, Punjabi, English and Hindi Language right within the application. All updates of Daily Hukamnama Sahib are from www.hukamnamasahib.com.  Features   New User interface  New Mini Player   More stable streaming   HUKAMNAMA SAHIB - View, download and share all hukamnamas of today or any past days. - Live Audio Hukamnama Sahib - Live Audio Hukamnama Sahib Katha   LIVE KIRTAN Many new live broadcast from many other Gurdrwara sahibs.   AUDIO NITNEM - Added audio nitnem of all banis    GUTKA SAHIB All Nitnem Banis added to read.   No Advertisements (No Ads)   Daily Hukamnama Sahib Update Notification  You can get daily hukamnama sahib notification through app (Morning and Evening)   Hukamnama Sahib in Different Languages  You can read hukamnama sahib with translation in different languages : Punjabi, Hindi and English.   Sharing Feature  Various Buttons added in Hukamnama Sahib Tab to share Image of Hukamnama Sahib easily with one click through various social networking channels like Facebook, Whatsapp, Twitter, Instagram etc.   Hukamnama Sahib Archive  Select any previous date to view hukamnamas from the past.   Live Kiran Radio  Listen Live Kirtan broadcast from Sri Darbar Sahib Amritsar 24 hours.   Auto Play Live Kirtan  An option is provided in app settings tab to enable/disable auto play live kirtan.   Mini Player in Notification Bar  Beautiful mini player is added in notification bar to easily play/pause , stop and share application.   Beautiful Layout  The app is beautifully designed to meet the users expectations with simple and cool colors of the layout.   Faster Loading  Within 5 Seconds Application starts playing live kirtan and load complete hukamnama sahib (Morning and Evening).   Social Networking Site Links  To reach us through various social networking sites users must visit this tab.   Feedback and Contact  Feedback and suggestions always welcome, contact us with one click through call, sms, email and whatsapp through tabs provided in applications.  Timing Daily Hukamnama Sahib time changes (monthly) according to the Nanakshahi Calender months. We try our best to update Hukamnama Sahib as soon as possible but it takes some time to write and update on website so please cooperate with us.   Suggestions and Feedback If you face and problem while using application or wand to share feedback, feel free to contact us at: http://hukamnamasahib.com/contact-us/ You may directly write us at info@hukamnamasahib.com ; info@jugrajsingh.com; gurpeetmundi777@gmail.com   www.hukamnamasahib.com  This app is made available by support from individual donations by website users and S. Gurpreet Singh Mundi. We consider it as our moral responsibility to give due credit to all the content owners and thus, we gratefully acknowledge the support & contribution of SGPC for providing live streaming. HukamnamaSahib.com has helped connect the world-wide Sikh community and Guru Nanak Nam Leva Sangat through the Internet since 2017. We are a platform for human beings to hook up with wisdom of the Guru and with each other.   For more information visit us on-line at http://hukamnamasahib.com ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW']",
}