{
"name" : "Qeep® Dating App: Chat, Match & Date Local Singles",
"url" : "https://play.google.com/store/apps/details?id=com.bluelionmobile.qeep.client.android",
"package" : "com.bluelionmobile.qeep.client.android",
"category" : "Social",
"description" : "Want to meet singles in your area? Looking for online chat, flirt, date or a perfect match? You are at the right place!  Qeep is the most popular online chat and dating app for locals. Qeep has interest-based matchmaking algorithms which help you chat & meet with Singles in your area who like to do the stuff the same way as you. It is easy, quick, simple and safe!   Download our Mobile app, meet your match and arrange a Date today!  YES, IT ACTUALLY WORKS!  - Register for FREE to mingle with local singles.  - Meet exciting new Dates every day  - Nearby: Swipe through daily photos of like-minded local singles  - Get a constant flow of Matches 24/7  - Check New Singles that have recently joined in your location.  - Qeep is for Free - Yes! You read it right  - 100% location-based  Qeep has created over 2 Million Matches just this year! -------------------------------------------------------------------------------  Qeeps Unique features:  * All your information & Photos are safe with full data protection!   * User privacy is Qeeps Top priority, 100% private & secured!  * Handpicked Profiles: only real users, no fakes in Qeep!  * Nudity is strictly prohibited with strong backend moderation!  Qeep is a great interracial & international dating app to meet beautiful girls and handsome single men in your city & around the world. Present yourself and meet beautiful single girls & attractive hot guys nearby and hopefully one day soon you will find your true love!  Qeep is the only dating app that finds you matches based on what you really care about, and its 100% FREE. You will definitely find your date with us. Happy Flirting!   Whether you are looking for Asian date, dating beautiful black women or guy, Brazilian girls, African women or Swedish girls, weve got your back in finding a match.   Qeep works for every kind, whether it is catholic match, Christian dating, Muslim dating or Jewish date. Go on a date today!   Just grab a coffee and meet beautiful ladies at a single swipe, date for free!   Get date ideas, learn how to flirt with girls or how to get a boyfriend or even how to know if a guy likes you, from fellow users on Qeep.   Forget about those old-fashioned dating apps, date elite & high-class singles with style, meet mature ladies or women or new people every day you crossed your path with.   Whether you are a man seeking women or a woman seeking men to date, Qeep has got everything for you with a single swipe.  Unlike other love dating apps or free dating sites, Qeep opens new opportunities to find your perfect match, true love, a casual date, a quick flirt or even marriage.   There are plenty of fast dating website or apps but Qeep stands out of the crowd, as it is a great matchmaker that brings you best matches & many possible ways of chatting in harmony!  Find your girlfriend, boyfriend or lover anywhere across the globe, Qeep goes beyond boundaries, just swipe anywhere in the world or meet locals when you are traveling and search by location, ethnicity or religion. All users on our mobile app are genuine singles looking for love.  Meet interesting and like minded verified singles in your city on Worlds best dating and matchmaking app.  Woohoo! You are in the right place to fall in love with your boyfriend or girlfriend truly & madly. Qeep is hassle-free for Singles to find beautiful women or men online for flirting & dating. Try it now!  Happy Matchmaking! ================================  The app is free to download and use. Some in-app items will require payment. We also have the most FREE features to help you start dating! You might know someone whos in a relationship/dating because of a match they found on Qeep. Its your turn!  Find the partner of your dreams & a beautiful relationship with our best match.  We are here to help you build true relationships, find a date or your perfect match or even your life partner. Have something to say? Reach us at support-android@qeep.net ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.SEND_SMS', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE']",
}