{
"name" : "Be Happy (Kindness and Karma)",
"url" : "https://play.google.com/store/apps/details?id=com.thinksmart.happyapp",
"package" : "com.thinksmart.happyapp",
"category" : "Social",
"description" : "This App will change your life.   Are you sick of all the hate and negativity in our world, right now? Do you want to turn that hate into positivity? Then Be Happy might be just what youre looking for.  Every day, for one year, the App will notify you of a personal challenge to complete.  These simple, but potentially life-changing, challenges will lead you onto a path of pure happiness and kindness.  Share your achievements with others, by photographing your challenge or linking with social media, and spread that joy!  There are three types of task to complete. Each task will bring happiness to you and others: Something for you- take time for yourself and improve your well-being. Karma- put others first and, in the process, make yourself feel happy! Pay it forward- do heart-warming acts of kindness to others.  Could this simple App start a revolution and create a world where everyone puts kindness before negativity? Just imagine the possibilities  How to use: Each day, at a time of your choosing, a notification will arrive on your device, outlining your task. Once you have completed your special challenge, go into Be Happy and select a thumbs up! At this point, you may want to load a picture of you doing the task or link to social media to share your achievement with the world! Every task assigned carries its own number of stars- based on how challenging it is. These will total up over the year against your profile.  Dont worry, if you didnt manage to carry out your task that day- it will automatically be stored in your history page and you can try again when a convenient time arises! Keep track of all your tasks completed and pending in your history page and celebrate your achievements throughout the year.  Start today and be part of the revolution to change the world!  Check out our trailer at: https://youtu.be/gOQd-raKoCg  You can even post your achievements on the dedicated Facebook group to share with the world: https://www.facebook.com/groups/177518152772302  or follow us on Twitter at  https://twitter.com/BeHappy_App  For an even better experience, there are No Ads in this app. We hope you enjoy it. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}