{
"name" : "Senguntha Mudaliyar Matrimony - A Most Trusted App",
"url" : "https://play.google.com/store/apps/details?id=com.sengunthamudaliyarmatrimony",
"package" : "com.sengunthamudaliyarmatrimony",
"category" : "Social",
"description" : "SengunthamudaliyarMatrimony App is an exclusive app developed for Sengunthamudaliyar brides and Sengunthamudaliyar grooms. Sengunthamudaliyar matrimony app is a part of community matrimony apps from MATRIMONY.COM Ltd. Sengunthamudaliyar Matrimony app is designed keeping in mind various partner preferences that a bride or groom might choose to find their life partner. Our Sengunthamudaliyar Matrimony app is intelligently designed to give you best results to match you with your life partner.  We are the largest matrimonial platform for the Senguntha mudaliyar community. Our app and web Sengunthamudaliyar matrimonial services have enabled 1000s of Sengunthamudaliyar weddings.  Our database consists of brides and grooms from different Professions, Educational Backgrounds, Regions & Sub Castes, Our databases of Senguntha mudaliyar aims to provide you with the best possible match to find the love of your life.  Sengunthamudaliyar Matrimony App Features:  Free Registration Safe and Secure APP. 100% privacy guaranteed Find your life partner at your convenience User Friendly Interface and Features for easy partner search  Get instant notifications when a partner communicates  Express your interest to shortlisted prospective matches Shortlist and save potential matches Know who viewed & shortlisted your profile  Search from 1000s of NRI profiles across the globe Indias most trusted matrimony services app from Bharat Matrimony  Find your partner from our other Regional Apps from Bharat Matrimony, Tamil Matrimony, Kerala Matrimony, Urdu Matrimony, Punjabi Matrimony, Hindi Matrimony, Bengali Matrimony, Gujarati Matrimony, Kannada Matrimony, Marathi Matrimony, Marwadi Matrimony, Oriya Matrimony, Telugu Matrimony, Assamese Matrimony, Parsi Matrimony and Sindhi Matrimony.  We have members that register from India and other countries like USA, UAE, Singapore, Oman, Kuwait, Saudi Arabia, Qatar and Others.  Profiles register from cities across the country and globe such as Chennai, Vellore, Kanchipuram, Coimbatore, Erode, Cuddalore, Salem, Pondicherry and Others.  SengunthamudaliyarMatrimony.com is a part of CommunityMatrimony.com from Bharatmatrimony.com - An Exclusive Community based Matrimony Service, we provide Exclusive Apps through our 40Plus Matrimony, Divorcee Matrimony, Manglik Matrimony, Any Caste Matrimony, Ability Matrimony and Defence Matrimony.  SengunthamudaliyarMatrimony is an exclusive service presented to you by trusted CommunityMatrimony - a renowned community oriented service for shaadi. Thousands of people from different Indian communities, including Senguntha mudaliyar community, have found their perfect match here.  Your privacy is a top priority for us at all times, so feel safe, we are a 100% secure app for shaadi.  The SengunthamudaliyarMatrimony app is light and easy to use. We can do a lot with just a little space on your phone.  So, what are you waiting for? Download the SengunthamudaliyarMatrimony app now and end the search for your special someone! Register FREE. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.CALL_PHONE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'com.sengunthamudaliyarmatrimony.permission.MAPS_RECEIVE', 'com.android.vending.BILLING', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'com.sengunthamudaliyarmatrimony.permission.MAPS_RECEIVE', 'com.android.vending.BILLING']",
}