{
"name" : "Good Morning Quotes- Daily Wishes & Greeting Cards",
"url" : "https://play.google.com/store/apps/details?id=com.bestwishes.quotes",
"package" : "com.bestwishes.quotes",
"category" : "Social",
"description" : "Daily Wishes And Greeting Cards Quotes & GIF Images app brings you the Best & Vast Collection of 2020 Wishes Images, Greetings, GIF Images & Quotes to Download & Share with your dear ones daily.  Get Daily Wishes, Everyday Greeting cards, Festival Wishes, Birthday Wishes, Family Wishes, Holiday Wishes, Anniversary Wishes, Love Wishes, Friendship Wishes, Good morning quotes, Sorry images, Life Quotes, Daily Quotes, love quotes, all GIF images, special wishes images & Gif, all festival gif images, christmas wishes, new year wishes etc.  You Can Download & Share All Wishes GIF images & Quotes with Your  Friends,  Family and  Love.  Send wishes, greeting cards, holiday greetings, daily blessings, best wishes etc to your near ones personally.   Wishes Images & Quotes Categories included in this App are:   Happy Makar Sankranti Wishes  Republic Day Wishes & GIF  Independence Day Wishes & GIF  Makar Sankranti Images & GIF  Happy new year images 2020  Happy new year Wishes with name  Christmas Eve Wishes  Christmas Wishes  Greeting Cards  e cards  Valentine Day Wishes Images  Dhanteras Wishes Images  Rangoli Designs  Happy Weekend Images  Halloween Wishes Images  Good morning images in hindi  Good morning images in english  Good morning quotes  Good night images in hindi  Good night images in english  Good afternoon images  Good evening images  All the best wishes  Happy Birthday wishes images  Engagement wishes images  Congratulations wishes images  Happy Holi English images & wishes  Happy Holi Wishes 2020  Ganesha photos  Ganesh Chaturthi images  Teachers Day wishes  Valentines day wishes & gif images  Womens day images & wishes  Guru Nanak wishes  Patrick day wishes  Mothers day wishes  Fathers day wishes  Eid Mubarak images  Ramzan wishes  Friendship Day wishes images  Raksha Bandhan images 2020  Janmashtami images  Independence day images 2020  Vishwakarma Jayanti Images  Navratri wishes  Army Images  Dussehra Images  Gandhi Jayanti Images  Sunday Wishes  Childrens Day Wishes  Happy New Year wishes in Hindi  Guru Gobind Singh Jayanti Wishes  Lohri Wishes Images  Happy Pongal wishes  birthday wishes images  Happy Makar Sankranti images  Latest Shayari Images  anniversary wishes images  Love Shayari images Hindi  Hindi sad Shayari images  Judai Shayari Images  Dard Bhari Shayari with images  Republic Day Images for WhatsApp  Australia Day Images  Valentine week greetings  Happy rose day images  Propose day images  Chocolate day images  Teddy day images  Promise day images  Hug day images  Kiss day images  Valentine day wishes  Valentine Day Image Shayari  Maha Shivratri wishes Images 2020  Happy Holi Hindi images & wishes  Hola Mohalla Images  Chaitra Navratri wishes  Gudi Padwa images  Ram Navami wishes  Mahavir Jayanti wishes  Good Friday wishes  Easter wishes  Hanuman Jayanti images  World Environment Day Photos  Ambedkar Jayanti Images  International Yoga Day Wishes  Happy Diwali Images 2020  People all over the world are very busy and have no time to meet personally to each and every person on various festivals, special occasions and couldnt wish their family, friends, colleague, relatives and loved once.  But with a little help from our Daily Wishes & Greeting Cards App, you can easily wish your dear ones instantly.  Send good morning greeting cards and wishes, good night greeting cards to your friends daily and make them feel special. Also from this Daily wishes and Greeting cards app you can add your own text and make your personalized greeting cards, holiday cards, e-cards, birthday cards, christmas cards, digital cards, free ecards, greetings, text on image editor, greeting card maker etc.  Disclaimer: All images in this Daily Wishes Image, Greeting cards & Quotes app are public domain on the internet. If you have any issues with the images please mail us at goodbooksapp15@gmail.com and we will sort out the issue ASAP. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.bestwishes.quotes.permission.C2D_MESSAGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}