{
"name" : "indaHash",
"url" : "https://play.google.com/store/apps/details?id=com.idhmedia.indahash",
"package" : "com.idhmedia.indahash",
"category" : "Social",
"description" : "Do you want to take part in campaigns on your social media for the best global brands? Want to share your beautiful profiles with the world and earn money while doing so? Download our app and see how it works!  If you have any questions, feel free to contact us at support@indahash.com or use our chat on www.indahash.com. Reach out for some tips on how to increase your chances of landing a campaign and how to improve your account! Get the opportunity to cooperate with brands that you already know. Every qualitative account is welcome, for as long as you meet the requirements!  About us  indaHash is the largest global influencer marketing platform that enables digital influencers to collaborate with the biggest and most popular brands from all over the world like McDonalds, Nestle, Coca-Cola, Nike, Volkswagen and many more. Why is indaHash the best influencer app in the whole world? We have over 900,000 INFLUENCERS registered with indaHash. More than 500 unique BRANDS have worked with us. And we operate in more than 90 MARKETS! How to I join indaHash? Its really easy!  1) Download the best influencer app in the world  2) Register your account 3) Join our campaigns and make money while doing what you love   What requirements must I meet to do campaigns?  1) Minimum 5000 followers 2) Minimum 40 posts 3) Good Engagement Rate of your followers 4) High-quality content You can help us become even better! How? Its easy. Simply send us your feedback to support@indahash.com. Your opinion keeps the heart of the influencer industry beating every day. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}