{
"name" : "All option social media app and Browser",
"url" : "https://play.google.com/store/apps/details?id=com.amar.socialmedianetworks",
"package" : "com.amar.socialmedianetworks",
"category" : "Social",
"description" : "All option social media app and browser provides easy access to all social networks in one application web browsers makes it easy to share your most recently used social media networks and social network allows Smartphone users to access their multiple your favorite social media icon,quotes using social media accounts from a single mobile app.   For social media social network marketing Messengers advertising from your phone.All in one social media app united kingdom social media Portuguese social liker all apps Italy social media India app contains all the famous popular all social media connection.all option social media app and Social Networks has a built in browser apps which opens every page fast and securely.    all in one app for all social media All Social Activities made easy follow the social trend easily by installing. social media wings explorer top 10 social media updates and social media access help relay whats going on in your world. Mexico social media Catalan make plans to meet up with friends with all option social media app and browser of your social friends.   Do you want to have access to all your social network apps in one place? Then no need to worry because our all option social media app and browser will help you.All in one Ukrainian social media browser lock French social tools play tool all Nigeria social networks in one text video super fast call chat, all in one messenger app browse free social networks in Arabic.  Message your friends in Direct. all free social media applications like meetme, badoo, skout, houseparty, textme, moco, hermit, abo, weplog, orkut, livejournal, netflix, insta, fb, baboo, badoo, HI5, social media and relationship in one Start fun conversations and videos to your feed that you want to show on your profile. manage all social media valut and addicted to social media.  All apps in one app your Indonesia social media needs can be met on Share messages and locations easily with friends.Debate for social media Send private messages to other users to share news and make plans with friends. All social media and social network in one app will let you can open social media management tools newest social media low mobile data consumption.   All option social media app is an application that groups and provide an easy access to all social networks namely. This is the coolest social browser present on Play Store in category or all in one social media app or social apps. chat on advertising, entertainment, your phone in one application.  DISCLAIMER:  All websites featured in the app through a permission process, making sure content is reproduced post-contact via email, telephone, affiliate management services, etc. If the owners of any of the websites are to notice any violation of terms & conditions, please bring to our notice immediately via email.  All contents of the website are owned by the respective website. We have no copyright over the content/logo of other websites. For any details, please mail us. These third-party sites have separate and independent privacy policies and terms. Please read their privacy policy and terms and conditions carefully.  The Icons used are owned by respective companies, and the social app declares that it does not impersonate any brand. Icons have been used to show users the presence of such content inside the app. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_CONTACTS']",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.amar.socialmedianetworks.permission.C2D_MESSAGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.CAMERA', 'android.permission.ACCESS_ASSISTED_GPS', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.ACCESS_LOCATION', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.RECORD_AUDIO', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.VIBRATE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.ACCESS_GPS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_ASSISTED_GPS', 'android.permission.CAMERA', 'android.permission.ACCESS_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_GPS']",
}