{
"name" : "Seguridad Chimalhuacán",
"url" : "https://play.google.com/store/apps/details?id=com.d3v3l0p_segb.seguridadchimalhuacan",
"package" : "com.d3v3l0p_segb.seguridadchimalhuacan",
"category" : "Social",
"description" : "La direccin de Seguridad Pblica y Trnsito de Chimalhuacn es una aplicacin que te permite realizar denuncias y establecer un vnculo con las autoridades del gobierno del Nuevo Chimalhuacn. Puedes enviar comentarios, quejas, sugerencias o denunciar alguna anomala en forma de texto, con la posibilidad de adjuntar imgenes como prueba. Adems, te permite acceder a informacin sobre las principales estrategias de seguridad instrumentadas en todo el territorio local. La autoridad municipal no recopila datos personales y la denuncia no se almacena en el dispositivo. Esta aplicacin es un servicio del gobierno municipal desarrollado para que la ciudadana conozca a detalle las acciones para salvaguardar la integridad de la poblacin.  Trabajemos unidos contra la inseguridad The Directorate of Public Security and Traffic Chimalhuacn is an application that allows you to make complaints and establish a link with the government authorities of New Chimalhuacn. You can post comments, complaints, suggestions or report any anomaly in the form of text, with the possibility to attach pictures as evidence. It also lets you access information on major security strategies implemented throughout the local territory. The local authority does not collect personal data and the complaint is not stored on the device. This application is a service of the municipal government developed so that citizens know in detail the actions to safeguard the integrity of the population.  Let us work together against insecurity ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.WRITE_CALENDAR_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.d3v3l0p_segb.seguridadchimalhuacan.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}