{
"name" : "hayi - Live Stream Video Chat",
"url" : "https://play.google.com/store/apps/details?id=com.lovoo.vidoo",
"package" : "com.lovoo.vidoo",
"category" : "Social",
"description" : "Streams come true.  No plans this evening but feel like talking to people? Welcome to hayi! hayi is your app for pure entertainment, diverse shows and fun in the live chat.   A place where something is always going on, every moment is unique and emotions are pure and genuine.  Bursting with energy, the focus is on the streamers, supporters, pure entertainment and the most relaxed way to meet people.   Here you become part of a community that sticks together  a diverse group of people that all have the same goal: to meet people, exchange ideas, goof around, entertain one another. The best part? No two days are the same. Each moment is special and unique. Youll never experience how you experience it here again. Better than TV, right? No, rather the future of TV! You can experience all that with hayi Live entertainment with direct interaction (live chat, virtual gifts) Diverse shows, contests, formats and streamers Your own community or fan base  Entertainment, streams, live videos:   Gone are the times of boredom when you switched through the program. With hayi, you swipe through the streams, determine the program yourself and sit back and relax for your live entertainment. You can give streamers you like animated gifts or find your own community. Our top streamers are always coming up with something new to inspire their audience. With regular shows, contests and brand-new formats, entertainment on hayi is, and remains, colorful, fun, diverse, and simply lively.  Imagine, you are cozy at home, you pick up your phone, press the record button and speak to thousands of people! Whether you want to release the entertainer in you or prefer to sit back and watch streams is up to you. hayi is for everyone.   Streamers and supports are a team on hayi  there cant be one without the other. As a streamer, the stage is yours; as a supporter, you decide what happens.    Stream team in the live chat:  Where else can you chat to others at the click of a button? Join a stream, say hello and before you know it you are right at the center of the action. The side stream offers even more interaction. Here you can chat with other streamers in the live video chat and get your community involved: An action-packed get-together of friends that you dont even need to get off the couch for.   Battles, surveys, and shows:  A number of features make sure that our live streams are entertaining.  Live out your ambition in the battles, go up against other streamers and be celebrated by your viewers. This is where the real action is, get the most gifts in a short space of team and emerge from the battle as the triumphant victor. Share your elation over your victory and your victory dance with your viewers. You did it together!  You can also start surveys and let your fans decide how you organize the show. ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
}