{
"name" : "Morari Bapu (Official)",
"url" : "https://play.google.com/store/apps/details?id=com.alive.moraribapuapp",
"package" : "com.alive.moraribapuapp",
"category" : "Social",
"description" : "Jai Siya Ram  Quotes  Quotes (SuVaakya) recited by Bapu during Kathas and several other occasions   Daily Katha Clips  Daily short videos of on going Katha or previous Katha   Ram Charit Manas  Chopai of Ram Charit Manas. The chopais come with their literal translations in English.   Katha Chopais  Chopai of Ram Charit Manas which formed the base of Bapus Kathas. The chopais come with their literal translations in English.   Katha E-Books  E-Books of the katha booklets which have been made and printed. For iOS users, E-Books will open in iBooks by default. Android users will have to download Kindle from the play store to open the eBooks. Android users will also have to open your amazon account to use Kindle.   Live Katha Video  Live video feed of on going Ram Katha from across the world. You can watch it on your phones and tablets with an access to data services and/or WiFi zones. This link will directly take you to live feed channel on YouTube.   Live Katha Audio  Live audio feed of on going Ram Katha from across the world. You can listen to it on your phones and tablets with an access to data services and/or WiFi zones. This link will directly take you to live feed channel on YouTube.   Morari Bapu - YouTube Channel  Direct access to Morari Bapu - YouTube Channel which contains previous Katha Videos   Events  Details of yearly events and upcoming events being organised by the Trust and Pujya Bapu.   Media  - Images  Photos of Bapu   - Other Videos  Videos of other events and interviews.   - Daily Katha Clip  Daily short videos of on going katha or previous katha   - Audios  Audio tracks of Sankirtan, Stuti and Bapus favourite melodies.   - Articles  Articles related to Bapu published in media   Whats New  Updates from Pujya Bapu and Shree Chitrakut Dham Trust.   Upcoming Kathas  Information of the upcoming kathas as provided by the katha organisers   Favourites  You can add any content into this section and view the same in offline mode.   Share  You can share all the contents of this app with you friends and family through any other social media app available on your phone.   Other features and tools  - Clicking on the Ram logo on the top of the app, navigates you back onto the home screen  - Clicking on Katha location shall show you the location of the Katha on google maps  - The Katha dates shall automatically get saved and linked onto your phone calendar and reminder for the katha as per the timing shall pop up on your phone  - Only 1 month old data shall be available on the app at any given time, unless added to favourites which gets saved onto the memory of your phone / sd card  - Access to Sangeet ni Duniya Online website and very soon to their online shop.  Sadguru Kripa Hi Kevalam    Shree Chitrakut Dham Trust ",
"desc_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.CALL_PHONE', 'android.permission.READ_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['com.alive.moraribapuapp.permission.C2D_MESSAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_FINE_LOCATION', 'com.example.permission.MAPS_RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CALENDAR', 'android.permission.VIBRATE', 'android.permission.CALL_PHONE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_CALENDAR', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.example.permission.MAPS_RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS']",
}