{
"name" : "Christava Matrimony",
"url" : "https://play.google.com/store/apps/details?id=com.christavamatrimony.app",
"package" : "com.christavamatrimony.app",
"category" : "Social",
"description" : "Christava Matrimony is the latest app for Kerala Christians seeking their perfect Malayalee Christian partner. It is the perfect platform for you to find the ideal Christian life partner in your dreams considering your religious preferences in marriage.  The best Christian matrimony service online for Malayalee Christian brides and grooms, Christava Matrimony allows you to register from anywhere the world and search globally and locally with profiles from around the globe. We list potential Malayalee Christian matches for you from different parts of India and from all over the world, while not forgetting the denomination and division you desire.  Christava Matrimony App features:   Free Registration Safe and Secure APP. 100% privacy guaranteed Find your life partner at your convenience User Friendly Interface and Features for easy partner search  Get instant notifications when a partner communicates  Express your interest to shortlisted prospective matches Shortlist and save potential matches Know who viewed & shortlisted your profile  Search from 1000s of NRI profiles across the globe Keralas most trusted Christian Matrimony services App for Malayalee Christians  Christava Matrimony has registered members from various Denomination such as Adventist, Anglican / Episcopal, Apostolic, Assyrian, Assembly of God (AG), Baptist, Born Again, Brethren, Calvinist, Catholic, Church of God, Church of South India (CSI), Church of North India, Church of Christ, Congregational, Evangelical, Jacobite, Jehovahs Witnesses, Latin Catholic, Latter day saints, Lutheran, Malankara, Marthoma, Melkite, Mennonite, Methodist, Moravian, Orthodox, Pentecostal, Protestant, Presbyterian, Seventh-day Adventist, Seventh-day Adventist, Syro Malabar and Syrian Catholic.  We are recognized as the most trusted NRI Matrimonial Service provider for aspiring Kerala Christian Brides and Grooms to find their perfect partner, especially for NRI communities spread over USA, Canada, Middle East, Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, Australia, Singapore, Malaysia, Srilanka, United Kingdom, London, France, Germany, New Zealand and others globally.  ChristavaMatrimony.com is the product of eBeams Infotech, a Cochin based web Development Company with clients in more than twenty four countries around the world.   We truly respect your privacy at all times, so be assured, we are a 100% secure site for shaadi.  The ChristavaMatrimony app is not just easy, its light too. We can do a lot with just a little space on your phone.   So, what are you waiting for? Download the ChristavaMatrimony App Now and find your perfect life match! Register FREE! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_APP_BADGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.christavamatrimony.app.permission.C2D_MESSAGE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}