{
"name" : "Localwire -Andhra & Telangana Local Social Network",
"url" : "https://play.google.com/store/apps/details?id=com.rpoli.localwire",
"package" : "com.rpoli.localwire",
"category" : "Social",
"description" : "Localwire is a hyper-local Social Network which allows users to discover or contribute News, Happenings, Experiences, Events, and Discounts around their location, i.e. within 1 to 100 miles of radius.   With facebook and twitter we are getting unlimited global updates but it is hard to find whats happening in your locality, localwire will help you find local news, happenings, around you.   Read or share content in your local language, i.e. Telugu, Tamil, Hindi, Kannada, Malayalam.  Features:  Feed Around - We see News, Opinions, Experiences, etc. around you  Vendors  Find products, services, promotions from local stores.  Events  Find interesting events near you and book tickets.  Deals  Grab the best deals around you.  Follow  Follow local Artists, politicians, Government Organisations, celebrities, brands, business and never miss updates.  Teleport  Point any location on map and see whats happening around.  Scale  Adjust the radius of your choice.  Highlights  Content Sharing or Viewing based on geolocation.  Empowering local businesses by listing their products & promotions on app  Users can buy tickets for local events and claim deals from local stores  Verified accounts for Local Government bodies, NGOs & local businesses  360 characters limit makes us a micro blogging app for local news/happenings  User can see reach on their posts   We are a social network with the service features  Achievements   We are an Award winning startup at StartAP Fest  Incubated at Andhra Pradesh Innovation valley, Vizag.  Presence   Currently our presence is in Visakhapatnam, Vijayawada and Hyderabad. And other towns in Andhra Pradesh and Telangana.   Featured  Sakshi - Localwire is a local twitter  Yourstory - The perfect place to get local updates  Indian Express - An app for updates of your neighborhood  Ennadu - Innovative app to know happenings around  Deccan Chronicle - The Ready-Reckoner  Andhra Jyothi - Best app for local happenings  The Hindu - Get wired, Locally!  Times of India - Localwire keeps you posted. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.rpoli.localwire.permission.C2D_MESSAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_NETWORK_STATE', 'com.google.android.gms.permission.ACTIVITY_RECOGNITION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}