{
"name" : "Life Quotes",
"url" : "https://play.google.com/store/apps/details?id=com.unit.motivational.quotes",
"package" : "com.unit.motivational.quotes",
"category" : "Social",
"description" : "Life Quotes has a great collection of motivational quotes, inspirational quotes and motivational Status.  It has great collection of quotes and status, quotes for whatsapp status, motivational quotes, Success Quotes ,motivational wallpapers. These amazing motivational quotes helps you to get inspired everyday and also inspire others by sharing it on social media platforms whats app, Facebook, Instagram, twitter.   These motivational quotes categorized in different categories, which include:   Attitude Quotes   Awesome Quotes and Status  Best Quotes and Status  Dream Quotes and Status  Happiness Quotes and Status  Hard Work Quotes and Status  Life Quotes and Status  Motivational Quotes and Status  Never Give Up Quotes and Status  Quotes   Success Quotes and Status  There is also best collection of inspirational quotes by famous personalities which brings the lot of positivity to your life. These life quotes or motivational quotes will inspire you to dream big, work more harder to achieve your goals. These life quotes are updated on regular basis so that you can always have fresh quotes to get inspired and share it with others.   Features:  * Works offline. * Latest collection of picture quotes, quotes for Instagram, quotes for whatsapp status, quote wallpapers. * Add any life quote to favorite list for early access. * Easy to Copy and Share these inspirational quotes to your social media accounts. * life quotes can be shared as simple text or with beautiful background image on your social media. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}