{
"name" : "Luxy - Elite Millionaire Dating App to Chat & Date",
"url" : "https://play.google.com/store/apps/details?id=com.luxy",
"package" : "com.luxy",
"category" : "Social",
"description" : "Welcome to Luxy, the best online dating app for elite singles   Luxy is the best luxury millionaire matchmaker, meetup dating App for wealthy, rich, successful, beautiful and elite singles who like all things Luxury. Chat, date and meetup with local singles. Join and meetup for FREE if you earn more than $200k, or are voted in by other members. Luxy plays matchmaker for CEOs, established men and women, entrepreneurs, beauty queens, supermodels, celebrities, pro athletes, doctors, lawyers, sexy singles, handsome rich men, the players of football league, hot women and other elite singles who are seeking romance relationships.Its the best app for meeting new people!  Featured on Mainstream Media!  Luxy is labeled A Millionaire Matchmaker Dating App. With millions of millionaires around the world, Luxy has been featured extensively on CNN, BBC, Business Insider, CNBC, ABC, The New York Times, The Huffington Post, to name a few. Jimmy Kimmel Show even made an episode about Luxy.   Elite match dating apps from Raya to Luxy that use net worth and Instagram followers as filters--Standard Luxy is for millionaires; Raya is for celebrities... --Geekwire  How Our Matchmaking Works Luxy extends its millionaire match service by hosting Elite Singles Parties, meetup dating. Global Millionaires attend our parties to chat, flirt and date with attractive, real, like-minded, sexy and local elite singles. Locations include NYC, LA, Miami, Paris, Milan, and London.   While therere other millionaire dating apps like Raya, Luxy executes the most reliable verification process to guarantee the best user quality among all the match dating apps. The annual income earned by Luxy Millionaire Singles:  41% earn $1M+ 3.3% earn $750K+  7.6% earn $500K+  15.3% earn $350K+  17.6% earn $250K+   Free access to many easy-to-use features: - Meet, chat, flirt and date with rich men / millionaires nearby - Swipe Right to Like and Swipe Left to Pass - Unlimited messages to local singles and your millionaire matches  - Free virtual gifts - Meetup dating  Enhance your experience with our most exclusive dating membership - Luxy BLACK + See Who Liked Your Profile. + The Private Mode: Show your profile to the ones that you have LIKED. + Unlimited Swipes: Get unlimited profiles, match more wealthy and sexy singles! + Advanced Filters: Find friends and meet new people. i.e. Singles meetup in the US / date people over 40. + BLACK Messages: Flirt and chat with local singles and the beautiful and the wealthy. No limits.   More subscription options, low to $12.99/mo.:  - Your account will be charged at confirmation of your purchase and auto-renews for the same price and duration period as the original one/three/six-month package. - Auto-renewal may be turned off by going to your Account Settings after purchase and must be turned off at least 24-hours before the end of the current period  - No cancellation of the current upgrade plan is allowed during your active period.   Please note that Luxy is not for sugar daddy / sugar baby relationships. Seeking arrangement is not allowed on Luxy. We have a strict review mechanism - the system will note if your conversation triggers some keywords, i.e. sugar daddy/baby, seeking arrangement, secret benefits and so on. Once its detected/reported for the reason on above, your Luxy account will be blacklisted forever. Unlike other flirting dating apps, Luxy has a more advanced verification process, ensuring users more reliable verified profiles. Luxy is the app for you to meet new people and local singles, helping you find real love with like-minded people. Whether you belong to the league of the Millionaires or the league of the attractive, Luxy is aimed at giving you the perfect elite single match.   Your privacy is always the most important thing to us. See more about our Privacy Policy and Terms at:  https://www.onluxy.com/page?path=privacy https://www.onluxy.com/page?path=terms ",
"desc_perms" : "['android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.luxy.permission.C2D_MESSAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.READ_LOGS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_LOGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}