{
"name" : "iMarriages Free Matrimony",
"url" : "https://play.google.com/store/apps/details?id=com.imarriages.imarriages",
"package" : "com.imarriages.imarriages",
"category" : "Social",
"description" : "A free to chat matrimony app by iMarriages - the worlds most advanced Bharat shaadi (jeevansathi) matrimony bureau. Our Bharat based shaadi service offers free messaging and is designed for the modern Indian who places trust and personality matching as top concerns.  Our free Bharat based matrimony app offers superior value for money over traditional paid shaadi and jeevansathi services.   Take a look at some of the key features of the iMarriages matrimony app:  * Free to download * Free to create your profile * Free to message other members * Search for suitable matches and save your favorites for future viewing * Allow our automated matching system to find you suitable prospects * Receive your own personality report * Stay securely logged in, no need to constantly re-enter your password * Get instant notifications and never miss out on a conversation with a potential match * Automatically syncs with your existing iMarriages account and profile * Real profiles - each and every profile registered is human screened, giving you confidence and trust in our member base * Lightweight - the app is very small and takes up less space * Secure - all communication between your device and our servers is encrypted  We believe in a unified and strong India, which is why we have not segregated our members by their mother tongue or region. Speakers of Tamil, Hindi, Bengali, Marathi, Kannada, Malayalam, Telugu, Gujarati, Marwadi, Punjabi, Oriya, Assamese, Sindhi, Parsi, Urdu can all be found within the one portal.  By not segregating India, a person whose mother tongue is Tamil but is living in Bangalore does not need to manage accounts and profiles on two separate portals.  Our modern design is perfectly matched for aspiring brides and grooms who are living outside of India and looking for an NRI matrimony service. In fact, our NRI community spans many countries including UK, USA, Canada, Australia, Singapore, UAE, Malaysia, Saudi Arabia, Qatar and Oman.  Whether you are in North India and seeking an exquisite shaadi or jeevansathi, or South India and dreaming of an amazing kalyanam, we have all the various communities covered.  Our largest most active regions in India are Tamil Nadu, Kerala, Maharashtra, Karnataka, Andhra Pradesh, Delhi, Gujarat, West Bengal, Uttar Pradesh and Orissa. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}