{
"name" : "Invitation Maker, Greeting Card Maker (RSVP)",
"url" : "https://play.google.com/store/apps/details?id=com.sk.invitation",
"package" : "com.sk.invitation",
"category" : "Social",
"description" : "Invitation Maker (RSVP) Create custom invitation cards by simply choosing a free invitation template and edit it with your own images, messages, etc.  Create your own invitation card for party, birthday, wedding ceremony, engagement/ring ceremony within seconds using beautiful and professional templates.  Look like you hired a professional designer by creating an awesome invite in seconds.  Its easy and fun to create invitation cards to invite your friends and family for any occasion.  Key Features: 1. Various collection of professional and beautiful invitation and greetings card templates 2. High-level customization support 3. Cool sticker collection 4. Add text with multiple fonts and text effects 5. Change Image from gallery or from the background image collection 6. Photo Editing 7. Autosave your work 8. Multiple layers 9. Lock & Unlock Stickers 10. Duplicate Your Designs 11. Create Your Own 12. My Arts Gallery 13. Shapes Collection 14. Texts Collection 15. Ultimate Graphics Designs 16. Share on social media 17. Easy to use   Announce your special day to the whole world with a beautiful message wrapped in attractive wedding card designs. Get started today!  Invite Maker & Greeting Cards Maker Select the greeting card from templates. Edit cards by changing the background image, stickers and texts. Change font, color, and size. Cards are available in both landscape and portrait category. Create your own greeting cards with ease.  You can create the greeting cards for anniversary, birthday, best wishes, good luck, Christmas, congratulations, festival wishes, Environment Day, Fathers Day, Friendship, Get Well Soon, Good Morning, Good Night, Graduation, Inspirational & motivational quotes, love you, miss you, mothers day, Sorry, Sympathy, Thank you, etc.  Invitation Card Maker, Greeting Card Maker (RSVP) have almost all types of Invitation Categories  1. Party Invitations 2. Wedding Invitation Cards 3. Baby Shower Invitations 4. Birthday Invitation Card Templates 5. Bridal Shower Invitation Card Designs 6. Engagement Invitation Cards 7. Anniversary Invitation Card Maker 8. Save The Date Invitations  Please rate the app and give your feedback to help us improve and create much more unique apps for you. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}