{
"name" : "Jain Matrimony - Leading Marriage App For Jains",
"url" : "https://play.google.com/store/apps/details?id=com.jainmatrimony",
"package" : "com.jainmatrimony",
"category" : "Social",
"description" : "JainMatrimony App is an exclusive app developed for Jain brides and Jain grooms. Jain matrimony app is a part of community matrimony apps from MATRIMONY.COM Ltd. Jain Matrimony app is designed keeping in mind various partner preferences that a bride or groom might choose to find their life partner. Our Jain Matrimony app is intelligently designed to give you the best results to match you with your life partner.  We are the largest matrimonial platform for Jain community. Our app and web Jain matrimonial services have enabled 1000s of Jain weddings.  Our database consists of brides and grooms from different Professions, Educational Backgrounds, Regions & Sub Castes, Our databases of Jains aims to provide you with the best possible match to find the love of your life.  Jain Matrimony App Features :  Free Registration Safe and Secure APP. 100% privacy guaranteed Find your life partner at your convenience User Friendly Interface and Features, for easy partner search  Get instant notifications when a partner communicates  Express your interest to shortlisted prospective matches Shortlist and save potential matches Know who viewed & shortlisted your profile  Search from 1000s of NRI profiles across the globe Indias most trusted matrimony services app from Bharat Matrimony  Find your partner from our other Regional Apps from Bharat Matrimony, Tamil Matrimony, Kerala Matrimony, Urdu Matrimony, Punjabi Matrimony, Hindi Matrimony, Bengali Matrimony, Gujarati Matrimony, Kannada Matrimony, Marathi Matrimony, Marwadi Matrimony, Oriya Matrimony, Telugu Matrimony, Assamese Matrimony, Parsi Matrimony and Sindhi Matrimony.  We have members who register from sects such as Shvetambar and Digambar. Also We have members from sub sects such as Murtipujaka, Sthanakvasi, Terapanthi, Bisapanthi, Gumanapanthi, Taranapanthi, Terapanthi, Totapanthi.  We have members from India and other countries like USA, UAE, Canada, UK, Australia, Singapore and others.  Profiles are registered from cities across the country and globe such as Mumbai, Ahmedabad, Pune, Bangalore and many more.  JainMatrimony.com is a part of CommunityMatrimony.com from Bharatmatrimony.com - An Exclusive Community based Matrimony Service, we provide Exclusive Apps through our 40Plus Matrimony, Divorcee Matrimony, Manglik Matrimony, Any Caste Matrimony, Ability Matrimony and Defence Matrimony.  JainMatrimony is a part of and is pioneered by CommunityMatrimony - an exclusive community oriented service for shaadi. Thousands of people from several Indian communities have found their perfect life partner here.  Your privacy is a top priority for us at all times, so feel safe. We are a 100% secure app for shaadi.  So, what are you waiting for? Download the JainMatrimony App Now and find your significant someone of love. Register FREE! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.GET_TASKS', 'android.permission.CALL_PHONE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.jainmatrimony.permission.MAPS_RECEIVE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.jainmatrimony.permission.MAPS_RECEIVE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.SEND_SMS', 'android.permission.CALL_PHONE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}