{
"name" : "FollowMeter - Unfollowers Analytics for Instagram",
"url" : "https://play.google.com/store/apps/details?id=com.beakerapps.instameter2",
"package" : "com.beakerapps.instameter2",
"category" : "Social",
"description" : "Track your Instagram unfollowers with Followmeter.  FollowMeter is the simplest way to manage your Instagram account. Our powerful analytics allow you to access deep insights into your Instagram account, monitor your unfollowers, follower growth, story views and posts performance.  We have all the features you love (Some features are part of the Plus Subscription): - Track unfollowers. - Detect who is not following you back. - See who views your stories the most. - See who viewed your stories but is not a follower (For public accounts). - See your top likers. - See your secret admirers. - Discover who your ghost followers are. - Track who blocked your account. - See which posts got most engagement. - Track your accounts engagement with our Activity Meter - Add your account to our discover section to get more exposure.  You can keep wondering who unfollowed you or you can get Followmeter and check who it was right now. There are people who follow you, and once you follow back, they unfollow you. Followmeter will do all the hard work and notify you when someone unfollows you.   Join over 3 million users who trust our analytics platform to help them grow their social presence.  Some of our premium features require a subscription. To learn more please visit: https://followmeterapp.com/subscriptions  Stay up to date: Follow our page on Instagram for awesome updates @followmeter   Have any questions? Contact our support team support@followmeterapp.com  FollowMeter is not affiliated with Instagram. ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}