{
"name" : "Free Dating",
"url" : "https://play.google.com/store/apps/details?id=com.mobile.android.eris",
"package" : "com.mobile.android.eris",
"category" : "Social",
"description" : "Eris is not only a popular dating application to meet millions of singles near you but also a social platform for fun and entertainment. You are going to contact to many singles living near you and will be surprised when you find your perfect match easily Our social network application will provide you diversity of premium member profiles and many options for good communication We know what you are looking for and we have designed Eris perfectly for your best dating experience  Come and join! Enjoy meeting with real & verified local members by using our top services  WHY ERIS?  1. We have a lot of verified & quality members living at your city  2. You can broadcast or watch live streams and can have a lot of fun.  Our premium live stream service will be very exciting & fascinating experience. You can  chat & send animated gifts,earn diamonds,use filters and face masks. Also joining to a broadcasting with your camera and doing a live conversation with  broadcaster will be big pleasure for you   3. We have very improved communication system which provides real time  communication with members using many options such as gift sending, text  messaging, sharing photos, location sharing, video and voice calls, video and voice messages, translation service,  instant photo sending with camera, animated gifs and sticker sharing. You can chat with members in different languages using our translation service  4. We have groups, you can create your own group or join other groups and do group chatting with many members from different social environments. You also also do broadcasting for your group members and have live communication with them  5. Our system is very secure and reliable, your data is strictly protected. We respect your  privacy  6. Improved filters, you can restrict members to contact to you with many options such as  country, gender, age, distance based filters  7. Our dating service provides you very improved notifications. You may be alerted about  any action performed by other members  8. Travel & Meeting system. This innovative feature of Eris lets you to publish your travel  requests or send meeting requests for members living far from you. Use this service and start your adventure with your soulmate living in another city or country  HOW IT WORKS?   Install Eris on your phone, sign up, search profiles and start your dating with Eris!  Give it a try , install Eris, create a free account in 10 seconds and start your journey now! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.VIBRATE', 'android.permission.FLASHLIGHT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}