{
"name" : "Attitude Quotes",
"url" : "https://play.google.com/store/apps/details?id=com.unit.attitude.quotes",
"package" : "com.unit.attitude.quotes",
"category" : "Social",
"description" : "We have the coolest attitude quotes categorised in 10+ categories,with the huge collection of stylist attitude quotes. It has huge collection of daily motivational quotes, quotes for motivation, quotes for whatsapp, picture quotes,attitude quotes with images,attitude quotes wallpaper hd. There are great collection of bio quotes for Instagram and Facebook which you can add it your bio on Instagram. You can share these positive attitude quotes as  message to your loved ones or you can use this as attitude caption of your photos.  Features :  Works without internet.  Add any Attitude quotes or status to favourite list for easy access.  Copy and Share these cool quotes directly into any social media like Facebook, Instagram, twitter etc.  Best collection of men quotes, strong men quotes, quote wallpapers, quotes for boys.  Best collections HD backgrounds.  Send quote as message.  Attitude status are updated on regular basis so that you can always have trendy attitude status or quotes for Instagram and Facebook photos.  These Attitude quotes and status are categorised in following categories  Angry quotes  Attitude quotes   Awesome status  Beard quotes  Bike quotes  Cool status for boys and girls  Inspirational quotes   Life quotes  Men quotes  Motivational quotes  Single captions  Smile quotes  Success quotes  Unique captions ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}