{
"name" : "Whatscan 2020",
"url" : "https://play.google.com/store/apps/details?id=com.hak.whatscanandqrcode",
"package" : "com.hak.whatscanandqrcode",
"category" : "Social",
"description" : "Whatscan for Whats Web scan is a world top rated Web CloneApp. Whatscan 2020 is very simple and easy to use Dual Chat option. Whatsweb Scanner App is also very light weight. Just need to open Whatscan 2020 app and scan QR Code from another app and now you are ready to use Dual Chat feature with this Web Clone App. Whatscan app for Whatsweb really helpful app for your WhatClone.  Whatscan 2020 - Whats Web Scan App have some unique features and you cannot find those in others android applications. Whatscan have optimized code, efficient working, super-fast scanning QR Code, super-duper QR Code reader and Scanner etc are the main key features. Whatscan 2020 - Whats Web Scan App is a top rated app for Whats Web Dual Chat and story saver.   QR Code Scanner: It scans QR code and decodes the information. It supports all kinds of QR codes. You can easily scan QR code by capturing the image. It quickly captures the code and scans into the information it is containing. With QR and barcode scanner app everyone can find out the retail price of marketed product.  Barcode Scanner: It quick scans any barcode and decodes the barcode into the information. It is a very secure barcode reader. With the help of this application you can use to scan medication, grocery, and price and quality assurance barcode.  Story Saver & whatscan cloner: Whatscan cloner allows you to manage dual accounts which were primarily on different devices on one phone. Story Saver & dual space allows you to have dual chat accounts from different numbers within one device like dual sim phone. You can manage dual space of accounts and do chatting from both accounts at the same time.  Features of Whatscan 2020 - Whats Web Scan:  * It scans QR code/bar code and, decodes and translates them. * very simple android application * Fast QR Scanner and Barcode Reader * Whatscan scanner app for whatsweb * Best whats tools according to your needs * It allows one to operate more than one account on one device to do chat. * You can open and read any chat from this Whatscan for Whatsweb app. * You can replay to any of your friend and get response back. * Delete chat messages with the help of Whats Web Scanner.  Help Tab: In this tab, you will get a help and find simple steps to use the Whatscan for Whatsweb app.  Download Whatscan for Whatsweb - Whatscan 2020, to enjoy dual chat & multiple accounts in one place. Where you can scan QR code or barcode for your personal or business use. Dont forget to share with friends & family.  We are always tried to develop helpful apps and your good reviews are always help to improve this Whatscan for Whatsweb App. Help us by sharing this app with your friends and family member, this whatsclone app is very helpful for you.  Disclaimer: Whatscan 2020 is created by us, neither it is an official application of WhatsApp nor associated with WhatsApp Inc. The WhatsApp name is copyright to WhatsApp, Inc. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.FLASHLIGHT', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}