{
"name" : "Jangam Matrimony - Matchmaking & Marriage App",
"url" : "https://play.google.com/store/apps/details?id=com.jangammatrimony",
"package" : "com.jangammatrimony",
"category" : "Social",
"description" : "JangamMatrimony App, part of CommunityMatrimony, is the most trusted matrimony service for Jangam across the world. You can choose Jangam Bride and Groom Profiles from major cities across Tamil Nadu & Andhra Pradesh in India and other NRIs. Thousands of Jangams have successfully found their life partner here. You too can find a Perfect Match. 100% Safe and Secure App. Register FREE.  Jangam Matrimony App, part of CommunityMatrimony, which has over 300 top community matrimonial apps including VanniyarMatrimony, NadarMatrimony, ReddyMatrimony, MudaliyarMatrimony, and AdidravidarMatrimony.  Heres what you can do after downloading the Free Jangam Matrimony App:  - Create your profile - Set up your partner preferences based on age, location, education, community, etc. - See daily matches on mobile and email - View profiles and photos of your matches - Search by community, profession, location - Express interest to your prospects - Respond to messages from other members  We have members from major cities in Tamil Nadu, Andhra Pradesh, and other Indian cities like Bangalore, Salem, Bellary, Belgaum, Davangere, Chennai, Hubli-Dharwad, etc. Also, we have Jangam NRIs from USA, UAE, Singapore, Germany, Saudi Arabia, Canada, Kuwait, UK, Abu Dhabi, Dubai, Malaysia, Australia, and many more are available.  You can find brides and grooms from different Professions, Educational Backgrounds, Regions, and Sub Castes. Our member base of Jangam aims to provide you with the best possible match to find the love of your life. Download the app today and find your life partner!  A Premium Membership can get you additional benefits:  You can contact your prospects through mobile, SMS, email and chat - You can send personalized messages to members you like - Get Premium Tag and be featured in the premium members section - Get priority position in search results and better response for your profile  CommunityMatrimony, of which JangamMatrimony is a part, belongs to the Matrimony.com group, the No. 1 matrimony service for Indians worldwide, which pioneered online matchmaking in India 20 years ago. Matrimony.com is a public listed company that owns over 300 of Indias largest matrimony brands including TamilMatrimony, TeluguMatrimony, and EliteMatrimony. It has a considerable retail presence with over 130 self-owned retail outlets across India. It also has a significant international presence with offices in the USA and Dubai. Matrimony.com has over 4 Million active profiles at any point in time.  The Jangam Matrimony app is designed keeping in mind various partner preferences that a bride or groom might have while choosing their life partner.  Pelli, Maduve, Kalyanam, Vivah, Shaadi or Vyah? JangamMatrimony helps you find your life partner. Thousands of Jangams from across Tamil Nadu & Andhra Pradesh, India and the world have found their perfect life partner here.  What are you waiting for? Download the Jangam Matrimony App Now and find your perfect life partner! Register FREE. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.GET_TASKS', 'android.permission.CALL_PHONE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.jangammatrimony.permission.MAPS_RECEIVE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.SEND_SMS', 'android.permission.CALL_PHONE', 'com.jangammatrimony.permission.MAPS_RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
}