{
"name" : "Pinterest Lite",
"url" : "https://play.google.com/store/apps/details?id=com.pinterest.twa",
"package" : "com.pinterest.twa",
"category" : "Social",
"description" : "Pinterest Lite saves space on your phone so you can discover the billions of possibilities for your life faster. Create extra home storage space, find your new favorite recipe, or get tattoo inspiration on Pinterest.  Find your new favorite recipe, ideas for creative home design, or get tattoo inspiration on Pinterest.  Save ideas on Pinterest:  Find lifestyle inspiration & explore articles on trending and recommended topics    Collaborate with friends for your next group trip, party or DIY project    See ideas & images out in the world that you like and snap a photo with Pinterest Lens to find out how to buy/make/do them!  Discover wedding tips, beauty inspiration and design concepts for your big day. Explore thousands of recommended or trending images, get travel inspiration or read new recipes and creative food ideas for your next dinner party. With fitness tips, interesting DIY projects to try out and tons of great fashion, style & beauty tips, Pinterest keeps all of your lifestyle inspiration in one place.  You never know what sparks a great design idea or when inspiration for your next DIY project might strike.  Get inspired from anywhere on the internet. Save your ideas, organize them by topic and share with others  all from your pocket!   Get ideas for the topics you care about most: - Home design, architecture & DIY - Creative wedding tips  - Travel, fitness & beauty - Fashion and style inspiration - Food, new recipes & cooking   Download Pinterest to start exploring possibilities for your next DIY or home design project. ",
"desc_perms" : "['com.android.vending.BILLING', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}