{
"name" : "Love Quotes and Status",
"url" : "https://play.google.com/store/apps/details?id=com.lovequote.and.status",
"package" : "com.lovequote.and.status",
"category" : "Social",
"description" : "Love Quotes and Status is beautiful collections of love quotes, love captions for pictures ,love statuses and love quotes with images which helps you convey your message to your loved one. Users can easily share the love quote as message or also with beautiful background image to spread love.  There is also great collections of love captions which use as caption for picture or story on Instagram or Facebook. These photo captions for Instagram will make your photo look more attractive.  love quotes plays very important role make your photo on Instagram look more unique. There also huge collection of Romantic messages,quotes for him,quotes for her,quotes for husband and wife, quotes for lovers, romantic quotes, love quote wallpapers which your send it your loved one as love message to remind them how much you love them.These love status can also be shared Facebook or Instagram to express your love. There is collection of miss you quotes which you can send as miss you messages to tell someone how much your missing them.There is also breakup quotes and moving quotes if you are going through break up and trying hard to move on.   Features :  Simple User interface  Add any quote to favourite list for easy access.  Works without internet.  love quotes for pictures.  high quality quote wallpapers.  love status can be shared as text or image with custom backgrounds.   Love Quotes are categorised into following categories :   Anniversary Quotes for husband and wife  Cheat Quotes  Cute Love Captions   Flirt Quotes  Heart Touching Quotes  Quotes for Husband  Love Quotes  Romantic Captions and Quotes  Marriage Captions   Relationship Quotes  Sad Quotes with pictures  Break Up Quotes  Heartbreak Quotes  Hurt Quotes  Miss You Captions and Quotes  Single Captions and Quotes  Sorry Quotes  True Quotes  Trust Quotes  Quotes for Wife  Moving On Quotes  Forgiveness Quotes ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}