{
"name" : "Apni Kheti - Agriculture Information & Farming App",
"url" : "https://play.google.com/store/apps/details?id=com.cogneesol.apnikhetiapp",
"package" : "com.cogneesol.apnikhetiapp",
"category" : "Social",
"description" : "Indias most famous and exclusive agricultural (, ) app that is changing the face of Indian farming today.  Apni Kheti is a comprehensive and innovative agricultural platform connecting farmers(, ) and common people from rural (, ) communities across the country and helping them in generating good productivity from their work and managing it properly. Our farming mobile app is available in multiple languages and helps people become more informed than ever before. Basically, this agricultural app is an online Farmers forum () where they can discuss their problems and help others with expert advice ( ,  ). So, get connected with this online social platform now, to keep yourself updated.  GET RIGHT INFORMATION AT RIGHT TIME:  Through Apni Kheti mobile app, we aim to provide farmers across India, the right information ( ,  ) at the right time ( ,  ),from sowing,(, ) nurturing (, ),( protecting to harvesting their crops (     ,        )Apni Kheti agriculture app helps the farmer in making and executing the decision (, ) efficiently and also calculating the future demand and acting upon it fruitfully. Our application provides you all the information you need regarding livestock ( ,  ) management or animal husbandry, from their day-to-day care (   ,   ), feed,(, ) selective breeding (, ) to disease and their treatment, direct from the experts across the country. So, whether your doubt is related to cows (, ) buffaloes (, ), goats (, ), horses (, ), pigs (, ), sheep (, ), poultry (, ) or fishery ( ,  ), we are here to help you with the best animal husbandry information and new trending technology (, )  CONNECT WITH FARMERS, EXPERTS AND PROGRESSIVE FARMERS NATIONWIDE  There is a real power in connectivity. Using our mobile application, connect with Subject/domain experts and other progressive farmers across the country to learn and discuss latest innovations in the farming sector, strategies to improve lives in rural communities, effective and sustainable farming strategies, ideal ways to increase yields and how to use resources more efficiently and a lot more. We help you get accurate, quick and free solutions to all your day-to-day problems related to farming (, ), dairy (, ), irrigation (, ) animal husbandry ( ,  ) etc.  WEATHER UPDATES: Get instant access to weather forecast (  ,    ), mainly the temperature, rainfall (, ) likelihood, anticipated wind speed & its direction in their area. This feature benefits the farmers in planning and taking corrective measures for agricultural related pursuits.  LATEST MANDI RATES:  Get instant access to market rates of your preferred crops in the area/place selected by you. These rates are updated from time-to-time so that you obtain the latest and accurate information.  LATEST NEWS AND ADVISORY:  Download Apni Kheti agriculture app to make the most of our latest news section where you get to know what is happening in your area, from time to time. The app also has an Advisory () section, where we post advisories and alerts provided by industry experts, universities and other accredited institutions.  PROGRESSIVE FARMER STORIES:  Apni Kheti mobile app aims to feature progressive farmers across India, highlighting their outstanding contribution towards agriculture, horticulture, and allied activities. Through our app, you can connect with these progressive farmers and obtain insight to the farming methods and practices adopted by them.  Download our free Apni Kheti kisan app today, a one-stop solution to all your agri-needs. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_SETTINGS', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'com.cogneesol.apnikhetiapp.permission.C2D_MESSAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.RECORD_AUDIO', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}