{
"name" : "Intimate Matrimony",
"url" : "https://play.google.com/store/apps/details?id=com.aabasoft.intimatematrimony",
"package" : "com.aabasoft.intimatematrimony",
"category" : "Social",
"description" : "This is the official Android app for Intimate Matrimony. Our new and improved mobile app functions with good performance and quality.  Intimate Matrimony is One & Only Service Assisted Matrimonial Web Portal in Kerala. Intimate Matrimony is one of the fastest growing matrimonial portal in India promoted by Intimate Matrimonial & Services Kerala Private Ltd. Intimate Matrimony is the Trusted and leading Matrimonial Service Provider for Hindu, Christian & Muslim in Kerala, India. We offer a superior matchmaking experience for prospective brides and grooms to meet and communicate with each other by expanding the opportunities available to identify potential life partners and build fulfilling relations. Intimate Matrimony offers unique space of interaction for those who are looking for prospective partners. The company is pioneered in online matrimonial and continue to lead the exciting matrimony platform for a decade.  Our new and improved mobile app has good features , user-friendly navigation and awesome design.  Key features: - Login to your profile and stay connected - Based On your Requirements Intimate Matrimonial will Provide Automatic Selection  - Search with your Partner Requirement and view profile details - Send Interest Message to Suitable Members - Respond to your Interest Messages Received - Access your My Matches profiles - Check who Visited your Profile - Update your own profile, Add Your Latest Photos - Upload and change your main photo and set as profile photo - Login Member Will get first Priority in Search Listing  For providing you all the services and answering your queries, we have furnished 55 outlets throughout Kerala. The highlighted feature of Intimate Matrimony is our staffs committed to develop healthy family relationships for our valuable customers. These outlets will serve you with the right guidelines and assistance for your partner search and payment options.  Be 100% secure  count on us to keep all your information safe and private. Easily sync your intimatematrimony.com account with the app for the mobile-ready partner search. Use conveniently  the app is really lightweight and takes less storage space. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.aabasoft.intimatematrimony.permission.C2D_MESSAGE', 'android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE']",
}