{
"name" : "Dark Mode Theme for Facebook",
"url" : "https://play.google.com/store/apps/details?id=com.ribbyte.darkmode.fb",
"package" : "com.ribbyte.darkmode.fb",
"category" : "Social",
"description" : "Switch your Facebook news feed to dark mode!  This is an unofficial app that changes the style of facebook.com to a black theme (or any other color of your choice!).   You were surfing your news feed for far too long even though you have to get up at 5am the next morning? Well, we cant help you with that, but we can help you to reduce eye strain by darkening and replacing all bright colors by more pleasant colors. Use your favorite social network during the night!  You have your own style and you dont care about the brightness and would rather just change the colors? We got you covered: use our multi-color support to change Facebook to red, green, blue, pink, yellow or whatever color your heart desires! Just swipe right to open the menu and go to Change Colors.  Get the ad-free PRO version here:  https://play.google.com/store/apps/details?id=com.ribbyte.darkmode.fb.pro  If you like this app, check out our dark theme for Instagram: https://play.google.com/store/apps/details?id=com.ribbyte.darkmode.ig  Frequently asked questions:  Does this actually change my Facebook app to a dark theme? -> This is an additional standalone app that you can use alongside the original Facebook app. It does not change the theme of the original app, as this is not allowed by the Android security system. Just use the regular app, when you feel like it, and use ours when its dark outside.  How do I activate the dark mode? -> If you start our app, it is already in a dark mode, you dont need to switch it on. Just use it like you would use your regular Facebook app!  Can I switch off dark mode? -> No. Just use the regular Facebook app to use the standard theme.  Can I remove the ads? -> We need the ads to support the development of these apps. But you can buy the ad-free PRO version here:  https://play.google.com/store/apps/details?id=com.ribbyte.darkmode.fb.pro  Can I change the colors? Yes, we have multi-color support. You can change the black-theme to red, blue, green and all the other colors you like. Just open our app and wait until Facebook has loaded. Then, swipe right to open the menu. Click on Change Colors. In the following menu, you can select the background color you like (and you can set the text color, too). On the bottom, youll see a preview of how it will look like when you apply these colors. Give it a few seconds to reload. If you like your selection, click on Apply. At the moment, you have to watch an ad to unlock this feature. After watching the ad, your settings are applied and you should see the colors you selected.  I accidentally changed the colors, how can I go back to the black-theme? Open the menu (swipe right) and select Change Colors. Now click the button on the bottom that says Reset to default. Now you should be back to our initial black-theme.  Do I need to create a new Facebook account? -> No. It works with all Facebook accounts.  Does this also work for Facebook Messenger? -> Yes, just click the Messenger-icon on the top menu.  How do I go back? -> Please use the back button of your phone to go back.  Can I post my current location? -> Unfortunately, this is not implemented at the moment.  Can I upload pictures or videos? -> Yes. If you try to upload pictures or videos, a new window will pop up that lets you select your files.  Do you have any suggestions or questions? Feel free to email us: ribbyteapps@gmail.com  We are not associated or related to Facebook in any way or form -- this is an unofficial third party application. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}