{
"name" : "Japan Social -  Asian Dating & Chat. Meet Japanese",
"url" : "https://play.google.com/store/apps/details?id=com.innovate.JapanSocial",
"package" : "com.innovate.JapanSocial",
"category" : "Social",
"description" : "Dating Japanese people has never been easier! Want to meet local Japanese people nearby or people in Japan for live dating and cultural exchange? Then we are excited to present you a free encounter with the perfect matchmaking and socializing dating app, the Japan Social singles app!  There are lots of daring people who want to encounter Asian culture, make friends for nearby chat, try online dating on a chat line, look for marriage, be a partner couple, and make a local meet up with their match for nearby dating or a blind date. When youre a couple dating is easier. A near meet up is fun! You never know who youll meet. This is the matching single love app/lover app for free chat Japanese love meets the world! Dating Asian people can be exciting.  This is a meet app unlike those other dating apps. Japan Social helps you connect with a Japanese lover for chat, local chat, local dating, chat dating, couple dating, and dating local. The people you meet chat a lot! If you are looking to make new Japanese friends, meet girls, meet Japanese singles, or find a lasting relationship, Japan Social has someone for you.   Our mission: help single people find the relationship they want through our meeting app by dating Japanese people. Encounter the singles you want to meet using our dating apps free!.  We went from being a matchmaking dating app focusing on single women, dating local, live dating, and singles dating to coupling helping people make friends near meet up with meeting the person they are looking for on our meet app. Find your match using the dating side of our lover app or make friends with nearby chat, setting up meets and chat dating!  This app is unique because you can meet people, your partner, singles near you, meet girls directly, find a lover, make local meet ups, and be a matching couple by watching videos of them. When you start dating video makes all the difference! Thats something the other dating apps or a dating site cant do! It wont be a blind date. Meeting new people and singles nearby, local dating, making friends, chatting, socializing, live dating, nearby dating, dating Asian people, and even dating single people has never been more fun!  Unlike other the other singles app or online dating networks with a meeting app, we have video profiles! We created a dating video based social app (or love app) because you can express yourself more accurately with videos and live chat to let your daring personality shine through! Too shy to upload a video? We have photos too but the videos are much more exciting!   Not looking for marriage or single women? Dont feel like looking at photos or videos of Asian people and singles? Then hangout in our chat rooms for cultural exchange and message people nearby for local chat or everywhere else right away. Chat with local people and singles near you or join the world chat room and chat with people from all over the world. Your free encounter is here!  Love to meet new people, meet chat, make single Asian friends, or find a date to hangout with tonight? Its easy with our matchmaking dating app! The people youll meet love to chat online! You can start by seeing video clips and when you like someone, just click the heart. If they like you back, we will connect you with your match. Itll be the start of a great encounter nearby! Want to help break the ice? Send them a Hi! You can meet people, send unlimited messages, videos and photos to each other. Finding a date, meeting new friends, chatting, and dating has never been so easy!  Our Features - group social chat rooms - free chat with singles nearby - chat line - live dating and live chat - Coupling dating local & local dating - dating video - make friends - singles dating - One of the BEST dating apps FREE to meet new friends  Why Japan Social? - one of the most fun dating apps - more than a dating site - meet new people - meet love - meet girls - make new friends - chat online - local chat room and world chat room ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CONTACTS', 'android.permission.CAMERA', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.android.alarm.permission.SET_ALARM', 'android.permission.BLUETOOTH_ADMIN', 'com.sec.android.provider.badge.permission.WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.READ_APP_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'com.sec.android.provider.badge.permission.READ', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.RECORD_AUDIO', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.android.vending.BILLING', 'android.permission.BLUETOOTH', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.ACCESS_FINE_LOCATION', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'me.everything.badger.permission.BADGE_COUNT_WRITE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}