{
"name" : "Thiyya matrimonial",
"url" : "https://play.google.com/store/apps/details?id=com.thiyya.matrimony.kerala",
"package" : "com.thiyya.matrimony.kerala",
"category" : "Social",
"description" : "This Thiya Matrimony app is the newest venture of the pioneers of computerised Kerala matrimony service Malayogam. Malayogam has always been the trusted Kerala matrimony service, staying in touch with Malayali hearts and evolving with the changing trends in weddings. The latest digital avatar Thiya Matrimony powered by Malayogam focuses on the Thiya community and maintains around 1 lac profiles of Thiya boys and girls. Malayogams 3 decades of success in Kerala Matrimony service, finding the perfect brides and perfect grooms; is all set to proceed with this innovative app exclusive for Thiya community.   Enjoy a FREE PREMIUM MEMBERSHIP (with FREE CONTACTS) in Thiya Matrimony powered by Malayogam for limited period.   Features & Benefits of Thiya Matrimony powered by Malayogam  -Unlimited basic membership -Advanced Search Options -Can view profiles, photos, address & contacts -Chat online and send/receive messages -Receive daily matches -Express Interests and Send personalized messages -Receive email & SMS notifications (when someone expresses or accepts interest) -Get your profile highlighted -Check horoscope matches -Sort profile by horoscope match   The promising features along with the trust gained since 1984, make this app the one stop site for Thiya Matrimony. With advanced tools to search, find and connect, Thiya Matrimony powered by Malayogam provides the safest gateway to find the Perfect Thiya Bride/ Thiya Groom. Malayogam, with the web and mobile based Kerala matrimony services, bestows an elite browsing experience to users. Now, with this exclusive Thiya matrimony app, we can help you make an easier search for professionals (Doctor, Engineer, IT professional, Banking professional, Govt Employee, Lecturer, Nurse, CA, Chemist, Journalist, Research Fellow, Managers, Designers, Artists, Business and many more) with in Thiya community.   Thiya Matrimony powered by Malayogam is the right place for you, if you are looking for a Kerala matrimony service providing innumerous profiles of Thiya boys and Thiya girls working in Kerala, India (Bangalore, Chennai, Bombay, Delhi or other city) or overseas (Gulf, US, Europe, Australia etc.). ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.alarm.permission.SET_ALARM', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.thiyya.matrimony.kerala.permission.C2D_MESSAGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}