{
"name" : "Plzcome Party Planner",
"url" : "https://play.google.com/store/apps/details?id=com.nxtoff.plzcome",
"package" : "com.nxtoff.plzcome",
"category" : "Social",
"description" : "Plzcome is a FREE online invitation app and its a super easy way to invite people to your events and for guests to sign up to them!   Get rid of much of the hassle next time you coordinate a party and use the Plzcome app instead. It is a completely free party planner, which helps you easily and quickly make and send invitations for any occasion while tracking who comes and who unfortunately cant make it.   NEWS:  Now you can now set up a Find the best day poll, which quickly can give an overview of which day most people can attend. Plzcome has also added a built-in ticket system, which can automatically issue tickets to the guests. Perfect for open events where guests sign up themselves or to give a special offer to draw more people to your event. With Plzcome you can both send your personal invitations out via email and SMS or you can share the event wherever you want, and let the guests sign up for themselves.  Whether you are holding a movie night, home party, birthday celebration, or even a wedding, you can use Plzcome to invite guests. Plzcome is also very useful when you want to plan an event, whether its a neighbourhood event or a larger event.   One of the most troublesome aspects of planning an event is managing the guest list. It includes choosing who to invite, sending invitations, and recording who will come or not.   We want to make it much easier for you to plan for various events such as parties, playdates, meetups, and even weddings.   You can use our app for FREE to send invitations to multiple people at once and receive notifications whether they are going or not.   ==================================================  FEATURES OF PLZCOME  ONLINE INVITATION FOR EVENTS:  ==================================================   Use our online invitation maker & sender for FREE.   Create an online invitation for various events and send it via Email or SMS.   Share your event on all social media for guest to sign up to   Automatically integrates your Contact info & Address book.   Send multiple invitations at once.   Setup a Find the best day survey   Use the build in ticket system to give and check ticket for entrance or special offers.   Many types of events with various Invite text   You can save your progress at any step of the invitation process.   Receive RSVP from your invitees.   Get notification when your invitees accept your invitation.   Add cool images as the cover for your invitation or upload your own images.   Add friends and plan get together!   === HOW TO USE PLZCOME TO SEND INVITATIONS TO YOUR CONTACTS: ===   1 . Create an account or login with Facebook or Google  2. We will automatically detect your contacts.  3. Create an event and enter the Event Details  4. Choose your Friends that you want to invite.  5. Send the invitation through their email or contact number.  6. We will let them know that they are invited and will send a link so they can RSVP their attendance.   *** Quick Events: ***  - Custom: add your own text.  - Barbecue party  - Play time / play dates  - Going out  - Girls night out  - Movie  - Computer Game  - Party now!  - Dinner plans  - Lets party  - Birthday party   ---   We want to make sure our users are happy with our app. If you encounter any issue, please email us so we can fix it ASAP. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION']",
}