{
"name" : "Kofluence Influencer | An Influencer Marketing Hub",
"url" : "https://play.google.com/store/apps/details?id=com.kofluence",
"package" : "com.kofluence",
"category" : "Social",
"description" : "The Kofluence app brings social media influencers and brands on a single platform where you can use our Influencer marketing app to collaborate with brands and conduct influencer marketing campaigns via your Instagram and Facebook social media accounts. Social media Influencers can directly apply to the available campaigns, submit content for review, receive payments, and get an in-depth analysis of every post. Registration is completely free and you get paid for every campaign you conduct through the Kofluence influencer marketing app.  Who should download Kofluence?  Creative influencers who would like to collaborate with brands Instagram influencers, Facebook influencers, YouTube influencers, TikTok influencers, social media bloggers, social media content creators, Influencer Marketing agencies, or anyone who is interested in Influencer Marketing. Basically everyone with a social media presence and the one who is willing to earn money through the power of social media!  How to join our Influencer Marketing Platform?  Step 1: Download the Kofluence app for free Step 2: Enter your mobile number and the OTP Step 3: Apply for the ongoing campaigns under New Collab tab  Step 4: Once shortlisted, start collaborating with the brands! Thats all it takes to become a Kofluencer!  Why you must have the Kofluence influencers app?   Its completely free to install   Dedicated only for the influencers  Awesome campaign throughout the year  Unlock your potential of content creation  Get impactful insights of your post and campaign performance   Facilitates to all types of influencers    What do you get from Kofluence?  Monetize your Instagram, Facebook, YouTube, TikTok, and every other social media content with compelling and engaging content to earn money. Leverage your social media influence via engaged audiences to help brands amplify their reach. Collaborate with top tier and leading brands and add your unique perspectives to the voice of the product for the respective campaigns to help people make the right choice by giving them an opinion which they trust.  Who is an influencer at Kofluence?  Anyone with little or more social following with the power to sway others decision-making strategies can be an influencer at Kofluence.  Nano influencers from Instagram, Facebook, YouTube, LinkedIn, and TikTok  Budding influencers from Instagram, Facebook, YouTube, LinkedIn, and TikTok  Micro influencers from Instagram, Facebook, YouTube, LinkedIn, and TikTok  Macro influencers Instagram, Facebook, YouTube, LinkedIn, and TikTok  What makes Kofluence unique?   Amazing campaigns from leading brands  Chance to monetize and earn money through your content as an influencer  Get payments on time after every campaign  No intermediaries, its just influencers and Brands  Always available to help you in every content creation steps  Are you ready to collaborate with the leading brands and earn money? Then download Kofluence app today and help us in shaping the future of Influencer Marketing. Think Influence, Think Kofluence. ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.MANAGE_DOCUMENTS']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MANAGE_DOCUMENTS']",
}