{
"name" : "Birthday Reminder: Calendar Bday Alarm",
"url" : "https://play.google.com/store/apps/details?id=com.apputilose.teo.birthdayremember",
"package" : "com.apputilose.teo.birthdayremember",
"category" : "Social",
"description" : "Are you in need of a birthday alarm app to remind you to say happy birthday to the people you care about?  Well, Birthday Reminder is the free birthday reminder app for android that will help you to never forget your friends or family members birthday. Say YES to a birthday reminder calendar & anniversary reminder which is easy to use, intuitive, sleek & extremely helpful.  Birthday Remember reminds you of the birthdays of all your friends and family and no longer have to worry about losing someone due to pure negligence and forgetting. Warm their souls and make them smile with the ultimate birthday anniversary reminder app!  SIMPLE AND PRACTICAL    In just a few taps our free birthday reminder app lets you choose which contacts to load or add a new birthday!  Add birthdays and anniversaries to your personalized list in a simple and intuitive way.  Convenient and practical viewing of upcoming birthdays on the Home screen! . Or view birthdays in the integrated calendar!  Night Mode available to be comfortable in any light condition! . Two types of widgets: choose your favorite!  Manage birthdays in a practical and safe way! Birthday Remember will help you not to forget any more by managing them separately from your commitments and social profiles! No more facebook birthday reminders free apps  just one birthday greeting cards reminder app for all!  REMINDER   The notifications remind you all birthdays and you can choose to set reminders even a few days before in order to organize for the gift or surprise party.  Notifications dont work? In the settings you will find our tutorial to help you receive notifications correctly. There is nothing stopping you to say happy birthday and send a bday wish to your dearest.  CARDS AND GREETING PHRASES!   Looking for birthday greeting cards with photos. Or even more so, do you want to say happy birthday mom, or happy birthday to your brother, other family members & friends. Well there is nothing better than to send your birthday wishes and greetings with our greeting cards collection:    Be the first and the most original to congratulate!  Dozens of bday greeting cards for all tastes, from classic to Games of Thrones or Avengers, to always be the most original to wish Happy Birthday! You are sure to be amazed by our happy birthday cards and birthday quotes and sayings.  Greetings cards not just for birthdays! Celebrate the most important holidays: Halloween, Thanksgiving Day and 4th of July - American Independence Day! More will be added!  Use the main messaging services, like WhatsApp or Telegram, to make wishes immediately choosing from a list of original happy birthday wishes or remind it to some friend that it will be forgotten.  Youre able to save your gift ideas in a custom list for each birthday, so you will always ready to astound your friends!  PRIVACY AND SECURITY    Privacy: your birthdays will be stored only on your smartphone. We dont have access to your data.  Backup: save your birthday in a practical in Excel / Csv files so you dont miss your birthdays when you change your smartphone.  ABOUT PERMISSION    Read Contacts: you need to import birthdays from your phonebook.  Usb Storage: you can choose your favorite photo for each birthday and backup them.  Run at startup: if you restart your smartphone you will not have to start the app manually to continue receiving notifications of your friends birthdays.  Now create your birthday list of birthday reminders and never miss a birthday or an important event. Download Birthday Reminder for free!  Facebook: https://www.facebook.com/birthdayremember/  Instagram: https://www.instagram.com/birthdayremember/ ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE']",
}