{
"name" : "GOOD MORNING GIF STICKERS",
"url" : "https://play.google.com/store/apps/details?id=com.gifgoodmorningstickers",
"package" : "com.gifgoodmorningstickers",
"category" : "Social",
"description" : "GOOD MORNING GIF STICKERS ========================================================================   We offer you the unique collection of GOOD MORNING GIF STICKERS to make your chat more romantic by sharing these stickers.  Getting bored with old Good Mornign Gif Stickers try latest HD quality animated stickers.  Good Morning stickers Gif present the new collection of stickers according to your mood.  Romantic Good Morning Sticker contain 500+ Gif image in two modes.  Ultimate collection of GOOD MORNING GIF STICKERS.  Really very fascinating GOOD MORNING STICKERS GIF.  Easy to share these stickers on social media.   It contains image photo and stickers in Hd Quality.  One click sharing on social media.   CHARACTERISTIC OF GOOD MORNING GIF STICKERS ====================================================================  * Totally free of cost. * Good Morning sticker have top collection forever according to mood. * Unique collection of Good Morning Stickers gif. * Good morning chat stickers fill your mood with freshness. * Gif Good Morning stickers provide your new collection of gif stickers everyday. * Good Morning gif Stickers contains cutest and beautiful collection for lovers. * Good Morning stickers gif reflect every time new stickers in online mode. * Single Touch Sharing gif good morning sticker.   GOOD MORNING GIF STICKERS SPECIAL FEATURES ====================================================================  * These GOOD MORNING GIF STICKERS are easy to share on any social media. * GOOD MORNING GIF STICKERS is not limited to just share image it spread to your loved one a special joy. * GOOD MORNING GIF STICKERSProvide best quality image. * Speed of application is fully optimized with smooth navigation with two modes. * GOOD MORNING GIF STICKERS present most adorable and fantastic collection of romance to share someone whom you love. * GOOD MORNING GIF STICKERS is devided into different categories like : Heart, Rose, Quotes, Teddy etc. * GOOD MORNING GIF STICKERS provide most passionate cute, fantastic , fabulous morning collection gif. * High Quality GOOD MORNING GIF STICKERS * GOOD MORNING GIF STICKERS provide heart touching morningsticker.   GOOD MORNING GIF STICKERS has following categories: ====================================================================  * Heart Stickers Gif. * Teddy stickers gif. * Quotes Or text Stickers gif. * Rose Stickers gif.  How to Use GOOD MORNING GIF STICKERS ====================================================================  * Select mode from home screen of Love Stickers gif i.e. Online or offline. * Click on singal category image like heart stickers, teddy stickers, rose stickers etc. * Click on social media icon on which you want to share.  Note - Please rate us for feedback with any comment most welcome. Your feedback is important to us to provide better app in future. THANK YOU. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}