{
"name" : "Family Tree Maker - FamilyGTG",
"url" : "https://play.google.com/store/apps/details?id=com.familygtg.free",
"package" : "com.familygtg.free",
"category" : "Social",
"description" : "FamilyGTG app allows you to build your family tree or import your familys GEDCOM file so you can easily check your family while you are on the go.  - Create new family tree directly from the device. - Import GEDCOM genealogy files easily (GEDCOM Viewer)*. - Export family trees to GEDCOM files (send via email or store on device)*. - Add and remove family members, and set relations between them. - Search family members by name. - View members full profile: relatives, personal info, and photo. - Add, change, or remove member photos*. - Edit member information (name, birth, marriage details, note, etc.). - Show descendants & ancestors tree for a specific member*. - Add a member to bookmarks list for easy reference later*. - Browse events calendar (birth, marriage, ...) for each month*. Todays events are highlighted. - Enable daily events reminders. - Browse family photo gallery. - View or share a log of edits (member added/edited/removed, etc.)*. - Undo/Redo logged edits*. - Show statistics about the family tree. - Sample family can be optionally downloaded. - Change app language. Available translations: Dutch, English, French, German, and Spanish. - Free version app with no time limitation and ads-free. * some limitations apply.  GEDCOM (GEnealogical Data COMmunication) files can be created by any desktop software. Send the file to your device via any method: bluetooth, ... etc. FamilyGTG then scans your device for any GEDCOM files (with .ged extention) so they can be imported.  Check FamilyGTG full version app ($3 USD) for no limitations. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.familygtg.free.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}