{
"name" : "Jeevansathi.com",
"url" : "https://play.google.com/store/apps/details?id=com.jeevansathi.android",
"package" : "com.jeevansathi.android",
"category" : "Social",
"description" : "Stay Home, Stay Safe! Connect with your partner for FREE from safety of your home  Introducing Jeevansathi Milan Samaroh  - Find most profiles of your community active at the same time! - Interact with them for FREE on Jeevansathi messenger - Do FREE Jeevansathi Video calls from the app if you like each other  Create your Jeevansathi profile NOW to see events in your community and participate.  This is the official app of Jeevansathi.com, Indias top-rated matrimonial app, where lakhs of prospective brides and grooms have found their perfect life partners.  We have been committed to provide a safe and convenient experience of connecting people for marriage for over 15 years. Our platform hosts millions of profiles across locations, communities, professions, etc., and we enable our users to find the most relevant profiles for them with easy-to-use filters. With strict privacy controls and our best-in-class matching algorithm, we ensure that our users have a smooth experience while searching their Life partners.  Only on Jeevansathi   Voice & Video Calling: Jeevansathi is the only matrimonial platform that allows you to get on a call with other members without revealing your phone number.   Chat & Hangouts: Only platform to arrange Online events to bring people with similar communities/ interests together.    Video profiles: Only platform to allow users to upload and view Video profiles for more realistic understanding about the profile and their families.   Verification: Only platform to offer In-person verification along with online verification using official sources.   Why use Jeevansathi?   Someone for everyone: We have lakhs of profiles across locations (NRIs, Delhi-NCR, Mumbai, Pune, Bangalore, etc.), communities (Hindi, Marathi, Punjabi, Rajasthani, Bihari, Bengali, etc.), castes (Agarwal, Arora, Bania, Brahmin, Jat, Kayastha, Kshatriya, Maratha, Rajput etc.) and religion (Hindu, Muslim, Christian, Jain, Sikh etc.), allowing you to search for your desired bride/groom.   100% Screened profiles: All profiles on our platform are manually screened and their contact numbers are verified during registration to provide a safe & secure environment. We also offer in-person & online verification services.   We Match Better: Every partner search is unique. We help you find your perfect one out of profiles most relevant to you via our strict filters and best-in-class matching algorithms.   Privacy controls: Our strict privacy controls allow you to decide exactly how much information to share and with whom.   Register for FREE and get the following benefits   Easily create your profile and start receiving interests from other members  Get Daily Match Alerts as per your desired partner preference  Refine your search using Advanced Filters  View full profiles of your matches along with their photos & videos  Send and Receive interests  Get Instant Notification about Interests and Accepts you receive   Premium Membership at very Affordable Prices   View phone numbers and e-mail IDs of profiles you wish to contact  Send personalized messages and chat  Increase your profiles visibility and responses   Your experience matters to us, and we are continuously improving our app based on your feedback. So download our app TODAY, and find your perfect sathi on the go! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.GET_TASKS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'com.jeevansathi.android.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.VIBRATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO']",
}