{
"name" : "Ezhava Mangalyam Matrimony",
"url" : "https://play.google.com/store/apps/details?id=com.ezhavamangalyam.app",
"package" : "com.ezhavamangalyam.app",
"category" : "Social",
"description" : "EzhavaMangalyam.com is the most trusted Ezhava Matrimony in Kerala where Ezhava brides and Ezhava grooms can find their perfect life partner. The best online ezhava matrimony kerala, we bring together tradition and technology helping the ezhava community in Kerala to make ezhava partner search easier and faster. FEATURES  Register you detailed profile for FREE Upload your photos and manage your photo album Find your perfect partner from anywhere you are. Know their birth date, star and jathakam. Get instant notifications when matches communicate with you Show your interest to prospective matches Shortlist potential matches you like Know who viewed and shortlisted your profile Get contact details and SNDP unit number of interested proposals.  You can search for ezhava boys and ezhava girls from different sub castes, professions and locations, local and global. Based on your educational, occupational, social preferences and star match, find out the best matching proposals for your dear ones faster and easier- in just a few clicks. An ISO 9001:2008 certified online ezhava matrimony, EzhavaMangalyam.com strives to incorporate ethics and technology and takes on the responsibility to obey Indian laws and regulations related to marriage. It is purely for marriage purpose only and not a dating website. We warmly welcome all Ezhava men and women who are seriously looking for marriage. We take all possible steps to make sure the genuineness of our profiles through manual verification process and thus all the registered proposals are filtered and all the contact numbers are verified. The privacy of each member is our priority. Our responsible and responsive support team will give you a family like feeling for the most important occasion of your family! Powered by eBeams Infotech, EzhavaMangalyam.com has registered members from all the cities such as Alappuzha, Kollam, Palakkad, Kottayam, Kannur, Bangalore, Idukki, Malappuram,Pathanamthitta, Ernakulam, Thiruvananthapuram, Thrissur, Kozhikode, Chennai, Mumbai, Wayanad, Coimbatore, Abu Dhabi, Dubai and many more. So, what are you waiting for? Download the EzhavaMangalyam app now and end the search for your special someone! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.ezhavamangalyam.app.permission.C2D_MESSAGE', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_APP_BADGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}