{
"name" : "💚 WeLove : love stickers (WAStickerApps)",
"url" : "https://play.google.com/store/apps/details?id=com.shareitagain.whatslov.wastickerapps",
"package" : "com.shareitagain.whatslov.wastickerapps",
"category" : "Social",
"description" : " WeLove presents native stickers for chatting in WhatsApp (WAStickerApps).  We selected the best of our love stickers. They are all absolutely free and in high resolution (HD).   Enjoy right now this romantic sticker app !   Our stickers celebrate all the types of love; passionate love, casual love, romantic love, funny love, maternal love, family love ....  So,  WeLove contains 300 love stickers in 10 categories: 1- Hearts 2- Smileys emoji 3- Mouth 4- Cute couples  5- Flowers & Gifts for all Happy Birthdays, Valentines Day, Mothers Day, 6- Cute animals 7- Family & wedding 8- Kissing couples 9- Love talks 1 10- Love talks 2  All our love stickers have a great sticker style, fitting nicely on all custom WhatsApp backgrounds.   Well update regularly and add new categories soon  How it works?  Add stickers to WhatsApp (WAStickerApps)  Open the category you want to add. Tap on Add to WhatsApp.  Open WhatsApp, tap the smiley icon   Tap the stickers icon  at the bottom.   You new sticker category will appear in the list with a small green dot indicating that it is new. ---> Now, you can enjoy and send your new stickers to your WhatsApp friends   Add to / remove from favorites in WhatsApp (WAStickerApps)  You can add a sticker to your favorites by long pressing on a sticker   You can remove a sticker from your favorites by opening the favorites category and long pressing on the sticker  Share stickers with your WhatsApp friends - Your friends do not need the app to see your stickers, but we will be happy if you share our app with our friends!  - Your friends can open the app by long pressing on a sticker on their WhatsApp - You can share the app link in the app via the Share menu  Remove stickers from WhatsApp (WAStickerApps) - Open WhatsApp, tap the smiley icon close to the keyboard, then tap the  icon at the end of the sticker categories tab. - Tap My Stickers tab and remove categories you dont want anymore. Dont worry you can add it again later.  My stickers disappeared from WhatsApp (WAStickerApps) It can be caused by your phone manufacturer that tries to optimize your battery. To avoid that you can try this solution, go in your device Settings / Battery /  WeLove Stickers and select Dont optimise (or equivalent as it depends on the device/manufacturer)    Contact us   contact@shareitagain.co  http://www.shareitagain.co   Follow us https://www.facebook.com/EmojiShareItAgain https://www.instagram.com/whatsmiley/   App made with love & fun  ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}