{
"name" : "Vellalar Matrimony - Trusted Vellalar Wedding App",
"url" : "https://play.google.com/store/apps/details?id=com.vellalarmatrimony",
"package" : "com.vellalarmatrimony",
"category" : "Social",
"description" : "VellalarMatrimony App, part of CommunityMatrimony, is the most trusted matrimony service for Vellalar across the world. You can choose Vellalar bride and groom profiles from major cities across Tamil Nadu, India and NRIs from abroad. Thousands of Vellalars have successfully found their life partner here. You too can find a Perfect Match. 100% Safe and Secure app. Register FREE.  Top VellalarMatrimony App Features:  - Free Registration - User friendly interface and easy partner search options  - Get daily matches on mobile and email - Express your interest to shortlisted matches - Get instant alerts when there is a communication  - Shortlist and save potential matches - Interact with other members using the chat feature  Lakhs of registered members are from all major Vellalar community sub-castes such as Shoziya Vellalar, Veerakodi Vellala, Agamudayar/Arcot/Thuluva Vellala, Saiva Pillai Tirunelveli, Kongu Vellala, Aaru Nattu Vellala, Cherakula Vellalar, Desikar, Illaththu Pillai, Isai Vellalar, Karkathar, Kodikal Pillai, Nanjil Mudali, Nanjil Nattu Vellalar, Nankudi Vellalar, Pandiya Vellalar, Saiva Pillai Thanjavur, Thondai Mandala Vellala, Veerakodi Vellala and Others.  We have members from major cities in Tamil Nadu like Chennai, Tiruchirappalli, Madurai, Thanjavur, Coimbatore, Sivaganga and etc other Indian cities like Bangalore/Bengaluru, Ernakulam, Mumbai, Palakkad, Hyderabad, New Delhi and etc., besides Vellalar NRIs from Abu Dhabi, Dubai, USA, Canada, UAE, Malaysia, Saudi Arabia, Germany, Kuwait, Singapore, Australia and Etc.  You can find brides and grooms from different Professions, Educational Backgrounds, Regions & Sub Castes, Our databases of Tamil Vellalars aims to provide you with the best possible match to find the love of your life. Download app today and find your life partner!  Get the Premium Advantage  A Premium Membership means: - You can talk directly to the opposite match - You can get contact details including phone number, mail id and address.  - You can also chat live with members you like - You can send personalised messages to people you like  Vellalar Matrimony App is part of Community Matrimony from Matrimony.com, which also offers language based matrimonial service like Tamil Matrimony. The app is designed keeping in mind various partner preferences that a bride or groom might have while choosing their life partner. The Vellalar Matrimony App is intelligently developed to give you the best results while matching you with your life partner.  You can also find your partner from other Regional Apps of Bharat Matrimony including Tamil Matrimony.  Thousands of Vellalars from across Tamil Nadu, India and the world have found their perfect life partner here.  The VellalarMatrimony App is light and easy to use and it occupies very little phone space.  So, what are you waiting for? Download the VellalarMatrimony App Now and find your perfect life partner! Register FREE. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.CALL_PHONE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.vellalarmatrimony.permission.MAPS_RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.vellalarmatrimony.permission.MAPS_RECEIVE']",
}