{
"name" : "Captions for Photos - Caption This",
"url" : "https://play.google.com/store/apps/details?id=com.neupanedinesh.coolcaptions",
"package" : "com.neupanedinesh.coolcaptions",
"category" : "Social",
"description" : "With Caption This app you can add caption to your photo and get best caption quotes for Instagram photos  Find caption, best status, caption pictures, beautiful quotes, facebook status, beautiful status, pic captions, insta caption quote, selfie captions and others within one caption app.  How many times did it happen to you to want to post a stunning picture, but when the time came to write the caption you absolutely froze? That happens to everyone of us and we are here to help you with that. You can now wave goodbye to the dilemma of choosing right image caption.  Generate captions for Instagram and facebook photos on the go ! Gain more likes and followers in Instagram and facebook, increase the user engagement with your post.  Now you can submit your own caption, see weekly featured captions and tips and tricks to improve your instagram profile and feeds that you might be interested in.  We have the best Instagram Quotes : Insta Quotes that help you gain more likes and followers : Caption this - Captions for Photos, any photo, anywhere   We have a large collection of captions for Instagram, status for facebook - Quotes and caption for photos of any moment, feeling and reason which you can pick instantly without a hassle and use for your photos and BOOM ! you get more likes and engagement in your photo. You can also share favorite quotes with your loved ones and save your favorite quotes for instant access.   Captured some cool pictures to upload on Whatsapp, Facebook or Instagram ? We have collected suitable Instagram captions for your pictures. Just copy and paste wherever you want.   Some of the categories :  Happiness Status, Cool Captions, Funny Captions, Funny Status, Inspiring Quotes, Inspiring Status, Life Sayings, Life Quotes, Love Status, Love Sayings, Love Captions, Party Captions, Party Quotes, Selfie Captions, Selfie Quotes, Selfie Status, Sweet Captions, Success Quotes, Savage Captions, Flirty Messages, Flirty Quotes and Sayings, Birthday Wishes, Friendship Sayings and Quotes, Instagram Captions, Instagram Quotes, Christmas Quotes, Christmas Captions, New Year Quotes, New Year Caption, sassy instagram captions and other captiona, best comments for Instagram, that you can easily copy and paste.  App Features   Copy and share for direct upload to social media (Status for fb, Captions for Insta)  Works completely offline Contains status for every occasions and events.  Regular app updates   Copy feature to copy & paste the statuses and quotes collection.  Share statuses via other applications. Beautiful design and user interface Caption for Instagram Story Handpicked Captions Curated list of Instagram Captions Ig captions, instagram captions and quote for instagram  You can select captions according to your mood. Its up to your choice. Have a great fun. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}