{
"name" : "Birthday Anniversary Reminder",
"url" : "https://play.google.com/store/apps/details?id=com.apparpaltd.abhishek.birthdayanniversaryreminder",
"package" : "com.apparpaltd.abhishek.birthdayanniversaryreminder",
"category" : "Social",
"description" : "Its a Birthday Anniversary Reminder App as well as Birthday Reminder App with upcoming events, age, Alarm, Reminder via Email, Online Notification, import from contacts, Notification, custom alarm tone, Import and export and snooze alarm facility. It is also an all in one reminder as user can add custom events too.   In this app user can add any number of birthdays, anniversaries and custom events. User will get notification at midnight on the date of events. On clicking on notification a view will open with option to wish via call, WhatsApp and SMS. User can set to send SMS automatically for any event at the time of adding them or they can update it latter. User can set alarm to ring it at particular time for every event. At the time of alarm rings, user will get a view having three option Snooze, Wish and Cancel. On clicking on wish button user will get option of calling directly from this app, Send message via WhatsApp and send SMS.   Integration with standard phone functions From the app you can send WhatsApp message or SMS with best wishes or just make a call.You can choose in what time app should remind you about Birthdays and anniversaries. Also you can snooze the reminder for any time if you are not free when the app reminds you.  Features :  Easy to use  Import events from contact  Backup and restore on Online server, Google drive and SD card  Age  Notification  Reminder via Alarm with snooze option  Reminder via EMAIL and online notification  Auto backup of events on Online server and SD card  Custom alarm tone  Notification with event count on 1st day of month  Separate view for upcoming events  Options to wish from Upcoming view  Search option to find events quickly  Small apk size  Event countdown ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'com.apparpaltd.abhishek.birthdayanniversaryreminder.permission.C2D_MESSAGE', 'android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.SYSTEM_ALERT_WINDOW']",
}