{
"name" : "Garden Tags - Plants & gardens",
"url" : "https://play.google.com/store/apps/details?id=com.gardentags",
"package" : "com.gardentags",
"category" : "Social",
"description" : "Garden Tags is the ultimate all-in-one app for gardeners of all abilities thats making the art of growing easy and fun. Get planting inspiration, advice, identification and garden management in one free app. Its simple  youll grow more plants and less weeds.  With the Garden Tags gardening app you can manage your entire garden and plant collection in one place. You can also experience the joy of gardening with our rapidly growing community of 100,000+ gardeners and receive garden and plant advice in return. And if you dont know what the plant is. No Problem. Our gardeners will identify it for you for freeYou really cant beat gardener powered plant identification.  CATALOGUE YOUR ENTIRE GARDEN FOR FREE  With Garden Tags you can keep a record of all your plants in your garden in one place. When you add a plant you also get access to all the information about that plant in our growing encyclopedia of 18,000+ plants. Whats more, you get a handy record of how each plant has grown over the seasons too.   FREE GARDEN AND PLANT INSPIRATION Garden Tags members have already shared hundreds of thousands of gardens, plants and beautiful flowers on the gardening app. With GardenTags youll never be stuck for garden design and plant inspiration again. Follow expert growers like the RHS and TV Gardener Michael Perry or organic growers like Ellen Mary Gardening. From rose specialists, to organic allotmenteers to succulent growers - theyre all sharing daily inspiration to expand our growing horizons. If you like garden design there are thousands of designs to choose from too.  FREE PLANT IDENTIFICATION & ADVICE FROM REAL GARDENERS Do you need to identify a plant or flower? Want to know which plants will grow best and flower in your garden? Thinking of going organic? GardenTags has 1000s of experts on hand and ready to answer your garden, plant and flower questions. Our gardeners will also help you identify pests and diseases. You may need an answer to a design question or quick answer to an organic solution to green fly. Easy. Just hashtag your question #advice and youll get an answer.  GARDEN JOURNAL AND PLANT CARE TASKS  When you upgrade to Garden Tags Premium youll receive plant care tasks when your plant needs care e.g. when its time to prune. There are also handy videos showing you the best way to approach the garden task too. Whether youre an organic allotment gardener or a succulent grower theyll be answers to your growing needs and personalised tasks alerts. Youll also be able to add growing notes to each plant and task.  Beginner gardeners love GardenTags because of the plant identification and answers to many common gardening problems but also because they find the plant encyclopedia invaluable. As you get more confident you can follow the RHS, organic growers, allotment gardeners, succulent growers and experts in garden design. You never know you may be able to help someone identify a flower or help with a plant care task for someones planting journal. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS']",
}