{
"name" : "NHSEVEN",
"url" : "https://play.google.com/store/apps/details?id=com.roverinfotech.nhseven",
"package" : "com.roverinfotech.nhseven",
"category" : "Social",
"description" : "NHSEVEN is one of its kind application in the world, which is a fusion of Entertainment and Earning. It is an extremely user-friendly application. NHSEVEN is an amalgamation of multiple social media features under one roof, that pays the user for every activity.  Key Features: Get benefited on your very first step, NHSEVEN pays you joining bonus of rupees 25 and get rewarded rupees 25 on each referral. Refer unlimited friends to gain an unlimited bonus.  We wish you to see on our top 7 performers list. Every effort is recognized and rewarded.  1. Join our NHSEVEN and get rewarded. Register, complete your profile and instantly get rewarded with Rs.25 2. REFER and EARN: Earn money by referring NHSEVEN to your closed ones. Referrer will get rewarded once the referee (your friend) complete their registration and updates his profile. 3. ACTIVITY and EARN: Users will get rewarded on performing activities on Posts { Clap, Respond, Spread }, the more activities users perform, they get rewarded with points which can be en-cashed.  Features of NHSEVEN  a) Community Groups Users can create, join, organize a group based on similar interests or for a specific purpose; a typical group can consist of Social cause or Business interests. b) Event Organizing Users can create, invite and participate in an event. An event can be specific to a particular group. c) Professional Network Builder Get advantage of Peer Networking to enhance your professional skills and connections. d) Job Finder and Creator Users can create a job posting or find a suitable job. e) Video Portal Showcase & spread your Videos and Pictures f) Business Promotion (Digitization) A no-cost digital marketing platform for your Products & Services g) Earning platform NHSEVEN works as an earning platform that allows the user to earn for every activity performed to entertain.  Unlike any other social media platforms that give only entertainment here at NHSEVEN, you will be monetized for every activity.  Contact Us: If you want to convey any suggestions or concerns regarding the enhancement of NHSEVEN, Please Email us at feedback@roverinfotech.com ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE']",
}