{
"name" : "OutShot : Event Photo Album App",
"url" : "https://play.google.com/store/apps/details?id=com.outshot",
"package" : "com.outshot",
"category" : "Social",
"description" : "Be There. Anytime, Anywhere   What is OutShot ?   You cannot attend your son birthday, your best friend wedding or a family party? Dont miss a thing and get in real-time photos taken and shared by guests.   Create your event and invite friends and family to attend and share photos.   Your events photos collected, organised and available in one safe place.  How does OutShot work ?   Event : Create an event, share photos and invite friends and family.   Photo : Share photos in your event or an event you are invited to with guests and people who cannot attend.   Reaction : React to photos by taking and sharing Selfies.   Invitation : Search and invite people by username or share an invitation code via SMS, email or social networks.  What are OutShot core features ?   Events : See your events and events you have been invited to.   Photos : See your photos, photos from your event and photos from events you have been invited to.   Reactions : See your reactions and reactions on your photos.   Guests : See who is joining and invited to your event or events you have been invited to.   Camera : Share photos in your event or an event you are attending or react to photos by taking selfies.   New Event From : Enter your event informations, create your event and invite your friends and family.   Invitation Code Form : Enter the invitation code shared to you by the event organiser or a guest and start interacting with the event.   Profile : Manage your profile informations and your notifications settings. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}