{
"name" : "Ranchhodraiji",
"url" : "https://play.google.com/store/apps/details?id=dakor.ranchhodraiji",
"package" : "dakor.ranchhodraiji",
"category" : "Social",
"description" : "Official Mobile App of Shri Ranchhodraiji Maharaj Temple, Dakor   Live Darshan  Darshan Timing  Purnima and Utsav calendar  Online Donation   Latest News  Feedback  Contact Us   Map   Disclaimer:   The information contained in this mobile app is for general information purposes only. The information is provided by Shri Ranchhodraiji Maharaj Mandir Trust and whilst we endeavor to keep the information up-to-date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk.  In no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of or in connection with the use of this website.  Every effort is made to keep the website up and running smoothly. However, Shri Ranchhodraiji Maharaj Mandir Trust takes no responsibility for and will not be liable for the website being temporarily unavailable due to technical issues beyond our control.  Copyright Notice:   This website and its content is copyright of Shri Ranchhodraiji Maharaj Mandir Trust All rights reserved. Any redistribution or reproduction of part or all of the contents in any form is prohibited other than the following:  You may not, except with our express written permission, distribute or commercially exploit the content. Nor may you transmit it or store it in any other website or other form of electronic retrieval system.  Terms for Donation:  Shri Ranchhodraiji Maharaj Mandir Trust online donation terms and conditions operate within the guidelines specified by Shri Ranchhodraiji Maharaj Mandir Trust Committee, to ensure all steps in the process are clear prior to you making an online donation. When you have made an online donation, Shri Ranchhodraiji Maharaj Mandir Trust is committed to ensuring the information you provide is protected. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'dakor.ranchhodraiji.permission.MAPS_RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'dakor.ranchhodraiji.permission.MAPS_RECEIVE', 'android.permission.CALL_PHONE']",
}