{
"name" : "DialNow - Voip App for Android",
"url" : "https://play.google.com/store/apps/details?id=finarea.DialNow",
"package" : "finarea.DialNow",
"category" : "Social",
"description" : "DialNow offers the lowest international tariffs and is easy to use. Just register an account on our website with your phone number and buy credit.  For 10 euro you can call up to 10.000 minutes: Are you looking for a way to call friends and family in other countries without spending a fortune on long distance charges?  We can assist! We offer affordable international calls, so youll save money when you call family and friends who are living or working abroad.   Whether youre originally from other countries and youre currently working or living abroad, or youre calling someone who recently moved to other countries, our affordable international calling rates will help bridge the gap. Living far from home and apart from loved ones and friends can be stressful, but with our low calling charges to other countries and dozens of other nations, youll save money and youll stay in touch.  If youre looking for an easy way to make affordable international calls to other countries, look no further. We believe in providing our customers with options, so well provide you with a way to make cheap calls from your smartphone or landline.   Our customers enjoy up to 98% savings, so youll save money as you enjoy super low calling charges when you call friends an family in other countries.  Individuals who use our service to make cheap international calls to other countries and other nations enjoy additional benefits such as:  Versatility. Use our service to call other countries any time of day, from anywhere using your landline or a smartphone! The app is available for your Android smartphone or iPhone. Installation takes seconds and youll be ready to make cheap international calls within moments! You can also make PC-to-phone calls, in addition to sending international text messages.  Great call quality. You already know theres a tremendous distance between you; the distance shouldnt be made apparent by your call quality! Youll enjoy crystal clear voice quality, just the same as youd experience if you were calling across town. No catches. Theres no catch, no fine print, no hidden fees and no fee hikes over time. We believe in transparency and honesty. So you can enjoy your international calls to family and friends, without having to worry about unexpected surprises when your bill arrives!  Calling and texting friends and family in other countries has never been easier or more affordable.  We understand that its your relationships with family and friends that make life so joyful and worth living! So its our mission to help you bridge the distance with cheap international call rates to other countries and beyond.  Using our app as a default dialer may interfere with dialing 911 emergency services. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SEND_SMS', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REORDER_TASKS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
}