{
"name" : "Unfollow For Twitter Free",
"url" : "https://play.google.com/store/apps/details?id=follow.unfollow.tool",
"package" : "follow.unfollow.tool",
"category" : "Social",
"description" : "Looking for an unfollow tool for twitter or a tool for your twitter account management? Heres an amazing unfollow for twitter app that helps you unfollow those users who do not follow you back. You can unfollow these non-followers directly using the Unfollow for Twitter  Unfollow For Twitter Free is the best free Unfollow Management app for twitter to help you grow your twitter account using follow and unfollow methods.    *************************** APP FEATURES *************************** Still looking for features that make Unfollow For Twitter Free the best unfollow tool for Twitter? Here are features of the app that make it incredible and the best unfollow tracker app for Twitter -  - Find your non-followers on Twitter - Unfollow your non-followers - Find users who follow you but you do not follow them - Follow back these users (called Fans) - Mass unfollow your Twitter non-followers - Copy followers of other Twitter accounts  All these features are available for free. So, what are you waiting for? Download the Unfollow for Twitter app now to get started.  Support Us If you have any feedback, please email us. If you like our app, please rate us on play store and share with other users.  Disclaimer - This app is not affiliated to Twitter - App uses Twitters API and is compliant with API usage policy - App does not store any user information ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}