{
"name" : "Nova video downloader: Download video from web",
"url" : "https://play.google.com/store/apps/details?id=free.video.downloader.converter.music",
"package" : "free.video.downloader.converter.music",
"category" : "Social",
"description" : "Use Nova video downloader to download your favorite videos from any social web freely!  Nova video downloader auto-detect videos on the website, you could download them with just one click. Support for all social media platforms and all formats. It`s lightweight and its totally free!   New Feature: GIF maker, you could convert video to GIF by one-click and share with your friends. TRY NOW!  Browse and Download your favourite videos anytime and anywhere mate.   Features:  - Browse and find funny videos or video songs with built-in browser  - Preview video before downloading - Easily and fast download video from Instagram/Facebook/Twitter/Whatsapp/Tumblr/xx video - Automatically detects the links from web browser - Share, repost, delete and manage downloaded videos with download manager  - Support all formats such as mp3, mp4, m4a, m4v, avi, mov, wmv etc.  - Download videos in the background  - Download files to SD card  - Different definitions to choose as you like. Fast speed to download HD videos  - Convert video to GIF with Gif Maker  - Download several files at the same time  - Add your favourite website to bookmarks  - Simple design, and lightweight - Browser private downloader for you and you can play videos offline   How to use Nova video downloader:  1Browse social webs or video sites with the built-in browser  2Open the video you want to download  3Click DOWNLOAD to save it to local   Done! Its easy and fast!  Or you can copy the links of videos and paste in the app to download the video you like.  Download all videos  All video downloader for social media and video websites to fast download video. Watch your favourite song videos and movie clips .  Fast and easy video downloader  This video downloader helps you download video with 1 click. It could automatically detect the links from web browser.  Browser private sites and video channels  Browse status and any other sites you like to find music videos or video songs and clips quickly .  Download manager Full-featured download manager.  Support for delete, share, repost, go to the website, etc. The best and easy to use download manager!  GIF maker  Convert your favourite video to GIF with just 1-click, and share it with your friend!  Want to download the video in social media apps? Want to watch video and listen to music offline?  Nova video downloader is the best app to download videos from internet.  Important notes:  - Please get permission from the owner before reposting.  - YouTube videos cannot be downloaded due to legal restrictions. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_SIP', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.android.vending.BILLING', 'android.permission.USE_SIP']",
}