{
"name" : "ShareChat - Made in India",
"url" : "https://play.google.com/store/apps/details?id=in.mohalla.sharechat",
"package" : "in.mohalla.sharechat",
"category" : "Social",
"description" : " ShareChat now features Hindi, Telugu, Marathi, Gujarati, Punjabi, Malayalam, Bengali, Tamil, Kannada, Odia, Bhojpuri, Assamese, Rajasthani, Haryanvi & Urdu ChatRoom!   Make Friends via Chat Rooms: Talk with strangers and make friends.  Download and Share FREE WhatsApp Status Videos, Funny Short Videos, Talk To Strangers, Latest Events and Trends in 15 Indian languages.   ShareChat: Join Indias Own Social Media App With More Than 100 Million Users.   Trending Chatrooms on ShareChat:   Wishes & Quotes   Entertainment   Funny Videos   WhatsApp Status & Instagram Story Videos  Short Videos  Cinema & TV Gossips  Astrology  Devotional Videos  Fashion  Health & Fitness   Trending News  Status and Stories    Create Funny Videos With ShareChat Video Filters, Use 300+ Emoji Stickers and Face Filters   AI Beauty Filters  Fashionable and stylish filters  Magic Music Filter  3D Camera Stickers  Dubbing & Lip Syncing in 15 Indian Languages   Put a video status, share and chat it with your friends across all of social media like Facebook, WhatsApp, Instagram, Snapchat, Twitter with exclusive Magic effects. There are millions of users already using ShareChat with the best magical performance.   Download Funny Short Videos, Jokes, Gifs, Audio Songs, Shayari, Motivational Quotes, Funny Quotes, Bhajans, Devotional Songs And Funny Images all in one platform.   Multiple Indian Languages: ShareChat is available in 15 Indian languages viz. Hindi, Telugu, Marathi, Gujarati, Punjabi, Malayalam, Bengali, Tamil, Kannada, Odia, Bhojpuri, Assamese, Rajasthani, Haryanvi & Urdu    You can make friends and share regional videos with people who speak in your own language. Hindi language users can now download Hindi videos, Hindi love video songs, Hindi shayari, and Hindi WhatsApp status videos and similarly, there are Tamil WhatsApp videos status, Telugu WhatsApp video status, Kannada WhatsApp video status, Marathi WhatsApp video status, Gujarati WhatsApp video status, Bengali WhatsApp status, Urdu WhatsApp video status, and Malayalam WhatsApp video status. You can download videos in just one click.    Features of ShareChat:   Download Jokes, Whatsapp Status, Memes, Trolls, Wishes And Greetings.  Viral Videos From Tamil Movies, Bollywood Movies, Telugu Movies, Marathi Movies And Bengali Movies.   Join Chatrooms in more than 15 languages. Create your own chatrooms and make friends.  Good Morning Wishes, Good Night Wishes And All Other Festival Wishes  Get Famous By Showcasing Your Talent And Become An Internet Celebrity.  Repost The Images Or Videos That You Like.  Make Whatsapp Sticker From Any Image  Best Hindi Shayari, Love Shayari, Romantic Shayari, Marathi Shayari and More.  Talk To Strangers With Sharechat Shake & Chat.  Beauty Tips, Home Makeup Tricks And Fitness Videos.  Latest Trends Of Your Locality!  Daily Horoscope, And Best Astrology From Panditji In All Indian Languages By Birth Date  Find Latest love Quotes, Tips To Dress Well And How To Prepare For Interviews  Health Tips And Fitness Tips On How To Cure Yourself With Home-made Remedies  Religious And devotional Songs Like bhajans  If you have any bugs to report or have questions regarding your first experience, please contact us at https://we.sharechat.com/contact Visit us at https://sharechat.com ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.READ_CALL_LOG', 'android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.truecaller.permission.sdk.internal.read_account_state', 'android.permission.WRITE_SETTINGS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'in.mohalla.sharechat.permission.MIPUSH_RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.SET_WALLPAPER', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'in.mohalla.sharechat.permission.MIPUSH_RECEIVE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CALL_LOG', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.truecaller.permission.sdk.internal.read_account_state', 'com.android.vending.BILLING']",
}