{
"name" : "YourQuote — Write At Home While You Work From Home",
"url" : "https://play.google.com/store/apps/details?id=in.yourquote.app",
"package" : "in.yourquote.app",
"category" : "Social",
"description" : "Hello there!   Since you have landed here, let me make it conversational. YourQuote Baba, the one wholl welcome you once you login, taught me that good writing is about starting a conversation & keeping the reader hooked.   The year was 2016. The month, October. I, much like you, accidentally landed on this description while searching for a writing app on Google Play. This app was merely a month old then. And I got hooked to it! Right from the start. It changed the way I saw and felt about writing. So much so that I joined the company and now am able to share my story with you. To share what YourQuote truly stands for. :)  In one line, YourQuote is an app that makes you write and never feel judged about it. It inspires you to find the most honest voice within yourself and takes care of your entire writing journey from getting started to getting better to publishing your book to making money off it. And it does so by taking care (rather, making sure) that you:  1. WRITE EVERYDAY: Yes, thats it. No bullshit. It will inspire you to write daily, teaching you techniques to become better and unleash the most honest voice within you. Its the only writing app youll ever need to keep the writer within you alive and kicking. Write from home, write from office, irrespective of whether you are working from home or office.  2. BECOME A BETTER WRITER WITH TIME: Meet the YourQuote Baba and his family of writer-makers! With daily creative writing tips, masterclasses and prompts, YourQuote makes writing fun and easy for those getting started, and fulfilling for those eager to take it to the next level. From writing a poem to writing a novel, we have got you covered about every form of writing.  3. PUBLISH YOUR BOOK & EARN REAL-TIME ROYALTY: Once you cross 48 posts, YourQuote unlocks publishing for you. Publish on YQ Bookstore, get a physical copy delivered to your doorstep and for the first time in this world, earn real-time royalty. Get notified everytime someone buys your books and connect with buyers right away. We have short-circuited the publishing process for the world.  4. MAKE YOUR QUOTES GOOGLE SEARCHABLE: Ever searched for Albert Einstein or Mother Teresa quotes on Google? Ever wondered why only famous peoples quotes are up on Google? Now no more. YourQuote turns your own quotes up on Google search within a month or two. Google Your Name Quotes after posting 20+ quotes or videos & see how magic happens!  5. FIND WRITER FRIENDS & FOLLOWERS: Befriend a writer and you shall never die, someone wise once said. Imagine a world filled with brilliant writers to follow and make friends with! YourQuote turns your imagination into reality, giving you an access to the finest creative minds at your fingertips. Try the fun collab feature to collaborate with your favourites.   6. WRITE ON PHOTOS & CREATE A PICTORIAL PORTFOLIO OF YOUR ORIGINAL WORKS: Write about anything under the sun (and even above it!): from quotes, stories, love poems, terribly tiny tales, shayari, ghazal, jokes, haikus to memes. YourQuote creates a stunning pictorial portfolio of your original literary work that you can turn into real posters or quote-books (you can order within the app!), simultaneously garnering thousands of followers on the app with your creativity.  7. LET YOUR WORDS TRAVEL THE WORLD & EARN CREDIT: Posting is boasting! :) Share across Facebook, Instagram, Twitter, WhatsApp & Twitter at the click of a button.   8. WRITE IN ANY LANGUAGE: We care for your mother-tongue. Our team speaks 20 languages, you know. YourQuote supports all languages & has over 2 million writers posting their original works in English, Hindi, Odia, Kannada, Malayalam, Bangla, Tamil, Telugu, Marathi, Gujarati, Assamese among others.   Join and start this extremely fulfilling journey with words. Its never too late to start writing. Happy discovering yourself on YourQuote! :) ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.FLASHLIGHT', 'android.permission.RECORD_AUDIO', 'com.truecaller.permission.sdk.internal.read_account_state', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'com.truecaller.permission.sdk.internal.read_account_state', 'android.permission.STORAGE']",
}