{
"name" : "Video Downloader for Instagram, Repost IG- Insaver",
"url" : "https://play.google.com/store/apps/details?id=instasaver.instagram.video.downloader.photo",
"package" : "instasaver.instagram.video.downloader.photo",
"category" : "Social",
"description" : "Wanna save video / photo / story / highlight from Instagram and IGTV to local ? Wanna REPOST with best caption and tag or just wanna save profile picture ? Use Video Downloader for Instagram- Repost, Story Saver - InSaver ,Fast, Easy, 100% FREE.  New features - Super fast story saver, save story from Instagram - Regram, repost or reshare with Instagram hashtag - Downloader, save video and photo for private account - Save Profile picture/ DP  No need to log in. You copy the link from Instagram and the download will automatically start. Fast and easy!  Install now and save, use Video Downloader for Instagram- Repost, Story Saver- InSaver to repost with caption and hashtag to get more likes and follows   How to Save?  1Method 1: Open Instagram and copy Link of video, photo, story or highlight Open InSaver Download automatically!  2Method 2: Click Share and choose InSaver. Done!  Save Profile picture/DP   1 Open Instagram and copy link of users profile 2 Open InSaver then auto-download  How to Repost?  1 Check the downloaded videos or photos 2 Click  repost to reshare, you can copy hashtag and caption before you repost  Its simple and fast to download and repost on Instagram! You can also share downloaded video everywhere. This Instagram downloader also save IGTV video. Enjoy ALL Instagram videos and photos saved offline!  Features: - NO LOGIN - Super fast save videos  - Story saver for Instagram, easy to save story and highlight - Easy repost videos with caption and hashtag using the best reposter  - Fast save Instagram caption, hashtag for repost - Download video from IGTV  - Download video and image from private account - Save HD videos savefrom Insta - Play videos savefrom Insta or LGTV offline - Small sized lite - Safe, totally FREE! - Multiple download videos from instagram at the same time - Save Profile picture/ DP/ Instadp  This photo saver and video saver can help you to download video and image from instagram and IGTV. Give it a try!   Disclaimer: * Please get the PERMISSION from the owner before you repost or download videos or photos. * We are not responsible for any intellectual property violation that results from an unauthorized repost or download of a video or photo. * This video downloader is not associated with Instagram. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.ACCESS_WIFI_STATE']",
}