{
"name" : "Photo & Video Downloader for Instagram",
"url" : "https://play.google.com/store/apps/details?id=instagramdownloader.instasaver.instasave",
"package" : "instagramdownloader.instasaver.instasave",
"category" : "Social",
"description" : "InstaSave for Instagram helps you to fast download and repost videos & photos from Instagram and IGTV without login. 100% free and safe!  With free Instagram downloader, you can easily save Instagram videos and photos directly to your gallery in just one tap. View offline, share, repost, delete saved posts as you like.   To save Instagram videos/photos with other downloaders, you must log in to Instagram and scroll to that video/photo again. This is quite inconvenient, and sometimes its not safe to log in to Instagram via a third party. While with InstaSave, you do not need to log in. Just tap share to or copy link of the post and the download auto starts. Its that easy and safe!  How to Use Option 1: Share Link  1. Open Instagram and click Share to... of the post 2. Select InstaSave  3. Download auto starts  Option 2: Copy Link 1. Open Instagram and click Copy Link of the post  2. Return  3. Download auto starts  Features * No login required * Easily and fast save Instagram videos and photos to your gallery * Support download all HD videos and photos * Download multiple photos in one Instagram post * Play downloaded videos offline with the built-in player * View saved videos & photos offline and share with friends * Repost, rename, share, delete downloads with powerful download manager * Download Instagram videos with hashtags and caption, easy for reposting * IGTV downloader * Small size and lightweight Instagram downloader tool  All in One Downloader * InstaSave for Instagram - save Instagram posts directly to the gallery * Instagram video downloader - fast download HD videos from Instagram/IGTV * Instagram photo downloader - save Instagram photos and share with friends * Repost app for Instagram - easily repost saved Instagram videos and photos * Download manager - share, repost, and delete downloads as you like  InstaSave Disclaimer * This app is not associated with Instagram * Please get the PERMISSION from the owner before you repost videos and photos * We are not responsible for any intellectual property violation that results from an unauthorized repost of a video or photo  Instagram downloader Instagram downloader is a full-featured downloading app for Instagram. You can use Instagram downloader to download HD videos and share with friends  Instagram video downloader It is also an Instagram video downloader, you can download your favorite videos and photos from Instagram and IGTV with this Instagram video downloader.   Insta downloader Use Insta downloader to save your favorite Instagram stories, repost or watch offline as you like. Try this Insta downloader now!  Insta saver Insta saverhelpsyoudownloadand repost Instagramphotosandvideoswithoutlogin. Use this Insta saver to download Instagram videos now!  Instasave for Instagram Instasave for Instagram is a full-featured downloader app for Instagram. You can save Instagram stories with Instasave for Instagram, share, repost, delete downloads as you like.  Repost for Instagram Repost for Instagram helps you fast download Instagram videos and photos. You can use repost for Instagram to repost Instagram videos.  Video downloader for Instagram The best video downloader for Instagram. You can save Instagram videos and pictures from this video downloader for Instagram.   IGTV downloader Its also an IGTV downloader. With this IGTV downloader, you can easily download videos and photos directly to your gallery.  Instasaver free Download and repost Instagram photos and videos with Instasaver free. Youll find its the best Instasaver free.  Download video Instagram Want to download video Instagram? Definitely the Instasave app, it helps you to download video Instagram lightning-fast.  Photo & video downloader for Instagram You can use the photo & video downloader for Instagram to save photos and videos from Instagram. Just try photo & video downloader for Instagram! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}