{
"name" : "Ummah - Muslim App",
"url" : "https://play.google.com/store/apps/details?id=io.ummah",
"package" : "io.ummah",
"category" : "Social",
"description" : "The only Islam app you need if you want to remain a proud, motivated & respectful Muslim!  Introducing Ummahyour all-in-one Muslim app and social Muslim brotherhood helping you to learn, share, collaborate and connect with Muslims anywhere, anytime.  Ummah Online Marketplace is finally here!  We have finally added the Ummah Online Marketplace. It is something that we have been working passionately in the last couple of years. Ummah Online Marketplace represents an online buying and selling platform that is designed to bring closer buyers and sellers in a suitable tool, which will allow them to interact properly. It is FREE to use it and Ad-Free. Businesses will be able to benefit from Ummah Online Marketplace by: - Expanding their business online for FREE, - Adding products easily, - Communicating non-stop with their clients, - Practical product categorization, etc. Meanwhile, users will be able to benefit from Ummah Online Marketplace by: - Using it for FREE, - Buying products at their best prices, - Being notified on SALES, - Negotiating the affordable price, etc. We will be continuously adding features and updating it by bringing the best practices that will allow you to feel safe and comfortable using Ummah Online Marketplace. Please, check it and send us your comments.  ALL IN ONE MUSLIM APP  Ummah is your personal virtual assistant and one of the best Muslim apps that reminds you of accurate Islamic prayer times, listening to the Quran, choosing the next Halal food restaurant to eat, read latest important news, thoughts, articles, and blogs related to Islam and much more. Just imagine connecting directly to the most comprehensive and FREE Muslim Islam platform that Ummah has built.  ACCURATE PRAYER TIMES FOR YOUR LOCATION  Always have detailed and highly accurate prayer times for your location with Qibla direction. See our prayer time Muslim calendar and know exactly your Fajr, Sunrise, Dhuhr, Asr, Maghrib and Isha a times in detail day by day and for your city. On top of that, you can make use of our halal food finder to complete your days with ease. Its really one of the most comprehensive Muslim apps out there.  STAY FOCUSED & INSPIRED Ummah is your Muslim app that is always here for you. Think about a personal virtual assistant, a friend, a shoulder to lean on, a teacher for the one who wants to learn, a reminder of our extraordinary religion, a guide on the right path, and bringing peace and prosperity all in one place...Ummah is a unique way to improve the akhirah!  WHY YOULL LOVE UMMAH:   Accurate prayer times based on your location, includes available multiple settings   Qibla - Find Qibla direction in the easiest and most interactive way possible  Notifications - This feature will help you get informed faster for things that Ummah thinks might be helpful for you.   Widgets - Right on your screen. Unique in design and unique in the way they give you the right information for prayer-times. We provide two widgets and ongoing notifications so you can always remember the prayer times (enable it in settings).   Read daily Ayah (from Quran), Hadith (of Prophet Muhammad ), Quotes (from eminent Scholars) & Supplications.  Available languages: English, & Arabic on the way to life.   Love Islam? Then youll love Ummah! Get our Muslim app now for free! We update our Islamic app regularly so we can make it better for you and keep you up to date with all Muslim holidays.   May Allah bless You for using Ummah app.  Make your moments more meaningful, share it with your friends, find Muslim mates and make the world happy!   Love Ummah?  Like us on Facebook:  https://www.facebook.com/ummah.io:  Follow us on Instagram:  https://www.instagram.com/ummah.io/    - NOTES   If you feel that the app is giving you wrong prayer times, it is most likely related to your settings.   If you find a bug or need our help, please write to us info@ummah.io ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACTION_TIME_CHANGE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.ACTION_TIME_CHANGE']",
}