{
"name" : "LINE PLAY - Our Avatar World",
"url" : "https://play.google.com/store/apps/details?id=jp.naver.lineplay.android",
"package" : "jp.naver.lineplay.android",
"category" : "Social",
"description" : "Be the best you! Make your own unique avatar and meet friends from around the world! Over 65,000,000 people are currently playing LINE PLAY around the world!  1. All it takes is 3 seconds to make your own original avatar! You can make an avatar that looks just like yourself by taking a selfie! You can set the avatar as your LINE profile pic and decorate it with LINE Camera stickers! Its also fun to make avatars of your friends and give them to them!  2. The possibilities are endless! Thousands of items are waiting for you! Produce any kind of look you want with a huge variety of fashion, hair, makeup, and accessory items! New items are added practically every day! Create whatever vibe youre in the mood for! There are even animated items, as well as ones that play music!  3. Lots of tie-ups with popular artists and characters! Popular real-life artists and celebrities as well as fictional characters from properties like HELLO KITTY and Rilakkuma all come together in LINE PLAY! Your favorite characters could show up in a tie-up at any time! The tie-up item gachas are also a must-see!  4. Dive into Story World, where you can experience your own unique stories! Theres a strange library in a corner of LINE PLAY. The fairy Libro lives there, and he needs your help! Please, help us! The only way to see the endings is to take back the stories!  5. Record special moments in your diary! Your diary is where you can write down anything from how you feel at the moment to important events in your life! Post your most stylish avatar outfits and see how many Likes you can get from your friends!  6. Head to the Squares, where you can hang out with people from around the world! The Squares are where you can chat and play all sorts of fun games! You can run a cafe, play soccer, or get absorbed in fishing!  7. Enjoy Circles with your friends! You can start your own Circle, or join an existing one! Talk with your friends about shared interests, exchange items, and more! Find your perfect Circle!   8. Play every day and become a VIP! Collect Stars by playing LINE PLAY every day, and get on the road to becoming a VIP! Once you become a VIP, you can enjoy a variety of benefits including access to special discounted gachas just for VIPs!   LINE PLAY is perfect for anyone who... ...loves fashion! ...wants to make new friends! ...loves cute items! ...wants to make friends with similar interests! ...wants to enjoy life! ...is looking for a new LINE profile pic! ...wants a new app to kill time with! ...wants to start something new with their friends!  Please note: LINE PLAY is free to download and play, but in-app purchases are available. If you wish to restrict in-app purchases, please go to the Settings of your device and configure it so that a password is required to make purchases.  Visit our official Facebook & Instagram Pages  http://www.facebook.com/lineplay.global https://www.instagram.com/lineplayglobal ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_SETTINGS', 'android.permission.ACTION_MEDIA_SCANNER_SCAN_FILE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'jp.naver.lineplay.android.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.FLASHLIGHT', 'android.intent.action.BADGE_COUNT_UPDATE', 'android.permission.CAMERA', 'android.permission.DISABLE_KEYGUARD', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACTION_MEDIA_SCANNER_SCAN_FILE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.intent.action.BADGE_COUNT_UPDATE', 'android.permission.DISABLE_KEYGUARD', 'com.android.vending.BILLING']",
}