{
"name" : "AHA Live Random Video Chat, Meet New People",
"url" : "https://play.google.com/store/apps/details?id=live.aha.n",
"package" : "live.aha.n",
"category" : "Social",
"description" : "The best random video chat app to meet fun and interesting people all over the world at the turn of each swipe!  Have you got fed up with common chatting apps and always get ignored by others? Are you tired of others being deceptive, dishonest or lying about their gender? Would you like to build true friendship with people around the world without checking their profile? Do you live in a place where it is too hard to connect with others or feel lonely and need to exchange of thoughts, ideas or feelings with someone else?  Say Bye-bye to common chatting and texting apps. With new alternative AHA to meet new friends!  AHA allows you to make video calls to connect with others and build friendship, regardless of common texting apps. By chatting with others, you will soon find out your character, value, interests match each other or not. No more deception or frustration when you found that you are chatting with liar or dishonest mate like whats happening in the common texting apps.  Our mission is to provide simple, reliable and interactive fun video communication service. You can enjoy face to face time with people worldwide. We are building an enjoyable, clean and harmony community, so any offensive behaviors or violations against terms of use will be taken seriously and result in the termination of your account.   Main Features: 1. Choose gender and region preferences and build new conversations while talking to strangers.  2. Do video chats through 3G\4G and Wi-Fi. 3. Unlimited texts, video messages and video chat among friends to enhance your friendship. 4. Dozens of fantanstic effects and filters to make you look better during live video chatting. 5. Add new friends in random video chat to friend list. 6. Do not worry about foreign languages! Your words will be translated in real time. So get ready to meet new people right now!   You can chat with global users about the topics you care about and you will never know who you will meet next. Stay in touch with those you enjoy chatting with. The connection can be rich and real. Maybe you can be best friends or even become lovers. Be friendly to everyone you meet and cherish the hard-wons fate. Start a romantic chatting tour at once! We would be happy if you shared AHA with your friends  Privacy and security: User privacy information will be encrypted and wont be shared to any third parties. The only information shared to other users is the information in your AHA profile that you allow others to view. AHA wont access your location as you can control it from your phone privacy setting. Any information you share with your friends is your responsibility.  Notice: additional fees may apply when using cellular data. We recommend using an unlimited data plan or Wi-Fi connection. AHA is also called A7A in Arabic country. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.RECORD_AUDIO', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.USE_CREDENTIALS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}