{
"name" : "Good Morning Images and Gif",
"url" : "https://play.google.com/store/apps/details?id=lovequotes007.love.justforu.gmprogirl",
"package" : "lovequotes007.love.justforu.gmprogirl",
"category" : "Social",
"description" : "Good Morning Images : If you love someone and want to make you lover woke up in the morning with Good morning images then this Application will be very special for you. Its especially for all the Good morning images, Good Morning pictures and gif around here. And today we are sharing latest Romantic good morning images, Good Morning messages, good morning gif and Good morning pictures. As we know that everybody who loves someone sends them Good morning images for WhatsAp but in the morning they like to send them good morning pics and sometimes a Good morning image with love but most of the time according to their mood in the morning they send them Good morning images with quotes.  If you search for Good morning images with flowers on the Google you get many good morning image with nature but choosing the best romantic good morning images is most important. But dont worry if you are looking for good morning love image or Good morning pictures for Facebook we are going to share the best ever Good morning images. If you like these good morning images then dont forget to share this special collection of Good morning images on social platforms. These Good Morning Love images are for everybody who is in love with someone. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_PHONE_STATE', 'com.android.alarm.permission.SET_ALARM', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}