{
"name" : "Messenger App for Free Video messages, Video Calls",
"url" : "https://play.google.com/store/apps/details?id=messenger.video.call.chat.free",
"package" : "messenger.video.call.chat.free",
"category" : "Social",
"description" : " All-in-1 Video Call & Messaging Apps  Video Call Pro is also an all-in-one video call and messenger app. The app lets you access the worlds best of free video chat apps like viber, facetime, kik & skype, apart from messaging apps like whatsapp, facebook messenger, tango etc.     Random Video Chat Video Call Pro is a random video chat app that lets users do free video chat with strangers. It allows users to meet someone new over video call with every tap.    --------------------------   The Random Chat Advantage  - Gender Filter  Although the fun about random video chat is when you actually randomly meet new people and talk to strangers, but the app comes with a gender filter that lets users chose to be connected with only males or females.   - Location Filter This is another feature of the app that lets you semi-control your random video chat experience. This filter allows you to only be connected with people in your city. And trust us, random chat has lot of power ;)  - Free video chat - unlimited fun This random chat app is absolutely free to download. Though users can make in app purchases to upgrade their experiences, one can essentially do UNLIMITED random video chat and talk to strangers for FREE !   - Face filters, virtual gifts and other cool features The random chat app comes packed with fun features like cool face filters, lets you send virtual gifts, hearts and hugs, to spice up your random video chats and ward off awkward moments !  - Meet new people from 120+ countries Whats a better way to meet new people than a random video chat app on your phone all over the globe. No need to travel or spend any money - just use the random chat feature on Video Call Pro to explore the world!  - Female friendly - 100% Safe & Secure Some people might be a little hesitant towards the idea of random video call and talk to strangers. Video call pro is a female friendly app that uses a community reporting system to weed out sketchy users.    Random video chat feature on Video Call Pro is super easy to use.  -One tap to start Once youve downloaded the Video Call Pro app, youre just a tap away from connecting with strangers on random video chat.   -One tap to make a new connection If you want to jump to another conversation, just tap and voila!, youll be connected to a new person right then.    -----------------------------   The All-in-1 Video Call Messenger Advantage  This feature allows you to access the following messenger, video call and random video chat apps.  Kik: Kik is a popular messenger, the easiest way to share pics, videos, GIFs, games and more.   Skype: Skype is a simple way to connect with family and friends. Skyper offers free video calling app. One can easily share content using Add-Ins without leaving Skype.   Viber: Viber connects millions worldwide. Viber is your go-to free messenger, allowing you to message or call anyone in the world. Viber is a free international calling app.  WeChat: WeChat is a messaging and calling app connect with family and friends across countries. Make calls to landlines and mobile with WeChat Out Calls. Add custom wallpapers, custom notifications with WeChat.  Tango: Tango is the first and the best video calling app. Send and receive text, stickers, photos, video, audio and location on Tango for free.Tango works on both smartphones and tablets. Use Tango to keep in touch with all those who matter to you.  Azar: Azar allows strangers to connect over random video call. Azar works on both phone and desktop. Few other similar apps like meetme and holla that allow users to do random video chat.    We really hope you have fun using our random video chat app ;)  With love,  Team Video Call pro ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CALL_PHONE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BATTERY_STATS', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_BACKGROUND_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.DISABLE_KEYGUARD', 'com.android.vending.BILLING', 'android.permission.BATTERY_STATS']",
}