{
"name" : "Widget for YouTube Analytics",
"url" : "https://play.google.com/store/apps/details?id=org.nikas.ytanalytics.widget",
"package" : "org.nikas.ytanalytics.widget",
"category" : "Social",
"description" : "Attention! Not install this app!  Unfortunately at this time this app works incorrect for new users. We try to fix this issue as soon as possible. For some reasons we cant hide this app in Google Play. Thank you for your understanding!  -------------------------------------------  Designed for YouTubers. Imagine your YouTube Studio as Android Widget.  Widget for YouTube Analytics is a YouTube Analytics Informer which provides charts with metrics, trends and statistics in timeline view from YouTube Analytics service accessing your YouTube Channel Statistics.  DISCLAIMER: We provide you ONE of any widgets for FREE. Unlimited widget count available by less than 4$ annually.  Features: It has categories and metrics from YouTube Analytics which you can track. For example you can setup the following items: - Channel Subscribers Boost (Channel Subscribers Increase); - Channel Subscribers Lost (Channel Subscribers Decrease); - Channel Views (Video Views); - Channel Likes (Video Likes); - Channel Dislikes (Video Dislikes); - Comments (Video Comments); - Shares (Video Shares); - View Duration (Video View Duration); - Metrics Counter (Counter).  See your YouTube Channel Statistics and analytics at the moment. YouTube Statistics Widget has configuring time detailing to represent your YouTube Analytics data in Day and Month dimentions.  Widget for YouTube Channel Analytics has configuring dynamic time period for YouTube Analytics report. For example: Today, Yesterday, 7 Days Ago, 30 Days Ago, N Days Ago or static period as fixed dates.  Widget for YouTube Channel Statistics provides configuring comparison mode. You can compare statistics of the current period with the previous one. For example, compare the revenue of the current month with the previous or with the same one a year ago. Widget\'s with Full YouTube Analytics flexible configuration on the colour scheme for the user interface makes it possible to fit it into any Android main screen design. When the device is offline all items of widgets with YouTube Full Statistics display the last loaded information with time tag. All supported metrics: - Gained YouTube Subscribers Number (subscribersGained); - Lost YouTube Subscribers Number (subscribersLost); - Views Number of Channel Videos (views); - Average YouTube View Duration (averageViewDuration); - Comments Number (comments); - Likes Number (likes); - Dislikes Number (dislikes); - Estimated Minutes Watched of Videos (estimatedMinutesWatched); - Shares Number of Videos (shares); - Annotation Click Through Rate Number (annotationClickThroughRate); - Annotation Close Rate Number (annotationCloseRate). ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.MANAGE_ACCOUNTS', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.GET_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.USE_CREDENTIALS']",
"extra_perms" : "['android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION']" 
}