{
"name" : "Berbagi Beras - Zakat, Infaq, Sedekah, Donasi",
"url" : "https://play.google.com/store/apps/details?id=org.berbagiberas.donasi",
"package" : "org.berbagiberas.donasi",
"category" : "Social",
"description" : "Masih banyak Saudara kita yang masuk dalam kategori miskin mutlak yang membutuhkan santunan untuk memenuhi kebutuhan hidupnya seperti kakek atau nenek sebatangkara, yatim piatu tanpa penanggung, keluarga berpenanggungan tanpa tulang punggung, difabel parah dan sebagainya. Mereka adalah tanggung jawab kita bersama. Dibutuhkan wadah komunitas sosial yang memungkinkan terwujudnya kegotong-royongan semua lapisan masyarakat untuk membantu secara rutin dan terkoordinir.  Tujuan Komunitas berbagi beras adalah untuk membantu memenuhi kebutuhan beras saudara kita yang masuk kategori miskin mutlak.  Kegiatan Komunitas berbagi beras antara lain menyalurkan bantuan beras secara rutin setiap bulan kepada sasaran tetap yang dipilih sesuai kriteria.  Sasaran bantuan komunitas berbagi beras adalah Saudara kita yang masuk pada kategori miskin mutlak yang membutuhkan bantuan untuk memenuhi kebutuhan dasar hidupnya. Meliputi kakek atau nenek sebatangkara, yatim piatu, difabel parah, keluarga tanpa tulang punggung dan lain-lain.  Aplikasi ini membantu kita untuk menyalurkan zakat, infaq, sedekah ataupun donasi kepada Saudara kita yang benar benar membutuhkan tanpa dipotong sepeserpun untuk gaji pengurus.  Berdonasi di komunitas berbagi beras akan sangat bermanfaat karena donasi kita sepenuhnya disalurkan kepada yang membutuhkan tanpa dipotong sepeserpun untuk gaji pengurus. Selain itu donasi juga akan disalurkan dalam bentuk beras yang merupakan kebutuhan pokok. Bersama kita bisa membantu meringankan beban saudara-saudara kita.  Aplikasi berbagi beras memudahkan donatur yang akan menyampaikan zakat, infaq, dan sedekah untuk berdonasi. Dalam aplikasi ini, pengguna juga dapat menyampaikan masukan atau berdiskusi dengan anggota komunitas berbagi beras. Selain itu, pengguna juga dapat memantau kegiatan kegiatan terbaru dari komunitas berbagi beras. There are still many of our brothers who fall into the absolute poor category who need compensation to fulfill their daily needs such as grandparents as well as elders, orphans without guards, families with a backbone, severe disabilities and so on. They are our shared responsibility. It takes a place of social community that allows the realization of mutual cooperation of all levels of society to help routinely and coordinated.  The aim of the Community to share rice is to help meet the rice needs of our brothers who are categorized as absolute poor.  The activities of the Community sharing rice include distributing rice assistance on a regular basis every month to the fixed targets chosen according to the criteria.  The target of helping the community to share rice is our brother who is in the absolute poor category who needs help to fulfill the basic needs of his life. Includes grandparents as well as siblings, orphans, severely disabled people, families without backbones and others.  This application helps us to channel zakat, infaq, almsgiving or donations to our brothers who really need it without cutting a penny for the salary of the management.  Donating in a community sharing rice will be very beneficial because our donations are fully channeled to the needy without a penny being deducted for the salary of the manager. In addition, donations will also be channeled in the form of rice, which is a basic necessity. Together we can help ease the burden on our brothers and sisters.  The rice sharing application makes it easy for donors who will deliver zakat, infaq, and alms to donate. In this application, users can also submit input or discuss with community members sharing rice. In addition, users can also monitor the latest activity activities from the community sharing rice. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'org.berbagiberas.donasi.permission.C2D_MESSAGE', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.GET_ACCOUNTS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'android.permission.VIBRATE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION']",
}