{
"name" : "Greeting Cards All Occasions",
"url" : "https://play.google.com/store/apps/details?id=realappes.greetingscards",
"package" : "realappes.greetingscards",
"category" : "Social",
"description" : "An image speaks a thousand words! Sharing greeting cards, images & wishes is a special way to convey our loved ones how much we care about them.  With this Greeting Card Photo Editor. Surprise your loved ones by sending beautiful greeting cards! Add photo and text to personalize greeting cards.  This is a must-have free text on card & photo on card greetings app for all occasions & purposes! It has all wishes & holidays cards.  Unlimited greeting cards for all occasions, a huge collection of quote images, all categories wallpapers, photo frame, text editor, paint brush & eraser, smileys & emojis, stickers, wish images, different fonts, colors to use & more.  ALL OCCASIONS GREETINGS Sharing free ecards, wishes and greetings is easy with this app. Share greetings for all occasions like Birthday, Anniversary, Wedding, Thanksgiving day, Good morning, Good night, Good evening, Stay in touch, Engagement, Wedding, Baptism & Christening, Care & Concern, Appreciation, Confirmation, Congratulations, Encouragement, First communion, Friendship, Get Well, Good Luck, Graduation, Love, Miss You, New Baby, Retirement, Sympathy, Thank You, Thinking of You, Sorry, See you, Happy Journey etc with this all occasion wishes app with name & photo.   LOVE GREETINGS FRAMES Love photo frame & text editor, love wish app, love greeting card, love wishes for husband, good night love wishes, birthday love wishes app, love quotes with images, love cards app, love quote app, love quotation app, propose images, miss you cards, love card app, love you cards, love quotes in English, love images for whatsapp, miss you images, I love you images, I love you wallpaper  HOLIDAY GREETINGS This greetings cards making app has cards for Thanksgiving day greetings, New Years Day, Epiphany, St. Patricks Day, Good Friday, Easter, Mothers Day, Armed Forces Day, Eid ul fitr, Fathers Day, Fourth of July, Grandparents day, Rosh Hashanah, National Boss Day, Sweetest Day, Halloween, Veterans Day, Hanukkah, Christmas, Passover, Nurses Day, Holiday cards & all seasons greetings.  EVERYDAY WISHES IMAGES Cheer up by everyday wishes & daily greetings. Share Sunday wishes, Sunday quotes, Sunday card, Monday wishes, Monday quotes, Monday card, Tuesday wishes, Tuesday quotes, Tuesday card, Wednesday wishes, Wednesday quotes, Wednesday card, Thursday wishes, Thursday quotes, Thursday card, Friday wishes, Friday quotes, Friday card, Saturday wishes, Saturday quotes, Saturday card, Weekend wishes, Weekend quotes, Weekend card, Weekday wishes, Everyday quotes, Weekday cards.  BIRTHDAY CARDS Discover beautiful birthday cards & inspiring birthday quotes in this card maker app. Share Birthday wishes, Birthday image, Birthday greetings, Birthday quotes, Birthday cake, Birthday greetings with name, Birthday cake with name, Birthday card maker, Birthday card with name etc.  PHOTO ON IMAGE EDITOR You can use this photo greeting card maker to paste photo on image or add photos on image & make beautiful photo greeting cards all occasions free. Use this photo editor on image to create pic on card, photo text on image, photo on card, add photo on image, text on card, birthday photo greeting card, greeting card photo editor, greeting photo maker, photo greetings app.  TEXT ON IMAGE EDITOR Give your cards a personal touch with your own text on image with stylish fonts. A text on images app to write text on picture, text on image & photos, text on photo with font & style, text on pics write on photos . Create beautiful layouts with this text on photo editor or text on pic app.  HOW GREETINGS APP WORKS Search with any occasion name. Write name or add photo on card. Share or Save your personalized card.  YOUR RATINGS Please leave us your ratings|reviews at Google Play. It tremendously helps our 3 member team to stay motivated!  EnlighTales Our YouTube Channel for inspiration bits  bit.ly/Enlightales  Wish you happiness & health! Love, App Team warmlygreetings.com ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}