{
"name" : "Status Saver for WhatsApp Video, Status Downloader",
"url" : "https://play.google.com/store/apps/details?id=statussaver.statussaverforwhatsapp.statusdownloader",
"package" : "statussaver.statussaverforwhatsapp.statusdownloader",
"category" : "Social",
"description" : " One click to save all statuses with Status Saver.   You can save status from different apps with Status Saver! Save video & photo from status directly into your gallery. Share even without saving.   Easy to Save - View status - Open Status Saver - Tap the save button   You Can Save Status for Free From - Status - GB Status - Business Status - Parallel Space - Parallel Space Lite   Features - Easily save status from different apps - Repost without saving - Check saved video & photo - Save, repost, share, delete - Save multiple videos & photos at one time   Status Saver for WhatsApp Disclaimer * This app is not associated with WhatsApp. * Please get the PERMISSION from the owner before you repost videos or photos; * Any unauthorized actions (re-uploading or saving of contents) and/or violations of intellectual property rights is the sole responsibility of the user.  Status Saver for WhatsApp Download Want status downloader 2019? Looking for status downloader 2019? No satisfied status downloader 2019? Try the best status saver for WhatsApp download! This status saver for WhatsApp can save all statuses.  Try this app if you want status app, status download apps, status saver app download, status saver for WhatsApp download, status downloader for WhatsApp 2019, status downloader for WhatsApp video...  Status Saver for WhatsApp Video Looking for status saver for WhatsApp video? Try the best status saver for WhatsApp video. It allows you to save all WhatsApp statuses.  WhatsApp Status Saver App Want a WhatsApp status saver app to save WhatsApp status? Try this WhatsApp status saver app.  WhatsApp Status Download Try this status saver for WhatsApp status download! Youll find its the best WhatsApp saver for WhatsApp status download.   WhatsApp Status Interesting Whatsapp status that you want to download? Use WhatsApp status saver to download it.  Status Downloader for WhatsApp 2019 Looking for status downloader for WhatsApp 2019? Try this status downloader for WhatsApp 2019, it allows you to download all statuses from WhatsApp.  Status for WhatsApp Want to download status for WhatsApp? Want to share status for Whatsapp? Try this WhatsApp status saver.  Status Video for WhatsApp Try this app if you want to save status video for WhatsApp. Its the best status saver app to download the status video for WhatsApp. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.FOREGROUND_SERVICE', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'statussaver.statussaverforwhatsapp.statusdownloader.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}