{
"name" : "Status Saver for WhatsApp - Save & Download Status",
"url" : "https://play.google.com/store/apps/details?id=statussaver.statusdownloader.savestatus.downloadstatus",
"package" : "statussaver.statusdownloader.savestatus.downloadstatus",
"category" : "Social",
"description" : "Want to download images and videos from WhatsApp Status? Looking for an app that can easily save video status and photo status fast and free? Then this Status Saver and Status Downloader for WhatsApp is definitely what you want!  Status Saver for WhatsApp - Download & Save Statuscan help you download images and photos from WhatsApp Status in simple steps. It is super fast  and 100% free.   With Status Saver for WhatsApp - Download & Save Status app. You can easily save videos and images from WhatsApp Status to your Android device. This way, you can enjoy downloaded status photos and status videos anytime, anywhere, or share them with friends, or repost downloaded status to other social medias.  So please install this Status Saver for WhatsApp - Download & Save Status app and have a try now  How to use 1 Open WhatsApp and view wanted status 2 Open this app (Status Saver for WhatsApp) 3 Save wanted images and videos Done!    Features - No login required, Great Status saver and Status downloader for WhatsApp. No private issues. - Free Status downloader and free Status saver - Save Status videos and download Status images in easy steps - Instant download, Super fast - Support Multi save (Save several videos and photos in one tap), share and delete - Support downloading all HD video and photo - Play videos offline with the built-in video player - Review photos offline with the built-in album - Easy to share or repost downloaded videos and photos of WhatsApp Status - Support Status from WhatsApp, GB WhatsApp and WhatsApp Business - Small size and lightweight  Status Saver for WhatsApp - Save & Download Status app  is a dedicated Status saver and Status downloader to download all videos and images from WhatsApp Status. With easy steps, you can download Status videos and Status images to your device and save WhatsApp photos and videos as long as you want. The versatile design of the saved page makes it easy to manage downloaded Status images and videos, share Status videos and photos with your friends, or repost to Status or other social media.  The built-in video player can play all the videos you saved.  So it is really a good download tool for WhatsApp Status and deserves to be installed and try  Notes - Status Saver for WhatsApp - Save & Download Status app is not affiliated with WhatsApp. It is a tool for WhatsApp video and image download. - We respect the copyright of the owners. So please DO NOT download or repost the videos, photos and media clips without owners permission.   If the Status Saver is helpful for you, please rate us  If you need support, please email us via polaris.view99@gmail.com.  Thanks very much for using Status Saver for WhatsApp - Save & Download Status. And wish you a happy day! ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'com.android.vending.BILLING', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}