{
"name" : "VSSM",
"url" : "https://play.google.com/store/apps/details?id=veeritsolutions.com.vssm",
"package" : "veeritsolutions.com.vssm",
"category" : "Social",
"description" : "The peripatetic nomads have never been part of any village or contained societies. The nature of their work required them to be on constant move. They were the traders, entertainers, artists, fortune tellers, essential service providers and much more. Until some 50-60 years back they were an essential part of our existence as their presence ensured that the society functioned like a well-oiled machine. However, the advent of an industrial society rendered the dexterous and skilled livelihoods of these communities futile and has led to a gradual obsolescence. Since these communities were never a part of any settled society and now that their skills were no longer required, they began vanishing from the memory of the civil society, law makers and planners.The nomads stay in make-shift settlements away from a revenue villages or hamlet or town as a result their names were never a part of any census study nor was their existence ever accounted for!!  The term Nomad derives from a French word Nomdae meaning people without fixed habitation. Nomads are known as a group of communities who travel from place to place for their livelihood. The nomadic communities in India can be broadly divided into three groups hunter gatherers, pastoralists and the peripatetic or non-food producing groups. Among these, peripatetic nomads are the most neglected and discriminated social group in India. They have lost their livelihood niche because of drastic changes in transport, industries, production, entertainment and distribution systems. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
}