{
"name" : "akRDCFree VNC viewer",
"url" : "https://play.google.com/store/apps/details?id=anykode.rdc",
"package" : "anykode.rdc",
"category" : "Communication",
"description" : "akRDC - VNC viewer - Remote desktop control (Free version)  If akRDC doesnt work for you, please ask for help through the Send email button in Google Play, we will certainly be able to resolve the problem. thank you.  -> PRO Version: - Compressed files transfer stream - Compressed directory files list (with TightVNC server, akRDC PRO only) - Direct support. - No Ad  -> The Free version displays an Advertisement at the application startup only.  akRDC is a Remote Desktop Control software compatible with the RFB protocol (VNC Client) and tested on servers: TightVNC, UltraVNC, RealVNC (without encryption), Ubuntu Remote Desktop (servers ready with the RFB protocol...)  * App languages: English, French, Russian, Italian, German, Espagnol, Japanese, Korean  * Files Transfer (For TighVNC and UltraVNC servers only right now + X11VNC in Ultra VNC mode): - Transfer (download and upload) files and complete directories structure. - Compressed files transfer stream (akRDC PRO only). - Compressed directory files list (with TightVNC server, akRDC PRO only) - Create / Delete directories. - Delete files.  * Supports UltraVNC repeater/proxy in mode 1  * Function keys:  - connection shortcuts - 3 buttons mouse + wheel emulation (volume key) - keyboard, quick keys (CTRL+C, ...), - Esc (Back key) - special keys (F1, F2...), - Zoom - Drag&drop - network band optimization. - configuration Import / export - hardware acceleration management (if the remote session view become BLACK, you have to disable the hardware acceleration)  * RFB Protocol implementation:  - supports TIGH, RAW, COPYRECT, RRE, HEXTILE and ZRLE encodings.  - VNC password (DES encrypted authentication). - MS-Logon authentication ( for UltraVNC server)  How to use: install a VNC server (TightVNC recommended) on your PC, create a new connection shortcut in AKRDC then connect to your server. The documentation available on www.akrdc.eu  To make the CTRL ALT DEL command works, run the VNC server as a service, and allow the CTRL ALT DEL feature in your system. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'anykode.rdc.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}