{
"name" : "Chudo Messenger",
"url" : "https://play.google.com/store/apps/details?id=app.chudo",
"package" : "app.chudo",
"category" : "Communication",
"description" : "Chudo is the fastest and most fun cross-platform messaging app on the market where users express themselves with their digital twins.  AVATARS THAT LOOK JUST LIKE YOU  Create your avatar in just one second with Chudos proprietary machine learning technology. Then customize your avatars hairstyle, eyes, colors, beard, glasses, and even makeup!  FAST & EFFICIENT DATA TRANSFER  Chudos own messaging protocol enables users to transfer information in the fastest way possible saving your time and data usage.  IMOTES FOR SELF-EXPRESSION  A keyboard with your personal imotes that makes online communication lively and exciting.  DOUBLE IMOTES  Shake hands, dance with your mates and even steal their food!  AUGMENTED REALITY MODE  Film and share videos with your avatars in the AR mode to surprise and awe your friends!      Frequently Asked Questions   Do I need the latest smartphone to use Chudo?  You dont have to buy an expensive smartphone from any particular vendor to use Chudo. The app works on different platforms and supports many devices, including the latest models as well as older ones.   Why does Chudo ask for my phone number during onboarding?  Chudo is a messaging app, so a phone number is required to identify users and allow friends to connect with each other quickly.   How is Chudo the fastest messaging app on the market?  Chudos unique Binary Data Transfer Protocol, Smart Media Transfer Mechanism and Animation Transfer Algorithm in the Meta-Data Format accelerate data transfer, reduce the usage of mobile traffic for communication and allow high-performance data transmission on low-speed and poor internet connectivity. In Chudo imotes transfer at as low as 50 bytes and text in as quick as 120 milliseconds!   Are there only human-like avatars in Chudo?  In Chudo you can be anyone you want: a human digital copy of yourself, a unicorn, a rabbit or even a gingerbread man!   How does the automatic avatar personalization work in Chudo?  The process of avatar generation starts by constructing a users 3D face model from a selfie shot. With this single photo, one neural network builds a 3D mesh of the users head. Then the mesh goes through the automatic stylization process that makes it look more cartoonish. Afterwards, it is used as a basis of the avatars head. Next, other neural networks swing into action. Face parts such as hair, eyebrows, facial hair and colors are classified and synthesized (generated) onto the mesh in the appropriate style. Moreover, if a user is wearing glasses another neural network will detect and synthesize a 3D version of them. All of this was made possible because the company has collected a unique dataset of 20,000 3D High Fidelity Face Scans including people of different races, genders, ages. This is the backbone of Chudos personalization and facial performance capture technologies. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_APP_BADGE', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_CONTACTS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}