{
"name" : "Network Info II",
"url" : "https://play.google.com/store/apps/details?id=aws.apps.networkInfoIi",
"package" : "aws.apps.networkInfoIi",
"category" : "Communication",
"description" : "2.1+ version of Network Info Donate version available, buy me a coffee :)  Shows info about the phone and the current network, Bluetooth, IPv6 and Cell connection.  It also shows your public/external IP & hostname.  Only goes on-line to get and resolve the public IP via my own server http://aschillings.co.uk/myscripts/getip.php and to remotely resolve it (see notes below). Initially the application was also using whatismyip.org but, as the server seems to be constantly down it was removed.  No ads.  >> Information shown << Device IP and hostname, both private and public.  Current mobile Cell and any neighbours, along with their signal strength, location info and type.  IMSI/ IMEI.  Information about the current mobile provider (MCC+MNC, current connection, etc.)  The Android device unique ID.  Full information regarding the WiFi connection (MAC, current SSID and BSSID, link speed, IP/Netmask, Gateway, DNS and DHCP servers, etc.)  Your current location according to Android based on your network neighbours. No GPS is needed or used.  Information regarding Bluetooth status, the current Bluetooth connection(s) and info about past pairings.  IPv6 device and router IP addresses for all device interfaces (see notes, this should now work for everyone).  >> Notes << This is an expansion of the Network Info application, to support more phones based on the 2.1 Android API.  I only have a GSM/UMTS phone. If anything funny happens on any other phone type, email me and I will try to fix it.  This application will connect to the network only to fetch your external IP/Hostname (using http://aschillings.co.uk/myscripts/getip.php and http://aschillings.co.uk/myscripts/gethostname.php). No other information is sent (my policy is located below).  Please email me about any bugs or features you want. I cannot see all market comments and I am not notified when someone does comment.  The IPv6 part should now work for everyone. If that is not the case for you, please email me (aschillings.dev@gmail.com) so I can try to fix it. If possible, download Under the hood from the market and send me the results via export.  If you want to show the Vendor which owns a MAC address, download MAC (OUI) Database from the market (it is one of my applications) and use it to download a copy of the OUI database.  In version v0.5.2 I added remote hostname resolution which is your public hostname as is resolved by my server. It should be the same as your external hostname, unless there is a record propagation delay or your DNS server is lying (like some home routers which resolve their external address as a local hostname). My server is hosted by 1and1 so this will be unreliable if you use the same DNS servers.  Ext. Hostname (L) is the hostname your device resolves your external IP (local resolve).\n  Ext. Hostname (R) is the hostname my server resolves your external IP (remote resolve).  Field Test is a hidden application which comes installed in HTC phones. The menu item will only appear if the Field Test is installed in your phone.  >> Known Issues << Samsung devices do not display Neighbouring Cells. This is a problem in Samsungs Android implementation and there is nothing I can do.  >> Privacy Statement << I do not collect any information which can directly and uniquely identify and/or bind a user to a device or any other personal information. When you retrieve your external IP address, my server will log a standard website hit which is the same as if you browsed a page on my server using a browser. No other information is logged or kept.  ***  Please email me with any bugs/problems/feature requests. I cannot reply to market comments which can make debugging difficult.  *** ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}