{
"name" : "Cliqz – the Privacy Browser",
"url" : "https://play.google.com/store/apps/details?id=com.cliqz.browser",
"package" : "com.cliqz.browser",
"category" : "Communication",
"description" : "BROWSE FAST AND PRIVATELY WITH CLIQZ. MADE IN GERMANY.  Cliqz is the first browser with built-in anonymous quick search and intelligent anti-tracking technology. Wherever you are going on the Internet: Cliqz protects your privacy. Our own search engine, developed in Munich, saves you time and data volume: simply type a query, select a suggested website or swipe left for more results. Cliqz is free, open source and actively protects your data. The Cliqz Browser is an independent alternative to the market dominating US platforms.  Cliqz features at a glance: * Maximum privacy * Innovative quick search * Ad blocker * Phishing protection * Forget mode * Cliqz Tab with most visited websites and news  Wanna learn more? Keep reading!   MAXIMUM PRIVACY Protect your privacy with Cliqz anti-tracking. Our AI-based technology prevents your personal information from being transferred to advertisers or other third parties when you visit a website. This way, trackers dont stand a chance!  Cliqz is privacy by design and already compliant to the European Unions General Data Protection Regulation (GDPR): Nothing and nobody can draw conclusions from your individual browsing behavior. All personal identifying information remains on your device, in your possession and under your control.  INNOVATIVE QUICK SEARCH Save time and data volume: Our quick search eliminates the detour via a search engine results page. Cliqz displays website suggestions in real time on intelligently designed cards right in the browser. Special Smart-Cliqz cards with weather forecasts, currency converter or news make your everyday life easier. You can also use a complementary search engine like DuckDuckGo, Qwant or Google.  AD BLOCKER Benefit from faster loading websites without ads and clutter.  PHISHING PROTECTION Protect yourself from fraudulent websites that want to steal your passwords and account information.  FORGET MODE Use forget tabs if you dont want your browsing history saved on your machine. Cliqz opens pages with adult content even automatically in forget mode.  CLIQZ TAB WITH MOST VISITED WEBSITES AND NEWS When you open a new tab, Cliqz will show you direct links to your most visited websites. You will also find the latest news from respected and trustworthy media outlets such as New York Times, Washington Post, BBC, and The Guardian.  CONNECT FEATURE FOR SENDING TABS Send tabs between your mobile browser and desktop browser. This way, for example, you can start reading an interesting article at home and then continue reading on your mobile device while you are on the move.  With Cliqz you have an easy-to-use but powerful companion for your mobile life.   Note: Cliqz for Android does work on tablets, however its design has not yet been adapted to these screen sizes. For devices with Android 5 or lower, Cliqz asks for camera permission: The camera is only used for scanning QR codes. Location access is opt-in. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.cliqz.browser.permission.C2D_MESSAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE']",
}