{
"name" : "EPRIVO Private Email with Voice and Controls",
"url" : "https://play.google.com/store/apps/details?id=com.bluerisc.eprivo",
"package" : "com.bluerisc.eprivo",
"category" : "Communication",
"description" : "Pioneering text/voice private emails! Use your favorite email address (GMail, Yahoo, AOL, iCloud, Outlook and Hotmail) for encrypted email with privacy controls. Recall sent secure emails anytime to make them vanish. Privatize and securely archive past emails from any email account. Easily maintain free service after trial.  EPRIVO is much more than encrypted email. EPRIVO is the only private email service with a wide range of fine-grained privacy controls - allowing future control over sent private emails in both recipient devices and cloud. Add several special privacy controls, authentication, and encryption/confidentiality. EPRIVO service does not store your emails, but instead combines government-grade digital security/encryption with patented physical security to ensure each emails privacy and access control in the future. No single provider ever has access to all the content even in encrypted form.   You can manage EPRIVO private emails using your favorite email client software, web-based email, or simply through the EPRIVO app. Include a text message to notify recipients about a forthcoming email.  Features include:   ability to send voice or text emails with privacy   sender-controlled privacy   special privacy features per email  access control in both cloud and recipients devices  authentication  confidentiality/encryption   affordable subscription plans with free trial period  Special Privacy Features: - Individual Plus (1 user) and Family Plus (up to 5 users) Subscription:  One-time view  No-forwarding   Time-based expiration  Privatize and securely archive emails from any of your email accounts   Privatize subject to make it confidential in the cloud  Privatized sender (unlockable)  Recall/expire anytime (unlockable).  - Celebrity Gold (1 user) and Celebrity Platinum (up to 5 users) Subscription:  All special privacy features listed above, unlocked and immediately accessible   Privatized metadata   Prepaid invitations  Invitees receive 1 year subscription for free  Note: Unlockable features can be unlocked for free by sending 2 invitations that result in a full registration (i.e. Individual Plus/Family Plus/Celebrity plans), or through in-app purchase for immediate unlock without sending invitations. Celebrity plan users have all features already unlocked.  EPRIVO is a private email service built by leading security team from MIT & UMass Amherst. An active subscription is required to send, receive and read private emails. Current subscription prices (in U.S. dollars) are as follows. Prices may vary in other countries and are subject to change without notice. - Individual Plus: $1/month (charged annually at $11.99/year) - Family Plus: $0.30/month/user with 5 users (charged annually at $17.99/year) - Celebrity Gold: $3/month (charged annually at $35.99/year) - Celebrity Platinum: $1.50/month/user with 5 users (charged annually at $89.99/year)  If subscription is purchased through in-app purchase: Payment will be charged to your Play Store account at the end of the free trial period after confirmation of purchase, unless cancelled at least 24-hours prior to the end of the trial. Any unused portion of the free trial will be forfeited if you upgrade your subscription while in the trial period.  Subscription period is 1 year and renews automatically, unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period at the price of the selected subscription plan.  Subscription may be managed and auto-renewal may be turned off by going to your My Subscriptions in your account after purchase. You can continue to use EPRIVO to send and receive private emails until the end of the current period, if cancelled.  Terms and Conditions: https://www.eprivo.com/billing-terms-conditions/?Android=1 Privacy Policy: https://www.eprivo.com/privacy-policy/?Android=1 ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.SEND_SMS', 'android.permission.GET_ACCOUNTS', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.USE_CREDENTIALS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_PROFILE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.USE_FINGERPRINT', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.SEND_SMS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}