{
"name" : "hidemy.name VPN",
"url" : "https://play.google.com/store/apps/details?id=com.fourksoft.openvpn",
"package" : "com.fourksoft.openvpn",
"category" : "Communication",
"description" : "VPN from hidemy.name  privacy on the internet, which is tested by time and modern blocking systems. This VPN will withstand everything and help to go unnoticed.   We offer servers around the world: choose which countrys IP addresses you want to use to browse websites, buy tickets, book hotels, transfer data. Switching between servers can be done in a few seconds. VPN will not slow down your internet connection.   Using our VPN, you can easily unblock websites that are not allowed in some countries, install any applications and prevent identity theft. All this  in a couple of clicks. We believe in keeping any information about you as confidential as possible, so the VPN from hidemy.name does not require registration.   A connected VPN provides you protection: everything that you send on the internet will be impossible to intercept. Our VPN can be used on 5 devices at the same time, and you will pay for only one subscription.   Our service has been protecting users around the world for over 14 years. It is highly rated by reviewers on Trustpilot and VPNMentor.   Why VPN from hidemy.name?  - The most advanced IKEv2 and OpenVPN protocols with maximum encryption. - The choice of applications that work through a VPN and without it. - VPN servers around the world, including fast servers in Europe and Russia. In total, more than 40 countries and 70 cities. - There is a local area network protected and inaccessible from the internet inside our VPN.  How to connect VPN from hidemy.name:  - Choose a suitable tariff or test one day for free.  - Click Connect.  The application will automatically receive all the data necessary for the connection and even select an optimal VPN server. However, you can always select any server from the list manually.  Have not used our VPN before? Test VPN for free  we provide a trial period for this. Moreover, if you pay a subscription, and you dont like something, we will refund your money within 30 days.   Additional VPN Subscription Features  For paid VPN subscribers, advanced features of the proxy list and proxy checker are available on the website. We check proxies for a variety of parameters, including ping, proxy connection speed and proxy anonymity.  Whats new?  The application has a completely updated interface. We tried to make it as accessible and understandable as possible. Enjoy all the benefits that a VPN can provide. We hope you will appreciate our updated application. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.QUICKBOOT_POWERON', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.fourksoft.openvpn.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.QUICKBOOT_POWERON', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}