{
"name" : "Root Call SMS Manager",
"url" : "https://play.google.com/store/apps/details?id=com.mdnsoft.callsmsmanager",
"package" : "com.mdnsoft.callsmsmanager",
"category" : "Communication",
"description" : "The program allows to block undesirable incoming and outgoing calls and SMS.    Some program functions require root privileges. Root rights are not needed to block calls on Android 8+. To use the program on Android 7.x with the latest versions of SuperSU, you need to put file radio.sh https://goo.gl/BhjW3J to folder /su/su.d, set permission to read and execute and restart the phone. When using MagiskSU before Android 8, you need to put the file radio_magisksu.sh https://goo.gl/jsTSvQ to /magisk/.core/service.d(/sbin/.core/img/.core/service.d for Magisk 16.3+) folder, set permission to read and execute and restart the phone.    There is a support Dual SIM smartphones. Blocking is carried out at system level, the program doesnt miss the first call, the screen isnt lit and there is no window of a dialer. Features: - Blocking incoming SMS and MMS on Android 4.4 above without appointment as its program for SMS processing. - Blocking of outgoing calls and SMS. - Support the Dual SIM smartphones with opportunity to set various parameters of blocking for everyone  SIM. - Private conversation. Possibility of replacing the incoming call number.  For calls it is possible to choose a way of blocking Reject or Not to answer. For SMS at desire it is possible to set the filter in the text (if the filter isnt set, all SMS from specified number are blocked). For division of several filters the symbol is used ;. If at the beginning of a field for the filter to put a symbol ! all SMS not corresponding to the filter will be blocked. For a filtration of numbers it is necessary to create the list and to make it current. The Not to block mode - all functions of blocking are disconnected. The black list - is made blocking of all numbers added in this list, for each number it is possible to establish the parameters of blocking. The white list - is made blocking of all numbers which arent entering this list, parameters of blocking undertake from list settings. Exceptions numbers of this list are processed by the set rules irrespective of settings of the current list. At number addition in the list it is possible to specify a template (? means any symbol, * means any quantity of any symbols). For blocking of hidden numbers for number it is necessary to leave a field empty. It is possible to use regular expressions (have to start with ^ and end with $, only in the full version of the program). There is an opportunity to use schedules - in set time the appointed list will be made the current. Restrictions of the free version: - No more than two entry in the list (it is possible to use templates, all from contacts, all not from contacts, numbers containing letters), arent supported groups of contacts and an exceptions. - There is no scheduler. Important system settings: - Wait after boot, sec. This delay is necessary in order that by the time of program start the radio module managed to be activated completely the telephone module. Typical value  10  40 sec., but many devices work and with a zero delay. If on your Dual Sim there is no blocking on the second this, it is necessary to increase this value. - Submode. Point serves for control for hardware features of the device. Selection of a submode at which the program is efficient can be demanded and the network on the device after start of the program (reboot) doesnt vanish. Reboot phone after change of a submode . For smartphones on MTK it is necessary to choose a submode 1. In settings, point, About it is possible to look at current state of service, for successful work of the SIM1(SIM2 for Dual SIM ) has to be green.  Integration with Tasker: for use of Tasker it is necessary to add To start the application as a task, to choose Root Call Manager and to enter a list name into the data field. Thus there will be a chosen list will be made the current. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_SUPERUSER', 'com.android.vending.BILLING', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_CONTACTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'android.permission.CALL_PHONE', 'android.permission.USE_BIOMETRIC', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.WRITE_SETTINGS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NOTIFICATION_POLICY']",
"perms_with_call" : "['android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.BLUETOOTH', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SEND_SMS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.ACCESS_SUPERUSER', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}