{
"name" : "Xabber",
"url" : "https://play.google.com/store/apps/details?id=com.xabber.android",
"package" : "com.xabber.android",
"category" : "Communication",
"description" : "Open source Jabber (XMPP) client with multi-account support, clean interface. Free (as in freedom!) and ad-free, Xabber is the best and most popular Jabber client for Android. It is built to provide users with a simple, fast and secure messaging based on interoperable open standards. Xabber is also available for a browser, with an iOS version coming soon.  Features   Modern material interface and great user experience  Device synchronization  Dynamic history loading  Multiple account support  Compatible with all standard XMPP servers  Sending Images and Files  End-to-end encryption to protect your privacy  Rich notification settings, including key phrases (with regular expressions, no less!)  Efficient power management  With Xabber, you are free to customize the interface to a great extent, search and organize your contacts and even export your chats.  XMPP Features  Xabber supports many extensions to XMPP protocol, called XEPs (XMPP Extension Protocols):  RFC-3920: Core RFC-3921: Instant Messaging and Presence XEP-0012: Last Activity XEP-0030: Service Discovery XEP-0045: Multi-User Chat (partial) XEP-0048: Bookmarks XEP-0054: vcard-temp XEP-0059: Result Set Management XEP-0078: Non-SASL Authentication XEP-0085: Chat State Notifications XEP-0091: Legacy Delayed Delivery XEP-0115: Entity Capabilities XEP-0128: Service Discovery Extensions XEP-0138: Stream Compression XEP-0147: XMPP URI Scheme Query Components XEP-0153: vCard-Based Avatars XEP-0155: Stanza Session Negotiation XEP-0184: Message Delivery Receipts XEP-0191: Blocking Command XEP-0198: Stream Management XEP-0199: XMPP Ping XEP-0203: Delayed Delivery XEP-0221: Data Forms Media Element XEP-0224: Attention XEP-0237: Roster Versioning XEP-0280: Message Carbons XEP-0297: Stanza Forwarding XEP-0313: Message Archive Management XEP-0333: Chat Markers XEP-0359: Unique and Stable Stanza IDs XEP-0363 HTTP Upload  Xabber is under active development and is regularly improved. Check Xabber Beta for early access to new features.   Support policy  Lets get the record straight: unless you are using our paid services, we dont owe you anything. The software is provided as is, with no warranty and no guarantee to work with all ill-configured servers/networks on every device with non-stock Android crippled by phone manufacturers.  We do, however, have great sympathy for any decent person who requires support, and we do try to help. You just have to ask nicely. If you are rude, make demands, feel entitled to premium service or lecture us how to behave, we kindly ask you to uninstall our app and be gone for good. We wont be saddened by 1-star review and well likely leave a sarcastic reply.  Getting support   Read F.A.Q. on our website, https://xabber.com/faq/  Youll be amazed how many issues are already covered!   Email info@xabber.com This is the best way to get tech support. Be nice, and well do our best to provide you help. Please, describe your issue in detail. If possible, attach screenshots and debug logs that would help us understand what went wrong.  Please, DONT ask for support in Google Play reviews! Reviews are by far the worst way to reach out to us for tech support. XMPP is a federated protocol, which means the network consists of thousands of servers with different settings, and that there are multiple points of failure. We cant conceivably know what went wrong from a short message, our replies are limited to 350 characters and the medium does not support back and forth exchange of information.  Source code of Xabber is available at https://github.com/redsolution/xabber-android under GNU GPLv3 license.  For more information visit https://xabber.com or follow @xabber_xmpp on Twitter. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.READ_INTERNAL_STORAGE', 'android.permission.CAMERA']",
}