{
"name" : "KeeperChat",
"url" : "https://play.google.com/store/apps/details?id=com.keepersecurity.chat",
"package" : "com.keepersecurity.chat",
"category" : "Communication",
"description" : "KeeperChat - The worlds most secure messaging app.  Why you need KeeperChat:   Because you deserve privacy.  Because you want to password protect your messages.  Because people are nosey.  Because you need a secure way to share your credit card and password information.  Because it does not store photos in your phones main gallery.  Because mistakes happen.  Because photos leak.  Because you changed your mind.  Because you sent something you regret.  Because you text the wrong thing to the wrong person.  Because you want to know when people screenshot your chat.  Because you want to pick up the conversation on your tablet.  Because it is easy to use.  Because all your friends will be on it.  Need your private photos and messages to disappear? Weve got you covered with our self-destruct timer. Sent something you regret? Retract your message without a trace at any time. Need to blur your screen from prying eyes? Our new stealth mode allows you to blur your screen for maximum privacy. Have you lost your phone and therefore all your messages? Login to the app on a new device and restore your conversations.  Messaging apps are so easy to use we dont often think twice about texting personal information to those we trust; however, the products we use to connect to each other were not built to handle this information securely. Existing messaging apps lack our zero-knowledge security architecture and necessary security protocols. KeeperChat enables you to chat with peace of mind knowing you are in control of the content you share, and who you share it with. Easily invite your friends, family, and colleagues to experience the future of secure messaging. Take control with KeeperChat.   Product Benefits:  Private vault for messages, photos and videos  Private, encrypted media gallery (nothing is saved on devices camera roll)  Biometric login and self-destruct protection for vault  Message retraction and self-destruct timer  Two-factor authentication  End-to-end message encryption  Unlimited devices and sync  Secure cloud backup  Private group chats  Auto-logout timer  Customizable messages with themes and animated stickers  Zero-knowledge, encrypted security architecture   Built-in Keeper password vault integration  Developed by Keeper Security, the creator of Keeper, the worlds most trusted password manager and digital vault. ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_FINE_LOCATION', 'com.keepersecurity.chat.permission.C2D_MESSAGE', 'android.permission.READ_CONTACTS', 'com.android.vending.BILLING', 'android.permission.USE_FINGERPRINT', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.REORDER_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_CONTACTS']",
}