{
"name" : "Fast File Transfer",
"url" : "https://play.google.com/store/apps/details?id=com.floriandraschbacher.fastfiletransfer",
"package" : "com.floriandraschbacher.fastfiletransfer",
"category" : "Communication",
"description" : "A new era of file sharing - appszoom.com The beauty of this utility is its simplicity - redmondpie.com  FastFileTransfer has a simple mission: Offering fast, offline file exchange between literally any platforms.  In a world of dozens of different operating systems, with many different file transfer standards and protocols, its still difficult to transfer files between them. With FastFileTransfer, you have a flexible solution for any data exchange need.  Features:  Lightning fast: Transfer 1 GB in under 4 minutes  Send multiple files or even whole folders (as ZIP)  Easy to follow step-by-step instructions   Receive from any device and operating system that supports WiFi  No need for an existing WiFi connection  Works completely offline  The receiver does not have to have the app installed  Send multiple files as ZIP  Display QR codes for faster receiving  Optionally use NFC for pairing  Unique engine specifically developed for compatibility against a wide range of Android devices  Send to an unlimited number of devices at the same time   Buy the Pro Version to:  Let FastFileTransfer do all the receiving setup via the built-in QR scanner  Receive files from devices that dont have FFT installed  Let receivers download multiple files with one click (unzipped)  Get rid of the ads   Using this app, you can easily send a file to an iPhone or any other phone that does not have Bluetooth but Wi-Fi. Will Kelly from Techrepublic wrote a tutorial on how to send files from Android to iOS using Fast File Transfer: http://www.techrepublic.com/blog/smartphones/send-files-between-android-and-ios-with-fast-file-transfer/6097   How to send multiple files? Just select multiple files in your file explorer and tap Send via (or similar) -> Fast File Transfer In some file explorers first tap Send via in the menu, choose this app and then your files.   I dont want to always enter the address on the receivers phone! Simply use the built-in QR codes or NFC support. PRO version even comes with a built-in QR reader.   The transfer speed this app offers depends on the sender and receiver device. For the best speed, use Wifi Direct or Wifi Tethering (and uncheck Wifi in the apps connectivity mode setting) Although I have never experienced such a case, I do not guarantee for any data fees caused by this app. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.NFC', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.NFC', 'android.permission.ACCESS_FINE_LOCATION']",
}