{
"name" : "HablaCuba: Cubacel & Nauta Recharge",
"url" : "https://play.google.com/store/apps/details?id=com.hablacuba.ui",
"package" : "com.hablacuba.ui",
"category" : "Communication",
"description" : "Recharge Cubacel phones or Nauta accounts in Cuba online, from anywhere in the world, in less than 1 minute. With HablaCuba, youll experience easy and instant Cuba cell recharges, buy 3G data plans and enjoy regular Cubacel promotions.   INSTALL for FREE and get:  instant mobile or Nauta account recharge the lowest processing fee secure payment with any major credit / debit card or PayPal account online payment, no matter the currency of your account or country of residence direct mobile recharge using your phone Contacts online access to your history and invoices  MORE FEATURES  free SMS with your recharge  regular Cubacel promotions and Bonuses  Thank You Points for free international calls and SMS on HablaCuba.com  24/7 customer service in both English & Spanish   FREQUENTLY ASKED QUESTIONS  How can I recharge a Cubacel number?  To recharge a cell phone in Cuba, just follow some simple steps: Enter your Contacts phone number or select it from the phone Contacts. Select the top up amount. Log in or Create a Free Account in order to proceed to payment. Pay with any major credit or debit card or your PayPal account.   How can I recharge a Nauta account?  Nauta is the Internet provider of Etecsa in Cuba, offering Wi-Fi access in hotspots all over the country. In order to top up a Nauta account in an instant, follow these steps: Enter the email address associated to your friends permanent Nauta account. Select the top up amount. Log in or Create a Free Account in order to proceed to payment. Pay with any major credit or debit card or PayPal account.    Do you have any Cubacel promotions?  Yes, we do. Get a regular Super Bonus Cubacel with HablaCuba.com on a monthly basis! Double Bonus, Triple Bonus are also popular Bonuses your relatives and friends in Cuba can get via HablaCuba.com.    Can I contact you anytime?  Yes, you can. We offer 24/7 Customer Support. In case you couldnt find the answer to your question in our Help Center section, you can email us at hablacuba@keepcalling.net and a representative will get back to you as soon as possible. Our Customer Support representatives can answer all your questions in both English & Spanish.  Recharge Cuba fast & easy, with our FREE HablaCuba app!  For more than 15 years, HablaCuba.com has delivered secure and reliable services to hundreds of thousands of customers. Send mobile credit in Cuba to your friends and family!  For any questions, please email us at hablacuba@keepcalling.net.  Or you can follow us on: Facebook: https://www.facebook.com/HablaCuba/ Twitter: https://twitter.com/hablacuba Instagram: https://www.instagram.com/hablacuba/ Blog: https://blog.hablacuba.com/ YouTube: http://www.youtube.com/c/Hablacuba ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE']",
"manifest_perms" : "['android.permission.INTERNET', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}