{
"name" : "MxBell",
"url" : "https://play.google.com/store/apps/details?id=com.mobotix.bell",
"package" : "com.mobotix.bell",
"category" : "Communication",
"description" : "MOBOTIX App for Android. Mobile intercom for MOBOTIX IP video door stations. Receive doorbell notifications, see who is ringing, talk to visitors, open the door.  Never miss a visitor thanks to push notifications. MxBell shows the doorbell message of a MOBOTIX IP Video Door Station and live images of MOBOTIX IP cameras on your Android device. Review the latest door station/camera events in the Playback view. Show up to four different camera live streams simultaneously in the Grid view. Supports automatic camera discovery, live view, remote camera connection via SSL and shows the connection status.  Highlights: Never miss a visitor thanks to push notifications. Shows doorbell message of a MOBOTIX IP Video Door Station. Shows live images of MOBOTIX IP cameras with gesture-controlled PTZ. Open the door, use hands-free communication. Playback view allows reviewing the latest recorded events. Grid view shows the live streams of up to four MOBOTIX door stations or IP cameras simultaneously. Visitors view allows reviewing the latest events where people rang a doorbell at one of the attached door stations. Supports automatic camera discovery, live view and remote connection via SSL. See the connection status. Supports remote connections.  Notes: Before viewing your cameras remotely via mobile data or other networks, you need to configure your router to allow incoming traffic. For security reasons, routers normally do not allow access to your internal network. Please read your router manual and your MOBOTIX camera manual regarding external camera access, port forwarding, DynDNS, etc. When using wireless networks (WiFi, 3G/4G) on mobile devices, connection quality can vary and the connection may even fail completely. This means that some events, such as ringing the doorbell, will be transmitted later or not at all. MOBOTIX therefore recommends to also use a cable-based intercom system (such as MxDisplay). If you do not use MxBell often: To ensure ongoing push notification functionality, you should open the app at least once every month. Please read the release notes before installing the app. You can find these notes on our website www.mobotix.com under Support > Download Center > Software Downloads > MxBell.  System Requirements: Android 5.0.0 or higher MOBOTIX IP Video Door Stations and IP cameras (P3/PXA320) with software 4.7.2.18 or higher MOBOTIX IP Video Door Stations and IP cameras (Mx6) with software 5.2.3.30 or higher  Note: Even if you are using the latest Android version, you may experience some restrictions due to the multitude of supported Android devices. ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.mobotix.bell.c2dm.permission.RECEIVE', 'android.permission.WRITE_GSERVICES', 'com.mobotix.bell.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.WRITE_GSERVICES', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.mobotix.bell.c2dm.permission.RECEIVE']",
}