{
"name" : "Toll Free & Customer Care Helpline Numbers India",
"url" : "https://play.google.com/store/apps/details?id=com.lightlink.tollfreenumbers",
"package" : "com.lightlink.tollfreenumbers",
"category" : "Communication",
"description" : "Available to one of the worlds best Offline Helpline App as an customer service representative.   Get easy access to all toll free & customer- care service numbers not only for India but this Toll Free & Customer Care Helpline Numbers app is covered US, UK and all the nations/countries, ultimately the Globle world.  Keep all your customer care touch points of many businesses at one place. No need to search for numbers, or call a Yellow page, keep it handy with you always.  Imagine having all the top helpline numbers at one place, and being able to call any of them at one touch.  Thats Toll Free & Customer Care Nos. App for you, which integrates all the helpline contacts at your fingertips.  Not exclusively customer support numbers & service is more essential than those outside it might at first assume, its developing at an uncommon pace.  Consider the current market place, customer phenomenon and business outcomes have converted, Messages, Chats are crucial for the long haul. Recent generations of grads have different & various techniques for communication. Furthermore, weve started to expose whats underneath where AI-enabled client service is concerned.  Some interesting records about customer services & customer support found here, 54% of customers have higher expectations today in comparison to one year ago. This is foremost aged from 18 to 34 years old.  67% of humans consider customer service as a whole is a development collaboration, 64% of Americans contacted such a form of customer service in 2017.52% of people around the globe accept that organizations need to take action on feedback provided by their customers.  Around the world, 96% of customers accept customer service is an important factor in their choice of loyalty to a brand. When asking customers what impact their level of trust with a company, offering excellent customer service is ranked number one. A consumer experience endorser has a lifetime incentive to an organization that is 600 to 1,400% that of a spoiler.  1. Get All Customer Service in Just One App: Browse and call from different categories such as Airline/Railway Inquiry, Mobiles/Mobile Network Providers, Gas Providers, Automobiles, Banks/Banking Enquiry (Credit Card, ATMs And Loans), Computer/IT Customer Support, Education, Travel, Couriers Enquiry, Teleshopping, Home Appliances, Matrimony, Hospitals, Social Service Care, Radio Cabs (OLA, Easy Cabs) & much more!  2. Easy Search: To search any of number, Tap on Search Feature and enter the keyword for quick results.  3. One Touch Call. No need to look around or search for right customer service details. Its all there in APP.  4. Favorite List: To add contacts to your Favorite List, Tap on star button on the right side of that contact.  5. Share Contact: You Can Share Toll Free Number ViaWhatsapp, Gmail, Dropbox etc.  6. Go Offline: App works offline except an option to update  Application Features:  1. 1000+ contacts are available (Updated in short intervals of time).  2. Directly call the Service centre of organization.  3. Easily Search and Browse different Categories or names from the application.  Note: 1. This app is designed for all countries Helpline services numbers.  2. Categories and the Entries list is updated regularly  3. Toll Free numbers are subject to change.  4. The data is continuously updated, and more and more numbers are added in short intervals.  5 .Please note, when roaming, additional carrier data charges may apply. Please contact your carrier for details.  Were always excited to hear from you! If you have any feedback, questions, or concerns, please email us at: Info@lightlink.in ",
"desc_perms" : "[]",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.lightlink.tollfreenumbers.permission.C2D_MESSAGE', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.CALL_PHONE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CALL_PHONE', 'android.permission.INTERNET']",
}