{
"name" : "GuardOn",
"url" : "https://play.google.com/store/apps/details?id=com.ionidea.ao",
"package" : "com.ionidea.ao",
"category" : "Communication",
"description" : "For your safety and the safety of your loved ones  #NoMore Rape, Assault, Kidnapping or Murder of women, children, elderly or anybody else!   Quick to install and easy to use. Use the GuardOn App by itself for FREE, or purchase the optional GuardOn Wearable to make sending alerts very quick and easy.  Quick Response to your Emergencies: When you are attacked by anybody, or when you have a medical emergency, time is of essence. A few minutes can mean the difference between life and death. If responders get to you quickly, they can rescue and save you. That is what GuardOn does for you, it sources help from Responders in your vicinity.   Your Responders: If you are ever in danger of being assaulted by others, OR, if you have a medical emergency, with GuardOn, you can get help quickly from your Trusted Contacts, Support Groups, First Responders (Police, Fire, EMT), and from volunteer GuardOn Angels in the vicinity. You control who responds to your alerts any or all of these categories of Responders.  Neighborhood Response by GuardOn Angels: Neighbors can help each other during distresses and emergencies to keep their neighborhoods safe. Get notified of distresses and emergencies in your neighborhood. Team up with other Responders to help the person in distress.   Trusted Contacts and Support Groups: Trusted Contacts are your family, friends and colleagues you have programmed into your GuardOn Account and have invited them to respond to you in case of emergencies. Support Groups are special groups that you choose to be part of your organization, school, college, business, association, NGO etc.  Overwhelming Force of Response: GuardOn notifies dozens of Responders in the vicinity of distress. Through GuardOn App, they can quickly communicate, collaborate and help the person under distress. This keeps the Responders safe and makes the rescue safe, quick and easily possible.  Protects you while protecting your Privacy: GuardOn shares your location ONLY WITH your rescue Responders ONLY WHEN you send an Alert indicating you need help, OR WHEN you explicitly tell us to share your location with one or more Trusted Contacts to whom you want to send your location.  Light on your Data and Battery Usage: GuardOn running in the background all day long uses only as much battery as a 5-minute video does, and as much data as a small text only e-mail does.  GuardOn App and GuardOn Wearable Your free GuardOn mobile app provides most of the functionality you need to keep you safe. But, if you want to be able to raise alerts more discreetly and easily, you may purchase a very affordable GuardOn wearable device.  Available Everywhere Use GuardOn to keep you safe in your community and your city. Also use it to keep you safe when traveling anywhere in your country our outside as well.   Safe Community, Safe Country  Together we can make it so!  Lets stop crimes against women, children and the elderly. Lets team up to make assaults, rape, molestation and kidnapping a thing of the past. If good men and women come together in large numbers, evil cannot stand up to the overwhelming force of good. ",
"desc_perms" : "['android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_COARSE_LOCATION', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.CALL_PHONE', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.CALL_PHONE', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
}