{
"name" : "100000+ SMS Collection Latest!",
"url" : "https://play.google.com/store/apps/details?id=com.aqua.apps.sms.collection",
"package" : "com.aqua.apps.sms.collection",
"category" : "Communication",
"description" : "Completely Offline & FREE of all sms collections having daily auto-updates!! 100000+ collection of latest text messages, forwards, quotes & top jokes in more than 75 categories for android phones!!    SMS Collection 100000+ : Features -  Largest FREE sms collection in smallest app-size!  This Offline app works without internet connection.   Updated daily - At least 20 latest sms added every day Guaranteed!!.   This app is a 2016 sms library with new cute theme.  All SMS in this app book can be used as status updates or status quotes for all occasions like diwali, onam, anniversary day.  Unlimited messages to choose from as the latest new sms collections are added via daily updates.  Templates are provided in multiple languages - In english, gujarati sms, collection in hindi, marathi sms, punjabi, pashto, tamil etc.  Best way2sms with lots of new funny, cute and sweet forwarding text messages & pick up lines. Dil se baatein...sms ke saath!  Way to go app for Jokes, Shayari, Love Romantic, Missing You poems, Flirt, goodnight/ goodmorning shuffle quotes.  Latest romantic message collection of pro sms for lovers.  Many more categories of pick up lines for girls & quotes for lover, old friends, boy friend, wife, husband, guys family, him & her.  New collection of funny ascii sms, friendship sms, thank you message, wishes and exam sms.  Messages to express feelings of sorry, friendship & love sms collection are provided along with the get well soon messages.  Swipe left/right to see the previous/next message & use the icon below to share a motivational message with friends.  Share Button is provided for sharing the SMS text though your favourite messaging app like Whatsapp & Facebook.  This sms collection app will be very handy to send Good Morning & Good Night wishes SMS to your loved ones. Also contains hand picked Love and Miss You SMS for impressing your girl friend / boy friend.  Download our Latest SMS Collection 100000 today and get guaranteed free new SMS every day. More than 50000 happy users worldwide. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}