{
"name" : "Vídeo Telemensagem: mensagens em video whatsapp",
"url" : "https://play.google.com/store/apps/details?id=com.twocatsapp.videotelemensagens",
"package" : "com.twocatsapp.videotelemensagens",
"category" : "Communication",
"description" : " Lindas mensagens em vdeo para encantar e emocionar todos seus amigos, namorado, esposo, familiares. Para voc compartilhar no Whatsapp, Telegram, Facebook messenger, Skype entre outros. O aplicativo possui diversas de belas mensagens fonadas prontas, loucuras de amor, video telemensagem com voz subdivididas em categorias distintas como:  Video Mensagem de Declarao de Amor Telemensagens de Conquista Romntica Aniversrio de namoro, Aniversrio de me, Aniversrio de pai, entre outros ...  Mensagens de Agradecimento  Telemensagem de Amizade  Video de Amor Proibido  Telemensagens de Bom dia, Boa tarde e Boa noite  Telemensagens de Datas Comemorativas: Dia das mes, dia dos namorados, dia das mulheres, dia dos pais, dia das crianas, avs, natal, ano novo, pascoa, dia do professor, sogra  Vdeo mensagens de Natal e Ano Novo  Videos mensagens de Desculpas  Mensagens de Despedida  Telemensagem Distante  Mensagens de Gospel e Evanglicas  Mensagens de Formatura  Mensagens de GLS  Mensagens de Homenagens   Mensagens de Otimismo  Mensagens de Maternidade  Telemensagem de Paquera  Telemensagem de Picante  Telemensagem de Psames  Telemensagem de Reconciliao  Video Mensagens de Saudade  Telemensagem de Vitria  No deixe nenhuma data passar em branco, mande uma linda telemensagem para mostrar que voc se importa. Compartilhe em grupos do Whatsapp faa sucesso, todos iram adorar e se emocionar, pois temos vdeo mensagens para todos os momentos! Espalhe o amor por todas as suas redes sociais, pois quem ama manda um video telemensagem (Mensagem fonada)  Beautiful video messages to delight and thrill all your friends, boyfriend, husband, family. For you to share in Whatsapp, Telegram, Facebook messenger, Skype among others. The application has several beautiful phoned messages ready, love crazy, video voice dialing subdivided into different categories like:  Video Message of Declaration of Love  Romantic Conquest Messages  Dating Anniversary, Mothers Birthday, Fathers Birthday, among others ...  Messages of Thanks  Friendship Telemensagem  Video of Forbidden Love  Telemessages of Good morning, Good afternoon and Good night  Commemorative Dates Telemensions: Mothers Day, Valentines Day, Womens Day, Fathers Day, Fathers Day, Mothers Day, Grandparents, Christmas, New Year, Easter, Mothers Day, Mother-in-law  Christmas and New Year messages  Videos Excuse messages  Messages of Farewell  Remote Telemensagem  Gospel and Gospel Messages  Graduation Messages  Messages from GLS  Messages from Tributes  Messages of Optimism  Maternity Messages  Paired Telemensagem  Telemensagem de Picante  Condensation Telemessage  Reconciliation Telemessage  Video Messages of Saudade  Telemensagem de Vitoria  Do not let any date go blank, send a beautiful message to show that you care. Share on Whatsapp groups is successful, everyone will love and get excited because we have video messages for every moment! Spread the love for all your social networks, because who loves send a video telemessagem (Message fonada) ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.ACCESS_NETWORK_STATE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.twocatsapp.videotelemensagens.permission.C2D_MESSAGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}