{
"name" : "Web Browser Powerful",
"url" : "https://play.google.com/store/apps/details?id=com.hiwapps.webbrowser",
"package" : "com.hiwapps.webbrowser",
"category" : "Communication",
"description" : "Best browser play videos in the background. You can leave the page in a comfortable way to watch YouTube videos and the like. Your videos will continue in the background. Safely and quickly through this web browser designed in a professional way, you can navigate the Internet. Smart mobile browser offers you unique features. Phone is designed for tablets. Web browser for Android. Now its easy to navigate, thanks to the high performance and enhanced security can no longer wander in a very comfortable way. You will not regret watching clips or listening to music. With this application you can navigate the phone both clips in a comfortable way. It is not necessary to stay on the same page. We have added a unique feature that eliminates this problem for you. You can play games while on the phone to listen to music on one side. Your music, videos, movies to a Web browser that can play in the background. You provides an easy interface to. You can scroll through pages registered in more convenient shortcuts to quickly page.   Features:  - Video and audio playback in the background. Offers a unique experience. - Bookmarks. - Tabbed browsing. - Free internet browser. - Full screen support. - Quick start. - Copy and paste feature. - Bookmarks. - Hidden call. - Sharing feature: Convenient for social networks (Facebook, Twitter, e-mail), you can share it. - General settings. - Advanced features. - Quick connections. In this way you can switch between pages. - Ability to find the page. - Number of Main page item. - Home of the regulations. - Automatic adjustment feature. Phone and tablet based adjustment feature. - Plugins activation. - Set the font size. - Preview. - Prior to examine options. - Ability to delete all the things you can clear history and past. ",
"desc_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['org.tint.permissions.services.ADDONS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.GET_TASKS']" 
"extra_perms" : "['org.tint.permissions.services.ADDONS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
}