{
"name" : "Mobile Number Location - Phone Number Locator App",
"url" : "https://play.google.com/store/apps/details?id=com.mobile.number.locator.phone.gps.map",
"package" : "com.mobile.number.locator.phone.gps.map",
"category" : "Communication",
"description" : " No need to search number location online now!  Do you want to find the caller mobile number location?  Have you been getting phone calls from unknown number?  Do you want to have a phone number lookup tool to get the detailed info of the caller number?  Mobile number locator will meet all these needs.   Mobile Number Locator - Find Phone Location App, a precise mobile number location app, will show you the caller id and you can find location of mobile number through the phone number! Clean page and user-friendly operations make this number finder more attractive. Call flash remind you about every incoming calls and call blocker are here for unwanted or strange calls!  This location app will locate any caller phone number location and display it on the GPS map.  In addition, this phone locator will show detailed Caller ID info such as phone number service provider, phone number types and phone number location etc.   Beside GPS Mobile Number Locator function, this app will also bring you so many useful function as below:   Call Flash 2018 Shiny LED Flash Light Alert blinks to remind you of all your incoming calls. You will never miss any important calls.   Call Blocker Free - Blacklist. Call blocking app allows you to add spam caller or fraud number to blacklist. You will never receive any unwanted call.   Caller ID - Call Screen Show detailed information of every incoming call in the caller screen. You can decide whether to answer the call or not by the information.   Other Functions: Call log history app Contacts management Mobile number area code lookup  A live mobile number locator, a hlr lookup, can helps you to find phone number location! Phone locator app for mobile number location is waiting for you to explore a call location. There are too many caller id and number locator apps to choose. But you will not regret if you try this call locator. Locate any number and find location by cell phone number now! Its a good mobile locator using mobile phone number to find number location. If you choose this caller locator, you have not only a phone number finder, but also a hlr lookup! Download and try it now! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.INTERNET', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION']",
"manifest_perms" : "['android.permission.CALL_PHONE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_CALL_LOG', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FLASHLIGHT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_FINE_LOCATION']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_SIP', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.CAMERA', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.READ_CALL_LOG', 'android.permission.USE_SIP']",
}