{
"name" : "Larix Screencaster",
"url" : "https://play.google.com/store/apps/details?id=com.wmspanel.larix_screencaster",
"package" : "com.wmspanel.larix_screencaster",
"category" : "Communication",
"description" : "Larix Screencaster allows you streaming your presentations, games and app demos to wide audience by capturing screen of your Android device and transferring it in real-time over WiFi, EDGE, 3G or LTE to any media service or server.  Some tech specs: ~ Live H.264/AAC encoding. ~ H.265/HEVC encoding on supporting devices. ~ Supports RTSP and RTMP TCP streaming protocols. ~ Supports SSL for RTSP and RTMP (RTSPS and RTMPS). ~ Supports SRT streaming protocol based on reliable UDP, library version 1.4.1. ~ HEVC over RTMP is supported as non-standard experimental feature. ~ Saving to MP4. ~ Connects to any media server like Nimble Streamer, Wowza Streaming Engine, Red5, Flussonic or any other capable of mentioned protocols. ~ Android version 5.0 (Lollipop / API 21) and later is supported. ~ Multiple simultaneous connections support - add several connections profiles and choose up to 3 connections for simultaneous streaming, E.g. stream to Nimble Streamer, YouTube and Twitch. ~ With 5G technology, multi-point publishing allows easily delivery to multiple points.  When streaming to YouTube, please enable the sound because YouTube doesnt like streams with no audio.  ~ ABR (adaptive bitrate) is available in 2 modes: - Logarithmic descend - gracefully descend from max bitrate down step by step. Retries to raise back to previous step every minute. Best fit for good networks. - Ladder ascend - first cut bitrate by 2/3 and increase it back to normal as much as possible. Retries to raise back to previous steps in 15 seconds, 1.5 and then 5 minutes. Best fit for networks with big losses. ~ Variable FPS can be used as an option, it will reduce bitrate by decreasing FPS in addition to changing the bitrate value. Notice that it heavily depends on your device capabilities and may not work on some hardware. This feature is disabled by default. Its enabled in Video menu.   You can browse full document reference for all details regarding setup, usage, streaming to popular platforms like Facebook Live, YouTube Live and other targets: https://softvelum.com/larix/docs/   If youd like to white label this application in your own app, visit our webpage to get streaming library and SDK for Android: https://softvelum.com/larix/android/ You can also download APK there. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO']",
}