{
"name" : "mail.com mail",
"url" : "https://play.google.com/store/apps/details?id=com.mail.mobile.android.mail",
"package" : "com.mail.mobile.android.mail",
"category" : "Communication",
"description" : "mail.com Mail App - A Truly Mobile Email Experience Speed, convenience, protection and power. Now you can bring all the great benefits of your mail.com webmail account to your Android device with our official mail app. Enjoy 24/7 access to your inbox wherever you areview your entire list of contacts, check your mails and reply to messages all from the comfort of your smartphone. Experience real email mobility with the mail.com free mail app for Android.   Features overview of the mail.com mail app:  - Available on all Android devices - Powerful protection thanks to encryption security technology (TLS, SSL) - Full screen mode, pinch to zoom, and many more convenient functions - Send multiple attachments in all your mails - Stay focused with the new quiet mode feature - Synchronization with your GMX or WEB.DE address book (optional) - Fingerprint lock security (Android 6 only)   Once you download the mail.com mail app youll have all these great features at your fingertips. Thats why we always say that our app is more than a digital inboxits the easiest and fastest way for you to liberate yourself from your desktop PC and finally discover a better way to mail on the move.   Stay in the loop With just one click you can access your address book, inbox and folders. Activate the battery-friendly Push email function and your device will fetch your mails automatically throughout the dayyoull receive an instant notification on your home screen when new mail arrives in your inbox. When it comes to email, everything you need to know is never more than a glance away thanks to the mail.com mail app.  Personalize to your hearts content The mail.com app is flexible by design, meaning you can tweak its many functions to suit your needs and lifestyle. Set a custom alert tone to notify yourself of a new mail, or if you prefer a quieter mobile mail experience, activate the silent vibration notification tab. You can also change the way your mail list appearssimply hit the Compact Mail List tab to get a simplified view. mail.com is an email client that puts its customers firstso download our free mail app today.   100% at your convenience Our app is packed full of clever, handy features that simply make life easier. Clean up your inbox at lightning speed with the Empty Trash and Empty Spam buttons, and access the most important areas of your mails instantly with the Floating Action Button: The pen icon presents you with a blank mail in the blink of an eye, and the magnifying glass icon lets you search your messages for when you need to find an old mail without having to comb through your entire inbox. Recording important information is also a breeze with the screenshot function.  Our free mail app features are not only there to save you time, they also give you peace of mind. If you have an Android 6 smartphone you can activate the fingerprint lock function for added security; for all other Android devices you can create a PIN code to protect access to your mails and mail.com account. And finally, take advantage of the customizable Quiet Time featureit lets you determine set times throughout the day so that our mail app wont notify you with ringtones or a vibration alert of incoming mails. The mail.com free mail app: 100% at your convenience.   Were happy to hear from you Got an idea or comment regarding our email client service? We love to hear from our community and value your input. Simply click the Feedback tab in the Settings area of the mail.com app to enter your thoughts or questions and hit send. Enjoy your free mail app courtesy of mail.com. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.USE_BIOMETRIC', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_OWNER_DATA', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.GET_ACCOUNTS', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.READ_APP_BADGE', 'android.permission.READ_SYNC_SETTINGS', 'com.mail.mobile.android.mail.permission.C2D_MESSAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_SYNC_STATS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.android.vending.BILLING', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.READ_CONTACTS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.RECEIVE_BOOT_COMPLETED', 'me.everything.badger.permission.BADGE_COUNT_WRITE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.READ_OWNER_DATA', 'android.permission.READ_CONTACTS']",
}