{
"name" : "AfriCallShop: Calls & Top-up Mobiles",
"url" : "https://play.google.com/store/apps/details?id=com.v3.africallshop",
"package" : "com.v3.africallshop",
"category" : "Communication",
"description" : "1. Enjoy international calls at the best prices to cell phones and landlines in Africa and anywhere in the world. 2. Send SMS to mobile phones 3. Send also mobile recharges in Africa and in the world.  International calls to Africa at cheap rates  AfriCallShop allows you to stay in touch with Africa and the world. Call or send mobile recharges to Algeria, Morocco, Tunisia, Cameroon, South Africa, Botswana, Burkina-Faso, Ivory Coast, Benin, Gambia, Ghana, Kenya, Lesotho, Liberia, Malawi, Mauritius, Madagascar, Mali, Mauritius, Namibia, Nigeria, Niger, Uganda, Rwanda, Kenya, Seychelles, Sierra Leone, Swaziland, South Africa, Togo, Zambia, Zimbabwe... Well you can call any mobile or landline phone around the world!  Africallshop is an application that allows you to call at cheap rates with one the best quality in the market. Communicate more easily with friends and family and without interruption by using your WiFi or your mobile network!  Top up any prepaid phones in Africa  Recharge mobiles in Africa. AfriCallShop is connected with a lot of mobile operators. Send credit to your friends and familys mobiles. Its fast, easy an secure to add minutes to a phone.  A service focusing on the quality of the call  Our priority is to help the African diaspora to keep in touch with family, friends... We found out the calls offered by the current operators are of low quality. Africallshop has developed an offer that combines price and quality.  Cheap international calls and top-up mobile phones  We are working with local telcos to ensure you have the best price anytime.  Security  With AfriCallShop you can safely buy credit. You can make your purchases by credit card and PayPal with a few clicks.  How it works?  Download the application with one click then open it. You will see an ergonomic and a simple interface that will allow you to make calls from your Androd smartphone or tablet.  The adventure starts here. Dial your phone number using the numeric keypad and call your loved ones.  How do I buy credit?  1. I sign in to AfriCallShop application from my Android smartphone or tablet 2. Then, I click on the button Buy credit 3. Make your free international call: your first call is free 4. I choose the amount of my recharge and I select my preferred payment method (credit card or Paypal)  Get more informations  AfriCallShop is close to Africa and the African Diaspora. Thus you can also get news and events about Africa on our blog.  AfriCallShop is at your service! Any suggestions or feedbacks about our service? Contact our help-desk at: contact@africallshop.com  Like and share us on Facebook: https://www.facebook.com/pages/Africallshop/188312914708800  Follow us also on Twitter: https://twitter.com/AfricallShop ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.BROADCAST_STICKY', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.WRITE_CONTACTS', 'com.v2.africallshop.permission.C2D_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.SET_DEBUG_APP', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_LOGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['com.v2.africallshop.permission.C2D_MESSAGE', 'android.permission.SET_DEBUG_APP', 'android.permission.RECORD_AUDIO', 'android.permission.READ_LOGS', 'android.permission.WRITE_CONTACTS']",
}