{
"name" : "Crypviser Secure Messenger",
"url" : "https://play.google.com/store/apps/details?id=com.scimp.crypviser",
"package" : "com.scimp.crypviser",
"category" : "Communication",
"description" : "he New Standard of Security and Anonymity. Crypviser Secure Messenger is the most private messaging app, based on Blockchain technology.  By implementing Blockchain Technology and Decentralisation, Crypviser Secure Messenger lets you to enjoy private video chat & voice calls with automated blockchain encryption.  We utilise Blockchain to eliminate all threats of Man-in-the-Middle attacks and solved the historical public key encryption issue by using decentralised encryption keys exchange, and authorisation algorithms.  Your Messages, Videos, Photos, Data, etc will reach their destination unfiltered, unchanged, unseen, and most importantly UNBLOCKED!  WHY SHOULD YOU USE CRYPVISER AS YOUR EVERYDAY CHAT, VOICE & CALLS COMMUNICATION APP?  Crypviser is based on a Decentralised Communication Platform which cannot be Blocked or Stopped, Totally Anonymous, Bullet Proof Security using Military Grade Encryption, Salsa 20/20, Ecliptic Curve Cryptology, 512 Hash.  Decentralised. Crypviser Secure Messenger has introduced a new era of cryptography based on Blockchain technologies. Attacks on your text message are impossible because crucial encryption keys are truly authenticated and distributed among the nodes of the Blockchain.  Anonymous. One of our core beliefs is that only you should decide which text message is to be made public and which isnt. Crypviser doesnt require your phone number, name, e-mail address or any piece of personal information. To us you are Anonymous.  Highly Secure. Send text messages with our security protocol, developed with genuine end-to-end automated encryption and blockchain based authentication algorithms which exceeds todays requirements against all kinds of threats.   Local security. Crypviser is the only secure messaging app which keeps all your data including media files encrypted on an independent local storage. No viruses, spyware, trojans or third  party apps can access your data inside Crypviser.    File sharing. Enjoy sharing as many encrypted and private files, photos or videos as you want without size restrictions.  Screenshot and Data Forward Control With this highly powerful feature enable, NO ONE can take screenshots of your chats. Protect your messages from being forwarded or copied with just one click.   Intrusion Detection. Detect and prevent MiTM (Man-in-the-Middle) attacks by third parties. You will be informed about eavesdropping attempts by third parties, where an attacker may stealthily listen to your conversations without your consent.   Hide Chat. Each and every contact can have a password that will Hide all of your conversations with said contact.   Lock Chat. Without a password all conversations with a contact will be Locked. The user can select different passwords for each contact.   Self Destructing Messages. The user can set a determined time for which the message they send, will Self Destruct, on both ends, sender and receiver.   AND MORE.   We strongly recommend to try Crypviser Secure Messenger as your main tool for reliable and secured information exchange. We are totally dependant on our customers satisfaction.  Many new features are in the works. Enjoy Crypviser! ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.CAMERA', 'android.permission.READ_LOGS', 'android.permission.VIBRATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.scimp.crypviser.permission.C2D_MESSAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.INTERNET', 'android.permission.EXPAND_STATUS_BAR', 'android.permission.USE_CREDENTIALS', 'com.android.vending.BILLING', 'android.permission.RECORD_AUDIO', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_PHONE_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.EXPAND_STATUS_BAR', 'com.android.vending.BILLING', 'android.permission.READ_LOGS', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_FINE_LOCATION']",
}