{
"name" : "ringStudio",
"url" : "https://play.google.com/store/apps/details?id=com.ipvision.ringstudio",
"package" : "com.ipvision.ringstudio",
"category" : "Communication",
"description" : "ringStudio uses face detection technology allowing users to apply various theme based masks on real-time photo and video. Record videos with music, animations, filters, or special effects and instantly share with friends on Facebook, twitter, and other social media.   Browse through the collection of songs for various occasions and select your preferred music for your video clip. Transform your videos to create a theme based clip which is fun to make and fun to share.  Enjoy the use of exciting and colorful theme based special effects on ringStudio:  1. Select a mask 2. Select a song 3. Tap to record 4. Instantly share with friends  We bet you will have limitless fun bringing a unique experience to your selfies and videos. Enjoy using a new & exciting way to express yourself with ringStudio.   FEATURES  -Theme Based Live Masks -Artistic Filters -Real-time Video & Photo -Record & Share  Can you see yourself in an animation, movie or historical event?  Well then animate yourself and go adventurous with masks and filters. The theme based masks are made to celebrate the various events around the world. Be a part of celebrated occasions across the globe using the collection of themes which can be applied to photo/video on real-time.   Artistic Filters  Tons of amazing filters which are frequently updated and you can easily transform your photo or video into art. We have amazing filters to change the look on your face for every occasion. Instant Sharing  Record, snap, and share with your friends using ringStudio. You can share your photos and videos instantly on Instagram, Facebook, twitter and other social platforms and messengers.   Stay with us for more exciting updates coming soon! ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}