{
"name" : "Larix Broadcaster",
"url" : "https://play.google.com/store/apps/details?id=com.wmspanel.larix_broadcaster",
"package" : "com.wmspanel.larix_broadcaster",
"category" : "Communication",
"description" : "Larix Broadcaster allows streaming video and/or audio live content from your mobile device in real-time over WiFi, EDGE, 3G, LTE and 5G. ~ Live H.264/AAC encoding. ~ HEVC(H.265) encoding (where available). ~ RTSP and RTMP streaming over TCP. ~ RTMPS and RTSPS support - SSL for RTSP and RTMP. ~ Supports SRT streaming over UDP in Caller (Push) mode, SRT library version 1.4.1. ~ HEVC over RTMP is supported as non-standard experimental feature. ~ Front and back cameras are supported with hot switch. ~ Landscape and portrait mode, live rotation, always horizontal and always vertical support. ~ FPS selection - dependents on device capabilities, see below. ~ Larix Grove support https://softvelum.com/larix/grove/ for easy links distribution via deep links and QR codes. ~ Saving to MP4, making screenshots - saved to DCIM/LarixBroadcaster/ . ~ Custom white balance, exposure value and anti-flicker. ~ Video stabilization - where its supported by device. ~ Long press preview to focus lens to infinity, double tap for continuous auto focus. ~ VU-meter. ~ Flash light support. ~ Selfie stick support. ~ Background streaming option - keep streaming with display turned off or while not in focus. You can enable it in Settings / Advanced options - check Background streaming and re-start app by double tapping Back button.  Join Beta program to get new features among the first!  OTG USB cameras are supported for MJPEG and YUYV formats. Join Beta, install update, go to Advanced settings and enable USB Camera to take preview via OTG. Notice that some cameras may not work on some mobile devices due to hardware and software limitations. Let us know via https://wmspanel.com/help how it works for your device and camera.  Notice on 60FPS support: most of mobile devices with 60 fps cameras do not provide this capability to third-party apps, so only in native camera app can do it. So if your device has that support, most probably Larix wont be able to use it.  ~ ABR (adaptive bitrate) is available in 2 modes: - Logarithmic descend - gracefully descend from max bitrate down step by step. Retries to raise back to previous step every minute. Best fit for good networks. - Ladder ascend - first cut bitrate by 2/3 and increase it back to normal as much as possible. Retries to raise back to previous steps in 15 seconds, 1.5 and then 5 minutes. Best fit for networks with big losses. - Variable FPS can be used as an option, it will reduce bitrate by decreasing FPS in addition to changing the bitrate value. Notice that it heavily depends on your device capabilities and may not work on some hardware. This feature is disabled by default. Its enabled in Video menu.   ~ Streams to any media server like Nimble Streamer, Wowza Streaming Engine, Red5, Flussonic or any other capable of RTSP, RTMP and SRT input. ~ Streams to vMix and OBS Studio via SRT. ~ Streams to Facebook Live, YouTube Live, Twitch, Restream.io and many other services capable of receiving RTMP(S). ~ Multiple simultaneous connections support - add several connections profiles and choose up to 3 connections for simultaneous streaming, E.g. stream to Nimble Streamer, YouTube and Twitch. ~ With 5G technology, multi-point publishing allows easily delivery to multiple points. ~ Limelight authentication support - publish your streams directly into Limelight CDN for further delivery. ~ Akamai / Dacast authentication support - publish streams to any Akamai-powered CDN like Dacast. ~ Support for Periscope Producer - choose correct Target type when creating connection.  You can browse full document reference for all details regarding setup, usage, streaming to popular platforms like Facebook Live, YouTube Live and other targets: https://softvelum.com/larix/docs/  If youd like to use our RTSP/RTMP/SRT streaming library in your own app visit our webpage to get streaming library and SDK for Android: https://softvelum.com/larix/android/ You can also download APK there. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BROADCAST_STICKY', 'android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO']",
}