{
"name" : "MobileRecharge: Mobile Top Up - Easy & Fast Refill",
"url" : "https://play.google.com/store/apps/details?id=com.mobilerecharge.ui",
"package" : "com.mobilerecharge.ui",
"category" : "Communication",
"description" : "Recharge any prepaid phone in the world with MobileRecharge app.  Recharge mobiles in over 140 countries including:  Recharge Nepal Recharge Mexico  Recharge Spain  Recharge Myanmar  Refill USA  Recharge Nigeria  And many more!   Send credit to your friends and familys mobiles. Its fast, easy & secure to add minutes to a phone. Top up +430 mobile operators, including:  Recharge Ncell Recharge Nepal Telecom AT&T Refill Refill T-Mobile Recharge Claro Recharge Orange Recharge Digicel Flow Movistar Altice Cubacel Telcel Ooredoo Etisalat PosteMobile Maroc Telecom Vodafone BlueSky BTC Ethio Telecom And many more!  DOWNLOAD FOR FREE the MobileRecharge app - the official top-notch airtime service and get:   Frequent mobile recharge promotions  10+ years of excellence in delivering successful top ups worldwide  Instant recharge on the go  Lowest price for international mobile top ups  24/7 Customer Service by chat, phone & email  Highly secure payments with any major credit/debit card or PayPal  Access from any Android device  Recharge phone contacts directly  Online access to orders and invoices  Direct access to phone contacts list  No need to go to a store. Mobile credit at your fingertips!  FREQUENTLY ASKED QUESTIONS  1. What is a mobile recharge?  Mobile recharge is a service that allows you to send credit to any mobile phone in the world. It is fast, simple and reliable!  2. How can you recharge mobiles internationally?  To recharge a mobile abroad, just follow some simple steps:  Select the country where you want to send airtime.  Choose the operator of the mobile number you want to recharge. Enter your Contacts phone number, Nauta account or any other details necessary, or select it from your phone Contacts list. If you dont have the number or other necessary details saved, you can enter them. Select the top up amount. Log in or Create a free Account in order to proceed to payment.  Pay with any major credit or debit card or PayPal account.  3. What mobile numbers can I recharge?  You can send minutes to any prepaid mobile number covered by our list of operators like Airtel, AT&T, Claro, Cubacel, Digicel, Lime / Flow, Movistar, MTN, Orange, Telcel, Tigo, T-Mobile, and more. Just select the operator, enter the number you wish to topup and proceed to send credit.  4. Can I also recharge bundles?  Yes, you can! Besides sending prepaid credit to mobile phones, you can also recharge data plans, such as: Claro Internet Telcel Internet Amigo Movistar Internet plans Digicel plans MTN Bundles Airtel data plans 9Mobile data plans And more!  5. Do you have any mobile recharge promotions?  Get tens of daily promotions that will double or triple the top up to any Airtel, AT&T, Claro, Cubacel, Digicel, Lime / Flow, Movistar, MTN, Orange, Telcel, Tigo, T-Mobile or other operators prepaid numbers.   You can check all our mobile recharge promotions on our Promotions section.  6. Can I contact you anytime?  Yes, you can. We offer 24/7 Customer Support. In case you couldnt find the answer to your question in our Help Center section, you can email us. Our Customer Support representatives can answer in both English & Spanish.  Top up a mobile fast & easy with our FREE app for Mobile Recharge! For more than 10 years, MobileRecharge.com has delivered secure and reliable services to hundreds of thousands of customers.  For any questions, please email us at customerservice@mobilerecharge.com.  Or you can follow us on: Facebook: https://www.facebook.com/MobileRecharge/ Instagram: https://www.instagram.com/mobilerecharge/ Twitter: https://twitter.com/MobileRecharges YouTube: https://www.youtube.com/c/MobileRecharge Blog: https://blog.mobilerecharge.com/ ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}