{
"name" : "Contacts Widget",
"url" : "https://play.google.com/store/apps/details?id=com.makeevapps.contactswidget",
"package" : "com.makeevapps.contactswidget",
"category" : "Communication",
"description" : "Contacts Widget - definitely the best contacts widget! Its a collection of widgets, which allow calling, chatting with any contacts by one-touch at convenient way for you, and also a very flexible tool for creating your own widget design.  Free Features - Over 20 amazing, beautiful widgets for all device types; - 6 types of singles widgets (11, 21, 22, 41, 42, 43) - 3 types of groups widgets; - Folder widget to separate contacts by comfortable categories for you;  - Dock Bar folder and Dock Bar single contact; - Last Call list (Limited amount); - Last SMS messages list (Limited amount); - Select SIM-card to each contact (for phones with 2 SIM-cards); - Set action by Click for each contact (Call, SMS); - Show missed Calls, unread SMS messages; - Best Editor for contacts widgets;  All Features - Over 50 amazing, beautiful widgets for all device types; - 6 types of singles widgets (11, 21, 22, 41, 42, 43) - 3 types of groups widgets; - Folder widget to separate contacts by comfortable categories for you;  - Dock Bar folder and Dock Bar single contact; - Last Call list; - Last SMS messages list; - Unlocked all masks, fonts etc. - Select SIM-card to each contact (for phones with 2 SIM-cards); - Integration with 12 Messengers and Social networks; - Set action by Click for each contact (Call, SMS, E-mails, Messengers, Social networks); - Best Editor for contacts widgets; - Quick access to the Call functions, SMS sending, profiles views and chat changes in social networks; - Show missed Calls, unread SMS messages, new messages in chats, and current status in Online of famous Social networks;  Other Features - Quick import from Contact book; - User Guide to help you get started; - Use your favorite applications for reading and sending SMS;  - Energy efficiency of your phone due to minimal use of battery power;  Note for HUAWEI devices! https://getdroidtips.com/solve-huawei-p10-widgets-disappearing/  If group widgets are gone after some time, please, try to do next: - Go to Settings, Apps and Notifications, Apps.  - Choose the app that you are using as widgets - Go to battery option in the app, click app launch, and then turn off manage automatically - Manage manually: all options turned on.  Attention! - If your device use Flyme OS or you have problems with disappearing photos or clicking by widget, please read this instruction to fix this problem. In general you should add app to White list or enable Keep running after screen off. https://austinmarton.wordpress.com/2017/01/08/meizu-flyme-notifications-fix/ Also recommend to disable Battery saving option in device settings or go to App -> Settings -> Battery optimization switch. - Please exclude Contacts Widget from your task killers. Otherwise, the widgets will not be able to update properly and can disappear after restarting your device. - If you got message Application not found try to reset data for this type of app using Clear option in Profile -> Setting (Choose for needed type) -> Clear (In dropdown list) - App not compatible with some SMS messengers like Signal. If you have problem with SMS, recommend use official Google Messenger - Have you found mistake in translation? Easy way to fix it: https://goo.gl/2ZMzK3  Permissions Access to contacts: For importing contacts and manage them Manage phone calls: For making calls from widget and showing calls history Send and view SMS messages: For showing SMS in widget Photo and media: For storing and showing contacts photo   Beta testing new version with a lot of new features and bugfixes https://plus.google.com/communities/100726205122312761367  Help to develop the application further. Share information about it with friends on social networks.  Facebook: facebook.com/makeev.apps Google+: plus.google.com/+DmitriyMakeev  Send us your suggestions and comments on contactswidgetapp@gmail.com ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_SOCIAL_STREAM', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_PHONE_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.READ_SOCIAL_STREAM', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CONTACTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}