{
"name" : "Syncapp - Enterprise chat",
"url" : "https://play.google.com/store/apps/details?id=com.syncapp",
"package" : "com.syncapp",
"category" : "Communication",
"description" : "If you use instant messaging for your enterprise you need to try Syncapp. Its free.  Millions of enterprises use instant messengers unnaturally. They share business data, coordinate their work force and receive customer orders in a noisy environment.  So we invented Syncapp. Syncapp is an open instant messaging platform for the enterprise that needs to engage with their retailers, distributors, customers, field force and employees through structured data.   With Syncapp you can,   On-board catalogs with complex order forms  Open your searchable store on mobile phone  Run the order through whole execution while keeping the customer in the loop  Manage field services like Pick up, Delivery, Repair, Installations etc.  Manage structured data reporting with time, location and personnel tagging   Create complex workflows with role based field visibility and forwards  Integrate workflows with in-house enterprise software systems  Syncapp retains simplicity and features of your favorite instant messenger and takes it to the next level by adding following,   1. ACTIONABLE POSTS  Post a message with action attached for the message receiver. You can post forms for collecting enterprise data.  2. PER POST PRIVACY  Control visibility of posts by making votes and comments private or making message auto delete or freeze after certain time.  3. DYNAMIC GROUPING  Forward the post to customers, employees or vendors. For deeper engagement they can forward the post further maintaining the context.  4. COMMENTS IN MESSAGE  Send messages under a post so that all your conversation stays in one thread. You can get out of the whole conversation and all the future conversations with just delete of the post.  5. CHANNELS and EXCHANGES  One to many and many to one messaging so that you can engage your followers with posts. The channels can be made searchable so others can find what you are offering.  6. CHANNEL STORE  To find other channels or exchanges and place orders or consume content. You can publish your own channels and exchanges with ease as well.  7. EXPORT, IMPORT, REPORTS  Rich export-import of data, reports, API and deep linking to integrate with enterprise ERP tools, bots and user agents.  8. ENTERPRISE  Combine channels, groups, posts, reports and roles of your enterprise into one unit so all your contacts stay focused on the job at hand. This reduces noise significantly for your enterprise.  9. DEPLOYMENT  Deploy enterprises to all your enterprise contacts across the world and customize their experience and manage the membership from one phone. This improves adoption of your enterprise and reduces TCO of the app significantly.  10. LANGUAGE TRANSLATION  Not every contact of your enterprise understand English. Allow them to fill the forms in their language, while you see the data in your language.  11. FORMS and ROLES  Accept data from your users through complex forms with 100s of fields using over 25 different field types. Forms support role based field visibility, privacy and other settings to manage user experience. You can attach form rules to control the fields even further.  12. MEDIA and ATTACHMENTS  Attach images, videos, audios, documents, stickers and location in your chats just like your regular instant messenger. You can even save the posts you like so you can resend them as your own .  Bring simplicity and power of instant messaging to your enterprise. If you use instant messenger for your business you would love Syncapp. Syncapp is designed from bottom-up to be the hub of your enterprise.   There are millions of Repair centers, Cable installers, Maintenance providers, Couriers, Transporters, Logistics service providers, Pick-up and delivery services, Event managers especially in developing countries that can benefit from Syncapp.  You can become partner, earn recurring revenue and provide value added services on top of Syncapp. Contact us at sales@syncapp.chat for additional information.  Lets Syncapp :) ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_CALENDAR_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.RECORD_VIDEO', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.CALL_PHONE', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.RECORD_VIDEO', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}