{
"name" : "Wishes cards maker",
"url" : "https://play.google.com/store/apps/details?id=com.innovationdrivenapps.greetings",
"package" : "com.innovationdrivenapps.greetings",
"category" : "Communication",
"description" : "Sending original and personalized wishes and greetings to loved ones and friends has never been easier.  We offer different greeting formats ranging from simple text to a fully personalized greeting card.  Whatever the format, you can then send your wishes on Messenger, Whatsapp, Facebook and other social networks and instant messaging tools.  You can send greetings using the following formats:  1 / Text message: this is the fastest way to make wishes by sending a text chosen from a selection of several hundred original greeting messages.  2 / Simple greeting card: this is a quick and easy way to create a personalized greeting card: After selecting a text or writing a text of your choice, you must choose a background image then choose the style and color of the text then the card is ready.   3 / Advanced greeting card: Using our card editor you can personalize your greeting cards by:  Using background images from the phone gallery or phone camera or from the app background image gallery Putting one or more predefined or personalized texts and positioning them freely on the greeting card. We have prepared greetings and cards for different occasions:  Womens day Birthday wishes and greetings Valentines Day / I love you / good morning / good night Condolences Mothers Day and Fathers Day Birth of a baby Wedding Recovery from illness Happy new year 2021 Merry Christmas 2021  We also offer content in French, English and Spanish. We plan to add more languages in the coming days.  We are trying to make advertising less intrusive to allow you to have a pleasant user experience using our application. Advertising helps us generate revenue so that we can continue to provide you with a better and richer content and new features over time.  If you have any questions about using the app or any suggestions, please dont hesitate to contact us on our email: products@amineware.com Happy Holidays ! ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.SEND_SMS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}