{
"name" : "Dell ClearPass QuickConnect",
"url" : "https://play.google.com/store/apps/details?id=com.dell.quickconnect.android",
"package" : "com.dell.quickconnect.android",
"category" : "Communication",
"description" : "Dell ClearPass QuickConnect helps you automatically configure your device to securely connect to your organizations wireless or wired network. Dell ClearPass QuickConnect offers an easy way for users to self-configure their Windows, Mac OS X, iOS, and Android devices to support 802.1X based authentication on wired and wireless.  This application must be used in conjunction with Dell ClearPass QuickConnect server side software deployed in your organization. After installing the application navigate to the URL provided by your organization to start automatic configuration of your device.  In most phone models, the QuickConnect application will get automatically launched during network profile provisioning. However, in some phone models, a configuration file may get downloaded instead. In such cases, click on the OPEN button the browser shows after downloading the file to launch the QuickConnect application and complete provisioning. You can also click on the downloaded file in the notification bar to launch the QuickConnect application and complete provisioning.  For more information visit http://www.dell.com.  NOTE: A screen lock is required and set by the Android OS when installing certificates needed for secure wireless network access. Once you no longer wish to connect to the secure wireless network, you can go to Settings > Security > Credential Storage and click on Clear Credentials. You would be able to reset the screen lock after this. ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.READ_LOGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CHANGE_WIFI_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_LOGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
}