{
"name" : "TopUp.com - Mobile Top Up Made Easy",
"url" : "https://play.google.com/store/apps/details?id=com.topup.ui",
"package" : "com.topup.ui",
"category" : "Communication",
"description" : "Top up mobiles everywhere in the world using TopUp.com app. Its your fast & reliable airtime service. Take advantage of our daily mobile top ups offers and get 100% satisfaction for all orders. Send credit or add minutes to any prepaid number in just a few clicks!  Enjoy a highly recommended top up service by thousands of customers worldwide and:  Top Up Jamaica  Top up Nigeria  Airtime Ghana  Recharge India  Send Minutes Haiti  Top up Philippines  Top up Afghanistan  Top up Pakistan  Top up Spain  Top up Haiti  Airtime South Africa  Send Credit Cameroon  Remittance Nigeria  And other +135 countries in only few seconds  Choose your operator and: Top up Digicel Top up Flow Top up MTN Refill T-Mobile Recharge Tigo Top up MPT Top Up Etisalat Top up Airtel Top up BlueSky Top Up Lime Top up BTC Top up T-mobile Top up Bluesky Top up bmobile Top up Orange Top up Vodafone Airtime MTN Refill at&t And other +400 operators and stay connected with your loved ones   Download Topup.com app for free and enjoy:  Excellent prices for all international mobile top ups  More than 135 countries available in our top up list  Over 430 operators ready for airtime transfers  Fast order processing  All major credit & debit cards accepted   Pay, send credit or refill minutes with PayPal   Top up app compatible with all Android devices  Got questions? Contact our 24/7 Customer service via chat or email  Frequently asked Questions What is a mobile top up? Mobile top up is a service that allows you to send credit/recharge/airtime/refill a mobile worldwide. TopUp.com app allows you to send credit, minutes or data to your own mobile or your loved ones mobiles in seconds. Fast and secure!   How can I top up a mobile internationally? Its simple!  Select the country where you want to send credit  Choose the operator and select your contact/enter the number that you want to recharge Select the amount that you want to top up Log in or Create an account in order to proceed to payment details Pay safely with your credit/debit card or PayPal Phone is topped up in seconds. Now you can enjoy your credit!  What are the countries where I can send credit? The list is long. Most popular destinations where our customers send top ups are Jamaica, Myanmar, United States, Haiti, Nigeria, Afghanistan, Ghana, Samoa, UAE, Pakistan, Gambia, Philippines, Bangladesh, Peru, Germany, Poland, Brazil, Guyana, Cameroon, South Africa, Thailand and many more.  What mobile operators can I top up? You can refill credit or send minutes to any prepaid mobile number available like Digicel, Flow, Orange, MTN, Movistar, Lime, Vodafone, Airtel, MPT, Kolbi, Etisalat, Natcom, BlueSky, T-Mobile and many others.  Can I also top up bundles? Yes, you can! Just select the operator & the plan that you want to top up and we will take care of the rest. We have great offers for: Claro Internet Telcel Internet Amigo Movistar Internet plans Digicel plans MTN Bundles Airtel data plans And more!  Do you have any mobile top up promotions? Yes, we do! We have regular top up promotions for operators like: Airtel, AT&T, BlueSky, Claro, Cubacel, Digicel, Etisalat, Kolbi, Lime/Flow, Movistar, MPT, MTN, Ncell, Orange, ooredoo, Telcel, Tigo, T-Mobile, Vodafone and many more.  Choose from more than 430 mobile operators including Digicel Jamaica, Flow Jamaica, Digicel Haiti, T-Mobile USA, Orange Spain, MTN Ghana, Ooredoo Tunisia, MTN Nigeria, BlueSky Samoa, Vodafone Spain, BTC Bahamas, AT&T USA, du UAE, Airtel India and many others.  Wait no more, top up a mobile with Topup.com app!  Follow us on: Facebook: https://www.facebook.com/topupcom/ Twitter: https://twitter.com/topupcom ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}