{
"name" : "Private Browser - Smart & Fast Privacy Web Browser",
"url" : "https://play.google.com/store/apps/details?id=com.eagle.web.browser.internet.privacy.browser",
"package" : "com.eagle.web.browser.internet.privacy.browser",
"category" : "Communication",
"description" : "Private Browser is a privacy browser and safe browser, it browse privately for everything, private search and private browsing. Private browser is also a smart browser and fast browser for android. You can browse web page quickly, because it is best free privacy browser. Private Browser is also a mini browser, because its size is so small.  Private Browser is a free web browser for android devices with Fast Download, Data Saving, Ad-Block functionality, and helps you access music, video, cricket information with smooth experience. You can visit many cricket sites to support your team, and watch cricket live stream, and check out match scores on Private Browser. You can also check your train status, train ticket booking,seat availability, and other train enquiry on Private Browser.  Browse like no ones watching. The new Private Browser automatically blocks a wide range of online trackers  from the moment you launch it to the second you leave it. Easily erase your history, passwords and cookies, so you wont get followed by things like unwanted ads.  Private browsing on most browsers isnt comprehensive or easy to use. Private Browser is next-level privacy thats free, always on and always on your side.  Automatic Privacy :  Blocks a wide range of common Web trackers without any settings to set  Easily erases your history  no passwords, no cookies, no trackers  Browse Faster :  By removing trackers and ads, Web pages may require less data and load faster. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.vending.BILLING', 'com.eagle.web.browser.internet.privacy.browser.permission.C2D_MESSAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE']",
}