{
"name" : "MailDroid - Free Email Application",
"url" : "https://play.google.com/store/apps/details?id=com.maildroid",
"package" : "com.maildroid",
"category" : "Communication",
"description" : "As one of the first email clients added to the store, MailDroid focused on making email usable again. We were used to blackberry email and we wanted something like that here. We did not find anything, so we wrote our own. Give our app a try and once you see all the features it has, I promise you wont be disappointed. You can always email us and we will reply right away with help (even on weekends! Yes, we love our users!).   How is MailDroid different? For starters, it is a pure email client which means we dont have a back-end server looking at your mail. You set up your POP, IMAP, Exchange connections and the client speaks directly to the server. Second, it is powerful and yet easy to use. If you dont want to use the PGP or sMIME encryption, simply hide it. Want to use the old navigation over the new navigation drawer, your choice. Want to snooze your email or send it at a delayed time, you can do that as well! Third, we have oAuth2 to Gmail, Yahoo Mail, AOL Mail, and Outlook. oAuth2 means that the app just gets a token from those providers and does not see any password. For those of you who have had issues recently with these providers (specifically Gmail and Yahoo Mail), this is the solution! We worked with all these providers to make sure you feel super secure. Fourth, we have integrated with important and helpful third party email companies like SaneBox! Finally, we support our users! We email you back when you ask for help!!   You are our users and we have built this mail client around feedback from users. We have no agenda of what we need to add anymore, just what people want us to add. We support so many email providers automatically and for those that we cant figure out the settings for, a manual option always exists. We have added support for so many features, that many times we even forget some of the things we have added. Here is a short list:   1. Complete re-write and not based at all on the standard email application 2. Idle Push for all IMAP servers that support it 3. Download attachments to your device using any file explorer or use the built in file manager to manage your files 4. Settings Support for signature, font size, ring tone, led color, icon selection etc. 5. Custom Mail Rules 6. Spell Check 7. Search your mail online (for IMAP servers only) or offline for both IMAP and POP3 servers 8. Password Protection 9. Microsoft Exchange 2003,2007,2010, Office 365 servers 10. Full WYSIWYG editor 11. Split screen for tablets 12. Calendar integration using ICS attachment (exchange 2007/2010 and CalDav support is coming) 13. Cloud storage integration to save attachments (dropbox, box.net, Google drive and SkyDrive/OneDrive) 14. Customize your inbox styles and themes to your preference 15. Spam Filter Plugin --> REQUIRES IN-APP PAYMENT 16. Email Threaded Mode 17. Light Flow, Tesla Unread, Apex Launcher, and Dashclock Integration 18. Different notification styles and icons 19. Identities/Aliases supported 20. Backup SMTP Provider 21. open PGP support using PGP Inline or PGP MIME 22. S/MIME support for all email providers 23. oAuth2 support for Gmail, Hotmail/Outlook, Yahoo, and AOL Mail 24. Support for SaneBox 25. Much more....  OK, that was a long list, but at least we left it with Much more... instead of going on. So why are you wasting time reading any more, just download the app and mail will finally work again for you!  NOTE: This is the ad supported model, a pro version exists as well on the store NOTE: ACTIVESYNC IS NOT SUPPORTED AT THIS TIME! NOTE: SPAM SUBSCRIPTIONS DO NOT CARRY OVER TO THE PRO VERSION!  Please email support if you have any questions ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.READ_APP_BADGE', 'android.permission.USE_FINGERPRINT', 'com.android.gallery3d.filtershow.permission.READ', 'android.permission.GET_ACCOUNTS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.WRITE_CALENDAR', 'android.permission.ACCESS_NETWORK_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.maildroid.READ_SETTINGS', 'com.google.android.apps.photos.permission.GOOGLE_PHOTOS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.READ_CONTACTS', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'com.android.vending.BILLING', 'com.flipdog.crypto.plugin.FLIPDOG_APPLICATION', 'com.google.android.gallery3d.permission.GALLERY_PROVIDER', 'android.permission.READ_CALENDAR', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.sec.android.provider.badge.permission.READ', 'android.permission.VIBRATE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.USE_CREDENTIALS', 'com.sec.android.provider.badge.permission.WRITE']",
"perms_with_call" : "['android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['com.google.android.gallery3d.permission.GALLERY_PROVIDER', 'android.permission.READ_CALENDAR', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'com.android.gallery3d.filtershow.permission.READ', 'android.permission.GET_ACCOUNTS', 'com.maildroid.READ_SETTINGS', 'com.google.android.apps.photos.permission.GOOGLE_PHOTOS', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CALENDAR', 'android.permission.READ_CONTACTS', 'com.flipdog.crypto.plugin.FLIPDOG_APPLICATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}