{
"name" : "CallIndia - Unlimited Calls",
"url" : "https://play.google.com/store/apps/details?id=com.callindia.ui",
"package" : "com.callindia.ui",
"category" : "Communication",
"description" : "Save money on your international phone calls and SMS to India.  With CallIndia app, you can call India using a cheap Unlimited India calling plan. International calls to India with CallIndia resemble local calls in terms of costs, great dialing experience and usability. Plus, the VoIP unlimited calls to India have a high quality. Choose your best unlimited plan to call India with no hidden fees, and well show you how to call India easily, using a fair and economical calling and texting service!  For low usage callers, the alternative to an unlimited calling plan is Voice Credit, prepaid credit that never expires. Buy online as much prepaid credit as necessary, and replace calling cards and phone cards with CallIndia app, that is free-to-install.  CallIndia app works with 3G, LTE/4G, and ideally with WiFi. This way you can make cheap calls to India and other destinations on CallIndia.com. Call India the easiest way, at the lowest price on the global market!   NEW! Offline Calling - this feature is meant to allow app users to connect calls without Internet connection WiFi or 3G/4G-LTE, through local access numbers. This feature will help you call any contact number without Internet connection. For any international contact you may need to call, a local phone number will be instantly made available for you.  VOICE CALLS & SMS Use with WiFi & 3G/ LTE 4G Direct access to your Contacts list Access from any Android device Works on 7 and 10 tablets Unlimited calling plans to India Or buy prepaid minutes, that never expire, to call worldwide  DOWNLOAD FOR FREE AND GET: No hidden fees Excellent call quality  Minute rounding Low cost calls to India Calling plan or prepaid credit in app purchase  Cheap calling rates for other international destinations 24/7 Customer Service  HOW IT WORKS: 1. Go to CallIndia.com and create an account  2. Buy an unlimited calling plan on the website if you dont have a PIN yet 3. Install the app and start calling or texting  EXTRA OPTIONS International Rates *Check the prepaid rate/min for other calling destinations in the Rates tab!  Help Center *Check out the answer to frequently asked questions in the Help Center tab.  Set my Caller ID *Let your friends know whos calling them! Set your Caller ID directly from the app.  Buy Calling Plan / Credit *Buy an unlimited calling plan to India, or recharge your PIN with prepaid credit, directly from the app!  Rate our app *We value your opinion. Please let us know if you like our app!  FEATURES:  Use your own phone Contacts to make direct calls   Create a new account from the app  Use Speed Dial to call your favorite numbers faster  HELP CENTER  What can I do to improve my quality when making a phone call online? All international calls placed through our application depend on the quality of your Internet connection. Please make sure you have a good signal and that no other software or program is using your Internet resources when making an internet phone call.  Can I use my phone contacts? Yes, but you have to make sure that all phone numbers are saved in international format: country code + phone number.   How much data does the app use for an online call? On average, the app uses approximately 1MB/min for making a voice call. In order to benefit from the highest quality available, we advise you to use the application with a WiFi network. Any costs resulting from using the application with 3G or LTE/4G networks when you call internationally or send an SMS are not covered by us.  BACKUP CALLING METHOD: Use Toll Free or Local Access Numbers from CallIndia.com to make direct calls from  your mobile phone or landline, without using the app.  We recommend that you turn off international calling with your mobile provider. This way there will be no risk to make international calls or long distance calls by accident using your current provider, at much higher rates.  Having issues with the CallIndia app? Please email us at callindia@keepcalling.net. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.GET_ACCOUNTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.BROADCAST_STICKY', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CALL_PHONE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.READ_CONTACTS', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_FINE_LOCATION']",
}