{
"name" : "Photon Flash Player & Browser",
"url" : "https://play.google.com/store/apps/details?id=com.appsverse.photon",
"package" : "com.appsverse.photon",
"category" : "Communication",
"description" : "Photon Flash Browser for Android devices is the leading #1 and best Flash browser app with fully available Flash player plugin built in support and online video streaming that liberate your browsing experience. Our leading edge technology allows users to browse the web fast, runs Javascript at speeds faster than most mobile browsers on your device (during cloud streaming mode) and play Flash.  Photon supports not only Flash videos, but also Flash games and websites. You can browse natively on the browser and when you need Flash support, you just need to click the lightning bolt button to activate the support on your tablets or phones. You can use Photon for free with ads or purchase a yearly premium pass to remove ads. Key Browser Features ------------------------------- 1) Unlimited tab support 2) Intelligent url bar to search and type your url from one single toolbar. 3) Browse and play video plus live TV full screen 4) Incognito and private browsing support allows you to erase browsing history with every session 5) Bookmark with folders support 6) Desktop browser and multiple user agent support. Set user agent as Safari, Chrome, Internet Explorer IE or Firefox with our desktop mode to view websites in their full desktop version. 7) Ad block and pop up blocker support 8) Support for Adobe FLV and SWF format 9) Local Access mode allows users to instantly watch movies & local TV stations and sites that may block based on geographical IP 10) Dynamic bandwidth adjustment allows you to adjust your video stream bandwidth on the fly to optimize viewing experience and save data bandwidth even on 3G networks. 11) Different mode allows you to optimize your experience. 12) 3 navigation modes. Finger mode allows you to touch and flick. Drag hand mode allows you to drag game maps and other items. Mouse mode treats your screen like a trackpad providing precise navigational control. 13) Supports Flash player 10.1, 11 and for Android KitKat and beyond. 14) Acts like a VPN service for browsing and unblocks services like Hulu and provide safe browsing in public non-secure Wifi hotspot. VPN browser allows you to browse blocked websites. With Photon browser, there is no sign up and need to learn how to install the Adobe Flash Player plugin or APK file. Just press the lightning bolt button and it just works and gets enabled without root on your device. Millions of users are already enjoying the benefits of watching online videos and playing Facebook games on Photon. Join them and download for free. Upgrade to get full screen support, AdBlock plus other features. Game Websites supported: Pogo games, Starfall, Armor Games and many more... Facebook Games supported include: Candy Crush Saga, Dragon City, Double Down Casino, Battle Pirates and many more... NOTE - Please note that Photon supports Adobe Flash which is different from Adobe AIR which runs outside of the browser and can be downloaded separately. What blogs and tech sites have to say:  Photon can access Hulu or online game sites like Kongregate  - About.com Overall, if I were to review and compare Puffin vs Photon, I would rate Puffin a 3.5 star and Photon a 4.5 star out of 5 star. - TechNoose.com After downloading the app, I was watching Flash videos on Hulu and YouTube in a matter of seconds. The playback was fast, the experience was stable and I was in streaming video heaven! - BigFishGames Adobe Systems, Inc discontinued the Flash Player Plugin for mobile devices. Adobe Air , Flash and Flash Player are a registered trademarks of Adobe Systems, Inc. ",
"desc_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['com.android.vending.BILLING']",
}