{
"name" : "Learn Syrian Arabic: Syrian Basic Phrases",
"url" : "https://play.google.com/store/apps/details?id=com.robtheis.android.phrasebook.ap.bc",
"package" : "com.robtheis.android.phrasebook.ap.bc",
"category" : "Communication",
"description" : "Military-related phrases for language learners. With text and audio.  Using this app, you can select an English phrase and view its translation and how to pronounce it in the foreign language.  This app was originally developed as an entry to the 2010 CIO/G6 Apps for the Army competition, and it is based on the modules publicly available online from the U.S. Defense Language Institute. While this apps subject matter relates mainly to military topics, the app is broadly useful with content relating to a range of topics.   Easy to use  Native speaker audio  Dictionary lookup  Pronunciation help: Transliteration/Romanization text  Over 600 phrases  Voice-based lookup (speak the phrase you want in English)  Good for language learning, or as a reference  Free and unlimited  This is part of a series of phrasebook apps published for many different languages and dialects. Phrasebooks in the series are available as basic and medical variants.   Text may be exported as Anki flash cards  Works offline: No network connection is required  Search bar for quick vocabulary lookup  No login or registration needed  Dark background color minimizes eye strain  Many of the languages covered by this series of phrasebook apps are under-resourced, with translation apps and dictionaries not widely available from other sources.  *BASIC* phrasebooks contain the following categories of phrases:  Commands, Warnings and Instructions Helpful Words, Phrases and Questions Greetings and Introductions Interrogation Numbers Days of the Week/Time Directions Locations Descriptions (Colors, Shapes, Sizes, Tastes, Qualities, Quantities) Emergency Terms Food and Sanitation Fuel and Maintenance Medical Terms/General Medical Terms/Parts of the Body Military Ranks Lodging Occupations Customs (Port of Entry) Relatives Weather General Military Terms Mine Warfare Terms  *MEDICAL* phrasebooks contain the following categories of phrases:  Introduction Guidance Registration Assessment Surgical Consent Trauma Procedures Foley (Catheter) Surgery Instructions Pain Interview Medicine Interview Orthopedic Obstetrics/Gynecology Pediatrics Cardiology Ophthalmology Neurology Exam Commands Caregiver Post-Op/Prognosis Medical Conditions Pharmaceutical Diseases  How to use  1. Choose a subject category from the menu. That category will be expanded. 2. From the expanded list of phrases shown, tap on the phrase you want. 3. On the phrase detail page, the phrase itself is shown alongside its pronunciation and the equivalent English phrase. Press the Play button to hear the audio pronunciation by a native speaker.  Ideal for   U.S. Military service members  Language learners  Doctors, nurses, and medical staff  Travelers  Aid workers  Linguists  Other languages and dialects available in this series  Albanian, Algerian, Amharic, Azeri, Baluchi, Bengali, Bosnian, Burmese, Cantonese, Cebuano, Chavacano, Croatian, Czech, Dari, Egyptian, Emirati, French, Gan (Jiangxinese), Georgian, Gujarati, Haitian, Hassaniya, Hausa, Hebrew, Hindi, Igbo, Ilocano, Indonesian (Bahasa), Iraqi, Japanese, Javanese, Jordanian, Kashmiri, Kazakh, Khmer, Korean (North), Kosovar (Albanian), Kurmanji, Kyrgyz, Lebanese, Libyan, Lingala, Malay, Mandarin, Mongolian, Moroccan, Nepali, Palestinian, Pashto (Afgh.), Pashto (Pak.), Persian-Farsi, Polish, Portuguese (Brazil), Portuguese (Europe), Punjabi, Quechua, Russian, Saudi, Serbian, Sindhi, Somali, Sorani, Spanish (Colombia), Spanish (Mexico), Spanish (Venezuela), Sudanese, Swahili, Syrian, Tagalog, Tajik, Tamashek, Tamil, Tausug, Telugu, Thai, Tigrinya, Tunisian, Turkish, Turkmen, Uighur, Ukrainian, Urdu, Uzbek, Vietnamese, Shanghainese, Yakan, Yemeni, Yoruba  Making flash cards: Launch app and choose Flash cards from the menu in the top corner, and follow the prompts. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.ichi2.anki.permission.READ_WRITE_DATABASE', 'android.permission.INTERNET', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.ichi2.anki.permission.READ_WRITE_DATABASE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}