{
"name" : "Stick Texting for WhatsApp",
"url" : "https://play.google.com/store/apps/details?id=com.sticktexting.sticktextingnew",
"package" : "com.sticktexting.sticktextingnew",
"category" : "Communication",
"description" : "The OriginalStickTextinghas gone Free and has expanded its library of animations. This version is specifically designed for use with WhatsApp, but you can still paste these funny animatedStickFigures anywhere that .gif and .mp4 files are accepted like Facebook, Twitter, Snapchat, Kik, Tumblr, email and text. Hundreds of original animations at your fingertips.  Emoticons? Emoji? Boring.  These are fully animatedstickfigure text scenes. Awesomestickart for your Android Devices! Dont be fooled by imitations.  Bring your Social Media to Life.  All original fully animatedstickfigure masterpieces made to add life to your WhatsApp conversations as well as almost any other social media posts.  Fun, clever and thought provoking.  If you think emoticons or emojis are cool, you havent seen anything yet.  If you think emoticons or emojis are lame, you are going to loveStickTexting.   --- Free updates with new animations ----  --- Simply dynamic ----   You will love sending and receiving animatedStickFigure Texts. Simply tap to preview and copy any of the several animations and launch WhatsApp or similar applications right from theStickTextingApp. Paste into any text or e-mail.   Each animation can be seen on any phone or computer that can view .gif animations.  These are high-quality detailed animations. Some animations contain as many as 100 frames. Not some lame smiley clapping or frowning. Not your typical emoji or emoticon. These are highly trainedstickactors andstickstuntmen!   ---- Check us out on YouTube and atwww.StickTexting.com. ----   StickTexts slam dunk basketballs, attempt motorcycle jumps, bust out karate moves, spontaneously combust, chow down on food and much, much more!  Dont be the last one to take your Social Media to the next level! Nothing else even comes close.  Has a keyboard option as well for quicker replies. Search feature too! We packed a lot of features into this app.  ***** Despite the warning by Google regarding installing third-party keyboards, we DO NOT gain access to any private information and we DO NOT monitor your keystrokes. You can read our privacy policy atwww.sticktexting.com. You can also useStickTextingwithout using the keyboard option if you prefer. ****** Thanks for checking outStickTextingfor WhatsApp. Now go make someone laugh. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.SEND_SMS']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.GET_TASKS', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.MOUNT_UNMOUNT_FILESYSTEMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
}