{
"name" : "Incognito Browser - Your own Anonymous Browser",
"url" : "https://play.google.com/store/apps/details?id=com.androidbull.incognito.browser",
"package" : "com.androidbull.incognito.browser",
"category" : "Communication",
"description" : "Incognito Browser is an Anonymous browser for Android with Multiple Tabs and video support. It let you browse the internet anonymously. Each time you exit the Incognito Browser, everything youve done will be erased, including history, cookies, and sessions. So this is the best of this Incognito browser like browsing anonymously - mean as soon as you exit the app, no one knows who used it and for what. Incognito Browser is a feature-rich browser, and its in permanent Anonymous mode.   Incognito Browser is the best private browser if you want to visit adult websites, dating sites, medical sites, check Facebook on a friends device, watch a video or anything else without anyone finding out! - Age restrictions apply   Features:   Absolutely no data is saved. When you exit the app, all data and history are removed. Everything that goes on in the browser is removed when you hit Home, Exit, or Close. That what makes it Anonymous.   Be Anonymous It does not stop websites from accessing your information, however, it makes sure that nothing is stored on the phone. No browsing history or cache but the files you downloaded.    Dark Mode Private Browser providing the true dark UI for browsing through the internet at night.     Fast Downloader Just integrated the new fast downloader, to download the files even more rapidly while browsing the internet anonymously.    Search Engines  Incognito Browser supports multiple search engine including Google. Which is default, but you can change in settings   Supports agent cloaking (no more mobile-version of sites!) Make websites think that youre visiting from another browser. Making it the even more secure browser, The best part of this Private Browser   Tabbed Browsing - Hassle-Free Incognito Browsers tabbed browsing feature has the ability to quickly switch between several open web pages within a single browsing session. Remember, every new tab you open is anonymous by default    Minimalistic, maximum space for browsing No junk, no extra bars - just enjoy maximum space for your anonymous browsing experience with Incognito Browser   Multiple Language Support Now Incognito Browser supports up to 5 mostly spoken languages worldwide, to make the app understandable for everyone and everywhere who is willing to be anonymous   No first or third party trackers are bundled in the app. Your information is secure from leakage.   You can set enable or disable images from Settings in Incognito Browser   You can set enable or disable Javascript from settings in Incognito Browser   You can maximize the browsing space by turning the Full-Screen mode on!   No more personalized ads, as you are serving the internet anonymously  Keep using Incognito Browser / Anonymous Browser and secure your privacy by going anonymous, Enjoy! ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.INTERNET', 'android.permission.QUICKBOOT_POWERON', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.android.vending.BILLING', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_DOWNLOAD_MANAGER', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.QUICKBOOT_POWERON', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_DOWNLOAD_MANAGER', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING']",
}