{
"name" : "Temp Mail - Free Instant Temporary Email Address",
"url" : "https://play.google.com/store/apps/details?id=com.tempmail",
"package" : "com.tempmail",
"category" : "Communication",
"description" : "Using Temp-Mail app, you can instantly generate disposable temporary email address and immediately receive emails, including photos or any other attachments.   Forget about revealing your real email to everyone. It causes endless spam, advertising mailings, email hacking, and phishing attempts. Keep your real inbox clean and secure. Temp Mail provides a temporary, anonymous, free, disposable email address in 10minute mail style.   This app is an advanced version of services also known as 10minutemail, disposable-mail, fake email, guerrillamail, mailinator, getairmail,mohmal mail, throwawaymail, tempmail, tempail, anonymous-mail, spambox, tmail, burnermail, trashmail, 20minute email, and others. But much more robust and with an option to unlock unique premium features.    Why use Temp-Mail?   Hide yourself from spam  No registration is required  Generate temporary disposable email  Protect your privacy and anonymity by not allowing spam in your personal inbox  Receive multiple or single attachment(s) which can be downloaded from email   Multi-language   Emails are constantly being securely deleted forever   With Temp-Mail app, you can :    Generate a new email address instantly   Copy to clipboard or using QR-code   Receive emails and attachments automatically  Get push notification of new emails  Read incoming emails, including attachments   Download sources (EML), including attachments   Quickly delete and/or generate new email addresses    Access Extra features with Premium :    Custom email names   Multiple mailboxes   In-app emails view   Premium domains   Extended email storage  Premium support   No ads   If you choose to purchase Temp-Mail Premium, payment will be charged to your Google account, and your account will be charged for renewal within 24-hours prior to the end of the current period. Auto-renewal may be turned off at any time by going to your settings in the Google play Store after purchase. Premium subscription prices can depend on user country, you can see exact terms and prices clearly on purchase screen. Any unused portion of a free trial period will be forfeited when you purchase a subscription.   All personal data are kept according to privacy policy, terms of service and available here:  https://temp-mail.org/privacy-policy-app  https://temp-mail.org/terms-of-service-app    Temp-Mail in the press:  Our service was mentioned a lot in various publications, youtube videos and social media posts.   Dealing with spam flooding your inbox can be stressful, and you have better things to do than go through and delete them. - Entrepreneur.com  Its a great way of maintaining some anonymity and keeping your main email free from phishers, scammers, and dodgy data buyers. - TheNextWeb.com  The iOS app gives you a temporary e-mail address so that your real inbox stays clean. This makes it an ideal solution for dealing with newsletters, bots and questionable websites- Iphoned.nl  However, the more secure method is to take advantage of the Temp Email app. With this app, it will generate a temporary email address that isnt associated with you or your personal information. With this app, you will receive any emails sent to this email address such as any account verifications or confirmation codes. - Gadgethacks.com  ---  Please note: You cannot send email using this app, only receive.  Moreover, our free service handling a couple millions emails per hour. Therefore, we are not able to store emails more than 1-2 hours and the domains may be the subject for change. Do not use temporary emails for registering important accounts or receiving sensitive data. We have no ability to restore emails or domains once removed.   Please send us any suggestions or inquiries to : support@temp-mail.org ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.READ_PHONE_STATE', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.CAMERA', 'com.android.vending.BILLING']",
}