{
"name" : "myMail – Email for Hotmail, Gmail and Outlook Mail",
"url" : "https://play.google.com/store/apps/details?id=com.my.mail",
"package" : "com.my.mail",
"category" : "Communication",
"description" : "myMail  Manage all your email accounts at once! Whether its Hotmail, Gmail, Yahoo, Outlook, AOL, iCloud, Live, Exchange or GMX, myMail email client supports all major mail providers and any other IMAP or POP3-enabled mailbox.    myMail keeps your mail securely in one place. It makes communication fast, light and mobile-friendly. Our app allows you to preview, read, reply and forward your messages as well as to add and view attachments. All you need is your email login and password and the mail app is ready to use.    myMail supports all popular email services: Google Mail (Gmail), Microsoft (Hotmail, Outlook, Live), Yahoo Mail, AOL, GMX, Mail.com and my Mail mobile email (my.com).   myMail automatically sets up IMAP, POP and SMTP settings for most host domains and includes support for the majority of corporate email servers such as Lotus Notes and Microsoft Exchange where IMAP and SMTP are enabled.    KEY FEATURES:   Real-time push notifications for your mail account which can be customised to better fit your work-life schedule   Navigate easily through your inbox with menu icons and contacts avatars as part of your conversation   Search through local and server contacts (Gmail, MSN Hotmail, Outlook and Live) with search suggestions as you type   Browse files directly from the mail app to include as attachments   Create a unique email signature   Organise your mailbox by flagging, moving to spam or deleting your messages   Filter by Unread email, Flagged or emails with Attachments   Clear layout and design   ActiveSync protocol supported   View your entire email conversation on one screen with email threads.   Theres more! Sign up at MY.COM for a short new e-mail address and access these exclusive features (and yes, its free!):   Add, delete, label and manage folders   Create filters to organise your messages e.g. by sender    Our email application is optimised for your smartphone and tablet.    Email security is our key priority. Our app uses OAuth authentication to sign in to Hotmail, Gmail and Outlook accounts and does not request users credentials. Instead, access to users data is required directly from Microsoft and Google websites, which ensures a secure e-mail login.    EWS protocol is not supported yet however keep an eye on future updates.   If a sign in problem occurs on your device, send details to androidmail@corp.my.com including your email address, IMAP, POP or SMTP email settings and we will resolve the issue.   Follow myMail to find out all about the upcoming updates and cool features at: www.facebook.com/mymail.official  myMail uses AdChoices. More information can be found here https://m.facebook.com/ads/ad_choices ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_ACCOUNTS', 'android.permission.MANAGE_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_SYNC_SETTINGS', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.google.android.gallery3d.permission.GALLERY_PROVIDER', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.READ_SYNC_STATS', 'com.android.gallery3d.permission.GALLERY_PROVIDER', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.INTERNET', 'android.permission.WRITE_SETTINGS', 'com.my.mail.permission.C2D_MESSAGE', 'android.permission.USE_CREDENTIALS']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['com.google.android.gallery3d.permission.GALLERY_PROVIDER', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.gallery3d.permission.GALLERY_PROVIDER', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}