{
"name" : "Poll Everywhere",
"url" : "https://play.google.com/store/apps/details?id=com.polleverywhere.mobile",
"package" : "com.polleverywhere.mobile",
"category" : "Communication",
"description" : "Respond to live Poll Everywhere activities with the Poll Everywhere app for Android. Sign in and register with speakers for attendance or graded questions. Review your response history and check correctness. Download Poll Everywhere for Android today, and be ready for your next interactive class or event.  ABOUT POLL EVERYWHERE Poll Everywhere adds live audience interaction to slideware so presenters can deliver effective, engaging presentations. Its a web-based audience response system that lets speakers embed interactive activities directly into their presentations. The audience responds using the app, a private response page, or via SMS texting. The results update in real time for all to see.  ABOUT POLL EVERYWHERE FOR ANDROID This mobile app is the perfect audience companion for a Poll Everywhere presentation. Students and audience members respond to polls from the app on their phones or tablets. Participants can sign in to track their attendance or graded response scores. Individual response histories are saved in the app.  POLL EVERYWHERE FOR ANDROID KEY FEATURES >> Sign in or create an account to track attendance and assessment >> Easily access recurring presenter sessions >> Review your response history and check correctness >> Respond to Poll Everywhere questions on your phone or tablet >> Keep track of the current question. The app updates automatically when the presenter starts a new activity.  Poll Everywhere is used by millions of audience members and students every year. Its trusted by over 60 percent of the Fortune 500, along with more than 300,000 educators worldwide, during meetings, classes, and events. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_CREDENTIALS', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'com.android.vending.BILLING']",
}