{
"name" : "Email - Mail Mailbox",
"url" : "https://play.google.com/store/apps/details?id=com.tohsoft.mail.email.emailclient",
"package" : "com.tohsoft.mail.email.emailclient",
"category" : "Communication",
"description" : "Email is your email fastest tracking application, the best check mail application. This application gives you to login for all your other accounts. The best feature is auto detect server, we will detect server of your all emails  This application allows you to log into various mail accounts, track emails at once and has the ability to manage an unlimited number of messages coming from your friends, suppliers, and customers.   The interface of the application is beautifully designed, corresponding to the Android operating system, IOS of all smartphones, tablets, ...  With the auto-update feature of your best mail server, send the fastest mail notifications to the user, you are experiencing a strong unified account packaged in an intuitive and easy-to-use design. This is the application provides the fastest mail check service, absolutely free when used.  - Support for accounts: Gmail, Yahoo Mail, Outlook mail, Hotmail, Live mail, Yandex mail, iCloud mail, Office 365 mail, AOL, MSN mail, Live, ymail, Mail.ru, GMX, mail.com, Hushmail, Zoho, Web.de, QIP, Rambler... - Support for IMAP, POP3 + Exchange (ActiveSync & EWS) Auto Configuration - Sync multiple mailboxes from all your providers in a Unified Interface - Support notification when new email coming - Material Design & Lollipop - The fastest email notification on smart mobile devices - Check mail quickly and accurately - Customizable email notification sounds - Alerts and other preferences per each of your accounts. - Define & Share Groups to quickly send and receive emails - With automatic switch between day & night modes - Integrated with any printer supported by Android such as select plugins - Track your mail in anywhere when connected to the internet - Make check email convenient and easy - Customize your swipe menu and email view actions with what matter to you the most - See if you have a new email in your inbox directly from your home screen - Daily sync: Customized for offline use - Sign in to your gmail account and check your email inbox fastest in seconds - Quickly mark emails to be handled later and set reminders so you do not miss them - When you have read and finish handling an email, you can just mark it as done to get it out of the way without having to delete it or reach Zero Inbox by using smart filters.  - Easily filter and track emails by unread/starred - Save time when using email tracking application - The data in your mail is always encrypted to protect the security and confidentiality of information - Secure communications and information, use industry-leading protocols to protect and protect your data. - You can set a lock screen timer to protect your personal email. - Work offline - Auto detect server for all emails, not need to configure the server. This application will auto detect and find server to login with every account.  By this e mail application, easiest way to login and protect all your mail: Gmail, Yahoo Mail, Outlook mail, Hotmail, Live mail, Yandex mail... ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_APP_BADGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.GET_ACCOUNTS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.USE_FINGERPRINT', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.CHANGE_WIFI_STATE', 'com.htc.launcher.permission.READ_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.oppo.launcher.permission.READ_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING']",
}