{
"name" : "PhoneClub – International Calling",
"url" : "https://play.google.com/store/apps/details?id=com.phoneclub.ui",
"package" : "com.phoneclub.ui",
"category" : "Communication",
"description" : "Get the lowest international calling rates on the market with PhoneClub app. Make cheap international calls at great quality and no extra fees. Join PhoneClub community and save money while calling cheap abroad. Use your own contacts list to make cheap calls worldwide. NEW! Offline Calling - this feature is meant to allow app users to connect calls without Internet connection WiFi or 3G/4G-LTE, through local access numbers. This feature will help you call any contact number without Internet connection. For any international contact you may need to call, a local phone number will be instantly made available for you.  DOWNLOAD FOR FREE and get:   Cheap(est) Rates for international calls  No Hidden Fees  Minute Rounding  Try it for as low as $2  Balance never expires  Buy credit in app  100% Call Quality  Access from any Android device  Direct access to your contacts  24/7 Customer Service  EASY TO USE:  1. Create an account or login  2. Buy Voice Credit if you dont have a PIN yet 3. Start calling or texting  EXTRA OPTIONS:  International Rates *Check whats the rate/min for the destination you want to call in our More >> Rates  section!  Help Center *Check out the answer to our frequently asked questions in our More >> Help Center  section.  Set my Caller ID *Let your friends know whos calling them! Set your Caller ID directly from the More  section of the app.  Rate our app *We value your opinion. Please let us know if you like our app!   ADDITIONAL FEATURES:   Use your own contacts list  Create new account from the app  Use Speed Dial to call your favorite numbers faster  Buy Voice Credit directly from the app  Set Auto Recharge on PhoneClub.com to make sure you never run out of credit  BACKUP ACCESS METHOD:  Use our Local Access or Toll Free Numbers from any mobile or landline phone.  We recommend that you turn off international calling with your mobile provider. This way there will be no risk to make international calls or long distance calls by accident using your current provider at much higher rates.  Having issues with our PhoneClub application? Please email us at customerservice@phoneclub.com. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.RECORD_AUDIO', 'android.permission.INTERNET', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_ACCOUNTS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.WRITE_CONTACTS', 'android.permission.WRITE_SYNC_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.READ_CONTACTS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.BLUETOOTH']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS']",
}