{
"name" : "ProfiMail Go - email client",
"url" : "https://play.google.com/store/apps/details?id=com.lonelycatgames.PM",
"package" : "com.lonelycatgames.PM",
"category" : "Communication",
"description" : "ProfiMail Go is a complete rework of once popular ProfiMail for Symbian and Windows Mobile systems, now exclusively for Android phones and tablets. We have reworked every piece of ProfiMail to make it run natively on Android.  With years of experience in developing an email client for mobile devices, we listened to many requests which were asked many times, but could not be incorporated into older version of ProfiMail. With such amazing mobile operating system as Android, most of requests were possible, and we have added even more.  Free version works for one account. To use with multiple accounts, we offer license for one-time at reasonable price.  Features:   Folders tree hierarchy - see all accounts and their folders in a tree view  Signatures - add your signature to composed message, automatically or manually  Rules - conditions and actions applied automatically on incoming messages  S/MIME cryptography - mail encryption and digital signatures   Combined folder - see messages from multiple folders in one place  Conversations and Threads - see related messages in a conversation in a tree view  Rich text message composer - add images, colors and smileys to your messages  Widget - see new messages on Home screen or lock screen  Multiple panes - see more on large screens  Full-text search - find any message on your device  Integration with X-plore - uses our free file manager for working with images, sounds, and other files  Tight integration with Android - make calls, open websites, share content, whatever  Fully automatic or manual work - check mail any way you like  Push mail - using IMAP IDLE to connect to any IMAP folders that you wish  Configurable - you choose how much/what/when to download and how to be notified about it  Attachments - shown in nice list, with icons, images with thumbnails  Works in background - you can do other tasks while mail is downloaded or sent ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.GET_ACCOUNTS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_CONTACTS', 'com.sec.android.provider.badge.permission.READ', 'com.google.android.c2dm.permission.RECEIVE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.android.vending.BILLING', 'android.permission.FOREGROUND_SERVICE', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}