{
"name" : "LSApp",
"url" : "https://play.google.com/store/apps/details?id=com.lsapp",
"package" : "com.lsapp",
"category" : "Communication",
"description" : "LSApp es una aplicacin gratuita, conceptualizada y diseada por Vanesa Barn, con el objetivo de mejorar la calidad de vida de las personas Sordas, facilitando el aprendizaje de la Lengua de Seas Argentina (LSA). Para la concrecin de este aporte a la sociedad, recibi apoyo de Posibillian Tech para el desarrollo informtico, Florencia Roth en el diseo as como el apoyo de ASO (Asociacin Argentina de Sordos) en la validacin de las seas y la experiencia de usuarios.  Funcionalidades: 1. Buscador de seas, que pasa de Espaol a LSA. 2. Juego para facilitar la prctica de LSA. 3. Consejos para comunicarse adecuadamente con personas Sordas.  LSApp es sencillo y no necesita de Internet para ser utilizado. Una vez descargada la aplicacin en tu dispositivo, simplemente la usas cuando la necesitas.  Por qu LSApp? Al momento de relacionarse con personas Sordas que se comunican con una lengua de seas en Argentina, corresponde recordar que su idioma primario y natural es LSA. Estas personas, pueden conocer otros medios alternativos de comunicacin, como leer los labios de quien habla Espaol, pero su idioma natural ser siempre LSA, por lo que LSApp permite una mejor comunicacin, brindando inclusin social a las personas Sordas. LSApp is a free application, conceptualized and designed by Vanesa Barn, with the aim of improving the quality of life of Deaf people, facilitating the learning of the Sign Language Argentina (LSA). For the realization of this contribution to society, received support from Posibillian Tech for computer development, Florence Roth in the design as well as the support of ASO (Argentine Association of the Deaf) in the validation of the signs and user experience.  Functionalities: 1. Sign Finder, which passes from Spanish to LSA. 2. Game to facilitate the practice of LSA. 3. Tips to communicate properly with Deaf people.  LSApp is simple and does not need Internet to be used. Once the application is downloaded to your device, you simply use it when you need it.  Why LSApp? When relating to Deaf people who communicate with a sign language in Argentina, it should be remembered that their primary and natural language is LSA. These people can know other alternative means of communication, such as reading the lips of someone who speaks Spanish, but their natural language will always be LSA, so LSApp allows better communication, providing social inclusion to Deaf people. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'com.lsapp.permission.C2D_MESSAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION']",
}