{
"name" : "Auto Reply for whats - AutoRespond Bot",
"url" : "https://play.google.com/store/apps/details?id=com.pransuinc.autoreply",
"package" : "com.pransuinc.autoreply",
"category" : "Communication",
"description" : "It can send reply automatically to individual Person, Group and Client etc. You can also able to create campaign for your customer support.  Advantages:   Auto Reply for whats.  Auto Reply Access from Website.  Create your own Auto Reply chat bot   Its easily to use and simple user interface than any other apps in the world.   No more technical skills required for build your own bot.  Support multiple whats apps Like WA Official, WA Business etc.  Create custom reply message patterns like Exact match, Contain, Start with, End with and many more...  Reply messages with tags.  It can also support to send Multiple reply options like One, All and Random.  Reply messages with delay.  Reply to options like individual Person, Groups and both.  Reply Specific contacts or groups.  Ignore Specific contacts or groups.  Schedule specific Day and time to turn On and Off automatically to send auto reply to your incoming messages. This feature is useful when youre busy or work away.  Repeat reply message between 1 to 99 times.  Create custom tags.  Save whats Image and Video status.  Start chat with any person without save contact.  Pause rule for contact.  Backup your AutoReply rules to your phone or share it, you can Restore rules whenever you want.  Send reply with 55+ different fancy font.  Type only one time and repeat it as many times you want.  24 awesome different themes, you can set it as you want.   Dialogflow (api.ai) with API V2.  Create more powerful conversations with own API. Connect Auto Reply app with your system via rest api.  Multiple receive message patterns.  Not match pattern option. Note: This app is Not affiliated with the WhatsApp. WhatsApp is a registered Trademark of WhatsApp Inc. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.RECORD_AUDIO', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.google.android.c2dm.permission.RECEIVE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.ACCESS_WIFI_STATE']",
}