{
"name" : "Yahoo Mail – Organized Email",
"url" : "https://play.google.com/store/apps/details?id=com.yahoo.mobile.client.android.mail",
"package" : "com.yahoo.mobile.client.android.mail",
"category" : "Communication",
"description" : "Thanks for checking out the Yahoo Mail appthe best email app to organize your Gmail, Microsoft Outlook, AOL, AT&T and Yahoo mailboxes. Whether you need a clutter-free mailbox, added customization, different views for deals, receipts, and attachments, or even more storage, weve got you covered.   Favorite features:  Use any email address Dont make your other inboxes jelly. Add your Gmail, Outlook or AOL account and keep everything in one place. Custom settings, colors and notifications make it a breeze to keep your accounts separate.  Unsubscribe Go forth and unsubscribe from the spam and junk mail you dont want to see in your inbox. Yahoo Mail shows all the mailing lists youre subscribed to on one screen and makes it easy to opt-out in one tap.  Attachments view  Looking for that one doc from that one person? Or, a photo from brunch three Sundays ago? Dont panic, Its right here. See all of your photos and files attachments in one easy view.  Customization Your inbox, your vibe. Customize the bottom nav bar with the folders and views you care about most. Then, pick custom sounds, themes, swipes to add your own flavor and unboring your inbox.   Travel view Travel stress-free. This view keeps all of your flight information in one organized spot. Smart Updates, from gate changes to delays and cancellations, will instantly appear in the app, so once you check inyou can check waaaaaay out.  Deals view Expires today? Challenge accepted. See the deals from your inbox in one quick view or enable location permissions to see a map of deals near you and get notified in real-time as you walk into your favorite stores.  Groceries view Win at groceries, every time. Add your grocery store loyalty cards to save coupons that will automatically get applied at checkout. To save even more, see all the deals in your area and save them to your shopping list.  People view Only see emails from your favorite people. Ignore the robots.  Receipts view No more crumpled receipts in your pocket. Find them neatly organized in your inbox.   Sounds + notifications Choose from several categories of notifications, custom sound alerts and visual settingsso, you get the reminders you need. And none you dont.   Accessibility Features high contrast themes, dynamic text resizing, and optimized for use with VoiceOver screen readers. Plus, folders at the bottom of the Inbox allow assistive technology users to navigate with less effort.  1000 GB storage You cant see your whole world without room to roam. Download the app and youll never have to delete memories to get your mail again.  Yahoo Mail Pro Get ad-free mail on Yahoo Mail for Android and priority customer support.  + Available as an in-app purchase at $0.99/month or $9.99/year + Subscription will auto-renew each month or year within 24 hours of your renewal date + Manage or cancel your subscription via Account Settings  Terms of service: https://policies.yahoo.com/us/en/yahoo/terms/product-atos/comms-mailadfree/index.htm  Privacy policy: https://policies.yahoo.com/us/en/yahoo/privacy/products/mail/index.htm ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'com.yahoo.mobile.client.android.mail.permission.RECEIVE_ADM_MESSAGE', 'android.permission.WAKE_LOCK', 'android.permission.READ_SYNC_STATS', 'com.amazon.device.messaging.permission.RECEIVE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'com.yahoo.mobile.client.android.permissions.YAHOO_INTER_APP', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.USE_BIOMETRIC', 'android.permission.INTERNET', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SYNC_SETTINGS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.yahoo.mobile.client.android.mail.permission.RECEIVE_ADM_MESSAGE', 'com.yahoo.mobile.client.android.permissions.YAHOO_INTER_APP', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS']",
}