{
"name" : "Nox Browser - Fast & Safe Web Browser, Privacy",
"url" : "https://play.google.com/store/apps/details?id=com.noxgroup.app.browser",
"package" : "com.noxgroup.app.browser",
"category" : "Communication",
"description" : "Nox Browser (     ) is your best choice for the Android browser complete with features such as incognito mode, history, and bookmark lock, threat interception, AD blocking, downloading tools, night mode, multiple tabs, search engines choices, offline browsing, and many more! It can bring you a fast and secure web browsing experience! Say goodbye to the regular slow internet and enjoy high-quality browsing with Nox Browser!  NOX BROWSER HIGHLIGHTS:   Incognito mode: protect private data from trackers  Safe Browsing: protect your devices from virus, malware, and tracking   AD Block: block annoying ads on main sites  Download manager: get the video, file, song easily  Night Mode: protect eyes with reading mode  Multiple Tabs: access multiple tabs simultaneously  Offline Browsing: save your favorite pages to read later  Naked Mode: save your network traffic data  Switch search engine: provide more choices for search engine  Smart Browsing Experience: provide contents that are tailored to your interests  NOX BROWSER FEATURES & CAPABILITIES:   INCOGNITO MODE Nox Browser for Android makes private browsing simply and to accomplish history-free browsing. Whenever you are in the mood to go off the records on the browser for Android, just open up the settings panel by taping the menu and select the option New Incognito Tab. You can now browse freely on the new incognito tab without leaving any browsing history, search history, and cookies data. Otherwise, there is also a private lock that can protect your private data in the incognito mode. With the private lock, nobody can view your data, and you can enjoy the real private browsing world.   SAFE BROWSING Nox Browser examines billions of URLs and content and warns users when they navigate to unsafe sites. Protect mobile devices against the virus, malware, and tracking.  AD BLOCK: Block annoying and intrusive ads, Nox Browser enables you to have an advertisement free web experience to see more of the content that matters to you.   DOWNLOAD MANAGER Nox Browser download management feature can help you easily access and view information of downloads. It shows downloads progress with pause, resume and cancel options, furthermore, it downloads files in parallel to increase and accelerate the transfer speed.   PROTECT YOUR EYES The Night Mode feature of Nox Browser can change your screen into natural color and protect your eyes so it can reduce the blue light which will affect your sleep. It can help to avoid headache and eye pain in a dark environment or at night effectively.   MULTI-TAB BROWSER Nox Browser can help you set multiple tabs browsing so that all your favorite websites can automatically start loading every time you launch your browser. You can also open more web pages at the same time! Easily create new tabs by long-pressing the tab button and new tabs will be opened, create as many tabs as you want!    SWITCH SEARCH ENGINE Nox Browser automatically uses Google as the default search engine in the browser tab, and it is possible to change the default search engine to any search engine of your choices, such as Yahoo, Bing, and Baidu. Keyword search suggestions and the personalized search ability to do the quick search in many search engines.   SMART BROWSING EXPERIENCE Nox Browser offers a fast browsing experience. Users can find the article that browser selected based on users previous browsing history, and give access to top sites, spend your time browsing your favorites sites and contents instead of looking for them.  --------------------------- If you like our application, please rate 5 stars  More and more features will be added in the future, so dont miss it. Share your thoughts on our https://www.facebook.com/NoxBrowser/ or send e-mail to us noxbrowser@bignox.com ",
"desc_perms" : "['android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.REQUEST_INSTALL_PACKAGES', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_GPS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.WAKE_LOCK', 'android.permission.RECORD_AUDIO', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_ASSISTED_GPS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CAMERA', 'android.permission.ACCESS_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_CREDENTIALS', 'android.permission.FOREGROUND_SERVICE']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.BROADCAST_STICKY']" 
"extra_perms" : "['android.permission.ACCESS_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_ASSISTED_GPS', 'android.permission.ACCESS_GPS']",
}