{
"name" : "AntiVirus for Android Security 2020-Virus Cleaner",
"url" : "https://play.google.com/store/apps/details?id=com.androhelm.antivirus.free2",
"package" : "com.androhelm.antivirus.free2",
"category" : "Communication",
"description" : "AntiVirus for Android protect your phone against viruses & other types of malware with AndroHelm Mobile Security. Free Security Protection for Android Phone with App Lock, Speed Booster, Anti Spyware, Virus Remover, App Permissions advisor. Download for Free Now!  People from all over the world installed AndroHelms antivirus mobile security apps.  AndroHelm Antiviruss Key Features:   Security & Antivirus  Powerful virus detection  Booster  Boost your mobile.  App Lock  Lock your sensitive apps.  SD-card scan  Scan your SD-card.  Privacy protector  Permissions advisor.  Traffic monitoring  Data usage stats.  Wi-Fi Security  Protect online safety.  Ad detector  Find apps that contain ads.  Scheduled Scan  Scan your phone automatically on-schedule.  Regular database updates  Up-to-date database and protection  Backups  Make a copy of your data.  Applications Manager  Easily manage your applications.   Security & Antivirus Scan installed applications, SD card and new apps automatically. Protect your device against viruses and malware.  Phone Speed Booster Accelerate & Boost your Phone. Get it running faster and smoother. Improve your phone performance with one tap acceleration booster  App-Lock Lock your private apps by using a PIN password. Take care of your sensitive data and keep your secrets safe from snoopers.  Privacy protector Permissions advisor. Check your installed apps permissions and influence on the phone.  Traffic monitoring Take care of your Wi-Fi and Mobile traffic. View live usage stats. Wi-Fi Security Scan Wi-Fi networks for threats. Check security of Wi-Fi network you are connected to. Ad detector Find the apps that may contain advertising.  Scheduled Virus Scan  Automatically scan your device daily or weekl Regular database updates Keep your Android device stay in sync with the up-to-date threat database so you stay protected from the latest security threats.  Data Backup (Local and in Cloud)  Make a backup copy of your data and restore it in case of need. Applications manager Manage installed applications. View the list of installed apps and delete the ones that you dont need. 24/7 Technical Support If you have any question contact us at contact@androhelm.com   This app uses the Device Administrator permission. ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CONTACTS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'android.permission.GET_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.VIBRATE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.android.vending.BILLING', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.CAMERA', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.REQUEST_DELETE_PACKAGES']",
"perms_with_call" : "['android.permission.WAKE_LOCK', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.PACKAGE_USAGE_STATS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_FINE_LOCATION', 'com.android.vending.BILLING', 'android.permission.REQUEST_DELETE_PACKAGES']",
}