{
"name" : "Newton Mail - Email App for Gmail, Outlook, IMAP",
"url" : "https://play.google.com/store/apps/details?id=com.cloudmagic.mail",
"package" : "com.cloudmagic.mail",
"category" : "Communication",
"description" : "Newton mail supercharges your email at less than the price of a cup of coffee.   ***Two Times Webby Winner For the Best Designed App*** & Numerous other awards.  Loved by critics, press, and thousands of subscribers from across the globe.  Ive replaced my iPhone and Android apps with Newton. Its the best overall option with its reminders, improved search, cross-app cooperation and support for many email providers - Joanna Stern, WSJ With Newton, youll be amazed how much more productive your emailing on the go gets - Allison Stadd, TIME Excellent option if you use multiple platforms, particularly if you value minimalism - Nathan Ingram, Engadget  Newton is the email app that you will still be using five years from now. - Jack Busch, Groovy Post  Theres Still Hope For Email - Jared Newman, Fast Company  My favorite email app for Mac and the iPhone - Lory Gil, iMore  Declutter your busy-inbox. Unleash Speed. Communicate Better.   Newton helps busy professionals and teams go through their email twice as fast. Cutting down complexity with a minimal interface helps professionals manage emails with a smile.  Works with Gmail, Exchange, Yahoo Mail, Hotmail/Outlook, iCloud, Google Apps, Office 365 and all IMAP accounts.  Sign Up Once, Use Everywhere  Use your Newton account to instantly access your email anytime, across ALL your devices - be it iPhone, iPad, PC or Mac. Email preferences & settings are synced magically on every device, without having to set up your account all over again.   Why Newton is the only email app you need  Read Receipts Email tracking to get read-status for every email you send. Also, get notified as soon as the email is read. Know exactly who read your email with individual mail tracking.  Send Later Schedule emails to be sent later and have them delivered to the recipients inbox at just the right moment.  Tidy Inbox Focus on emails that matter. Weed out newsletters and social media emails to another folder and make your inbox distraction-free. Think Gmail tabs for all email accounts.  Snooze Set your emails to come back to Inbox at a more convenient time. Snooze emails, not productivity.  Connected Apps Finish your workflow without leaving your email. Add important emails to your favorite productivity apps like Todoist, Evernote, OneNote, Pocket, Trello, Wunderlist, Instapaper & more.  Undo Send Pull back that email blunder you just sent. Especially useful when youre on mobile and need to reply in a hurry.  Recap Recap automatically brings back conversations that are waiting for your reply or that need following up. It also covers other mails with due dates, reminders etc., so that nothing slips through the cracks. (Available only in English)  Instant push notifications for ALL types of email Gmail, Hotmail/Outlook, Exchange, Yahoo Mail, iCloud, Google Apps, Office 365 and any IMAP account.  Save attachments  Add your favorite cloud storage service like Google Drive, Box, Dropbox, OneDrive etc. with ease.  And much more...   2-factor authentication  One-click Unsubscribe  Custom Inbox Swipes  Handoff  HTML signatures  Email Aliases  Print emails  Turn on/off Conversations  Touch ID  Custom Folder Sync  Spotlight Search  3D Touch  Remote Wipe  Passcode Lock  Unified Inbox  Available in major languages   Newton Mail has a companion in the Newton Calendar. Download the app, and all your events/calendars will sync automatically. Works with Google and Exchange (EWS) calendars.    Privacy, Promised!    Newton does NOT track your location.   NO in-app targeted Ads  PRIVACY GUARANTEE Newton is ad-free and does not rent, sell, distribute or monetize on your data. To anyone. Ever.  Have Questions?  Shoot us at hello@newtonhq.com  Thanks to everyone for showing love and support. Love Newton App? Rate us or leave the reviews!  ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['com.cloudmagic.mail.permission.C2D_MESSAGE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.USE_FINGERPRINT', 'com.android.vending.BILLING', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.VIBRATE', 'android.permission.READ_CALENDAR', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.INTERNET', 'com.sec.android.provider.badge.permission.READ', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.READ_CONTACTS', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.READ_SYNC_STATS', 'android.permission.ACCESS_NETWORK_STATE', 'com.anddoes.launcher.permission.UPDATE_COUNT']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.SET_WALLPAPER', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.CHANGE_WIFI_STATE']" 
"extra_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_CALENDAR']",
}