{
"name" : "Translate Different Languages - Camera Translators",
"url" : "https://play.google.com/store/apps/details?id=com.translate.different.languages.camera.translators",
"package" : "com.translate.different.languages.camera.translators",
"category" : "Communication",
"description" : "Translate all Languages by using this unique Voice, Camera & Text translation App. It translates different languages depending upon your needs. If you are a tourist travelling across the world and exploring different places or a student or a business traveler, it helps you learn different languages by translating back into your native language. This is the best app that uses different mediums to translate your words into the desired language. All languages free Translator uses speak & voice inputs so that you can speak to your gadget and it returns the results in the selected language. Our apps Camera Translator also enable you to make the most of your devices camera and use it to take pictures of the text you want to be translated. Weve embedded this app with myriads of different languages used in the world so that where ever you go our app follows. Translator is incredible free app for voice translation, camera translation & conversation. It has the essential elements to make easy, fast, precise and accurate translations to blow the language gap. Language Translator is a simple voice translator but a complete solution of English language translation. App includes voice to voice translator, camera translators & text translator. All Language Translator 2020 enables you to learn all international languages by translation them in your own language. Download free translation app and make you of all its features depending upon you needs. Our online speech to text app gives you the user interface to speak to the app and then it translates. It also houses a chat translation options to help you communicate with people with different languages. Language Translator & Camera Translator App is a free Multi language Translate app consisting of very useful translator tools to remove communication gap using language translator to translate different languages in the world. Voice translator & camera translator is free to download application that immediately translates and is easily accessible by all types of different users. Translate Different Languages & Camera Translators takes notes easily by speaking in different languages voice translator free app. New language translator used for transcription, interpretation, language interpreter with words, text to speech, different language sentence. The translated text can be copied and it can be shared on social media in this camera translator app. You will enjoy best features such as text-to-speech and voice to text translation. Spell Checker feature make this language translator app more accurate, fast and perfect translation app & chat translation app. Open the application enters your text to speech, or use the microphone for the spoken language and the translation is ready to listen or share. Language Translator Main Features:  Best voice translator translates audio in different languages.  Speak & translate is useful app fast translations.  Share different languages translator with friends and family.  Enjoy translation app text-to-speech in combined social media.  Language translator supported in text to speech & voice translator.  Voice translator app to translate between multiple languages.  Unique features like copy/paste, delete message & history.  Spell Checker option in camera translator app. ",
"desc_perms" : "['android.permission.CAMERA', 'android.permission.RECORD_AUDIO', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE']",
"manifest_perms" : "['com.android.vending.BILLING', 'android.permission.WAKE_LOCK', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'com.android.vending.BILLING', 'android.permission.ACCESS_FINE_LOCATION']",
}