{
"name" : "Sticker Maker : Whatsapp Sticker Maker",
"url" : "https://play.google.com/store/apps/details?id=com.stickers.creator.whatsapp",
"package" : "com.stickers.creator.whatsapp",
"category" : "Communication",
"description" : "Create your own personal whatsapp Sticker, use memes, or your own photos to create custom whatsapp Stickers.  Sticker Maker for create WhatsApp Stickers with your own photos or memes !   Do you Love WhastApp Stickers and making WhastApp Stickers? Of course!, WhastApp Stickers are fun. Ever wanted to create WhatsApp Stickers, When you come across your friends Sticker Studio? You are at the right app Page for whatsapp Sticker Maker.  This Whatsapp Stickers Maker app Function is helping you make Stickers and having your own Stickers Studio. see your Friends gorgeous or hilarious whatsapp Stickers are made with Sticker creator. You Like Your Friends whatsapp Stickers then Use Our Sticker Maker for whatsapp and create custom whatsapp Stickers.  By using this Sticker Maker for whatsapp you can make your own whatsapp Stickers with your own personal photos or memes and impress your friends with your own whatsapp Sticker Studio. Now its easy to make whatsapp Stikers or wtstick, whatsapp stickers Studio. No need to ask your friends where they get their whatsapp Stickers.  Surprise your friends or family member with your whatsapp Sticker Studio, and send your custom Stickers to your whatsapp friends. Its easy to make your own custom Sticker. All you have to do is Install watsapp Sticker Maker, and do the following:- 1. Open Sticker Creator 2. Add photos with free hand crop feature 3. Add Text and Sticker 4. Save to your own whatsapp sticker packs 5. Publish and Enjoy !  Features :   Free hand crop photos You can crop face and any object in a photo using free hand mode with magnifying glass support   Reuseable cropped photos You can reuse all the cropped photo to create another whatsapp sticker   Text and Sticker 1. Add text for your whatsapp stickers, with many fonts choices for the text editing. 2. Add stylish stickers and emojis for your custom whatsapp sticker 3. You can add those text, emoji, and sticker then combine it into 1 funny WhatsApp stickers Note : Please make sure you already using the latest WhatsApp that support stickers.    Disclaimer: This app is not affiliated with WHATSAPP.  To develop Status Sticker Maker for WhatsApp app I worked hard and with love. For more, you can send me your suggestions.  Important: WhatsApp name is copyright to WhatsApp,Inc. This whatsapp Sticker creator is in no way affiliated with, sponsored or endorsed by WhatsApp, Inc. The content created by users using this Whatsapp Sticker Maker are stored on their own phones and our Sticker Maker for whatsapp cannot view, manage or delete them. Users are responsible for the content created by themselves. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.CAMERA', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.INTERNET', 'android.permission.KILL_BACKGROUND_PROCESSES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'com.stickers.creator.whatsapp.permission.C2D_MESSAGE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_INTERNAL_STORAGE', 'android.permission.KILL_BACKGROUND_PROCESSES']",
}