{
"name" : "Phoner 2nd Phone Number + Texting & Calling App",
"url" : "https://play.google.com/store/apps/details?id=com.appsverse.phoner",
"package" : "com.appsverse.phoner",
"category" : "Communication",
"description" : "Download Phoner app for FREE to send text messages and calls. Add a 2nd phone number for your business or social life to protect the privacy of your own personal phone number.   Phoner gives you multiple new second phone numbers so you can have different numbers for your personal, business and social life.  Phoner 2nd new phone number allows you to get a free burner number to call or text anonymously when you are uncomfortable in revealing your main phone number in situations such as buying/selling on Craigslist. Use Phoner as your secure and private texting and calling app!   Phoner supports call recording for both incoming and outgoing call. You can perform phone number lookups to identify caller ID before you even pick up the phone or reply to a text message. You can look up the number of the caller prior to accepting an incoming call to detect robo caller, spoof callers or spam calls.   *** Why Phoner 2nd phone number app? ***  Whether you are a lawyer, banker, Uber driver, cab driver, buyer or seller on Craigslist or Ebay, police officer , you probably need to give out your phone number to someone you hardly know for them to text or call you. You do not want to give out your personal phone number. With Phoner Second Phone Number app, you can add different phone numbers for your various needs and give them out without compromising your real personal number. Phoner allows you to add your phone number for your Android phones. Add disposable phone numbers for incoming , outgoing calls and text messages for your different businesses and social life.  *** What is Phoner Private Phone and Text? ***  Phoner second phone number allows you to get private phone numbers for text messages and calls. Instead of buying a burner phone each time, Phoner allows you to burn your phone number each time you do not need it and then get another new one.  *** Who uses Phoner? ***   People who values private conversations and privacy during texting and calling  People who wants to protect their text messages and protect their real caller ID for privacy.  Professionals such as lawyers, bankers, police officers, teachers, sales person now can separate their work phone number from their personal number by getting a second phone line..  International calling and texting and international phone numbers from over 20+ countries such as US, Canada, Australia, UK and France  Websites, app and service registrations that requires a second phone number  Buying and selling on Amazon, Ebay, Craigslist, Etsy, and other ecommerce sites  Separate 2nd phone line for your office  Call Recorder for Android. You can now record phone call and conversations.   Reverse Number Lookup support ensures you can identify the caller ID and perform a phone number lookup on anonymous caller before you even pick up the call.  Disposable burner phone numbers for dating networks such as Tinder, Match, Zoosk, Plenty Of Fish (POF), Grindr, etc  Registration on websites and other apps  Needs multiple disposable burner numbers that can be burn after use  New alternate phone number for business call & text  Customize your voice mail  *** Phoner Phone Features *** + Choose any area code and get a temporary premium number + Detect anonymous callers and lookup their information before accepting + Temporary or permanent different second, third and fourth multiple phone numbers all centralized and managed in the same app + Burner Phone numbers to block and filter your various communication. Block further communications by burning your phone number when you are done.  Please use call recorder feature responsibly. You need to comply with local, state, national and any international law with regards to call recordings. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_CALL_LOG', 'android.permission.RECORD_AUDIO', 'android.permission.SEND_SMS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.FOREGROUND_SERVICE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.RECORD_AUDIO', 'com.android.vending.CHECK_LICENSE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE']" 
"extra_perms" : "['com.android.vending.CHECK_LICENSE', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.ACCESS_FINE_LOCATION']",
}