{
"name" : "Enterprise FlowCrypt",
"url" : "https://play.google.com/store/apps/details?id=com.flowcrypt.email.enterprise",
"package" : "com.flowcrypt.email.enterprise",
"category" : "Communication",
"description" : "Enterprise version of FlowCrypt Android App.  Core functionality (android)  Import OpenPGP private keys created by customers legacy software (not implemented yet) Send OpenPGP encrypted emails to other FlowCrypt users Send OpenPGP encrypted attachments to other FlowCrypt users (not implemented yet) Decrypt and view OpenPGP encrypted emails received from other FlowCrypt users Decrypt and download OpenPGP encrypted attachments received from other FlowCrypt users (not implemented yet)  Additional functionality (android)  Manually change or update public keys in application Contacts (not implemented yet) View information about users public key (not implemented yet) Look up public keys of other FlowCrypt users Verify that public key records match installed private key  Known limitations (android)  Attachments cannot exceed 3MB per email Messages and attachments encrypted for public key that does not match users private key cannot be opened Messages and keys not strictly adhering to OpenPGP standard may not be supported Certain Android System settings may cause FlowCrypt Android App to stop functioning. Rigorous testing is strongly recommended before deploying changes to Android settings. May not be compatible with all OpenPGP software from other vendors. Before FlowCrypt Android App is available in production stable version, it may contain security flaws, be slow, unstable and may not work as intended. ",
"desc_perms" : "['android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_NETWORK_STATE']",
"manifest_perms" : "['android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION']",
}