{
"name" : "Bria Mobile: VoIP Business Communication Softphone",
"url" : "https://play.google.com/store/apps/details?id=com.counterpath.bria",
"package" : "com.counterpath.bria",
"category" : "Communication",
"description" : "Android Softphone App for VoIP and SIP voice and video calls, instant messaging and more! Try it free for 14 days! Subscription not charged if cancelled within trial.  Bria Mobile is new and replaces the former Bria Android Smartphone Edition and Tablet Edition clients. If you had previously purchased the old clients and want to reinstall them, you can find the instructions to do so here: https://support.counterpath.com/hc/en-us/articles/115004178833-Install-Bria-for-Android-Android-Tablet-from-App-Library  Stay connected wherever you go. Start or join meetings with high definition, face-to-face video, high quality audio, and instant messaging - now with Bria Push Service for enhanced battery life.   Bria Mobile is an award-winning softphone that increases your business productivity by streamlining business communication across mobile devices and teams. Whether you are a small start-up or a global enterprise, take the power of this award-winning softphone with you  at work, at home or anywhere in-between to ensure you stay connected and more productive.   Use the new Bria Mobile app to:  Message or call any person or group within your team for fluid business communication  Join team meetings easily using voice and video calling  Technical Features Highlights:  Thoughtfully innovated, with over 10 years of technology development, Bria Mobile is now available either monthly or on an annual basis, which includes ongoing updates, Bria Push Service (for enhanced battery life), high definition video calling, G.729 and other Wideband Codecs (previously paid add-ons).   Highly secure, SIP-based softphone with exceptional voice quality  Pre-defined VoIP provider list available when adding new accounts  Multi-tasking support for background operation, such as fielding incoming calls while using other applications  HD Audio Codecs including G.722, Opus and SILK  Video in 720p HD when using H.264 or VP8 on supported devices  Supported accessories include headsets, headphone, as well as other BluetoothTM devices   Available English, Chinese, French, Japanese, Portuguese, Russian, German and Spanish  IPv4 and IPv6 support, including NAT64  For More information on Bria Mobile for Android features, please visit: http://www.counterpath.com/android-sip-softphone/   IMPORTANT NOTE Bria Mobile is a standalone softphone subscription and not a VoIP service. A SIP server or subscription with a SIP-based VoIP provider is required to make calls. See https://www.counterpath.com/itsp-partner-program/?tab=itsp_certified_partners to see some of the many providers that support Bria Mobile.   IMPORTANT VOIP OVER MOBILE/CELLULAR DATA NOTICE Some mobile network operators may prohibit or restrict the use of VoIP functionality over their network and may also impose additional fees, or other charges in connection with VoIP. You agree to learn and abide by your cellular carriers network restrictions. CounterPath Corporation will not be held liable for any charges, fees or liability imposed by your carrier for use of VoIP over Mobile/Cellular Data.  EMERGENCY CALLS CounterPaths Bria mobile products provide handling designed to redirect emergency calls to the Native Cellular Dialer when possible on a best reasonable commercial efforts basis, however this functionality is also dependent on the operating system of the mobile phone which is outside of our control and subject to change at any time. As a result, the official position of CounterPath is that CounterPaths Bria product is not intended, designed, or fit for placing, carrying or supporting Emergency Calls. CounterPath will not be liable for any costs or damages arising either directly or indirectly from the use of the software for Emergency Calls. ",
"desc_perms" : "['android.permission.CALL_PHONE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.vending.BILLING', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.BROADCAST_STICKY', 'android.permission.EXPAND_STATUS_BAR', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_NOTIFICATION_POLICY', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECORD_AUDIO', 'android.permission.INTERACT_ACROSS_USERS_FULL', 'android.permission.USE_FINGERPRINT', 'com.android.vending.BILLING', 'android.permission.VIBRATE', 'android.permission.ACCESS_WIFI_STATE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CALL_PHONE', 'android.permission.WAKE_LOCK', 'android.permission.GET_ACCOUNTS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.READ_CONTACTS', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WRITE_SETTINGS', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE']" 
"extra_perms" : "['android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.EXPAND_STATUS_BAR', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.INTERACT_ACROSS_USERS_FULL', 'com.android.vending.BILLING', 'android.permission.DISABLE_KEYGUARD', 'android.permission.SYSTEM_ALERT_WINDOW']",
}