{
"name" : "Call Timer for Oppo",
"url" : "https://play.google.com/store/apps/details?id=ctsoft.androidapps.calltimerop",
"package" : "ctsoft.androidapps.calltimerop",
"category" : "Communication",
"description" : "Call Timer for Oppo can make your phone automatically hang up when your call reaches a configurable predefined time.  Why it is needed? Many network carriers or telecom services offer free calls for first 5, 10, 20, xx minutes. If you dont want to monitoring the elapsed time and manually hang-up the call while talking, then you can have this application do it for you.  NOTICE  OPPO phones:  For Color OS 3.0, 3.1 phones such as Oppo F3, F3 plus, F1s: + Go to Security Center  Privacy permissions  Startup Manager. Then turn on Call Timer to allow it startup in background. + Go to Batery  Batery optimization  Call Timer. Then choose Do not optimize. + Go to Batery  Energy Saver  Call Timer. Then disable Free when in background and Automatically optimize when an Abnormally is detected. For Oppo phones with Color OS 2.1: + Go to Home  Settings  Application Management  Running apps. Lock the app. + Find item Data Saving (either in Security center or in Settings): If enable then add Call Timer to list of background app. + Find item Cleanup (either in Security center or in Settings). add Call Timer to Clean Whitelist.  SAMSUNG phones: in some Samsung phone models such as J7, J5, J3, J2, S7, S7 edge...phone system needs to be initialized (make at least one call) before you can test Call-Timer. If you buy a new phone or you reboot your phone, please make at least one call before installing Call-Timer  SAMSUNG GALAXY, HUAWEI, LENOVO... phones in POWER SAVING MODE: Some phones have power saving feature and this feature may interfere with Call-Timer. If that is your case, please try to reconfigure power saving feature or completely disable power saving mode.  DUAL SIM phones: In order to keep Call-Timer working well on dual SIM phones, you need to configure default SIM card for voice calls AND make calls from that default SIM card. That can be configured via system app Settings (...SIM card).    FEATURES: + Auto hang up: user sets time limit once and the application will be in standby mode; whenever there is an outgoing call or incoming call (optionally), the application will be activated and begin to time the call.  + Periodic notifications: This is useful for people who are charged per minute.  + Multi-call support. Please read more at http://call-timer.blogspot.com/2013/01/multi-call-feature.html + Auto redial. + To be notified before hang-up + Temporarily disable call timer for current call + Widget for fast enable/disable and for dialing most contacted contacts.  NOTE on USAGE: - OPEN THE APP AT LEAST ONCE AFTER INSTALL, otherwise force close error will occur due to first time data is not initialized.  Please send suggestions or report bugs to call-timer@ctsoftsolutions.com.  Thank you! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_PHONE_STATE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.VIBRATE', 'android.permission.CALL_PHONE', 'android.permission.WRITE_CONTACTS', 'android.permission.BLUETOOTH']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}