{
"name" : "mail.fr Mail",
"url" : "https://play.google.com/store/apps/details?id=de.mail.android.mailapp.fr",
"package" : "de.mail.android.mailapp.fr",
"category" : "Communication",
"description" : "Libert et indpendance grce  mail.fr. Vous pouvez utiliser votre messagerie nimporte o et quand vous le souhaitez sur votre mobile ou une tablette. Notre application est disponible et optimise pour les smartphones et tablettes Android.  Notre application est disponible et optimise pour les iPhone et les iPad.   Cette application regroupe les plus importantes fonctions vous permettant de communiquer et, outre la rception et lenvoi demails, elle vous propose les possibilits suivantes:  E-MAIL - Recevoir et envoyer en toute scurit des e-mails chiffrs - Compatibilit avec la fonction PUSH (notifications) - Envoyer des pices jointes jusqu 100 Mo  - Gestion multi-compte (gestion de plusieurs comptes mail.fr) - Compatibilit avec le chiffrement PGB de-mails et de pices jointes - Envoyer des fichiers de taille importante par lintermdiaire dun lien  SMS et FAX - Rception et envoi de SMS et de faxs  CARTE POSTALE - Envoi dans le monde entier de vraies cartes postales. Envoyez un message personnel depuis votre lieu de vacances directement dans notre application  CARNET DADRESSES - Accs scuris  votre carnet dadresses. Crez de nouveaux contacts dans lapplication, modifiez-les et synchronisez-les directement et automatiquement avec le carnet dadresses de votre messagerie web.   CALENDRIER - Aperu de tous les vnements inscrits dans votre calendrier. Crer, modifier et enregistrer de nouveaux vnements. Synchronisation automatique avec le calendrier de la messagerie web.  ESPACE DE STOCKAGE EN LIGNE - Accs  lespace de stockage en ligne. Sauvegarder et modifier le nom de photos, de fichiers de musique et de documents dans lespace de stockage, y accder ou les envoyer par e-mail/fax.  SYNCHRONISATION - Synchronisation automatique des fonctions e-mail, carnet dadresses, calendrier et espace de stockage en ligne.   APPARENCE - Cette fonction permet de modifier lapparence de lapplication et ainsi de lajuster  votre convenance.  SCURIT La scurit est un critre important:  pour protger votre communication, vos donnes sont toujours chiffres, que vous accdiez  Internet par le biais dun wifi public ou dun rseau priv. Notre application utilise une technologie de chiffrement ultramoderne et est soumise  la loi allemande stricte sur la protection des donnes en raison de notre sige social, qui se trouve en Allemagne.  Lapplication de messagerie de mail.fr est compatible avec le chiffrement PGP de-mails et de pices jointes pour prvenir toute tentative despionnage exerce par exemple par les autorits.  Nous utilisons notre propre matriel informatique dans un centre informatique ultra-scuris en Allemagne.   Notre application permet bien entendu un accs protg par un code PIN afin de prvenir tout accs par des tiers (lors de la perte de votre mobile p. ex.).   Votre avis nous intresse. Si vous avez des suggestions, des questions ou des critiques, nhsitez pas  nous en faire part. Envoyez un e-mail en utilisant le formulaire de contact dans votre messagerie mail.fr ou  support@mail.fr.   REMARQUE:   Vous pouvez aussi utiliser le nombre mensuel de SMS et de faxs gratuits dans notre application. De plus, il est trs simple de recharger votre crdit de SMS, de faxs et de cartes postales par lintermdiaire de PayPal. Freedom and independence through mail.fr. You can use your mail anywhere and anytime on your mobile or tablet. Our application is available and optimized for Android smartphones and tablets. Our application is available and optimized for iPhone and iPad.  This application includes the most important functions for you to communicate and, besides receiving and sending emails, it offers the following possibilities:  E-MAIL - Receive and send securely encrypted email - Compatibility with the PUSH function (notifications) - Send attachments up to 100 MB - Multi-account management (managing multiple accounts mail.fr) - Compatibility with the BMPs encryption of emails and attachments - Send large files via a link  SMS and fax - Receiving and sending SMS and faxes  POST CARD - Sending worldwide real postcards. Send a personal message from your holiday place directly in our application  ADDRESS BOOK - Secure access to your address book. Create new contacts in the app, edit and sync them directly and automatically with the address book of your web mail.  CALENDAR - Overview of all of the events in your calendar. Create, edit and save new events. Automatic synchronization with the timing of the webmail.  SPACE STORAGE ONLINE - Access to online storage. Save and rename photos, music files and documents in the storage space, access or send them by e-mail / fax.  SYNCHRONIZATION - Automatic synchronization of email functions, address book, calendar, and online storage space.  APPEARANCE - Allows to change the appearance of the application and so adjust to your liking.  SECURITY Security is an important criterion:  to protect your communications, your data is always encrypted, you are accessing the Internet via a public wireless or a private network. Our application uses an ultra-modern encryption technology and is subject to strict German law on data protection due to our headquarters, located in Germany.  The mail.fr messaging application is compatible with PGP encryption of emails and attachments to prevent any attempt to spy exerted for example by the authorities.  We use our own hardware in an ultra-secure computer center in Germany.  Our application allows course access protected by a PIN to prevent access by third parties (in the loss of your mobile p. Ex.).  Your opinion interests us. If you have suggestions, questions or criticisms, please let us know. E-mail using the contact form in your mail or mail.fr support@mail.fr.   NOTE :  You can also use the monthly number of SMS and faxes free in our application. Moreover, it is easy to recharge your SMS credit, faxes and postcards via PayPal. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.RECEIVE_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'de.mail.android.mailapp.permission.C2D_MESSAGE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'de.mail.android.mailapp.permission.C2D_MESSAGE']",
}