{
"name" : "MobileVOIP Cheap international Calls",
"url" : "https://play.google.com/store/apps/details?id=finarea.MobileVoip",
"package" : "finarea.MobileVoip",
"category" : "Communication",
"description" : "Cheap Voip Calls: The Mobile VOIP dialer lets you make cheap calls to national or international destinations. MobileVOIP is the best Android voip solution; save on your mobile phone costs right away, by using this Mobile voip (MVoIP) cheap calls app! MobileVOIP offers free 3G calls or WiFi calls for Android and iPhone users! Save on monthly calling charges.   You can now also use MobileVOIP to top up mobile prepaid phones abroad! Simply select a contact and choose the Mobile Top Up function. You can use your regular voip credit to send Airtime anywhere in the world.  What is VOIP and why should I use it? VoIP is a technology that allows telephone calls to be made over computer networks like the Internet. VoIP also offers a substantial cost savings over traditional long distance telephone calls.  Travel Roam free with MobileVOIP! You never have to worry about high roaming costs abroad anymore! When abroad, simply use MobileVOIP over a WiFi network! Whether in a restaurant, hotel room or public HotSpot, you can now save on mobile calling charges when travelling abroad as well!  Simply install our free calling app, register with one of the many supported VOIP brands and save loads of money on your international calls. If your selected destination is not among the FREE destinations, using mobile voip calls enable you to call them at almost no costs. MobileVOIP offers very cheap calls to any international destination!   Stop spending too much money on your international calls; use cheap 3G calls or cheap WiFi calls with MobileVOIP. MobileVOIP is the best FREE calls app youll find on the market! Install MobileVOIP for your Android VoIP calls and call for free!   MobileVOIP is a Mobile Voip (MVoIP) application developed by Finarea. It supports all Dellmont VoIP brands and enables its users to save on their monthly calling charges by over 95%.   Some examples: - FreeVoipDeal is your partner for European countries like: Germany, United Kingdom, France, Belgium, the Netherlands, Spain, Italy, etc.  - CallingCredit is probably the cheapest options from European Union Member states to (other) European countries.   - VoipWise is very populair for calls to India, Turkey and Iraq  - Frynga is mostly used for international calls to Nigeria and Pakistan  - VoipGain has the best quality routes to Cuba, Ethiopia and Morocco  - DialCheap is great for voip calls to Bangladesh and Pakistan  - VoipChief offers the best rates for calls to Uzbekistan    Using our app as a default dialer may interfere with dialing 911 emergency services. ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.BROADCAST_STICKY', 'android.permission.REORDER_TASKS', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.WRITE_CONTACTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.BLUETOOTH_ADMIN', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.REORDER_TASKS', 'android.permission.WRITE_CONTACTS']",
}