{
"name" : "Greengow Call Translator (Push-to-talk)",
"url" : "https://play.google.com/store/apps/details?id=greengow.alphacode.com.br",
"package" : "greengow.alphacode.com.br",
"category" : "Communication",
"description" : "Have you ever thought you could speak in your native language with a foreigner next to you or anywhere in the world?  Now this is possible. Download Greengow!  Speak in your native language and Greengow translates your voice calls (push-to-talk walkie talkie) or text messages in real time.  Use Greengow to expand your business globally or to make friendship with foreigners.  Companies:  Once Greengow is downloaded, the application generates a number for you. You can make this number available to your customers and business partners on your website or social medias. You can even make audio conference call with more than one person of different nationality on the same call, and Greengow will do the translation for everyone automatically. The push-to-talk walkie talkie system for conversations helps give the simple and direct communication in the business world..  Individuals:  Make new friends with an international person in the Greengow World. Search for users next to you or anywhere in the world to talk about the same interest. Greengow is a language translator for your messages or voice calls. Finding a foreigner to practice a language or to make friends has never been easier.  Technology? Greengow is the first native application designed to be a call translator. It features a built-in native algorithm of cognitive translation technology and voice capture and Push-to-talk walkie talkie technology. So you have a real-time, simple, direct and intuitive translation communication experience.  Why should I download Greengow? Greengow can help you in various situations, such as, international travel, doing business with foreigners who do not speak your language, making new international friendships. It works as much as a call translator between Greengow users anywhere in the world as a voice translator or text translator for you.   Greengow is a Language Translator? Greengow is not only a language translator, but also a voice call translator to talk to one or more people at the same time, next to you or anywhere in the World. This feature increases possibilities of language translator:  - Language translator for hotels; - Language translator for parks; - Language translator for cabs; - Language translator for international business; - Language translator for international dating.  What languages does Greengow have available? Currently the Greengow application translates into 10 languages: English, Portuguese (Brazilian), French, Spanish, German, Italian, Japanese, Korean, Mandarin Chinese and Russian. It is available for all possible combinations for the 10 languages (total of 90). All translation is made by Microsoft.  Is the Greengow application free? You can download the application for free, and use the walkie-talkie push-to-talk radio system and text messages with translation in real time for free. As a VIP user you will get greengow number and make audioconference calls and have lots of other benefits. Check it out! All you need is internet access. That is, you now have freedom of language and geographical barrier. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.WRITE_CONTACTS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_APP_BADGE', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'greengow.alphacode.com.br.permission.PushHandlerActivity', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.WAKE_LOCK', 'greengow.alphacode.com.br.permission.C2D_MESSAGE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.GET_TASKS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'com.htc.launcher.permission.READ_SETTINGS', 'android.permission.INTERNET', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'android.permission.READ_PHONE_STATE', 'com.oppo.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'com.android.vending.BILLING', 'greengow.alphacode.com.br.permission.PushHandlerActivity']",
}