{
"name" : "Swarachakra Tamil Keyboard",
"url" : "https://play.google.com/store/apps/details?id=iit.android.swarachakraTamil",
"package" : "iit.android.swarachakraTamil",
"category" : "Communication",
"description" : "       If your device can display this sentence in Tamil perfectly, then your device supports Tamil and Swarachakra should also work well. If you do not see any text, or if some of the words are incorrect, Swarachakra may not work well.  Swarachakra Tamil ( ) is a touch-screen keyboard for inputting text in Tamil. (Swarachakra is also available in Telugu, Malayalam, Kannada, Hindi, Marathi, Gujarati, Odia, Punjabi, Bengali and Konkani.) Swarachakra uses a logically ordered design based on the structure of Tamil script. Swarachakra displays the consonants sequenced according to the logical structure of Tamil script, phonetically grouped and arranged in a grid similar to those found in most school textbooks.  Typing with Swarachakra In Tamil, we frequently need to type a combination of a consonant () and a matra () like  +  = . When you touch a consonant, a chakra with combination of consonants and 10 frequent matras pops up (, , , , , , , ...). The chakra gives a preview of the possible character combinations. To select a combination, you slide the stylus or finger towards it. Complete vowels (, , , , , , , , ...) appear in a separate chakra on the bottom right. The less used vowels and matras are next to it (, , ). Numerals, symbols and rarely used characters appear on a shift. You could also switch to the QWERTY keypad temporarily to input English characters.  Installing Swarachakra First, install Swarachakra Tamil by clicking the Install button above.  Next, you need to enable the keyboard. To enable, open Settings, select Language and Input and check the box in front of   (Swarachakra Tamil) in the Keyboard and input methods section.  Finally, click on the Default option in the Keyboard and input methods section, and select   (Swarachakra Tamil) as the default keyboard. (Sorry, but thats how Android works) ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}