{
"name" : "Swarachakra Marathi Keyboard",
"url" : "https://play.google.com/store/apps/details?id=iit.android.swarachakraMarathi",
"package" : "iit.android.swarachakraMarathi",
"category" : "Communication",
"description" : "     ,     -   . If your device can display this sentence in Marathi perfectly, then your device supports Marathi and Swarachakra should also work well. If you do not see any text, or if some of the words are incorrect, Swarachakra may not work well.   Swarachakra Marathi ( ) is a touch-screen keyboard for inputting text in Marathi. (For Hindi please use Swarachakra Hindi and for Konkani please use Swarachakra Konkani. Swarachakra is also available in Gujarati, Telugu, Kannada, Malayalam, Odia, Punjabi, Bengali and Tamil). Swarachakra uses a logically ordered design based on the structure of Devanagari. Swarachakra displays the consonants sequenced according to the logical structure of Devanagari, phonetically grouped and arranged in a grid similar to those found in most school textbooks.  Typing with Swarachakra In Devanagari, we frequently need to type a combination of a consonant () and a matra () like  +  = . When you touch a consonant, a chakra with combination of consonants and 10 frequent matras pops up (, , , , , , , ...). The chakra gives a preview of the possible character combinations. To select a combination, you slide the stylus or finger towards it.  Typing conjuncts like , ,  is particularly hard for most people. Swarachakra makes it easy. First tap on the first part of the combination and select the halant from the chakra ( + ). Swarachakra then shows a preview of all possible conjuncts that begin with that consonant ( +  +  = ;  +  +  =  etc.). If you need to add a matra, select it from the new chakra like earlier (, , , , ...). To type a rafar (), a rashtrachinha () or the eyelash ra (-, -), first select the corresponding key from the right-most bottom keys, and then type as usual.  Complete vowels (, , , , , , , , , ) appear in a separate chakra on the bottom right. The less used vowels and matras are next to it (, , , , , , , , , ,). Numerals, symbols and rarely used characters appear on a shift. You could also switch to the QWERTY keypad temporarily to input English characters.  Installing Swarachakra  First, install Swarachakra Marathi by clicking the Install button above. Next, you need to enable the keyboard. To enable, open Settings, select Language and Input and check the box in front of   (Swarachakra Marathi) in the Keyboard and input methods section.  Finally, click on the Default option in the Keyboard and input methods section, and select   (Swarachakra Marathi) as the default keyboard. (Sorry, but thats how Android works) NOTE: Swarachakra is designed for Android 4.0 (ICS) onwards. It does not work right now on older versions because they do not have Unicode support. ",
"desc_perms" : "[]",
"manifest_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'android.permission.BLUETOOTH_ADMIN']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.BLUETOOTH', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.BLUETOOTH_ADMIN']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.CAMERA', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}