{
"name" : "Servetel - Call Management and Dialer App",
"url" : "https://play.google.com/store/apps/details?id=in.servetel.android.servetelv3",
"package" : "in.servetel.android.servetelv3",
"category" : "Communication",
"description" : "Servetels Call ManagementandDialerApp for Android devices brings a simplified feature to keep a trackcalls on your business phoneusinga mobile device from anywhere, anytime. The app is available with a free 10-days trial for the new users. ExistingServetel users can use the application for tracking the activities of their account.  Features  Features available in the current version of this Android app are:  CallLogs All the calls dialed,received or missed on yourServetel account are listed along with details, such as  caller ID of the customer, date and time of the call, agent name (or IVR), and call duration.  Active Call  All the active call running for yourServetel account are listed in this section with the details including thecurrent status of the call (ringing/answered), source of the call, destination of the call, and the agent connected on the call.  Click-to-Call  With Click-to-call feature, admin can initiate a call to the customer and choose the agent with which the call needs to be connected. With the active calllogs you can see the available agents and accordingly pick the agents for click-to-call option.  Billing History  You can track the dues, payments and other important billing details for yourServetelaccount in this section.  Active Plan  Track the Details of your current plans in Active Plan Section.Details of the active plan that are listed in this section are remaining minutes, plan start date, plan expiry date, number of agents, number of departments, etc.  *Note that all the features listed here may not be available for the trial account. For any assistance with app orServetel account, please contact our toll-free number1800-3002-8140.  Permissions  Servetels Call Managementand DialerApp requires SMS reading permissions to authenticate the phone number for a new account. User can also deny the permissions and enter the One Time Password (OTP) manually.  AboutServetel  Servetel, a product ofServetel Communications Pvt. Ltd., is a leading provider of cloud telephony services for the businesses based in India. Some of the services offered byServetel include Toll-free numbers, Virtualnumbers, IVR, Voice broadcast, Bulk SMS, and call center software (such as predictive dialers, manual dialer, call monitoring system, etc.). These solutions are delivered over the cloud technology.  You can contactServetel via:  Phone: 1800-11-3333  Email: sales@servetel.in  Website: Servetel.in  Follow us on social media:  Facebook: https://www.facebook.com/ServetelIndia/  Twitter: https://twitter.com/ServetelIndia  LinkedIn: https://www.linkedin.com/company/servetel/  YouTube: https://www.youtube.com/channel/UCo-mZQCg9LUuAo9yVSMd5Zw  Google+:https://plus.google.com/108015731331012303781 ",
"desc_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE']",
"manifest_perms" : "['android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
}