{
"name" : "Postinfo",
"url" : "https://play.google.com/store/apps/details?id=info.indiapost",
"package" : "info.indiapost",
"category" : "Communication",
"description" : "Postinfo - Department Posts Android Mobile Application Postinfo, the citizen centric android Mobile application of Department of Posts developed by Centre for Excellence in Postal Technology .The app provides the following facilities;  1) Tracking 2) Post office search 3) Postage Calculator 4) Insurance premium calculator 5) Interest calculator Brief description of each facility is given below; TRACKING:  The tracking facility is made available on this mobile app for the following types of mail items.  Speed Post  Registered Letter  Insured Letter  Value Payable Letter  Insured Value Payable Letter  Registered Packets  Registered Periodicals  Registered Parcel  Insured Parcel  Value Payable Parcel  Insured Value Payable Parcel  Business Parcel  Business Parcel COD  Express Parcel  Express Parcel COD  Electronic Money Order (e-MO)   The users can view the status of the above mentioned type of articles by entering the articles number and touching the Track button. The following additional facilities are also available.  Save the results for future reference   Share it with others through Android native sharing apps viz. Bluetooth, WhatsApp, Facebook etc. POST OFFICE SEARCH:  By entering first three character of the name of the Post office or by entering the Pin code of the office the users can get a list of matching Post offices. By clicking again on the row the user gets the details like Name of Post office, Street address (location), contact details of the Post office (where ever available) for the selected Post office. The name of the Division and contact details.   Offline Pincode search has feature to find nearest post office, locating post office on Google Map and Making call to Post office  POSTAGE CALCULATOR:  The app will calculate the Postage (tariff) based on the weight entered by the user for the following items..   Ordinary letter  Speed post Domestic *  Registered letter  Ordinary Parcel  Registered Parcel  Registered book packet  Registered book packet containing Printed books  Ordinary Registered book packet   Ordinary book packet containing Printed books  Book packet containing periodicals  Book packet containing Registered News papers  *Domestic Speed Post Tariff depends on distance between place of origin and destination.   Based on tariff there are 5 slabs of tariff viz. local, up to 200 KM, 201 to 1000 KM, and 1001 to 2000KM and above 2000KM. The calculator shows the tariff for all categories) PREMIUM CALCULATOR  The Department is offering various types of Life Insurance Policies through Postal Life Insurance and Rural Postal Life Insurance. The users can check the premium payable for all the eligible types of Postal /Rural Postal Life insurance Policies on the basis of the input entered. INTEREST CALCULATOR  Post office is offering different types of Small Savings Schemes as mentioned below:  Sukanya Samriddhi yojaana  Recurring Deposit  Time Deposit (1 year, 2 year, 3 year and 5 year)  Monthly Income Scheme  Senior Citizen Savings Scheme  National Savings Certificate   Kisan Vikas Patra ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'android.permission.WRITE_INTERNAL_STORAGE', 'com.google.android.providers.gsf.permission.READ_GSERVICES', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.WRITE_INTERNAL_STORAGE']",
}