{
"name" : "NTN24",
"url" : "https://play.google.com/store/apps/details?id=io.com.app.NTN24",
"package" : "io.com.app.NTN24",
"category" : "Communication",
"description" : "Nuestra Tele Noticias 24 (NTN24) es un canal internacional que emite su seal en todo el continente americano, desde Canad hasta Argentina, con informacin de todo lo que acontece en Amrica Latina, EE.UU. y el mundo, a travs de las pantallas de televisin y las plataformas digitales. En nuestra app encontrar informacin inmediata, actual, oportuna y veraz, nuestra seal en vivo (no habilitada en Estados Unidos) y notificaciones de noticias de ltima hora. Casi 10 aos informando las realidades que impactan a los latinos desde los lugares claves de la informacin y sus pases de origen, actualmente, llega a ms de 40 millones de espectadores a travs de operadores de cable y satlite en ms de 22 pases. NTN24 transmite desde sus estudios en Washington, Nueva York, Miami y Los ngeles y su centro de noticias internacionales y agencias en Bogot, Caracas y Quito, a travs de su amplia red de corresponsales ubicados en las principales ciudades de los Estados Unidos, Amrica Latina y Europa. Nuestra Tele Noticias 24 (NTN24) is an international channel that broadcasts its signal throughout the Americas, from Canada to Argentina, with information on everything that happens in Latin America, USA and the world, through television screens and digital platforms. In our app you will find immediate, current, timely and accurate information, our live signal (not enabled in the US) and notifications of breaking news. Almost 10 years reporting the realities that impact Latinos from key sites information and their home countries, currently reaches more than 40 million viewers through cable and satellite operators in more than 22 countries. NTN24 broadcasts from studios in Washington, New York, Miami and Los Angeles and its center of international news agencies in Bogot, Caracas and Quito, through its extensive network of correspondents located in major cities in the United States, Latin America and Europe. ",
"desc_perms" : "[]",
"manifest_perms" : "['com.sonyericsson.home.permission.BROADCAST_BADGE', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.READ', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_APP_BADGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'io.com.app.NTN24.permission.C2D_MESSAGE', 'android.permission.INTERNET', 'com.oppo.launcher.permission.READ_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_READ', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.htc.launcher.permission.READ_SETTINGS', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.WAKE_LOCK', 'com.oppo.launcher.permission.WRITE_SETTINGS', 'me.everything.badger.permission.BADGE_COUNT_WRITE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET', 'android.permission.ACCESS_FINE_LOCATION']",
}