{
"name" : "Wochat",
"url" : "https://play.google.com/store/apps/details?id=io.wochat.app",
"package" : "io.wochat.app",
"category" : "Communication",
"description" : "Wochat is the free messaging app featuring LIVE translation of messages and video chat! We connect you with not only your friends but the entire world!   The world just got a lot smaller. Featuring state of the art LIVE translation capabilities, Wochat will allow you exchange messages, voice and video chat with anyone regardless of language barriers. Use your Android device for all of your catching up, networking or for simply meeting new people regardless of regions and languages. Our app uses your devices current connections, either network or Wi-Fi, to connect you with millions of users across the globe.  The worlds first truly universal messaging app!  Wochats menus and interface support English, French, Italian, Spanish, German, Russian and Chinese. Instant translation of your messages and video chat into 103 different languages including Arabic, Chinese (both simple and traditional), Hindi, Japanese, Dutch, Portugese, Vietnamese, Swahili and so many more! Message with live translation  This feature supports all languages, and is even able to translate video calls. Our easy to use system, complete with smart keyboard auto correction, ensures your message is delivered fast and accurately. You send your message in your language and your recipient receives the message in his language automatically! Want to chat over live video? Wochat will translate live! You speak your language and your friend hears their language - automatically! Our mission is to bring the world together using the technology you have in your hand through your Android device. While this is the perfect app to message or call home, it is also a tremendous platform for networking and making new friends. User can even take advantage of our app to date and find relationships across the globe! Meet new people worldwide  Dynamic messaging system  Send written messages, audio messages, video or voice chat Schedule messages ahead of time - never miss a happy birthday or holiday message again! Chat with multiple users  Group chat features make catching up with multiple friends or messaging your entire family a breeze. Communicate with no fees  Using your already existing network of WiFi means you can message and video call without the need for extra subscriptions. Data protection  Our messages our encrypted to ensure your privacy. We pride ourselves in protecting our users and their data. Accordingly, our development team uses the latest data protection practices to ensure your identity and information stays safe. We will never sell your information to outside agencies. *Data rates may apply. Contact your provider for details.  Start connecting with friends all over the world today - for free! Live translation of messages and video makes Wochat the premiere app for global communication!  Connect with us on social media! ",
"desc_perms" : "['android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_CONTACTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PHONE', 'android.permission.INTERNET']",
"manifest_perms" : "['com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.READ_PHONE_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'android.permission.BLUETOOTH', 'android.permission.CAMERA', 'android.permission.WAKE_LOCK', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_TASKS', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.USE_FINGERPRINT', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION']",
}