{
"name" : "Professional Walkie Talkie",
"url" : "https://play.google.com/store/apps/details?id=masih.vahida.privatewalkietalkie",
"package" : "masih.vahida.privatewalkietalkie",
"category" : "Communication",
"description" : "This app acts like a real Walkie Talkie with a very high quality voice and also Video! The app has 50 public channels (Number of Free channels are less than 50 for unsubscribed users) that allow users to select a channel and talk on that channel with all other people who are using the same app set to the same channel. For example , you can ask your friends to set their app to channel 3 and then you will be able to chat with each other like a real Walkie Talkie with all the sound effects that a real Walkie Talkie Radio has !   Users can also define a 14 to 20 character key code and share with each other and make a private network that only the users who have this code can connect to each other.  The app connects the users in the same geographic region and same age group.  The app has two PTT buttons, one for Audio only and the other one for both Audio and Video.  THE BEST THING ABOUT THIS APP IS , YOU DONT NEED TO MAKE ANY ACCOUNT !. JUST TURN THE WALKIE TALKIE ON AND BOOM !! READY TO USE.  There is also a channel scan system that allows user to search all of the channels and see if there is any body talking on any channel. so you can search the channels to see if there is any body talking and start talking to  There is also ability of inviting one person or a group of people on public channels to the private channel and have a private conversation.  You can also send text or voice messages to one or a group of users.  You can find friends with this app   Download is free. Its really fun !!! Try it. you will love it believe me...   PRIVACY: This app needs access to Microphone, Camera and Storage. Microphone is needed to record your voice when you hold PTT button. Camera is used when the Camera is enabled by the user to capture videos for Video Chat. Video Chat is not allowed in public channels. No Audio or Video will be transferred without user holding PTT button. Storage is used to store the Apps settings only. This application requires to get your devices serial number and your Devices info None of the above are collected or stored anywhere on our servers and will not be shared .  NOTICE: This application is a public Audio / Video chat Application, that gives the users the ability to chat with other people. there is no privacy and any body who has this app set to the same channel will be able to hear or see you. Conversations, Videos and Activities on this app is not the app developers responsibility. Since its a public chat app with users in various age range, Using this Application is not recommended for children. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.INTERNET', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECORD_AUDIO', 'android.permission.VIBRATE', 'com.android.vending.BILLING', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.CAMERA', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.BLUETOOTH', 'android.permission.ACCESS_FINE_LOCATION']" 
"extra_perms" : "['android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_FINE_LOCATION']",
}