{
"name" : "IndiaCall - Free Phone Call For India",
"url" : "https://play.google.com/store/apps/details?id=net.yolonet.indiacall",
"package" : "net.yolonet.indiacall",
"category" : "Communication",
"description" : "IndiaCall - Phone Call && Free Call, next generation real voice calls, support Second Phone Number. IndiaCall developed for Indian. Best Free Wifi Calling App - Send SMS, MMS on Wifi. A Real Phone Number: Get now your own real USA Canada phone number to call. Download this VoIP Wi-Fi calling online app & enjoy free calls worldwide to any mobile & landline! Even if your friends or family have no network access, IndiaCall can still connect them for free. Send and receive SMS/MMS/Text for free. 2nd, multiple number: burner number, disposable number, anonymous free call. Travel with IndiaCall and make Unlimited local & long distance calls to the U.S. and Canada. Popular countries include wifi call India, call the USA, call Nigeria, call Pakistan, call Germany, call India and call the UK. We pay the VoIP bills for you, so it is completely free Features  Free International Calls Completely FREE CALL Phone. 100% Free & global phone call free. No contract, no hidden fees. Whenever and whoever youre talking with, IndiaCall is always the best application for making free calls! Popular countries include call USA, call Nigeria, call Pakistan, call Germany, call India, call the UK and call Bangladesh. Free does not mean low quality. We will spare no effort to improve quality. Enjoy high-quality free calls in over 230 countries!  Second Number  A real phone number for free - anonymous texting - anonymous calling - burner number, disposable number. Turn now your Google Android Tablet into a voice device: call from phone and tablet with free calling app. Give your friends your very own phone number they can call!  Unlimited Free Message  Real phone free call, free text. 2nd, multiple number: burner number, disposable number, anonymous free call, anonymous texting. You can text now with features such as free SMS messaging, free MMS picture messaging, international texting & calling.  Privacy Protection  Do you want an anonymous call and dont want others to know your personal number? IndiaCall hides your personal number during the call. The analog signal and digital signal intercommunication technology, as well as the unique voice encryption and decryption technology, can effectively prevent the call from being monitored.  Why use IndiaCall?   High Quality Voice Calls Dial away and make high-quality phone calls with voice quality that is crystal clear, just like making phone calls from a landline! In conjunction with the worlds leading companies, powered by advanced voice coding and decoding technology, IndiaCall takes pride in the innovation and optimization of IP-PSTN call quality, allowing our users to make high-quality free phone calls.  No Phone Bills Calling via Wi-Fi or 3G/4G/LTE network, you dont get hit with expensive service charges. International calls are very expensive, but IndiaCall is FREE! Most of the same kind of products are charged, and the price is high, even if some are low-cost phones, they are still too expensive compared to the free of IndiaCall. If you want to make an international call, IndiaCall is your best choice. SMS messaging across different cell networks such as international calls can also be expensive or even in some cases impossible. So even if you make a local call, IndiaCall is a great choice.  Notice  1. Dont use IndiaCall while driving. 2. When you call a friend, please pay attention to the time zone to avoid disturbing your friends. 3. Dont use IndiaCall for phone harassment.  keep in touch Try it now. Dont forget to give us 5-Star(    ) rating, if you like us. Dont forget to share it with your friends, if you would like to help us. If you have any suggestions, please email: indiacall@yolonet.io ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.SEND_SMS', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CALL_LOG', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_ACCOUNTS', 'android.vending.BILLING', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.WRITE_CONTACTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.CALL_PRIVILEGED', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.AUTHENTICATE_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'com.google.android.c2dm.permission.RECEIVE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CALL_PRIVILEGED', 'android.permission.RECORD_AUDIO', 'com.android.vending.BILLING', 'android.permission.WRITE_CONTACTS']",
}