{
"name" : "SSTV Encoder",
"url" : "https://play.google.com/store/apps/details?id=om.sstvencoder",
"package" : "om.sstvencoder",
"category" : "Communication",
"description" : "Open Source Code (Apache License, Version 2.0): https://github.com/olgamiller/SSTVEncoder2  --- Supported modes:  Martin Modes: Martin 1, Martin 2 PD Modes: PD 50, PD 90, PD 120, PD 160, PD 180, PD 240, PD 290 Scottie Modes: Scottie 1, Scottie 2, Scottie DX Robot Modes: Robot 36 Color, Robot 72 Color Wraase Modes: Wraase SC2 180  The mode specifications are taken from the Dayton Paper of JL Barber: http://www.barberdsp.com/downloads/Dayton%20Paper.pdf  --- Image:  Tap Take Picture or Pick Picture menu button or use the Share option of any app like Gallery to load an image.  To keep the aspect ratio, black borders will be added if necessary. Original image can be resend using another mode without reloading.  After image rotation or mode changing the image will be scaled to that modes native size.  After closing the app the loaded image will not be stored.  --- Text Overlay:  Single tap to add a text overlay. Single tap on text overlay to edit it. Long press to move text overlay. Remove the text to remove a text overlay.  After closing the app all text overlays will be stored and reloaded when restarting.  --- Menu:  Pick Picture - Opens an image viewer app to select a picture. Take Picture - Starts a camera app to take a picture. Save Wave File - Creates a wave file in the Music folder in SSTV Encoder album. Play - Sends the image. Stop - Stops the current sending and empties the queue. Rotate Image - Rotates the image by 90 degrees. Modes - Lists all supported modes.  --- SSTV Image Decoder:  Open Source Code: https://github.com/xdsopl/robot36/tree/android  On Google Play the Working App: Robot36 - SSTV Image Decoder https://play.google.com/store/apps/details?id=xdsopl.robot36 ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_NETWORK_STATE']",
}