{
"name" : "Firefox Browser: fast, private & safe web browser",
"url" : "https://play.google.com/store/apps/details?id=org.mozilla.firefox",
"package" : "org.mozilla.firefox",
"category" : "Communication",
"description" : "Firefox Browser for Android is automatically private and incredibly fast. Thousands of online trackers are following you every day, collecting information about where you go online and slowing down your speed. Firefox blocks over 2000 of these trackers by default and there are ad blocker add-ons available if you want to customize your browser even more. With Firefox, youll get the security you deserve and the speed you need in a private, mobile browser.   FAST. PRIVATE. SAFE. Firefox is faster than ever and gives you a powerful web browser that protects your privacy. Keep whats personal private with Enhanced Tracking Protection, which automatically blocks over 2000 online trackers from invading your privacy. With Firefox, you dont have to dig in your privacy settings, everything is set up automatically, but if you like to be in control, you can choose from the many ad blocker add-ons available for the browser. We designed Firefox with smart browsing features that let you take your privacy, passwords, and bookmarks with you safely wherever you go.  ENHANCED TRACKING PROTECTION AND PRIVACY CONTROL Firefox gives you greater privacy protection while youre on the web. Block third-party cookies and unwanted ads that follow you around the web with Enhanced Tracking Protection. Search in Private Browsing mode and you wont be traced or tracked  your private browsing history is automatically erased when youre done.  OWN YOUR LIFE WHEREVER YOU INTERNET - Add Firefox across your devices for secure, private and seamless browsing.  - Sync your devices to take your favorite bookmarks, saved logins and browsing history wherever you go.  - Send open tabs between mobile and desktop.  - Firefox makes password management easy by remembering your passwords across devices.  - Take your internet life everywhere, knowing that your personal data is safe, never sold for profits.  SEARCH INTELLIGENTLY & GET THERE FASTER - Firefox anticipates your needs and intuitively provides multiple suggested and previously-searched results across your favorite search engines. Every time. - Easily access shortcuts to search providers including Wikipedia, Twitter and Amazon.  NEXT LEVEL PRIVACY - Your privacy has been upgraded. Private Browsing with Tracking Protection blocks parts of Web pages that may track your browsing activity.  INTUITIVE VISUAL TABS - Open as many tabs as you like without losing track of your open Web pages.  EASY ACCESS TO YOUR TOP SITES - Spend your time reading your favorites sites instead of looking for them.  GET ADD-ONS FOR EVERYTHING - Take control of your mobile browser by personalizing Firefox with add-ons like ad blockers, password and download managers and more. Want a more personalized browser? Add-ons can help you customize your browser to make your time online safer.   QUICK SHARE - The Firefox web browser makes it easy to share links to web pages or specific items on a page by connecting to your most recently used apps like Facebook, Instagram, Twitter, WhatsApp, Skype and more.  TAKE IT TO THE BIG SCREEN - Send video and Web content from your smartphone or tablet to any TV equipped with supported streaming capabilities.  Learn more about Firefox for Android: - Have questions or need help? Visit https://support.mozilla.org/mobile - Read about Firefox permissions: https://mzl.la/Permissions - Follow Firefox on Twitter: https://mzl.la/FXTwitter  ABOUT MOZILLA Mozilla exists to build the Internet as a public resource accessible to all because we believe open and free is better than closed and controlled. We build products like Firefox to promote choice and transparency and give people more control over their lives online. Learn more at https://www.mozilla.org  Privacy Policy: https://www.mozilla.org/legal/privacy/firefox.html ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.GET_ACCOUNTS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.RECORD_AUDIO', 'org.mozilla.firefox.permission.C2D_MESSAGE', 'android.permission.WRITE_SETTINGS', 'com.android.launcher.permission.UNINSTALL_SHORTCUT', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.READ_SYNC_STATS', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MANAGE_ACCOUNTS', 'android.permission.NFC', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'org.mozilla.firefox_fxaccount.permission.PER_ACCOUNT_TYPE', 'android.permission.CAMERA', 'android.permission.INTERNET', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WRITE_SYNC_SETTINGS', 'com.android.browser.permission.READ_HISTORY_BOOKMARKS', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_PHONE_STATE', 'android.permission.NFC', 'org.mozilla.firefox_fxaccount.permission.PER_ACCOUNT_TYPE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.DOWNLOAD_WITHOUT_NOTIFICATION', 'android.permission.GET_ACCOUNTS', 'android.permission.SYSTEM_ALERT_WINDOW', 'com.android.browser.permission.READ_HISTORY_BOOKMARKS']",
}