{
"name" : "Vinota: Cheap International Calling App",
"url" : "https://play.google.com/store/apps/details?id=org.vinota",
"package" : "org.vinota",
"category" : "Communication",
"description" : "Cheap International Calls & SMS to your loved ones at super cheap rates, with crystal clear voice quality. Thats Vinota. Talk more with HUGE Savings! on mobile VOIP  Avoid roaming charges on your international calls by using Vinota, Make cheap international calls abroad while keeping your own phone number using your local SIM card!  You can call any number in any part of the world, with worlds most competitive call rates and HD quality voice. There are no boundary to call any countries or continents with the competitive rates of Vinota. (Check our amazing rates inside the APP). Calling has never been easier or cheaper!  Why Use Vinota ?   Lowest call rates to any country in the world  Best mobile voip operator   No connection fees or hidden cost  Lowest data usage  Bypass VOIP blocking  No ads . We keep your privacy  Crystal clear voice quality  No call dropping  Free yourself from expensive roaming charges  Try before you buy - first call is free of charge  Cheap text message (SMS) rates  Credits valid for lifetime  Payment via PayPal, credit cards, Recharge Codes or bank deposit  Cheap International Calls Vinota is great for calling India, Ethiopia, Bangladesh, Brazil, Philippines, Mexico, China, Egypt, Germany, Nigeria, Kenya, Indonesia, Malaysia, Iran, Iraq, Morocco, Pakistan, Poland, Romania, Russia, Saudi Arabia, Sri Lanka, Nepal Turkey, Laos, Myanmar, Thailand, Afghanistan, Yemen, ,Uganda,Cameroon or any other destination. Save money on international call costs and roaming fees without sacrificing on voice quality while traveling abroad.  Vinota makes your life easier. Whichever country you are in, you can make international calls to any other country. All this may seem too much, but its not. Why? Because its Vinota! Signup with Vinota today to experience this marvel piece of innovation.  . Get-off The Burden of Roaming charges Travelling while on a business trip and hate paying huge roaming fees? You can make cheap international calls to any country in the world with crystal clear voice quality. By using Vinota, you dont even need to carry on with expensive roaming charges your phone company provides. Feel the freedom to - call anywhere - from anywhere - being anywhere.  Low-cost Worldwide SMS Its a great way to eliminate the phone companies international  text charges. Start using Vinotas worldwide texting offer.  Strong Connectivity Its time for you to relax and talk with your loved ones without the fear of call dropping. The strong connectivity helps in providing the best possible signal strength on mobile VOIP calls.  Truly Clear Call Quality How many times it happened when you call your friend and you are not even recognizing his/her voice. Why?Because of the cheap call quality.Using Vinota, you can make sure that there wont be any issues with call quality. You will enjoy HD Quality voice every time.  International Calling Rates Starting From   Call India 1.35 /min  Call Sri Lanka from 13.5 /min  Call Nigeria 8.31 /min  Call Bangladesh 2.65 /min  Call Philippine 9.46 /min  Call Pakistan 2.97 /min  Call Nepal 9.85 /min  Try Before You Buy - Your First International Call Is Free Vinota gives you the opportunity to try the international call service without charges. You can make your first call and evaluate the performance of Vinota without taking out a single penny from your pocket. After that, if you liked our service, buy the credits for continuing the great experience of cheapest international calling rates and super crispy voice quality.  If you have a question or a query, just send us a mail at: support@vinota.com  Get Connected With Vinota - Socially, Have a taste of Vinotas activities on social media.  Like Vinota on Facebook - https://www.facebook.com/vinotaAPP  Follow Vinota on Twitter - https://twitter.com/vinotaAPP  Share, like, follow, tweet, comment, and most importantly - have a great time! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CALL_PHONE', 'android.permission.WRITE_CONTACTS', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.AUTHENTICATE_ACCOUNTS', 'com.android.vending.BILLING', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_SYNC_SETTINGS', 'android.permission.WRITE_SYNC_SETTINGS', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_MULTICAST_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.KILL_BACKGROUND_PROCESSES', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.SYSTEM_ALERT_WINDOW', 'android.permission.CAMERA', 'com.android.vending.BILLING', 'android.permission.WRITE_CONTACTS']",
}