{
"name" : "twinsee - chat and video calls",
"url" : "https://play.google.com/store/apps/details?id=org.twinlife.device.android.twinsee",
"package" : "org.twinlife.device.android.twinsee",
"category" : "Communication",
"description" : "Twinsee is a free messaging and peer-to-peer video call service based on WebRTC, for interacting with contacts, friends and families from a mobile device or a Chrome browser on a PC or Mac (no plugin required).  Twinsee is the first mobile application providing a high-definition free video call service based on the WebRTC standard.  Twinsee works on WiFi, 3G, and 4G/LTE networks.  Twinsee allows organizing contacts in Circles (or buddy groups) with different properties for easier management and better security. Twinsee allows to sign in from a Facebook account, thus avoiding creating a specific twinsee account for those who prefer to use their Facebook account for signing in.  You can invite your friends on Facebook into your twinsee circles.  As opposed to many free mobile or web applications, twinsee does not have any advertising. Your data is considered as strictly personal and cannot be sold. The twinsee service infrastructure has been designed to guarantee privacy protection and secure communications.  Twinsee is heavily based on Internet standards and open source software, in particular WebRTC (www.webrtc.org) for peer-to-peer high quality real-time video and audio communication (to be included in the HTML5 standard) and XMPP (xmpp.org) for instant messaging, contacts and presence management.  Have fun! :-) ",
"desc_perms" : "['android.permission.GET_ACCOUNTS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.VIBRATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.BROADCAST_STICKY', 'android.permission.SET_WALLPAPER', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.CAMERA', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO']",
}