{
"name" : "twinme - private messenger",
"url" : "https://play.google.com/store/apps/details?id=org.twinlife.device.android.twinme",
"package" : "org.twinlife.device.android.twinme",
"category" : "Communication",
"description" : "twinme is a free secure instant messaging and High-Definition voice/video call application, protecting your privacy and giving you full control over each of your relationships and contents.  WHY USE TWINME:  . PRIVACY BY DESIGN: twinme doesnt ask, store, or use any of your personal data. You do not need to subscribe and provide any personal information to use twinme. twinme is about the only messaging app that does not use your phone number (no email address or social network ID either), and that does not snoop into your address book to suck your contacts phone number and other private information.  . PERSONALIZED CONTACTS: you can choose what you disclose about yourself to each of your twinme contact individually: your name, your image, which you can change at any time. You control how each of your contacts can reach you (or not). Since your contact information is personal to each of your contacts, it cannot be transferred to nor used by anyone else. You are in full control, whether you interact with a close friend or a complete stranger.  . PERSONALIZED CALLS: twinme video calls allow your contact to see you in live video BEFORE accepting the call. You can thus create a live emotional preview of your call by simply long pressing the video call button.  . PRIVATE CONVERSATIONS: all conversations happen in peer-to-peer with no relay server storing contents in-between devices. Data exchanged always stay within devices. Messages and voice/video calls are end-to-end encrypted . You clear all messages of a conversation on both ends simultaneously in one tap.  . FAST MESSAGING AND HIGH DEFINITION VOICE/VIDEO CALLS: twinme peer-to-peer message transfers are instantaneous when both ends have an active data connection. twinme voice and video calls leverage the latest state-of-the-art real-time multimedia protocols and codecs that adapt to device configurations and changing network conditions to provide the highest quality voice and video definition achievable on the market today.  . FREE WITH NO ADVERTISING: since twinme does not access any of yours or your contacts personal information, it cannot be used for commercial purposes. Unlike most other messaging apps, you are not a product.  . INTERACT ONLINE LIKE IN REAL LIFE: you are free to decide with whom, when and how you interact.  Have one of your profiles invitation twincodes (QR-Code) scanned by a friend next to you or someone you just met, or send it by text, email or any other means to a family away, or post it to your website or tweet it to your followers: you decide. If you dont want to continue a relationship any further just remove it from your twinme contact list, and he/she cannot reach you anymore: no unsolicited call, no harassment, no spam are possible with twinme.  . IDEAL FOR KIDS: twinme helps you turn any tablet into a safe communication device for children. Without a phone number, your kid cannot discover or be discovered on line by unknown people. The only contacts allowed are those met in person (family and friends) that can flash the kid profile twincode (QR-code) with their device. Parents feel comfortable and kids can enjoy their first grownup social app safely.  . UNIQUE TECHNOLOGY: twinme extends the WebRTC open source technology (the new standard for secure real-time peer-to-peer multimedia exchanges on the web) with its unique twincode relationships model to provide the most disruptive communications services on the market today.  twinme uses your device Internet connection (WiFi or 3G/4G/LTE as available). Data charges may therefore apply. Check your carrier for details.  PERMISSIONS:  . Camera & Microphone to take pictures, make voice/video calls  . Photos/Media/Files for profiles or messages . Storage to access files on SD cards . network connections to monitor connections . audio settings for audio volume . prevent from sleeping when in a voice/video call . vibration to give feedback . run at startup to receive message/call ",
"desc_perms" : "['android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.SEND_SMS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'com.sec.android.provider.badge.permission.WRITE', 'android.permission.CAMERA', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FULL_SCREEN_INTENT', 'com.huawei.android.launcher.permission.READ_SETTINGS', 'com.huawei.android.launcher.permission.WRITE_SETTINGS', 'com.huawei.android.launcher.permission.CHANGE_BADGE', 'android.permission.VIBRATE', 'com.sec.android.provider.badge.permission.READ']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.USE_FULL_SCREEN_INTENT']",
}