{
"name" : "Firefox Lite — Fast and Lightweight Web Browser",
"url" : "https://play.google.com/store/apps/details?id=org.mozilla.rocket",
"package" : "org.mozilla.rocket",
"category" : "Communication",
"description" : "Meet Firefox Lite, the lightning-fast and lightweight web browser. At only 6MB in size  and with turbo mode to speed you up  it provides a blazing fast online experience. Whats more, Firefox Lites advanced private browsing mode can prevent advertisers and websites from tracking you. You can now check how many trackers are blocked in private mode.   Lightning Fast Browsing Speed With Turbo Mode, Firefox Lite promises you a lighting fast browsing experience!  A Lightweight Web Browser This incredibly mini size browser is less than 6MB, taking up almost no space on your phone.  Advanced Private Browsing Browse without a trace. No history, no passwords, no cookies recorded when browsing in the private browsing mode. With the tracking protection, which most browsers dont have, Firefox Lites advanced private mode can prevent advertisers and websites from tracking you. Feeling curious? Now you can check how many trackers are blocked in private mode.  Save Data  and Cash  Save on data costs via enabling image blocking while you browse.  Screenshot the Whole Page You can capture the whole page to read offline with a single tap on the toolbar. And a website link is automatically saved too, so you can quickly browse back there whenever you want.  Smart Shopping Search Find great deals quickly and easily. With Smart Shopping Search, simply tap on convenient tabs to compare products and prices across multiple shopping sites at once.  Free games, news and travel discovery Immerse yourself in more than 100 popular free games  without installing gaming apps. Catch up on the latest stories from major news sites. And Discover and plan your next adventure in one convenient place.   Night Mode Protect your eyes with night mode to read more comfortably at night. This also saves some battery life.  Save Phone Space  Clear your cache straight from the menu to free up storage space fast. Or with a quick flip in settings, you can save your cache and downloads straight to an SD Card.  ABOUT MOZILLA Mozilla is dedicated to keeping the power of the internet in peoples hands. Were a global community of users, contributors and developers working to innovate on your behalf. When you use Firefox, you become a part of that community, helping us build a brighter future for the internet. Learn more at https://www.mozilla.org.   Privacy Notice: https://www.mozilla.org/privacy/firefox-lite/ ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.FOREGROUND_SERVICE', 'com.android.launcher.permission.INSTALL_SHORTCUT', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.WAKE_LOCK', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.READ_EXTERNAL_STORAGE', 'com.samsung.android.providers.context.permission.WRITE_USE_APP_FEATURE_SURVEY', 'android.permission.ACCESS_WIFI_STATE']",
}