{
"name" : "WP Poczta",
"url" : "https://play.google.com/store/apps/details?id=pl.wp.wppoczta",
"package" : "pl.wp.wppoczta",
"category" : "Communication",
"description" : "WP Poczta to bezpatna i atwa w obsudze aplikacja pocztowa.  Przejrzysty ukad i wygld aplikacji pozwala sprawnie wykorzystywa wszystkie funkcjonalnoci WP Poczty.  Teraz moesz byskawicznie odbiera maile dziki powiadomieniom push, czyta wiadomoci i odpowiada na nie w trybie online i offline, a take szybko przeszuka wszystkie foldery poczty.  Aplikacja WP Poczta to take:   Segregatory  Twoje wiadomoci s sortowane na kategorie (Oferty, Spoecznoci, Zakupy), dziki czemu skrzynce odbiorczej panuje porzdek.   Kontakty  w aplikacji masz dostp do wszystkich adresw  zarwno ze skrzynki pocztowej, jak i z telefonu.   Galeria zacznikw  w atwy sposb moesz odnale, przejrze i udostpni swoje pliki.   Konwersacje - wszystkie wiadomoci o danym temacie znajduj si w jednej konwersacji, w porzdku chronologicznym.   Fiszka patnoci - zawiera najwaniejsze informacje o Twojej fakturze, a za pomoc usugi Pac z WP moesz szybko opaci swoje rachunki z kadego miejsca na wiecie.   Fiszka przesykowa - pozwoli Ci w prosty sposb monitorowa status Twojej przesyki w Paczkomatach, wszystkie niezbdne informacje bd widoczne na gwnym ekranie aplikacji, bez koniecznoci otwierania konkretnej wiadomoci.   Konta zewntrzne - od teraz moesz podpi dowolne konto zewntrzne przez WP Poczt na komputerze. Dodane konto bdzie widoczne w aplikacji jako jeden z folderw. Moesz dowolnie przenosi, usuwa i edytowa maile midzy dodanymi kontami. Podepnij swoje konto o2, Gazeta, Onet, Gmail, Interia lub inne, ktre posiadasz.  Aplikacja WP Poczta to bezpatny i dedykowany klient dla usug pocztowych www.poczta.wp.pl    Masz uwagi lub sugesti? Zapraszamy do kontaktu z nami, napisz na adres aplikacje-poczta@wp.pl  WP Mail is a free and easy-to-use email application.  The clear layout and appearance of the application allows for efficient use of all the functionality of the WP Mail.  Now you can receive emails instantly via push notifications, read and respond to them online and offline, and quickly search all your mail folders.  WP Mail application is also:   Binders - Your messages are sorted into categories (like Promos, Social, Shopping), so your inbox neat and tidy.   contacts - in your application you have access to all addresses - both from the mailbox, and from the phone.   Gallery attachments - you can easily find, view and share your files.   Conversation - all messages about a given topic can be found in the same conversation, in chronological order.   fiche payment - contains the most important information about your invoice, and by using Pay with WP can quickly pay their bills from anywhere in the world.   fiche parcel post - will allow you to easily monitor the status of your shipment Paczkomaty, all the necessary information will appear on the main screen of the application, without opening a specific message.   External Accounts - now you can hook up any external account by WP Mail on your computer. Added account will appear in the application as one of the folders. You can move, delete, and edit e-mails between accounts added. Hook your account o2, Newspaper, Yahoo, Gmail, or other Interia have.  WP Mail application is free and a dedicated client for postal services www.poczta.wp.pl   You have a comment or suggestion? We invite you to contact us, please email aplikacje-poczta@wp.pl  ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.VIBRATE', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.WAKE_LOCK', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WRITE_CONTACTS', 'android.permission.RECEIVE_BOOT_COMPLETED', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.GET_TASKS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.WAKE_LOCK']" 
"extra_perms" : "['android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.WRITE_CONTACTS']",
}