{
"name" : "NOS Communicator",
"url" : "https://play.google.com/store/apps/details?id=pt.nos.communicator",
"package" : "pt.nos.communicator",
"category" : "Communication",
"description" : "O NOS Communicator  uma aplicao multiplataforma atualmente disponvel para smartphones/tablets Android ou iOS assim como para laptop/desktop Windows ou Mac. Esta aplicao  um softclient opo e parte integrante das solues empresariais de telefonia IP, comunicaes vdeo e gesto de servio da NOS Comunicaes SA.   Nota: Para a utilizao deste softclient  necessrio ter um servio cloud de comunicaes empresariais compatvel da NOS Comunicaes SA.   Atravs da utilizao do NOS Communicator, os seus utilizadores passam a ter disponvel um dispositivo multimdia avanado, com interface intuitiva e coerente entre os vrios tipos de plataformas, totalmente integrado com os servios e funcionalidades avanadas da soluo empresarial da NOS, que tanto endeream as necessidades do utilizador, como as especificas da empresa de uma forma global.  O softclient NOS Communicator integrado nas solues da NOS permite-lhe: - Efetuar chamadas ou videochamadas atravs do seu smartphone; - Realizar transferncias, conferncias, parquear e recuperar chamadas de forma simples e intuitiva; - Configuraes as opes mais necessrias do seu servio de voz fixa em mobilidade, nomeadamente: reencaminhamentos, no perturbar, nmero annimo ou toque simultneo; - Integrar o seu diretrio corporativo com os seus contactos pessoais presentes no seu smartphone. - Consultar o registo de chamadas; - Estender ou usufruir da sua extenso fixa fora do escritrio, em qualquer lugar; - Ter uma s identidade para mltiplos dispositivos (telefones IP, vrios softclient) - Mudar de dispositivo durante uma chamada sem quebra de servio;  - Usufruir das suas condies do seu servio de comunicaes empresariais fora do escritrio ou em roaming sem custos adicionais;  Para poder utilizar este softclient  necessrio: - Ser cliente servio cloud de comunicaes empresariais compatvel da NOS Comunicaes SA - Subscrever a opo correspondente  utilizao do NOS Communicator - Ter uma ligao LAN, Wi-Fi ou dados mveis 3G/4G; - Ter acesso direto ou indireto a servio pblico Internet para resoluo de nomes DNS; - Requisitos minimos dispositivo: - CPU Dual-Core (ARMv7) e 1GB RAM; - Resoluo ecr: 320 x 480;  Se desejar conhecer melhor esta soluo, contacte o seu representante ou gestor/consultor empresarial da NOS Comunicaes SA. The US Communicator is a multiplatform application currently available for smartphones / Android or iOS tablets as well as laptop / desktop Windows or Mac. This application is a softclient option and an integral part of enterprise IP telephony solutions, communications, video and IN service management communications SA.  Note: To use this softclient you need a cloud service business communications compatible NOS Communications SA.  By using NOS Communicator, its users now have available an advanced multimedia device, with intuitive and consistent interface between the various types of platforms, fully integrated with the services and advanced features of the enterprise solution of NOS, which both address the needs the user, as the specific form of a global company.  The integrated softclient IN THE Communicator in solutions allows you to: - Make calls or video calls via your smartphone; - Perform transfers, conferences, good parking and retrieving calls simply and intuitively; - Settings most necessary options for your fixed voice service in mobility, such as: call forwarding, do not disturb, anonymous number and simultaneous ringing; - Integrate your corporate directory to your personal contacts present in your smartphone. - Consult the call log; - Extend or use of its fixed length out of the office, anywhere; - Having a single identity to multiple devices (IP phones, several softclient) - Switch device during a call without service break; - Take Advantage of the circumstances of your business communications service outside the office or roaming at no extra cost;  To use this softclient is necessary: - Being customer cloud business communications service compatible NOS Communications SA - Subscribe to the corresponding option to the use of NOS Communicator - Have a LAN connection, Wi-Fi or 3G / 4G mobile data; - Have direct or indirect access to the public Internet service for DNS name resolution; - Minimum Requirements device: - Dual-Core CPU (ARMv7) and 1GB RAM; - Screen Resolution: 320 x 480;  If you want to learn more about this solution, please contact your representative or manager / business consultant NOS Communications SA. ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.RECORD_AUDIO', 'android.permission.GET_ACCOUNTS', 'android.permission.CALL_PHONE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.USE_CREDENTIALS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_CONTACTS', 'android.permission.MANAGE_ACCOUNTS', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.CAMERA', 'android.permission.DISABLE_KEYGUARD', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.BLUETOOTH', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.USE_FULL_SCREEN_INTENT', 'android.permission.VIBRATE']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.READ_PHONE_STATE', 'android.permission.CHANGE_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.READ_CONTACTS', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.GET_ACCOUNTS', 'android.permission.DISABLE_KEYGUARD', 'android.permission.USE_FULL_SCREEN_INTENT']",
}