{
"name" : "Callbridge Rocks",
"url" : "https://play.google.com/store/apps/details?id=rocks.app.callbridge",
"package" : "rocks.app.callbridge",
"category" : "Communication",
"description" : "Callbridge is a virtual meeting suite that creates order out of meeting chaos. Guests may expect an enterprise-class discussion environment accessible from any device with formidable encryption and privacy.  Deep personalization makes your meeting environment as unique as your signature, with both custom audio and visual components. High-definition audio and video enables crisp, clear communication second only to meeting in person.  Features Include:  Conference Calls:   Conduct conference calls with up to 400 callers  Schedule calls on the go or start a call on-the-fly with the click of a button  Invite participants from your integrated address book  Accommodate callers around the world with the new Time Zone feature  Add an agenda so that callers know what topics youll be covering  Hold regular meetings? Create recurring calls with just a few clicks   International numbers connect you to participants around the world  Download-free video & screen sharing  Online Meetings:    See thumbnails of participants, and who exactly is speaking  View callers logged in via webcam  Video screen share with other attendees during any online meetings.  View shared files and documents  Download files uploaded to the Chat window  Mute and add/remove participants from within your call  Use text chat, take notes and save for later in your call history  Initiate recording from within the app  Meeting History:    View your call history including conference stats  Listen to or download your conference recordings  View/edit upcoming calls  Update your contact information  Manage your account settings  Say Goodbye to:   Call reservations - schedule in advance or on demand!   Confusing star commands - use your personal meeting room and enjoy visual call controls! ",
"desc_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CALL_LOG', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CAMERA', 'android.permission.CALL_PHONE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.INTERNET']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.webkit.PermissionRequest', 'android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.RECORD_AUDIO', 'android.permission.CAMERA', 'android.permission.BLUETOOTH', 'android.permission.INTERNET']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.RECORD_AUDIO', 'android.webkit.PermissionRequest', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.ACCESS_NETWORK_STATE']",
}