{
"name" : "Call Blocker",
"url" : "https://play.google.com/store/apps/details?id=ru.lithiums.callsblockerplus",
"package" : "ru.lithiums.callsblockerplus",
"category" : "Communication",
"description" : "The program is designed to block incoming and outgoing calls. It has the fastest algorithm for blocking calls.   In the settings you can set the desired method of the application response to an incoming call: reject a call, silent or, if supported by your device and the network, the caller will hear in response the number you dialed is not available or wrong number or something similar.  The application consumes minimal resources of your mobile device, and all the basic settings can be found in the left sliding panel.  As opposed to the standard black list is all data about blocked calls is stored in a separate program, which has its own log and settings.  Access to the application can be password protected. Password you can reset by clicking on the icon in the upper right corner of the password entry screen. After this, all your lists and settings will be reset to the original. The password is not stored in the clear, but encrypted.  The phone numbers that you want to block are recorded in the black list. Whitelist is designed for phone numbers which will not be blocked never. The phone number listed in the white list, can not added to the blacklist, and vice versa.  To the lists, phone numbers are added from the contacts, by manually, from call history and messages. You can specify the number, which starts with certain digits. The numbers in black list can be combined into a group. This is useful if you plan to block calls on a schedule.  In the app you can set a schedule for the whole blacklist, and for individual numbers or groups of numbers. Blocked calls are displayed in the log. The log can be disabled, and you will never know about the incoming call which was rejected. Also in the settings you can disable only the notifications about the block, while the log will continue to work. You can also export log.  In the program you can also enable the block calls from unknown or hidden numbers. Unknown numbers in the program includes all numbers that are not listed in your phonebook contacts. Hidden number - incoming call with no number or number is not defined.  You can also block all incoming calls, making your device not available to all callers. At any time, the application can be disabled. In this case, the application will be nothing to block.  There are other possibilities which you can find if install this application.  Any questions and requests can be asked through the application or write an e-mail to: support@lithiums.ru. ",
"desc_perms" : "['android.permission.MODIFY_AUDIO_SETTINGS', 'android.permission.CALL_PHONE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_CALL_LOG']",
"manifest_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.RECEIVE_BOOT_COMPLETED', 'android.permission.QUICKBOOT_POWERON', 'android.permission.READ_CALL_LOG', 'android.permission.CALL_PHONE', 'android.permission.FOREGROUND_SERVICE', 'android.permission.WAKE_LOCK', 'android.permission.PROCESS_OUTGOING_CALLS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.READ_CONTACTS', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.READ_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.ANSWER_PHONE_CALLS', 'com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE', 'android.permission.INTERNET', 'android.permission.READ_PHONE_STATE', 'android.permission.ACCESS_NOTIFICATION_POLICY']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BROADCAST_STICKY', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'android.permission.GET_TASKS', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.BLUETOOTH']" 
"extra_perms" : "['android.permission.WRITE_EXTERNAL_STORAGE', 'android.permission.ACCESS_COARSE_LOCATION', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.REQUEST_IGNORE_BATTERY_OPTIMIZATIONS', 'android.permission.READ_CONTACTS', 'android.permission.READ_EXTERNAL_STORAGE', 'android.permission.QUICKBOOT_POWERON', 'android.permission.ANSWER_PHONE_CALLS', 'android.permission.PROCESS_OUTGOING_CALLS', 'android.permission.ACCESS_NETWORK_STATE', 'com.android.vending.BILLING', 'android.permission.INTERNET']",
}