{
"name" : "Mail.Ru for UA – Email for Hotmail, Outlook & i.ua",
"url" : "https://play.google.com/store/apps/details?id=tormail.mail.ru",
"package" : "tormail.mail.ru",
"category" : "Communication",
"description" : "Mail.Ru for UA provides worldwide access to Yandex, Mail.Ru, Gmail, Outlook and other email services through a secure connection. No VPN or other geo-blocking apps needed.   A snappy and easy-to-use mail app that supports multiple Mail.Ru, Gmail, Yahoo!, Hotmail AOL, iCloud, Hotmail, Outlook, GMX and any other IMAP or POP3-enabled mailboxes!   Send and receive mails. Share photos and documents. Learn about new messages almost instantly thanks to push-notifications. Configure the time, folders, and services for which you want to receive notifications. Personalized spam filter will protect you from annoying bulk mail.    Supports all popular mail services:   Gmail;  Mail.ru;  Hotmail;  MSN;   Outlook;  Office 365;  Yahoo;  AOL;  Apple (iCloud, me.com, mac.com);  My Mail (my.com).   Features:   - Support for multiple accounts. Add all your mailboxes and easily switch between them. Now switching between your work- and personal email accounts is as easy as switching between folders within a single mailbox.   - Full synchronization. It doesnt matter if you use your computer or your mobile device to read, flag, or move your email. All your changes will be saved on the server and synchronized between devices.   - Mail.Ru address book. When you compose an email, your contact list and autocompletion suggestions will include email addresses from your local address book as well as from the server. The email addresses that you write to most often will be displayed on a separate tab in your contact list for fast and easy access.   - Full mail search. Use search to quickly find any email in your mailbox. Filters will help you refine your search and more quickly find what youre looking for.   - Push-notifications for new mail. Youll know about a new message almost instantly if your iOS device is online.   - Notification filtering. Set the time when you want to receive notifications; choose specific services and folders; or create a custom filter to receive only the notifications you care about!   - Mail caching. Your mail is stored in your phones memory and will be available offline. Read messages and look at attachments on the bus or in the country.   - Personalized spam filter. Do you get messages from services that you didnt sign up for or cant unsubscribe from? Press the Spam button and all subsequent mail received by the sender will be automatically put in the Spam folder. And youll be able to read only the messages that matter to you.   - Avatars in your message list (can be disabled on the iPhone and iPod). Photos in your message list make it easier to navigate.   - Quick actions. Slide your finger across an email from right to left to open the email action menu. Without opening a message, you can mark it as read, or flag, move, or delete it.   - Email Threads. View your entire email conversation on one screen!   - iPad version. Its two display modes (portrait and landscape) make the app convenient to use no matter how you hold your tablet.   Please send all your requests, complaints, and suggestions through the apps Feedback section or by email to mailua@corp.mail.ru. Well always respond to your mail! ",
"desc_perms" : "['android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.GET_ACCOUNTS', 'android.permission.INTERNET', 'android.permission.WRITE_EXTERNAL_STORAGE']",
"manifest_perms" : "['android.permission.VIBRATE', 'android.permission.AUTHENTICATE_ACCOUNTS', 'android.permission.READ_CONTACTS', 'android.permission.WRITE_EXTERNAL_STORAGE', 'com.google.android.c2dm.permission.RECEIVE', 'android.permission.READ_SYNC_SETTINGS', 'com.android.gallery3d.permission.GALLERY_PROVIDER', 'android.permission.WRITE_SETTINGS', 'android.permission.USE_CREDENTIALS', 'android.permission.MANAGE_ACCOUNTS', 'com.htc.launcher.permission.UPDATE_SHORTCUT', 'com.majeur.launcher.permission.UPDATE_BADGE', 'android.permission.WAKE_LOCK', 'android.permission.USE_FINGERPRINT', 'com.sec.android.provider.badge.permission.WRITE', 'com.sonymobile.home.permission.PROVIDER_INSERT_BADGE', 'com.anddoes.launcher.permission.UPDATE_COUNT', 'android.permission.READ_SYNC_STATS', 'android.permission.GET_ACCOUNTS', 'com.google.android.gallery3d.permission.GALLERY_PROVIDER', 'android.permission.WRITE_SYNC_SETTINGS', 'com.sonyericsson.home.permission.BROADCAST_BADGE', 'android.permission.WRITE_SOCIAL_STREAM', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.READ_SOCIAL_STREAM', 'android.permission.INTERNET', 'tormail.mail.ru.permission.C2D_MESSAGE', 'android.permission.WRITE_CONTACTS', 'com.sec.android.provider.badge.permission.READ', 'com.htc.launcher.permission.READ_SETTINGS']",
"perms_with_call" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.BLUETOOTH_ADMIN', 'android.permission.ACCESS_NETWORK_STATE', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.WAKE_LOCK', 'android.permission.CHANGE_WIFI_STATE', 'android.permission.BROADCAST_STICKY', 'android.permission.ACCESS_FINE_LOCATION', 'android.permission.BLUETOOTH', 'android.permission.GET_TASKS', 'android.permission.USE_FINGERPRINT']" 
"extra_perms" : "['android.permission.ACCESS_COARSE_LOCATION', 'android.permission.WRITE_SOCIAL_STREAM', 'android.permission.ACCESS_WIFI_STATE', 'android.permission.READ_PHONE_STATE', 'android.permission.READ_SOCIAL_STREAM', 'android.permission.ACCESS_FINE_LOCATION', 'com.google.android.gallery3d.permission.GALLERY_PROVIDER', 'android.permission.WRITE_CONTACTS', 'android.permission.READ_CONTACTS', 'com.android.gallery3d.permission.GALLERY_PROVIDER']",
}